{
  "Ross Stores Stock Outlook: Is Wall Street Bullish or Bearish?": 0.1,
  "Barrick Mining and Whirlpool have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Inside AstraZeneca’s long-game strategy in lung cancer": 0.5,
  "Are Wall Street Analysts Predicting PACCAR Stock Will Climb or Sink?": 0.2,
  "The Best Stocks to Invest $1,000 In Right Now": 0.5,
  "Japan tech giant SoftBank Group sees better fortunes on surging AI stocks": 0.8,
  "Trending tickers: Apple, Shopify, Duolingo, Airbnb, Deliveroo": 0.0,
  "Inside Dexcom’s strategy to stay ahead in the $13.6bn CGM market": 0.5,
  "Apple Launches $100 Billion American Manufacturing Program": 0.8,
  "Is ASML a Buy?": 0.0,
  "The Zacks Analyst Blog Highlights Walmart, BlackRock, Texas Instruments, Perma-Pipe and MIND Technology": 0.5,
  "Airbnb dips as slower growth outlook renews fears of travel demand slowdown": -0.7,
  "Apple leads surge in global tech shares after Trump tariff relief": 0.8,
  "EU Says Its U.S. Chip Exports Will Be Covered by 15% Tariff Deal": -0.5,
  "Apple Raises US Investment to $600 Billion as Trump Eyes 100% Chip Tariffs": 0.2,
  "CrowdStrike expands AI Security Services portfolio": 0.5,
  "Constellation Reports Second Quarter 2025 Results": 0.0,
  "Morgan Stanley downgrades Coca-Cola bottler CCEP on ’balanced risk-reward’ profile": -0.2,
  "Millennials have abandoned these 7 boomer habits that made them the richest generation yet — plus what they do instead": 0.5,
  "Baker Hughes Completes Acquisition of Continental Disc Corporation": 0.5,
  "IT'S OFFICIAL CANADA - NESTEA® RTD IS HERE": 0.6,
  "Microchip Technology (NASDAQ:MCHP) Will Be Looking To Turn Around Its Returns": 0.5,
  "Calculating The Fair Value Of Autodesk, Inc. (NASDAQ:ADSK)": 0.2,
  "This Artificial Intelligence Stock Plays an Important Role in Chip Production, but It's Down 14% in 12 Months. Could It Be a Bargain Buy?": 0.2,
  "You should consider these 3 stock picks, portfolio manager says": 0.2,
  "Constellation Energy beats forecasts on top and bottom lines, shares rise": 0.8,
  "RFK Jr’s mRNA funding halt signals “shift in US public health”": 0.5,
  "Baker Hughes (BKR) Slid Due to Macro Economic Uncertainty": -0.6,
  "Datadog forecasts upbeat third-quarter results on increased cloud security adoption": 0.8,
  "Zscaler to Host Fourth Quarter Fiscal Year 2025 Earnings Conference Call": 0.0,
  "Constellation Energy Corporation (CEG) Tops Q2 Earnings and Revenue Estimates": 0.8,
  "Should You Be Excited About CSX Corporation's (NASDAQ:CSX) 25% Return On Equity?": 0.6,
  "Looking For Yields: WEC Energy, Mondelez International, And Southern Are Consistent Moneymakers": 0.6,
  "Alexion, AstraZeneca Rare Disease reaches an agreement with the pan-Canadian Pharmaceutical Alliance (pCPA) for Ultomiris for the treatment of adults with neuromyelitis optica spectrum disorder (NMOSD) and adults with generalized myasthenia gravis (gMG)": 0.5,
  "Dow Jones Futures Rise On Trump Move, Google, Tesla Eye Buy Points; DoorDash, AppLovin Earnings Late": 0.5,
  "Warner Bros. Discovery (WBD) Surpasses Q2 Earnings Estimates": 0.8,
  "Earnings in Focus: Market Movers": 0.0,
  "Littelfuse names Dr. Karim Hamed Senior Vice President and General Manager, Semiconductor Business": 0.5,
  "Here's How Much a $1000 Investment in Axon Enterprise Made 10 Years Ago Would Be Worth Today": 0.5,
  "JPMorgan says Apple delivered ’masterclass’ in managing geopolitics": 0.8,
  "Grain, automotive keep U.S. rail traffic ahead of 2024": 0.5,
  "Nova Ltd. (NVMI) Q2 Earnings and Revenues Beat Estimates": 0.8,
  "Samba TV Report Finds Advertiser Confidence is Up with 68% of Top 100 Brands Accelerating TV Advertising in First Half of 2025": 0.8,
  "Mobile Access Made Easy: Transact + CBORD and ASSA ABLOY Partner to Improve Campus Security and the Student Experience": 0.6,
  "Want Better Returns? Don't Ignore These 2 Retail-Wholesale Stocks Set to Beat Earnings": 0.8,
  "Constellation Energy Q2 Earnings Beat Estimates, Revenues Rise Y/Y": 0.8,
  "EU Says Chip Exports to U.S. Will Have 15% Tariff Ceiling Despite New Levies": 0.2,
  "Warner Bros. Discovery Tops Revenue Estimates, Swings to Profit": 0.8,
  "We Think Biogen's (NASDAQ:BIIB) Profit Is Only A Baseline For What They Can Achieve": 0.6,
  "Food Lion Feeds Provides More than 28 Million Meals to Combat Child Hunger": 0.8,
  "Patriot.TV Viewership and Stock Performance Surge Amid Industry Shift and Legacy Media Decline - Investors Take Notice under JD Ruckers Leadership": 0.6,
  "Company News for Aug 7, 2025": 0.0,
  "IDEXX Laboratories, Inc. Just Beat Earnings Expectations: Here's What Analysts Think Will Happen Next": 0.5,
  "Earnings Growth & Price Strength Make Axon Enterprise (AXON) a Stock to Watch": 0.8,
  "Is Zscaler (ZS) a Buy as Wall Street Analysts Look Optimistic?": 0.6,
  "Is Marvell (MRVL) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Warner Bros. Discovery (WBD) Reports Q2 Earnings: What Key Metrics Have to Say": 0.2,
  "Compared to Estimates, CDW (CDW) Q2 Earnings: A Look at Key Metrics": 0.2,
  "Looking for Aerospace Stocks? The Zacks Rank Can Help You Find Winners": 0.5,
  "Is Axon Enterprise (AXON) Outperforming Other Aerospace Stocks This Year?": 0.5,
  "Are You a Value Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Why Workday (WDAY) is a Top Growth Stock for the Long-Term": 0.8,
  "Eli Lilly downgraded, Lyft upgraded: Wall Street's top analyst calls": 0.2,
  "Cyient Semiconductors Enters Strategic Channel Partnership with GlobalFoundries": 0.5,
  "Stocks Rally on Positive Tariff News ad Rate Cut Hopes": 0.8,
  "Google Is Ditching CrowdStrike Stock. Should You?": 0.1,
  "Warner Bros. Discovery Stock Slides. The Box Office Is Back, But TV Is Still a Worry.": -0.5,
  "Law Enforcement Software Market worth $32.96 billion by 2030 | MarketsandMarkets™": 0.5,
  "Influenza Vaccine Market Research Report 2025-2030 Featuring GSK, Abbott, Pfizer, AstraZeneca, Sanofi, Moderna, CSL, Emergent BioSolutions, BIKEN, Serum Institute of India, Sinovac, GC Biopharma": 0.2,
  "Analysts weigh implications of Section 232 semiconductor tariffs": 0.0,
  "Baker Hughes Stock: Is Wall Street Bullish or Bearish?": 0.2,
  "Warner Bros. Discovery Unexpectedly Swings to Second-Quarter Profit Amid Better-Than-Expected Subscriber Growth": 0.8,
  "US Vehicle Auction Market Trends 2025-2030 Featuring Openlane, Copart, ACV, RB Global, E Automotive, eBay, COX Automotive, Capital, Cars & Bids, A Better Bid Car, AutoBidMaster, Barrett-Jackson": 0.0,
  "Nvidia, AI Bets Lift SoftBank To Profit After Brutal Year-Ago Loss": 0.6,
  "How Airbnb's $200M investment could weigh on profit margins": -0.5,
  "lululemon Navigates FX Swings & Demand Shifts: Can It Stay Nimble?": 0.2,
  "Crocs Sinks Most Since March 2020 on Tariffs, Cautious Consumers": -0.6,
  "Warner Bros. Discovery Hits Profit Turnaround, Thanks To Theaters, Not TV": 0.5,
  "Vistra Jumps While Constellation Energy Stalls. Why the Power Giants Split.": 0.2,
  "Airbnb Stock Drops. Why Wall Street Is Cautious About Its Experiences Relaunch.": -0.6,
  "AI agents aren’t the ‘new Google,’ says Airbnb CEO": 0.1,
  "Trump Calls for Intel CEO to Resign, Stock Drops": -0.7,
  "AVGO Expands Data Center Portfolio With Jericho4: Hold the Stock?": 0.2,
  "DASH Q2 Earnings Beat Estimates, Revenues Increase Y/Y, Shares Rise": 0.8,
  "Nvidia, chip stocks jump after Trump says some chipmakers exempt from 100% semiconductor tariff": 0.8,
  "Why Ross Stores (ROST) Could Beat Earnings Estimates Again": 0.6,
  "Warner Bros. Discovery Q2 Earnings Beat Estimates, Revenues Rise Y/Y": 0.8,
  "ABNB Q2 Earnings Beat Estimates, Revenues Rise Y/Y, Shares Drop": 0.2,
  "Why Axon (AXON) Might be Well Poised for a Surge": 0.8,
  "Leerink Partners Raised the Firm’s PT on Intuitive Surgical (ISRG), Kept a Buy Rating": 0.5,
  "Cognizant Partners with WRITER to Accelerate Secure AI Adoption for Enterprises": 0.6,
  "Loop Capital Markets Reiterated a Buy Rating on AppLovin Corporation (APP), Kept the PT Unchanged": 0.6,
  "New Street Lifts Netflix (NFLX) PT to $1,210 Amid Strong Performance, Ad Growth": 0.8,
  "Argus Research Raises Lam Research (LRCX) PT to $120 After Strong Q2 Performance": 0.8,
  "WBD earnings top estimates, but it's not a buy yet, analyst says": 0.1,
  "Autodesk Channel Feedback Points to H2 Rebound After Q2 Slowdown, Oppenheimer Says": 0.5,
  "Marriott International Declares Quarterly Cash Dividend and Increases Share Buyback Authorization": 0.5,
  "Jim Cramer on Netflix: “It’s a Very Highly Valued Stock”": 0.5,
  "Constellation Energy stock: Catalysts that could power it higher": 0.8,
  "IGEL Expands Zero Trust Capabilities with Zscaler Client Connector on IGEL App Portal": 0.5,
  "Nuclear Stocks CEG and VST Power the AI Boom": 0.5,
  "Workday Rising to Feature Star-Studded Lineup With Brené Brown, Duran Duran, and Microsoft": 0.8,
  "Palo Alto Networks Stock Got Hammered After CyberArk Deal. Earnings Offer a Chance at Redemption.": 0.2,
  "Why AppLovin Stock Popped Today": 0.5,
  "Is Berkshire Hathaway Stock a Buy, Sell, or Hold After Earnings?": 0.0,
  "Datadog (NASDAQ:DDOG) Delivers Strong Q2 Numbers, Full-Year Outlook Exceeds Expectations": 0.8,
  "Warner Bros. Discovery (NASDAQ:WBD) Reports Q2 In Line With Expectations But Stock Drops": -0.5,
  "buildOn Welcomes Three New Members to National Board of Directors": 0.5,
  "Celsius Stock Jumps on Earnings Beat. The Alani Nu Deal Is Paying Off.": 0.8,
  "Update: Fortinet Shares Fall After Morgan Stanley, Rosenblatt Downgrades": -0.6,
  "Nat-Gas Prices Erase Early Gains as US Weather Forecasts Cool": 0.2,
  "Roper Technologies, Inc. (ROP): A Bull Case Theory": 0.5,
  "Why CrowdStrike (CRWD) Shares Are Plunging Today": -0.7,
  "Why Zscaler (ZS) Stock Is Nosediving": -0.8,
  "Equity Markets Mixed Amid Speculation on Semiconductor Tariffs": 0.1,
  "Fortinet Falls On Q2 Results. Investors 'Confused' On Firewall Refresh. Cybersecurity Stocks Sell Off.": -0.5,
  "Buy the Spike in AppLovin Stock after Q2 earnings?": 0.2,
  "Duolingo, Eli Lilly, Airbnb: Trending Tickers": 0.0,
  "Back to School, Forward to the Future: How Smart Tech and Sustainable Connectivity Empower Students to Thrive on the Go\"": 0.8,
  "Ross Stores, Inc. Announces Second Quarter 2025 Earnings Release and Conference Call": 0.0,
  "Apple Stock Rallies on Trump’s Plan for ‘Make in America’ Tariff Exemptions": 0.8,
  "Regeneron Announces Investor Conference Presentations": 0.0,
  "S&P 500 Nuclear Leaders Report Earnings As Stock Market Nuke Fever Spreads": 0.2,
  "US Equity Markets Mixed as Investors Parse President Trump's Tariff Remarks on Semiconductor Imports": 0.1,
  "Microchip Technology Announces Quarterly Cash Dividend on Common Stock of 45.5 Cents Per Share": 0.5,
  "The RMR Group Announces $1.0 Billion Refinancing of Vertex Pharmaceuticals’ Headquarters in Boston Seaport District": 0.5,
  "Microchip Technology Announces Financial Results for First Quarter of Fiscal Year 2026": 0.5,
  "Equity Markets Close Mixed Amid Trump's Semiconductors Tariffs, Jobless Claims Data": 0.1,
  "These Stocks Moved the Most Today: Eli Lilly, Fortinet, AppLovin, Sunrun, Airbnb, Duolingo, and More": 0.5,
  "Tyson Foods Names Microsoft Executive to Board of Directors": 0.5,
  "Take-Two Interactive Software Raises Fiscal-Year Outlook on Improved First-Quarter Results": 0.8,
  "Microchip Tech: Fiscal Q1 Earnings Snapshot": 0.0,
  "Take-Two lifts annual bookings forecast on 'Mafia', 'Borderlands' launches": 0.6,
  "Stocks Close Mixed after Higher Bond Yields and Tariff News": -0.5,
  "Take-Two: Fiscal Q1 Earnings Snapshot": 0.0,
  "Take-Two Tops June-Quarter Targets, Touts Ambitious Game Pipeline": 0.8,
  "Roper Technologies Prices Public Offering Of $500 Million Senior Unsecured Notes Due 2028, $500 Million Senior Unsecured Notes Due 2030, $1 Billion Senior Unsecured Notes Due 2035": 0.0,
  "Take-Two shares rise on strong net bookings, upbeat forecast ahead of new GTA": 0.8,
  "Traditional media 'turning the corner': Streaming sector playbook": 0.5,
  "Mondelēz 2024 Snacking Made Right Report: Energy": 0.0,
  "KLA Declares Regular Cash Dividend": 0.2,
  "Pinterest Q2 profit miss, Block Q2 revenue miss, Take-Two Q1 beat": -0.33,
  "APP: Oppenheimer Calls AppLovin a 'Top Pick' -- Shares Jump to New High": 0.8,
  "S&P 500 Gains and Losses Today: Apple Stock Climbs; Eli Lilly Slumps After Disappointing Trial Results": 0.2,
  "Atlassian’s (NASDAQ:TEAM) Q2 Sales Top Estimates But Quarterly Revenue Guidance Slightly Misses Expectations": 0.2,
  "Microchip Technology (MCHP) Q1 Earnings and Revenues Surpass Estimates": 0.8,
  "T-Mobile Is Using 5G, Drones and AI to Help First Responders": 0.6,
  "Atlassian (TEAM) Q4 Earnings and Revenues Top Estimates": 0.8,
  "Take-Two’s (NASDAQ:TTWO) Q2: Beats On Revenue, Full-Year Outlook Exceeds Expectations": 0.8,
  "Atlassian forecasts downbeat quarterly revenue": -0.7,
  "Workday (WDAY) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Lululemon (LULU) Dips More Than Broader Market: What You Should Know": -0.5,
  "Why Zscaler (ZS) Dipped More Than Broader Market Today": -0.5,
  "President Trump Rocks Chip Stocks With Tariff Talk, Intel Comments": 0.5,
  "Tech, Media & Telecom Roundup: Market Talk": 0.0,
  "Take-Two Interactive (TTWO) Beats Q1 Earnings and Revenue Estimates": 0.8,
  "Microchip Tech beats Q1 net sales, profit estimates": 0.8,
  "Analog Devices (ADI) Ascends While Market Falls: Some Facts to Note": 0.5,
  "Microchip Tech (MCHP) Q1 Earnings: How Key Metrics Compare to Wall Street Estimates": 0.5,
  "Pemex plan disappoints suppliers awaiting billions in overdue payments": -0.6,
  "AppLovin Stock Jump 12% On Outlook Driven Catalysts": 0.8,
  "QuinStreet (QNST) Q4 Earnings Lag Estimates": -0.5,
  "Atlassian (TEAM) Reports Q4 Earnings: What Key Metrics Have to Say": 0.2,
  "Take-Two (TTWO) Reports Q1 Earnings: What Key Metrics Have to Say": 0.2,
  "Dividend Watch: 3 Companies Boosting Payouts": 0.5,
  "Verisk Analytics, Inc. Prices Offering of Senior Notes": 0.0,
  "SoftBank Shares Surge to Record on AI-Fueled Profit Recovery": 0.8,
  "TSMC Secrets Leak Puts Japan’s Tokyo Electron on Hot Seat": -0.5,
  "Go with the Flow: Agoda's Curated Guide to Asia's Hidden Riverside Destinations": 0.5,
  "Comcast’s (CMCSA) $19M Expansion Brings Speed and Support to Bossier City": 0.6,
  "BMO Capital Lifts PT on Regeneron Pharmaceuticals (REGN) Stock, Keeps Outperform": 0.6,
  "2 Reasons to Watch BKNG and 1 to Stay Cautious": 0.5,
  "TSMC’s July Sales Grow 26% on Sustained Demand for AI Chips": 0.8,
  "Netflix Stock: Is Wall Street Bullish or Bearish?": 0.2,
  "What Are Wall Street Analysts' Target Price for Xcel Energy Stock?": 0.0,
  "Constellation Energy Corp (CEG) Q2 2025 Earnings Call Highlights: Strong Financial Performance ...": 0.8,
  "Zacks Investment Ideas feature highlights: Constellation Energy, Vistra and Meta Platforms": 0.2,
  "Zacks Investment Ideas feature highlights: AppLovin": 0.2,
  "Atlassian Corp (TEAM) Q4 2025 Earnings Call Highlights: Record Deals and AI Growth Propel ...": 0.6,
  "Prediction: This Dividend Stock Will Beat the Market Over the Next 5 Years": 0.6,
  "Intel CEO Dogged by Decades of China Chip Bets, Board Work": -0.5,
  "Microchip Technology (NASDAQ:MCHP) Posts Better-Than-Expected Sales In Q2 But Stock Drops": -0.5,
  "Best AI Marketing Tools (2025): QuickBooks to Launch Campaign Automation via Mailchimp, Named Top Marketing Solution by Better Business Advice": 0.6,
  "Intel boss hits back at ‘misinformation’ after Trump attacks China links": -0.5,
  "CFOs On the Move: Week ending Aug. 8": 0.0,
  "Pepsi: Turnaround in the Making?": 0.5,
  "Have $1,000? These 2 Stocks Could Be Bargain Buys for 2025 and Beyond": 0.5,
  "Should You Double Down on These 3 Dow Jones Dividend Stocks Near All-Time Highs?": 0.5,
  "Additional Considerations Required While Assessing Xcel Energy's (NASDAQ:XEL) Strong Earnings": 0.5,
  "4 chip stocks well positioned for Trump's 100% tariff threat": 0.2,
  "5 Top Stocks to Buy in August": 0.0,
  "Fortinet Second Quarter 2025 Earnings: EPS Beats Expectations": 0.8,
  "Nicotine Is Hot, Beer Is Not. What Vice Stocks Say About America’s Guilty Pleasures.": 0.2,
  "A Closer Look At Honeywell International Inc.'s (NASDAQ:HON) Impressive ROE": 0.8,
  "Edge AI Hardware Market Research Report 2025-2030 | Opportunities Expand with Generative AI Optimization, On-Device Visual Processors, and 5G-Enabled Ultra-Low Latency Applications": 0.6,
  "AppLovin Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "Earnings, Tariff Outlook Lift Wall Street Pre-Bell; Asia Mixed, Europe Up": 0.5,
  "Sonder Secures New Funding, Amends Marriott Agreement": 0.5,
  "Airbnb, Inc. Just Beat EPS By 9.5%: Here's What Analysts Think Will Happen Next": 0.5,
  "This Week In AI Chips - DEEPX Baidu Partnership Advances Global AI Integration": 0.6,
  "US High Growth Tech Stocks To Watch In August 2025": 0.5,
  "Texas Instruments Incorporated (TXN) Surged Along with Market Sentiment": 0.8,
  "Financially motivated cluster a key player in ToolShell exploitation": -0.5,
  "NXP Semiconductors (NASDAQ:NXPI) Might Have The Makings Of A Multi-Bagger": 0.8,
  "Why Phillips 66, PepsiCo, And Regions Financial Are Winners For Passive Income": 0.5,
  "Here’s Why Diamondback Energy (FANG) Slid in Q2": -0.5,
  "Investors Parse, Look Ahead to Earnings Announcements as US Futures Rise Friday Pre-Bell": 0.5,
  "Take-Two soars after forecast signals mobile gaming rebound": 0.8,
  "3 Cheap Tech Stocks to Buy Right Now": 0.5,
  "Is Warren Buffett About To Dump The Highest-Yielding Dividend Stock In Berkshire Hathaway's Portfolio?": -0.5,
  "Are Intel Options Traders Expecting the Chip Stock to Collapse This August?": -0.6,
  "Intel CEO responds after Trump calls for his resignation": 0.1,
  "Intel CEO Says He Has Board’s Support After Trump Calls to Step Down": 0.2,
  "Is Wall Street Bullish or Bearish on Constellation Energy Stock?": 0.5,
  "Exchange-Traded Funds, Equity Futures Higher Pre-Bell Friday Ahead of Fed Board Changes": 0.5,
  "How to Find Strong Computer and Technology Stocks Slated for Positive Earnings Surprises": 0.8,
  "Here is What to Know Beyond Why Intuitive Surgical, Inc. (ISRG) is a Trending Stock": 0.2,
  "Investors Heavily Search Axon Enterprise, Inc (AXON): Here is What You Need to Know": 0.5,
  "Homes.com Report: Moderate Home Price Appreciation Continued in July. Nationally, the Median Home Price Was up 2.1% From a Year Ago.": 0.5,
  "Wall Street Set to Open Slightly Higher Friday as Investors Pore Over Earnings Results": 0.5,
  "United States Soup Market Trends and Growth Analysis Report 2025-2033 | Premium and Plant-Based Soups Drive Expansion Amidst Evolving Consumer Preferences": 0.5,
  "Computer-aided Engineering (CAE) Market Surges to $19.96 billion by 2030 - Dominated by Ansys (US), Autodesk (US), Dassault Systèmes (France)": 0.6,
  "Atlassian Q4 Earnings Surpass Expectations, Revenues Rise Y/Y": 0.8,
  "Netflix revenues hit record high amid BBC licence fee exodus": 0.5,
  "PepsiCo (PEP) Crossed Above the 20-Day Moving Average: What That Means for Investors": 0.5,
  "Coca-Cola Europacific Partners First Half 2025 Earnings: EPS: €1.99 (vs €1.73 in 1H 2024)": 0.5,
  "Tradr Readies Leveraged Single-Stock ETFs on ALAB and DDOG": 0.1,
  "Here's Why Idexx Laboratories (IDXX) is a Strong Growth Stock": 0.8,
  "Datadog Q2 Earnings Surpass Estimates, Revenues Increase Y/Y": 0.8,
  "Mafia: The Old Country Now Available Worldwide": 0.5,
  "Stocks Supported by Robust Earnings and Rate Cut Hopes": 0.8,
  "Tax Management Software Market Surges to USD 25.4 Billion by 2033, Propelled by 10.5% CAGR - Verified Market Reports®": 0.8,
  "PepsiCo Stock: Is Wall Street Bullish or Bearish?": 0.1,
  "Are Wall Street Analysts Predicting American Electric Power Stock Will Climb or Sink?": 0.2,
  "Amgen's Repatha, Evenity & Blincyto Drive Sales This Earnings Season": 0.5,
  "Intel's top executive digs in after Trump demands his ouster": -0.5,
  "Take-Two Interactive 'Well Diversified' With IP Across Categories, Wedbush Says": 0.5,
  "Expedia Posted Strong Earnings. What Wall Street Is Saying About the Stock.": 0.5,
  "Intellia Q2 Loss Narrower Than Expected, Pipeline Progress in Focus": 0.5,
  "Comcast Brings High-Speed Internet and Lift Zone to McDuffie County, Celebrates with Laptop Giveaway and Block Party": 0.8,
  "Stocks Rally on Positive Earnings and Hopes for an End to Russia-Ukraine War": 0.8,
  "Warner Bros. Stock Slides After Analysts Flag Second-Half Challenges": -0.6,
  "Airbnb charts AI-first path as it expands customer service agent": 0.1,
  "Airbnb Stock Just Went on Sale. Here’s How to (Safely) Trade the Post-Earnings Dive with Options.": 0.2,
  "Gilead Sciences Expected to See 3% Growth in Annual HIV Product Sales, Truist Says": 0.5,
  "Airbnb embraces a paradox: CEO Brian Chesky says hotels are the future": 0.5,
  "Under fire from Trump over China ties, Intel’s Tan counters resignation calls": -0.5,
  "BZLFY vs. MDLZ: Which Stock Is the Better Value Option?": 0.0,
  "GFS vs. LSCC: Which Stock Is the Better Value Option?": 0.2,
  "Microchip Q1 Earnings Beat Estimates, Sales Down Y/Y, Shares Drop": -0.2,
  "Apartments.com Releases Multifamily Rent Growth Report for July 2025": 0.0,
  "DASH Q2 Benefits From Strong Marketplace GOV: Time to Buy the Stock?": 0.6,
  "You don’t own enough Google- Another “Google is undervalued” post - OpenAI just released their frontier model and suffice to say… it flopped. People are waiting with bated breath to see what Google has cooked up. They already released Genie 3, which nobody is even close to yet on world models. I think it will be trivial for them to surpass or at least catch up to OpenAI on the intelligence front for frontier LMM.": 0.2,
  "Microchip Technology Faces Higher Revenue Bar than Peers, Morgan Stanley Says": 0.1,
  "Why Is Gilead Sciences (GILD) Stock Rocketing Higher Today": 0.6,
  "Gilead’s Yeztugo sales “ahead of expectations” following launch": 0.8,
  "Is Idexx (IDXX) a Solid Growth Stock? 3 Reasons to Think \"Yes\"": 0.6,
  "Monster Beverage Leverages Functional, Zero-Sugar Innovations To Capture Energy Drink Market Growth": 0.8,
  "Netflix's $6 Billion UK Spend Pays Off With Strong Growth, Membership Gains": 0.8,
  "Oil, Gas Rigs Still Near 3-Year Low Despite Weekly Bump": 0.2,
  "US Equity Indexes Rise Amid Trump's Efforts to Secure Ukraine-Russia Peace Deal; Gold Hits New Record": 0.8,
  "Intuit (INTU) Revolutionizes Small Business Finance With Advanced AI Accounting Tools": 0.8,
  "Microchip Technology (MCHP) Reports Dividend Declaration Despite US$19 Million Quarterly Loss": -0.5,
  "PepsiCo (PEP) Unveils 7UP Pink Lemonade To Enhance Moods With Colourful UK Campaign": 0.6,
  "CrowdStrike (CRWD) Launches AI Security Services to Protect and Power the Future of SOCs": 0.6,
  "KLA (KLAC) Announces US$1.90 Dividend as Board Members Retire": 0.5,
  "Diamondback Energy Narrows Production Guidance as Net Income Dips in Q2": -0.5,
  "Constellation Energy (CEG) Completes Buyback as Earnings Show Mixed Results": 0.1,
  "Compared to Estimates, Datadog (DDOG) Q2 Earnings: A Look at Key Metrics": 0.2,
  "Datadog (DDOG) Reports Q2 Earnings: Sales Rise to US$827 Million, Net Income Declines": -0.5,
  "Atlassian (TEAM) Announces Leadership Change, Earnings Rise, & Google Cloud Partnership": 0.5,
  "Monster Beverage Q2 Earnings Beat, Higher Sales Across Most Segments Aid": 0.8,
  "Investing.com’s stocks of the week": 0.0,
  "Compared to Estimates, Monster Beverage (MNST) Q2 Earnings: A Look at Key Metrics": 0.2,
  "Why Trade Desk (TTD) Stock Is Plummeting Today": -0.8,
  "Tariff fog looms over US auto sector as semiconductor rules remain unclear": -0.5,
  "Microchip Beats Q2 Estimates but Shares Sink 5% on Tepid Outlook": -0.5,
  "Equities Rise Intraday as Markets Parse Earnings, Fed Official's Comments": 0.5,
  "Intel's new CEO had 3 major problems to tackle. This week Trump added a new one.": -0.5,
  "1 Cash-Producing Stock with Exciting Potential and 2 We Turn Down": 0.6,
  "2 Cash-Producing Stocks for Long-Term Investors and 1 We Brush Off": 0.2,
  "Oil Rig Count Rises by 1; Crude Set for Weekly Losses Ahead of Potential Trump-Putin Meeting": -0.5,
  "Honeywell (HON): Buy, Sell, or Hold Post Q2 Earnings?": 0.2,
  "Cisco Stock, Monster Hit New Highs And Flash This Signal": 0.6,
  "2 Reasons PANW is Risky and 1 Stock to Buy Instead": -0.5,
  "2 Unpopular Stocks That Should Get More Attention and 1 Facing Headwinds": 0.2,
  "Truck sales in the second quarter might have been the worst performing metric of all": -0.8,
  "3 Market-Beating Stocks with Solid Fundamentals": 0.5,
  "1 Large-Cap Stock Worth Your Attention and 2 We Find Risky": 0.2,
  "Final Countdown: San Francisco Set to Host B2B’s Boldest Voices at Marketers Connect": 0.5,
  "Sector Update: Consumer Stocks Advance Late Afternoon": 0.5,
  "Equity Markets Rise After Corporate Earnings; Fed's Musalem Sees Labor, Inflation Risks": 0.5,
  "Figma’s $21 Billion Drop Returns Stock to Earth After IPO Frenzy": -0.5,
  "Trade Desk Stock Plunges On Small Revenue Beat, Rising Amazon Competition": -0.6,
  "Sector Update: Tech Stocks Higher Late Afternoon": 0.5,
  "Alphabet (GOOGL) Needs a Breakup to Unlock Full Value, Says DA Davidson": 0.2,
  "Gilead Surges 8%, Flirting With A Breakout, On Growing Enthusiasm For HIV PrEP": 0.6,
  "US Equity Markets Rise, Nasdaq Climbs to Record After Week Packed With Corporate Earnings": 0.8,
  "How major US stock indexes fared Friday, 8/8/2025": 0.0,
  "Capital Compounders for Investors": 0.0,
  "These Stocks Moved the Most Today: Trade Desk, Expedia, SoundHound, Pinterest, Gilead, Peloton, and More": 0.2,
  "Equity Markets Close Higher After Earnings, Fed's Musalem Inflation, Labor Remarks": 0.5,
  "Video game sector: Tariff impacts, GTA 6 release, EA outlook": 0.2,
  "Stocks to Watch Recap: Apple, Tesla, Firefly, Block": 0.0,
  "Nasdaq Hits Fresh High as Wall Street Posts Best Week Since June": 0.8,
  "S&P 500 Gains and Losses Today: Apple Stock Extends Its Rise; The Trade Desk Craters After Earnings": 0.2,
  "Stock Market Week Ahead: Ford's 'Model T' Moment, China Leaders, Aerospace Innovators": 0.5,
  "CBMJ (Patriot.TV) Stock Rockets: +296.48% Since July 6, +127.49% This Week, and +63.64% Today": 1.0,
  "Nasdaq posts record closing high with tech gains, rate cut optimism": 0.8,
  "The Paramount Merger Was a Bad Deal for Old Shareholders. Buying the Stock Is a Good Bet for New Ones.": 0.2,
  "FlyJets CEO On Rising Private Jet Rentals": 0.5,
  "Compared to Estimates, Diamondback (FANG) Q2 Earnings: A Look at Key Metrics": 0.2,
  "Ad Tech Company Trade Desk Downgraded as Amazon, AI Reshape Digital Market": -0.5,
  "I Tried To Buy 1,000 Shares Of The Figma IPO...Here's What Happened": 0.1,
  "Oreos Combined With Reese’s? Inside the Manhattan Project of Snacks.": 0.6,
  "RDDT - which advertisers are paying $$$ ?? - I made money shorting RDDT after the first record high. Now I want to do it again but their earnings report is stupefying to me. How can they be pulling in that much dough from advertisers? I never even notice ads on here. I can't believe advertisers would pay a lot to RDDT in the apparent belief that redditors are going to turn into big time": -0.2,
  "Wells Fargo Lowers Lululemon (LULU) PT to $225, Cites US, China Concerns": -0.5,
  "Shopify Inc Stock - Shop Inc (NASDAQ: SHOP) skyrocketed 20%+ after earnings a few days ago due to a surprise EPS beat and more importantly, them saying that the Trump tariffs will not have noticeable effects on them. However, it is greatly overvalued, with inflation on the rise due to tariffs and a slowing economy, I believe SHOP is gonna crash hard. It crashed hard in 2021 during post-COVID inflation. SHOP is very sensitive to": -0.8,
  "Solid Earnings Reflect AstraZeneca's (LON:AZN) Strength As A Business": 0.8,
  "Forget the \"Magnificent Seven.\" It's Time to Start Talking About the \"Ten Titans.\"": 0.6,
  "The Smartest Growth Stocks to Buy With $1,000 Right Now": 0.5,
  "Prediction: 2 Stocks That'll Be Worth More Than Palantir 3 Years From Now": 0.5,
  "Here's Why Charter Communications (NASDAQ:CHTR) Is Weighed Down By Its Debt Load": -0.5,
  "Marvell Technology, Inc.'s (NASDAQ:MRVL) Intrinsic Value Is Potentially 22% Below Its Share Price": -0.7,
  "Is Arm Holdings Stock a Buy Now?": 0.2,
  "Google Breaks Out, Leads Five Stocks Near Buy Points": 0.5,
  "These 7 Stocks Are Analyst Favorites For Magnificent Earnings Growth; Arista, GE Lead": 0.8,
  "Monster Beverage Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "Roper Technologies' (NASDAQ:ROP) Solid Earnings May Rest On Weak Foundations": -0.5,
  "Electronic Arts' (NASDAQ:EA) Conservative Accounting Might Explain Soft Earnings": -0.5,
  "Traders Are Fleeing Stocks Feared to Be Under Threat From AI": -0.6,
  "Take-Two Interactive Software First Quarter 2026 Earnings: Beats Expectations": 0.8,
  "Gilead Sciences Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "Is There An Opportunity With lululemon athletica inc.'s (NASDAQ:LULU) 39% Undervaluation?": 0.5,
  "Gilead Sciences (GILD) Touches New Record High as 10 Analysts Turn Bullish": 0.8,
  "Analysts Have Been Trimming Their The Trade Desk, Inc. (NASDAQ:TTD) Price Target After Its Latest Report": 0.1,
  "Is Qualcomm the Best Semiconductor Stock to Buy Right Now?": 0.5,
  "r/Stocks Weekly Thread on Meme Stocks Saturday - Aug 09, 2025 - The meme stock scheduled posts will now run weekly and post Saturday afternoon and won't be a sticky; you're probably seeing this because automod sent you here! [Full list of meme stocks here.](https://www.reddit.com/r/stocks/wiki/meme-stocks) This will be updated every once in a while. ------ Welcome traders who just can't help them selves discuss the same exact stock that's been discussed 100s of times a": 0.1,
  "Cathie Wood Goes Bargain Hunting. 1 Dirt Cheap Artificial Intelligence (AI) Stock With Monster Potential She Just Bought": 0.8,
  "Comcast (CMCSA) Completes High-Speed Internet Expansion in Georgia with $10,000 Community Grant": 0.6,
  "Wells Fargo analyst gives TECK $101 price target (It's currently $33.) - Relevant link: [https://www.investing.com/news/analyst-ratings/teck-resources-stock-rating-reiterated-at-**overweight-by-wells-fargo-93CH-4179952**](https://www.investing.com/news/analyst-ratings/teck-resources-stock-rating-reiterated-at-overweight-by-wells-fargo-93CH-4179952) **Full disclosure:** I'm a longstanding TECK holder. It's a large part of my port, I recently added some, and I plan to hold it for many years to come. As such, I'm biased and have a lot to gain by seeing it moon. On the other hand, I think I'm pretty realistic. I have a decent grasp of the challenges": 0.5,
  "Wells Fargo Stays Bullish on Apple (AAPL) Amid $100B U.S. Expansion Plan": 0.8,
  "UBS Reiterates Buy on AppLovin (APP) With $540 PT After Q2 Beat": 0.8,
  "Datadog (DDOG) PT Lifted to $170 on AI-Driven Usage Growth": 0.5,
  "Palo Alto Networks (PANW) Price Target Trimmed to $204 Despite Positive CyberArk Outlook": 0.5,
  "The Biggest Takeaways From Axon Enterprise's Aug. 4 Earnings Report": 0.2,
  "Fortinet (FTNT) Price Target Cut to $90 as UBS Warns of Low Double-Digit Growth Ahead": -0.5,
  "Mizuho Cuts Atlassian (TEAM) Price Target to $235 but Sees Strong Multi-Year Growth Ahead": 0.8,
  "SoFi Q2 2025 Earnings Report's Top Takeaways - Source: \"5 Important Takeaways From SoFi's Blowout Earnings Report\" by Matt Frankel dated Aug 9, 2025 1 Growth Momentum keeps on growing. * Revenue growth 44% YOY * Membership base 34% YOY with 846K new members, the highest single quarter. 2 Strong Capital-light revenue streams. * LPB (loan platform business) has explosive growth. * Fee-based low-risk revenue makes up 44% of the company's total revenue. * Noninterest": 0.8,
  "Wolfspeed, Inc. (WOLF) Appoints Bret Zahn as Vice President and General Manager": 0.5,
  "Needham Lifts Axon Enterprise, Inc. (AXON)’s Price Target To $870, Maintains Buy Rating": 0.8,
  "Psychological advice to help me stick to my 70/30 passive/active portfolio - I have been investing for 2 years. I began as 95% all world etf with 5% gold, original 40k investment lump. Over that time I found myself leaning more into individual stock picking, as I have started to enjoy it. I have had good results with amd, western digital, vertiv and applovin, which are now 30% of portfolio. I have already noticed the": 0.2,
  "Apple has its best week since July 2020 after White House visit - [https://www.cnbc.com/2025/08/08/apple-has-best-week-since-july-2020-after-tim-cooks-white-house-visit.html](https://www.cnbc.com/2025/08/08/apple-has-best-week-since-july-2020-after-tim-cooks-white-house-visit.html) * Apple shares rose 13% this week, its largest weekly gain in more than five years, after CEO Tim Cook appeared with President Donald Trump in the White House on Wednesday. * At the White House on Wednesday, Cook appeared with Trump to announce Apple’s plans to spend $100 billion on American companies and American parts over the next four years.": 0.8,
  "PagerDuty (PD) high chance of buyout potential ? - Shares of PagerDuty popped from $14.71 to a high of $18.00 July 28 when Reuters came out with an https://www.reuters.com/markets/europe/pagerduty-exploring-potential-sale-after-receiving-buyer-interest-sources-say-2025-07-25/ that they are \"working with Qatalyst Partners on the sale effort, after attracting interest from both financial sponsors and strategic acquirers.\" TD upgraded PagerDuty to Buy on high likelihood of buyout with a price target of $22 up from $17. They mentioned Qatalyst has a strong": 0.8,
  "TD Cowen Backs Comcast (CMCSA) on Strong Q2 and Diversified Growth": 0.8,
  "Jim Cramer on Intuitive Surgical: “I Like That Company So Much”": 0.8,
  "Companies that have a moat - lock their customers in - I'm doing research on which companies have a moat to add to my portfolio. Especially with growth. Companies that once customers use their services, it's hard for them to leave, and customers then have to pay the companies over and over again. But I also want them to have high growth for higher return. Feel free to agree/ disagree and suggestion. Thanks. NVDA: already": 0.6,
  "Wells Fargo Lowers Honeywell (HON) Target, Cites Near-Term Market Uncertainty": -0.5,
  "Better Growth Stock: Costco vs. Visa": 0.5,
  "3 Undervalued Dividend Stocks for Passive Income Investors to Buy in August": 0.5,
  "2 Surefire Stocks to Invest $1,000 in for the Long Haul": 0.5,
  "Stock-Split Watch: Is ASML Next?": 0.2,
  "Cadence Design Systems, Inc. (NASDAQ:CDNS) is a favorite amongst institutional investors who own 89%": 0.5,
  "Cintas (NASDAQ:CTAS) Could Be A Buy For Its Upcoming Dividend": 0.5,
  "Honeywell International Inc. (NASDAQ:HON) Will Pay A US$1.13 Dividend In Four Days": 0.2,
  "Here's Why We Think Exelon (NASDAQ:EXC) Might Deserve Your Attention Today": 0.5,
  "A Look At The Intrinsic Value Of Old Dominion Freight Line, Inc. (NASDAQ:ODFL)": 0.2,
  "CDW's (NASDAQ:CDW) Dividend Will Be $0.625": 0.2,
  "My 3 Favorite Stocks to Buy Right Now": 0.0,
  "Workday, Inc.'s (NASDAQ:WDAY) Intrinsic Value Is Potentially 47% Above Its Share Price": 0.8,
  "India plans tariff response to US over steel, aluminium levy - [https://www.hindustantimes.com/india-news/india-plans-tariff-response-to-us-over-steel-aluminium-levy-101754765466919.html](https://www.hindustantimes.com/india-news/india-plans-tariff-response-to-us-over-steel-aluminium-levy-101754765466919.html) India may slap tariff countermeasures on select American commodities, a retaliation to Washington’s move to impose a steep 50% duty in June on steel, aluminium and their derivatives from India, people aware of the matter have said. To be sure, the levies on steel and aluminium have played out as a parallel trade dispute at the World Trade Organization, but its timing would": -0.2,
  "Do you think Salesforce (CRM) stock will go up before earnings on Sept 3? - I’ve been watching CRM and wondering if it’s likely to run up ahead of the earnings report on September 3rd. Do you think the stock will gain momentum leading into earnings and hit beyond $270 or is it more likely to stay flat or drop? Any insights or thoughts on what to expect would be appreciated! Thanks! Update: I had": 0.2,
  "When to Buy Back In Internationally - I'm one of the fools who thought they could time the market. I didn't get burned too bad, as I sold at an average of about 5800 in the S&P. But now I'm sitting on a lot of \"cash\" in my 401k that's only making like 4%. I like to think I've learned my lesson and will not be doing something like this again. I want to diversify": 0.2,
  "Owners connected to Monster Energy announce plans to expand Thrifty Ice Cream": 0.5,
  "How do you feel about GDRX? - I’ve been looking for a few stocks to invest a bit of money into and one of my undecided tickers is GDRX. GDRX is near an all time low right now at $3.47. GoodRX just got a new CEO, new VP from Amazon Pharmacy, new Board, etc, but earnings have been under analyst expectations (3% increase). Not great, not terrible. I’m not sure if they are at a": 0.2,
  "Exit GOOG/GOOGL or Hold Through Remedies Ruling? - It's my largest position by far and I'm a bit nervous about Department of Justice remedies announcement coming sometime this month. Thinking of selling 500 or 600 shares and waiting out the month of August until there's clarity around legal headwinds facing the company; then, if it dumps on some harsher than expected verdict (e.g. selling Chrome, forced sharing of search data treasure trove, etc.) get back": -0.6,
  "23 years old, starting my first paid internship, How to build a diversified portfolio with small amounts? - Hi everyone, I’m 23, living in France, and about to receive my first salary from a 6-month internship. My goal is to start investing as early as possible to build a diversified portfolio over the long term (7–8 years minimum, possibly longer). At first, my monthly budget for investing will be quite small (low hundreds of euros),": 0.6,
  "Thirsty for Passive Income? PepsiCo's Dividend Yield Continues to Deliver.": 0.6,
  "CENTENE (CNC) is a good long term opportunity at this level - Like every self-respecting Value investor, I've been looking for opportunities to divest from my tech-heavy portfolio. AI Stocks like NVDA, PLTR, MSFT, AMZN, TSLA have done great, but some of these valuations just don't make sense and I don't think now is a good time to buy into them anymore. That brings me to look for other opportunities. I don't think there's a": 0.6,
  "(Item 8.01) Other Events. ATM Updates On August 11, 2025, MicroStrategy Incorporated d/b/a Strategy (“Strategy” or the “Company”) announced updates with respect to its at-the-market offering programs: ATM Program Summary During Period August 4, 2025 to August 10, 2025 As of August 10, 2025 Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) Common ATM - - - $17,042.7 $21 billion of class A common stock, $0.001": 0.1,
  "(Item 8.01) Other Events. On July 7, 2025, the Company filed with the Secretary of State of the State of Delaware a Certificate of Amendment (the “STRK Certificate of Amendment”) to the Certificate of Designations that established the terms of the Company’s 8.00% Series A Perpetual Strike Preferred Stock, $0.001 par value per share (the “STRK Stock”). As described in greater detail in the Company’s Current Report on Form 8-K filed with the Securities and Exchange Commission": 0.0,
  "(Item 8.01) . Other Events Wisconsin Electric and Natural Gas Rate Request In March 2025, Northern States Power Company-Wisconsin (NSP-Wisconsin), a wholly owned subsidiary of Xcel Energy Inc., filed a request with the Public Service Commission of Wisconsin (PSCW) for a multi-year electric and natural gas rate increase. For the electric utility, NSP-Wisconsin requested a total electric revenue increase of $94 million (11.8%) in 2026 and an incremental $57 million (7.1%) in 2027, for a total of": -0.1,
  "Nextdoor - NXDR: The Next Local Platform Breakout & Why Reddit Buying it Makes Sense - Nextdoor is a hyperlocal social platform sitting at the intersection of community trust, local commerce, and utility. After years of underperformance, it’s in the middle of a *major product relaunch* that’s already driving better engagement and beating revenue estimates. With a market cap under $1B (\\~3× revenue), there are multiple untapped monetization levers, and real strategic appeal to larger": 0.8,
  "Trump Administration Considers Longtime Critic to Lead Bureau of Labor Statistics - The Trump administration is interviewing candidates to lead the Bureau of Labor Statistics including at least one longtime critic of the agency, according to a senior administration official. Administration officials are weighing candidates to take the top job after President Trump [fired the BLS commissioner](https://www.wsj.com/politics/policy/trump-orders-firing-of-bureau-of-labor-statistics-chief-d8eaa272) earlier this month following the release of a weak jobs report. One of the people being interviewed is": -0.5,
  "3 Growth Stocks to Invest $1,000 in Right Now": 0.5,
  "5 Dividend Stocks to Hold for the Next 5 Years": 0.5,
  "Inside The MBA Program Where Students Solve Real Problems For Fortune 500s — Before They Graduate": 0.6,
  "Trump Administration to Take 15% Cut of Nvidia and AMD Chip Sales to China - I feel 15% is going to be the threshold for any export but this seems unprecedented. If these chips are dangerous for China to own, why sell them at all? “It is unusual for companies to essentially pay for export licenses. The agreements follow criticism from national-security hawks who fear the chips and other technology will boost China’s AI ecosystem": -0.6,
  "Ross Stores (ROST): Buy, Sell, or Hold Post Q1 Earnings?": 0.2,
  "Intel CEO to visit White House after Trump called for his ouster over alleged China ties: report": -0.5,
  "AI Won’t Kill Software. It Will Simply Give It New Life.": 0.5,
  "2 High-Flying Stocks to Research Further and 1 We Turn Down": 0.2,
  "1 Large-Cap Stock on Our Buy List and 2 That Underwhelm": 0.2,
  "1 Surging  Stock with Competitive Advantages and 2 We Avoid": 0.5,
  "1 Semiconductor Stock Worth Investigating and 2 We Question": 0.2,
  "3 Large-Cap Stocks with Promising Prospects": 0.5,
  "Gilead Stock Is Closing In on an All-Time High. The Case for More Upside.": 0.8,
  "Airbnb added to the shame I felt after suffering years of domestic abuse": -0.8,
  "How Mondelēz is modernizing Ritz as it turns to snacks to drive growth": 0.5,
  "O'Reilly Automotive's Historic Stock Split Was Spurred by a 65,000% Gain Since Its IPO. Is Its Biggest Rival About to Become Wall Street's Next Stock-Split Stock?": 0.5,
  "Company News for Aug 11, 2025": 0.0,
  "AppLovin Shares Jump as Revenue Continues to Surge. Is It Too Late to Buy the Stock?": 0.5,
  "Apreo raises $130M for pivotal trial of emphysema device": 0.6,
  "Non-metastatic Prostate Cancer Market Analysis and Forecast, 2023-2035 | J&J, Astellas, Bristol-Myers Squibb, Pfizer, Merck, Bayer, Sanofi, Clovis, AstraZeneca, AbbVie, and Boehringer Lead Innovations": 0.5,
  "Stuttering Market Research Report 2025-2035 | AstraZeneca, via Alexion, Leads with Strensiq as the First Approved Enzyme Replacement Therapy": 0.2,
  "These 3 Artificial Intelligence (AI) Stocks Could Soar More Than 40% Over the Next 12 Months, According to Wall Street": 0.8,
  "Chronic Inflammatory Demyelinating Polyneuropathy Market Report 2025 | Distribution Channel, Route of Administration, and Region Analysis and Forecast to 2035": 0.1,
  "Salesforce, PayPal COFOs tout agentic AI potential: Trial Balance": 0.2,
  "US Equity Investors to Look for Impact of Inflation on Rate-Cut Outlook, Ukraine-Russia Truce This Week": 0.2,
  "O'Reilly Automotive Second Quarter 2025 Earnings: In Line With Expectations": 0.5,
  "Monster Beverage achieves “record” quarterly net sales": 0.8,
  "Kymera Therapeutics Announces Second Quarter 2025 Financial Results and Provides a Business Update": 0.5,
  "Stoke Therapeutics and Biogen Announce First Patient Dosed in Phase 3 EMPEROR Study of Zorevunersen, a Potential Disease-Modifying Treatment for Dravet Syndrome": 0.8,
  "Biohaven Reports Second Quarter 2025 Financial Results and Recent Business Developments": 0.5,
  "Biogen and Stoke Therapeutics Announce First Patient Dosed in Phase 3 EMPEROR Study of Zorevunersen, a Potential Disease-Modifying Treatment for Dravet Syndrome": 0.5,
  "Option Volatility And Earnings Report For Aug 11 - 15": 0.0,
  "Palo Alto Networks, Inc.'s (NASDAQ:PANW) Fundamentals Look Pretty Strong: Could The Market Be Wrong About The Stock?": 0.6,
  "Better Artificial Intelligence Stock: ASML vs. AMD": 0.5,
  "Shopify Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "Peace Talks, Pending Inflation Report Cap Wall Street Pre-Bell; Asia Up, Europe Muted": 0.2,
  "AAON (NASDAQ:AAON) Reports Sales Below Analyst Estimates In Q2 Earnings, Stock Drops 15.6%": -0.7,
  "TDS reports second quarter 2025 results": 0.0,
  "The Trade Desk Crashes 39% in a Day as Amazon Looms Large": -0.7,
  "Holtec’s Michigan nuclear plant set for restart": 0.5,
  "AI Chips Update - DEEPX Partners With Baidu To Propel AI Innovation": 0.8,
  "U.S. Cellular’s (NYSE:USM) Q2: Beats On Revenue": 0.5,
  "Alibaba Group (BABA) Plans to Wind Up its Members-Only Stores, Bloomberg Reports": -0.5,
  "What Gives Constellation Energy an Edge in Wholesale Energy Markets?": 0.5,
  "Microchip Technology (NASDAQ:MCHP) Is Paying Out A Dividend Of $0.455": 0.2,
  "Best platform to look up historical intra day performance of a stock? - If you would look at the chart for XYZ stock today at 4pm, that 1 day chart (but for a previous day) seems hard to find for say 3 Tuesdays ago. ChatGPT and Grok and a few others don't show it either, they talk about subscription services that provide this. For those with experience in this kind of thing, which paid platform": 0.2,
  "Up 23% to 132%, There's Still Time to Buy These 3 Stocks": 0.5,
  "GE HealthCare Technologies Inc.'s (NASDAQ:GEHC) Intrinsic Value Is Potentially 67% Above Its Share Price": 0.8,
  "Analog Devices, Inc. (NASDAQ:ADI) is largely controlled by institutional shareholders who own 89% of the company": 0.1,
  "Axon Enterprise (NASDAQ:AXON) delivers shareholders enviable 60% CAGR over 5 years, surging 13% in the last week alone": 0.8,
  "Datadog (DDOG) Releases Q2 2025 Results": 0.2,
  "The Trade Desk (TTD) Announces Financial Results for Q2 2025": 0.5,
  "Diamondback Energy Q2 Earnings Beat Estimates, Revenues Rise Y/Y": 0.8,
  "Q2's coming up, ACHR dip looks more like a chill moment than a breakdown - Alright, Archer’s about to drop Q2 results on Aug 11 most expect a loss around $0.25 per share on tiny revenue. Doesn’t scream breakout, but let’s not freak out just yet Btw, [Vanguard just scooped up 5.66% of the company](https://www.msn.com/en-us/money/topstocks/vanguard-takes-5-66-stake-in-archer-aviation-as-stock-swings-continue/ar-AA1JWfde) & [Virtu Financial went nuts boosted its position by 704%, worth about $2.56M](https://www.marketbeat.com/instant-alerts/filing-virtu-financial-llc-has-256-million-stake-in-archer-aviation-inc-nyseachr-2025-08-10/). That’s not small time support On the": 0.5,
  "Biogen, Stoke Therapeutics Dose First Patient in Phase 3 Trial of Zorevunersen for Dravet Syndrome": 0.5,
  "If You Invested $1000 in Shopify a Decade Ago, This is How Much It'd Be Worth Now": 0.5,
  "4 Stocks to Bet on as Nasdaq's Northbound Journey Continues": 0.5,
  "Latest News In Digital Payment - Digital Banks Reshape Landscape With Super Apps and Innovation": 0.8,
  "Find Oversold Stocks to Buy at a Discount With This Barchart Screener": 0.2,
  "Golden State Perks Await in Paradise: Hacienda del Mar Unveils Limited-Time California Resident Offer": 0.5,
  "Paramount buys UFC rights in $7.7 billion, 7-year deal - [https://www.cnbc.com/2025/08/11/paramount-buys-ufc-rights-skydance-merger.html?&qsearchterm=paramount](https://www.cnbc.com/2025/08/11/paramount-buys-ufc-rights-skydance-merger.html?&qsearchterm=paramount) Paramount has acquired the U.S. rights to UFC, beginning in 2026. The deal is for all annual UFC live events, which will then be exclusively streamed in the U.S. on Paramount+. The new Paramount deal removes pay-per-view, so all events are available for no extra charge on Paramount+.": 0.8,
  "Airbnb Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "EVERISE STRENGTHENS LEADERSHIP TEAM WITH CHIEF REVENUE OFFICER AND CHIEF FINANCIAL OFFICER APPOINTMENTS": 0.8,
  "Amplitude to Present at Upcoming Investor Conferences": 0.0,
  "Workday Wellness Named a 2025 Top HR Product of the Year by HR Executive": 0.8,
  "Is Trending Stock Amgen Inc. (AMGN) a Buy Now?": 0.0,
  "Is Most-Watched Stock PDD Holdings Inc. Sponsored ADR (PDD) Worth Betting on Now?": 0.2,
  "AppLovin Corporation (APP) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Amgen Insiders Sell US$12m Of Stock, Possibly Signalling Caution": -0.5,
  "3 Biotech Stocks Likely to Outpace Q2 Earnings Estimates": 0.5,
  "3 Top-Ranked Dividend Stocks: A Smarter Way to Boost Your Retirement Income": 0.5,
  "Insights Into Applied Materials (AMAT) Q3: Wall Street Projections for Key Metrics": 0.1,
  "Why KLA (KLAC) International Revenue Trends Deserve Your Attention": 0.5,
  "Investing in Microchip Tech (MCHP)? Don't Miss Assessing Its International Revenue Trends": 0.5,
  "International Markets and Atlassian (TEAM): A Deep Dive for Investors": 0.5,
  "Fortinet (FTNT) International Revenue Performance Explored": 0.2,
  "Unlocking Monster Beverage (MNST) International Revenues: Trends, Surprises, and Prospects": 0.5,
  "ON Semiconductor Corp. (ON) Reliance on International Sales: What Investors Need to Know": 0.2,
  "CRDO Rises 79% YTD: How Should Investors Approach the Stock?": 0.5,
  "Intel stock rises as CEO prepares for White House meeting amid Trump criticism": 0.5,
  "PepsiCo (PEP) Crossed Above the 200-Day Moving Average: What That Means for Investors": 0.5,
  "Brokers Suggest Investing in AppLovin (APP): Read This Before Placing a Bet": 0.2,
  "Can Solid Automotive Revenues Propel QCOM Stock Amid Tariff Woes?": 0.1,
  "Arm initiated, Adobe downgraded: Wall Street's top analyst calls": -0.5,
  "Does PepsiCo Have the Edge in Functional Beverage Boom?": 0.5,
  "Lifeway Foods Expands Distribution to San Diego Region Costco Wholesale Warehouse Locations with Kefir Variety Packs": 0.5,
  "Is AppLovin (APP) Stock Outpacing Its Business Services Peers This Year?": 0.2,
  "ADP® Lyric HCM Wins Top HR Product of 2025 Award By HR Executive": 0.6,
  "r/Stocks Daily Discussion Monday - Aug 11, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.2,
  "Token Security and Descope Unite with Cybersecurity Leaders to Launch Security Guide for Agentic AI Adoption": 0.5,
  "The Rise of Wi-Fi as a Service Market: A $21.96 billion Industry Dominated by Tech Giants - AT&T (US), Verizon (US), and T-Mobile (US)| MarketsandMarkets™": 0.5,
  "Palo Alto Networks (PANW) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "Deep Learning Chipsets Market Surges to USD 25.5 Billion by 2033, Propelled by 18.4% CAGR - Verified Market Reports®": 0.8,
  "Apple Inc (AAPL) Increases its Total Investment to $600 billion to Expand its Manufacturing in the United States": 0.8,
  "PepsiCo hit with US lawsuit over alleged price discrimination": -0.6,
  "PANW Plunges 14% in 6 Months: Should You Hold or Fold the Stock?": -0.6,
  "Netflix (NFLX) Secures Broadcasting Rights for FIFA Women’s World Cup": 0.8,
  "Form 8.3 - Aqua Acquisition Sub LLC (subsidiary of Qualcomm Incorporated)": 0.0,
  "Datadog Q2 Earnings & Revenues Beat on Solid Customer Growth": 0.8,
  "[Latest] Global Email Encryption Market Size/Share Worth USD 31.1 Billion by 2034 at a 22.5% CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trends, Forecast, Segmentation, Growth Rate, Value, SWOT Analysis)": 0.5,
  "Paxos joins spate of crypto companies applying for US trust bank licenses": 0.5,
  "Exclusive-Paxos joins spate of crypto companies applying for US trust bank licenses": 0.5,
  "Costco's July Sales Jump Signals Strong Finish to Fiscal 2025": 0.8,
  "Remington Hospitality appoints chief commercial officer": 0.2,
  "Trinity and Costco Launch Scalable Off-Grid Power Solutions with Innovative Energy System": 0.6,
  "Vertex Minerals to commence high-grade ore production at Reward gold mine": 0.8,
  "The Zacks Analyst Blog Highlights JPMorgan Chase, Chevron, Shopify and Crawford United": 0.0,
  "Melius Research warns that things ‘can get worse for SaaS players like Adobe’": -0.6,
  "IonQ Stock Surges on Quantum Breakthroughs: More Upside Ahead?": 0.8,
  "Honeywell Rises 10% in a Year: How Should You Play the Stock?": 0.5,
  "Applied Materials Before Q3 Earnings: How to Play the Stock": 0.5,
  "S&P 500 Companies' Profit, Revenue Growth Accelerates, Oppenheimer Says": 0.6,
  "Exelon (EXC) Could Be a Great Choice": 0.8,
  "Fox and ESPN to Offer Streaming Services in $40-a-Month Bundle": 0.5,
  "Paxos Applies for National Bank Trust Charter, Joining Stablecoin Issuers Circle, Ripple": 0.2,
  "Laurel Secures Investment from Workday Ventures to Reshape How Professional Services use AI to Track, Manage, and Maximize Time": 0.6,
  "National Advertising Review Board Recommends T-Mobile Discontinue Certain Comparative Savings Claims for its Mobile Telephone Service": -0.5,
  "Electronic Arts blocks more than 300,000 attempts to cheat after launching Battlefield 6 beta": 0.6,
  "Double Your Savings in a Year With This Plan by Humphrey Yang": 0.5,
  "EA SPORTS™ NHL® 26 Elevates Authenticity With NHL EDGE Partnership and ICE-Q 2.0 Integration": 0.6,
  "Enterprise Merchandising, Now Native on Shopify": 0.5,
  "Electronic Arts (EA) Stock Is Up, What You Need To Know": 0.5,
  "Why The Trade Desk (TTD) Stock Is Up Today": 0.5,
  "The Bancorp (TBBK) Stock Is Up, What You Need To Know": 0.5,
  "Why Monday.com (MNDY) Shares Are Plunging Today": -0.7,
  "Adobe Stock Gets a Downgrade. ‘AI Is Eating Software,’ Analyst Says.": -0.6,
  "Nvidia Will Give U.S. a Cut of Its AI Chip Sales to China. The Stock Gets a Bump.": 0.5,
  "2 Stocks to Buy From the Challenging Semiconductor Industry": 0.5,
  "Broadcom Hits New High: Is AVGO Stock Still a Buy?": 0.5,
  "Shopify's Higher FCF Margins Can Push SHOP Stock Higher": 0.6,
  "Ocean’s new app brings inbox triage, tasks, and invites to Gmail users": 0.5,
  "Arm Stock Is Rising. The Chip Designer Has Tripled Its Market, This Analyst Says.": 0.8,
  "How Stagflation Could Derail a Market Fueled by ‘Hopium’ and Send Stocks Down 15%": -0.6,
  "Comcast Names Nick Kask Vice President of Finance and Business Operations for Big South Region": 0.2,
  "Trump extends China tariff deadline by 90 days - President Donald Trump has signed an executive order that will prevent high U.S. tariffs on Chinese goods from snapping back into effect for another 90 days, a White House official told CNBC on Monday afternoon. The order was signed just hours before midnight, when the pause on Trump’s tariffs was set to expire. The delay was the expected outcome from the latest round of talks between": 0.2,
  "Why Shutterstock (SSTK) Stock Is Falling Today": -0.5,
  "FibroGen Reports Second Quarter 2025 Financial Results and Provides Business Update": 0.0,
  "PubMatic Announces Second Quarter 2025 Financial Results": 0.0,
  "Micron Stock Rises After Memory-Chip Maker Ups Outlook": 0.8,
  "Microchip Technology to Present at the KeyBanc Technology Leadership Forum": 0.0,
  "AMC earnings, Strategy & bitcoin, C3.ai sinks: Trending Tickers": 0.2,
  "Bitcoin Nears Record. It Could Soon Join Your 401(k).": 0.8,
  "These Stocks Moved the Most Today: C3.ai, Coinbase, Monday.com, Avantor, Tegna, Nvidia, Albemarle, and More": 0.2,
  "Why Is Tilray (TLRY) Stock Soaring Today": 0.5,
  "Stock Market Today: Dow, Nasdaq Fall, Set Aside Trump-China Tariff Move; Tesla Clears Entry But This AI Stock Craters": 0.1,
  "US Equity Indexes Decline Ahead of July CPI Inflation Print, Upcoming Ukraine-Russia Peace Talks": 0.1,
  "Galaxy Appoints Matt Friedrich as Chief Legal Officer": 0.5,
  "Dow Jones Futures: Tesla Hits New Buy Point; CoreWeave Earnings, CPI Inflation Data Next": 0.5,
  "Mondelēz 2024 Snacking Made Right Report: Climate Change": 0.0,
  "Adobe Stock Downgraded As 'AI Is Eating Software'": -0.5,
  "Trump flip-flops on Intel CEO, calls him ‘success’ days after demanding resignation - President Trump said Monday that he met with Intel CEO Lip-Bu Tan, days after the U.S. leader called on Tan to resign. Intel shares rose 2% in extended trading. In a post on Truth Social, Trump praised Tan and said Tan and members of the Cabinet would come up with suggestions. “I met with Mr. Lip-Bu Tan, of Intel, along with Secretary": 0.2,
  "Albemarle operating chief Netha Johnson to leave company": -0.5,
  "UFC Parent TKO Punches Higher, Leads S&P 500; Intel Extends Gains Late On Trump Reversal": 0.5,
  "Stocks to Watch Recap: Nvidia, AMC, Coinbase": 0.0,
  "Intuit (INTU) Declines More Than Market: Some Information for Investors": -0.5,
  "PDD Holdings Inc. Sponsored ADR (PDD) Falls More Steeply Than Broader Market: What Investors Need to Know": -0.5,
  "Why sports dominate the media industry & what's next in 2026": 0.2,
  "Why Arm Holdings Stock Popped Higher on Monday": 0.5,
  "Is Figma the Next Hot Tech Stock to Own?": 0.6,
  "Copart, Inc. (CPRT) Advances While Market Declines: Some Information for Investors": 0.5,
  "Texas businessmen indicted for allegedly bribing officials at Mexico's Pemex": -0.8,
  "Tomorrow CPI numbers will be BAD - So Trump just announced his new pick for BLS head, the day before CPI numbers are out. I think this is a sign from Trump. Trump has access to the BLS data releases a day before, so he knows what's gonna happen tomorrow. Trump is trying to quickly get the new BLS head into office so \"changes\" to the BLS can made quickly. I also think Trump will": -0.6,
  "Cannabis stocks rally after Trump says he is weighing drug reclassification - ″We’re looking at reclassification,” Trump told reporters Monday during a press conference to announce the deployment of the National Guard to Washington, D.C. “We’ll make a determination ... over the next few weeks.” The biggest immediate win is this will remove 280e, where these companies will finally be on the same playing field as every other American company and can deduct business expenses,": 0.8,
  "(Item 8.01) of this Current Report on Form 8-K is incorporated by reference into this\n\n(Item 8.01) Other Events. On August 12, 2025, Roper Technologies, Inc. (the “Company”) consummated the issuance and sale of $2,000,000,000 in aggregate principal amount of senior unsecured notes consisting of: (i) $500,000,000 aggregate principal amount of its 4.250% Senior Notes due 2028 (the “2028 Notes”), (ii) $500,000,000 aggregate principal amount of its 4.450% Senior Notes due 2030 (the “2030 Notes”) and (iii) $1,000,000,000 aggregate principal amount of its 5.100% Senior Notes due 2035 (collectively with the 2028": 0.1,
  "Marine Sensors Market to Reach $1.9 Billion by 2028, Growing at 6.5% CAGR: Exploring the Depths of Growth": 0.8,
  "Agoda Unveils Top Visa-Free Asian and European Destinations for South Korean Travelers": 0.5,
  "Gilead Receives Favorable CHMP Opinion For HIV Prevention With Twice-Yearly Lenacapavir": 0.8,
  "Amgen Announces Bemarituzumab’s Successful Phase 3 Results in FGFR2b+ Gastric Cancer": 0.8,
  "Regeneron Reveals The Regeneron Prize For Creative Innovation 2025 Winners": 0.5,
  "The Smartest Growth Stock to Buy With $160 Right Now": 0.5,
  "Revna Biosciences and AstraZeneca Increase Access to Lung Cancer Treatment in Ghana": 0.8,
  "CrowdStrike Sees 13% Stake Growth from PNC Financial": 0.5,
  "Do you actually sell when your stock hits your target price? - I’ve always found it tricky to sell when a stock finally reaches the target price I set. A recent example for me was AMD. I bought it during a dip, and a few months later it was up over 35%. My initial target was around $150 based on my valuation work, and when it hit that level I still hesitated. I kept thinking": 0.2,
  "Medical Devices & Supplies - Imaging, Diagnostics Stocks Q2 Earnings: GE HealthCare (NASDAQ:GEHC) Best of the Bunch": 0.6,
  "Winners And Losers Of Q2: CSX (NASDAQ:CSX) Vs The Rest Of The Transportation and Logistics Stocks": 0.2,
  "Spotting Winners: PepsiCo (NASDAQ:PEP) And Beverages, Alcohol, and Tobacco Stocks In Q2": 0.5,
  "GOOGL is a value buy due to AI - Yes, this is your weekly Google post! Google, the company that made LLMs possible with the transformer revolutionary paper. The company that has been valued at 20 PE for many quarters now, even though its peers are at 30ish PE. LLMs have hit a plateau. Incremental model versions (GPT 5 for example) are not showing incremental gains. If anything, new versions are kind of acting funny": 0.2,
  "5 Revealing Analyst Questions From Electronic Arts’s Q2 Earnings Call": 0.2,
  "The Top 5 Analyst Questions From Mondelez’s Q2 Earnings Call": 0.1,
  "5 Insightful Analyst Questions From Booking’s Q2 Earnings Call": 0.5,
  "The 5 Most Interesting Analyst Questions From Starbucks’s Q2 Earnings Call": 0.6,
  "2 Mid-Cap Stocks on Our Watchlist and 1 We Brush Off": 0.1,
  "VRSK Q2 Deep Dive: M&A and AI Drive Strategy Amid Market Caution": 0.2,
  "GEHC Q2 Deep Dive: Tariff Headwinds and Innovation Pipeline Shape Outlook": 0.5,
  "GE HealthCare’s Q2 Earnings Call: Our Top 5 Analyst Questions": 0.5,
  "ODFL Q2 Deep Dive: Volume Weakness, Cost Inflation, and Market Share Focus Shape Outlook": 0.1,
  "SBUX Q2 Deep Dive: Operational Investments and Turnaround Strategy Define Starbucks’ Quarter": 0.5,
  "Electronic Arts (EA) Q2 CY2025 Deep Dive: Sports Franchises Drive Engagement, But Margin Pressures Persist": 0.1,
  "5 Revealing Analyst Questions From Verisk’s Q2 Earnings Call": 0.2,
  "1 Unprofitable Stock with Competitive Advantages and 2 Facing Challenges": 0.0,
  "BKNG Q2 Deep Dive: Alternative Accommodations, Asia, and AI-Powered Experiences Drive Growth": 0.5,
  "The 5 Most Interesting Analyst Questions From Old Dominion Freight Line’s Q2 Earnings Call": 0.6,
  "MDLZ Q2 Deep Dive: Pricing, Regional Divergence, and Margin Gains Amid Consumer Caution": 0.5,
  "USM Q2 Deep Dive: T-Mobile Sale Reshapes Strategy, Fiber and Towers in Focus": 0.5,
  "TDS Q2 Deep Dive: Portfolio Reshaping and Fiber Expansion Set the Stage for Transformation": 0.8,
  "Costco’s High PE Ratio and its Growth Potential - Costco is one of the best retail businesses in the world with decades of consistent growth. The stock has been trading at a P/E of around 54 and I wanted to see if the fundamentals justify the current price. **Earnings growth requirements** If we assume a fair multiple of 27 (which is what I would pay for an exceptional business like Costco) then EPS would need": 0.5,
  "This Dividend Fund Owns Nvidia and Broadcom. It’s Crushing the Market.": 0.8,
  "Puerto Rico’s ongoing journey from manufacturing hub to innovation enterprise": 0.5,
  "Japan’s Nikkei Hits Record High on Tariff Relief, Tech Rally": 0.8,
  "TEAM Q2 Deep Dive: AI Adoption and Enterprise Demand Offset Cautious Outlook": 0.5,
  "TTD Q2 Deep Dive: Cautious Advertiser Environment and AI Platform Shift Shape Outlook": -0.5,
  "TTWO Q2 Deep Dive: Mobile Outperformance and Franchise Momentum Offset Guidance Concerns": 0.5,
  "Trump Met With Intel CEO, Says Tan Will Bring ‘Suggestions’ Next Week": 0.2,
  "CDW Q2 Deep Dive: Diversified Portfolio and Services Investments Shape Results Amid Market Uncertainty": 0.5,
  "Inflation Data, Retail Sales, Cisco Earnings: What to Watch This Week": 0.2,
  "3 Leading Tech Stocks to Buy in the Second Half of 2025": 0.5,
  "APP Q2 Deep Dive: Platform Expansion and Self-Service Strategy Drive Future Growth": 0.6,
  "ABNB Q2 Deep Dive: Product Expansion and International Markets Shape Outlook": 0.5,
  "MNST Q2 Deep Dive: Global Growth, Innovation Pipeline, and Margin Expansion": 0.6,
  "MCHP Q2 Deep Dive: Inventory Correction and Demand Recovery Shape Results": 0.5,
  "DDOG Q2 Deep Dive: AI Customer Growth, Product Expansion, and Guidance Raise": 0.8,
  "GILD Q2 Deep Dive: HIV Franchise Drives Growth, New Launches and Pipeline in Focus": 0.6,
  "ViCentra to Bring Smartphone-Based Closed Loop Therapy to People with Diabetes in Early 2026": 0.5,
  "Adobe Stock Outlook: Is Wall Street Bullish or Bearish?": 0.2,
  "Inflation Is Ticking Upwards. Should Costco Wholesale Investors Be Worried?": -0.5,
  "2 Growth Stocks to Buy With $200 and Hold Forever": 0.5,
  "Pepsi vs. Coke: Which Soda Stock Fizzes With Value?": 0.5,
  "r/Stocks Daily Discussion & Technicals Tuesday - Aug 12, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on technical analysis (TA), but if TA is not your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly": 0.2,
  "Shopify aims to kill Sezzle lawsuit": -0.6,
  "Norway’s $1.9 Trillion Fund Has Best Quarter Since 2023": 0.8,
  "Media musical chairs are reshaping the sports landscape": 0.2,
  "Inflation Report: Consumer Prices Up 2.7% Annually, Meeting Expectations": 0.5,
  "KLA Corporation (NASDAQ:KLAC) Released Earnings Last Week And Analysts Lifted Their Price Target To US$929": 0.6,
  "Health Care Roundup: Market Talk": 0.0,
  "Micron awards Gilbane preconstruction contract on $100B plant": 0.5,
  "If You'd Invested $1,000 in VIG 5 Years Ago, Here's How Much You'd Have Today": 0.5,
  "Ford Crosses into Fast Lane With $2 Billion Affordable EV Plan": 0.8,
  "Paramount Ponies Up $7.7 Billion to Win UFC Rights": 0.5,
  "Sanofi halts Praluent supply in China due to limited availability": -0.5,
  "MicroStrategy's (NASDAQ:MSTR) Profits May Be Overstating Its True Earnings Potential": -0.5,
  "First patient dosed in Phase III trial of zorevunersen for Dravet syndrome": 0.5,
  "Tradr Launches First-to-Market Leveraged ETFs on Datadog & Astera Labs": 0.5,
  "Vertex Pharmaceuticals' (NASDAQ:VRTX) Earnings May Just Be The Starting Point": 0.5,
  "Trump says Intel CEO has an 'amazing story' days after calling for his resignation": -0.5,
  "Monster Energy executives aim to revitalize Thrifty Ice Cream": 0.5,
  "PL Developments Builds a Smarter, Healthier Supply Chain with Kinaxis": 0.5,
  "CoreStack Recognized Again as One of America's Fastest-Growing Private Companies by Inc. 5000": 0.8,
  "Accrete, Inc. Debuts on the 2025 Inc. 5000 List, Among America's Fastest-Growing Private Companies": 0.8,
  "Mondelez International (NASDAQ:MDLZ) investors are sitting on a loss of 10.0% if they invested a year ago": -0.7,
  "With 88% institutional ownership, Texas Instruments Incorporated (NASDAQ:TXN) is a favorite amongst the big guns": 0.6,
  "Copyleaks Ranks No.153 on the 2025 Inc. 5000 List of America’s Fastest-Growing Private Companies": 0.8,
  "IRONSCALES Named to Inc. 5000 List of America’s Fastest-Growing Private Companies for Fifth Consecutive Year": 0.8,
  "1 S&P 500 Growth Stock Down 31% to Buy in August": 0.2,
  "Fortinet Stock Is Plunging on Refresh Cycle Woes. Should You Buy the FTNT Dip?": -0.5,
  "Company News for Aug 12, 2025": 0.0,
  "1 AI Stock Analysts Are Quietly Raising Their Price Targets On": 0.2,
  "GoTo Foods trials drone delivery service in Texas, US": 0.0,
  "Exploring High Growth Tech Stocks In The US Market": 0.5,
  "Are Wall Street Analysts Predicting Linde Stock Will Climb or Sink?": 0.2,
  "Is Applied Materials (AMAT) Well-positioned to Capitalize the AI Trend?": 0.5,
  "Eureka Therapeutics Appoints Dr. Reginald Seeto and William S. Solari III to Board of Directors": 0.5,
  "Paxos seeks national trust bank charter in US": 0.2,
  "Who are the best stock-pickers you actually trust? Looking for the GOOD list. - I’m mapping out the best finfluencers who focus on actual stock-picking. Not macro takes, not memes, not crypto. Who has genuinely improved your process with specific ideas and clear reasoning? Podcasts, YouTube channels, newsletters all welcome. I’ll compile the top mentions and share the summary here next week.": 0.6,
  "ISRG's Post-Earnings Slide: Margin Worries Overshadow Growth Story": -0.6,
  "Tutor Perini and Crocs have been highlighted as Zacks Bull and Bear of the Day": 0.2,
  "Do It Best Selects HawkSearch for Large-Scale Personalized Commerce Experience": 0.5,
  "Alliance Entertainment Scales Handmade by Robots Brand with Costco Debut of Limited-Edition Mega Horror Figures": 0.5,
  "Here's How Much a $1000 Investment in Idexx Laboratories Made 10 Years Ago Would Be Worth Today": 0.5,
  "Paxos is applying to become a US bank — Here’s why that matters": 0.5,
  "CoreWeave Stock Soars as JPMorgan Hikes Target Ahead of Earnings": 0.8,
  "Response Labs Named to Inc. 5000 America's Fastest-Growing Private Companies list for the Fourth Straight Year": 0.8,
  "CPI rose 2.7% less than the expected 2.8%, while Core CPI rose 3.1% above the expected 3.0% in July - \"In July, the Consumer Price Index for All Urban Consumers rose 0.2 percent, seasonally adjusted, and rose 2.7 percent over the last 12 months, not seasonally adjusted. The index for all items less food and energy increased 0.3 percent in July (SA); up 3.1 percent over the year (NSA).\" The close to expected inflation, combined": 0.2,
  "3 Cybersecurity Stocks You Can Buy and Hold for the Next Decade": 0.5,
  "Sanderson Firm Ranked #92 on the 2025 Inc. 5000 List of Fastest-Growing Companies in America": 0.8,
  "Truck manufacturers sue CARB over zero-emission vehicle plan": -0.6,
  "New .med Domain Names Surpass 40,000 Pre-Orders in July": 0.8,
  "Software stocks in Europe fall on concerns over AI pitfalls": -0.6,
  "warren buffett to disclose their secret stock in a few days. any guesses? - Warren Buffett has been building a position on a secret stock for a while now and could disclose their secret stock with their 13F filings later this week. would it be something in the insurance sector, consumer staples or something else? Previously his secret stock was chubb. i see alot of talk about UNH but i highly doubt it, and i": 0.2,
  "New Workday Global Research: AI Agents Are Here--But Don't Call Them Boss": 0.5,
  "Ansys Announces Agreement to Offer Access to NVIDIA Omniverse Technology from within Simulation Solutions": 0.5,
  "Fortinet Enhances FortiRecon to Align with Continuous Threat Exposure Management (CTEM) Framework to Help Organizations Stay Ahead of Threats": 0.6,
  "Chicago Entrepreneur Gives Family Business a New Life at the Airport": 0.8,
  "Is Trending Stock Shopify Inc. (SHOP) a Buy Now?": 0.2,
  "Is Trending Stock Cadence Design Systems, Inc. (CDNS) a Buy Now?": 0.2,
  "Datadog, Inc. (DDOG) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Here is What to Know Beyond Why Warner Bros. Discovery, Inc. (WBD) is a Trending Stock": 0.2,
  "Costco Wholesale Corporation (COST) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Baker Hughes (NASDAQ:BKR) shareholders have earned a 24% CAGR over the last five years": 0.8,
  "An Intrinsic Calculation For Keurig Dr Pepper Inc. (NASDAQ:KDP) Suggests It's 47% Undervalued": 0.8,
  "TKO delivers a 'knockout' with UFC and WWE deals as Wall Street sees more upside ahead": 0.8,
  "TTD Stock Crashes Post Q2 Earnings: Stay Invested or Make an Exit?": -0.5,
  "Dave Ramsey: 7 Brutally Honest Money Tips To Follow Now": 0.5,
  "Neon and Razorpay Partner to Bring World-Class DTC Payments to India’s Gaming Market": 0.5,
  "Guggenheim Lifts PT on Regeneron Pharmaceuticals (REGN) to $815 From $810": 0.6,
  "International Markets and Lam Research (LRCX): A Deep Dive for Investors": 0.5,
  "Madden NFL 26 Championship Series Competitions Return to Full Sail University Orlando Health Fortress for Second Consecutive Year": 0.5,
  "NXP Semiconductors Stock: Analyst Estimates & Ratings": 0.0,
  "T-Mobile Introduces New Revvl 8 Smartphone Packed with Power and Perks": 0.8,
  "Pickering Energy Partners Advises Heliogen, Inc. in Merger with Zeo Energy Corp.": 0.5,
  "Broadcom Stock: Is Wall Street Bullish or Bearish?": 0.5,
  "SearchStax Named to the 2025 Inc. 5000 List of America’s Fastest-Growing Private Companies": 0.8,
  "Ethereum treasury company Bitmine Immersion plans to issue $20 billion worth of stock to buy more ETH": 0.2,
  "Here's What Investors Should Expect From RADCOM's Q2 Earnings": 0.2,
  "Supply Chain Security Market Surges to $5.14 Billion by 2030 - Led by IBM (US), Emerson (US), Oracle (US) | MarketsandMarkets™": 0.8,
  "New to Investing? This 1 Computer and Technology Stock Could Be the Perfect Starting Point": 0.6,
  "Is It Worth Investing in Micron (MU) Based on Wall Street's Bullish Views?": 0.5,
  "Is It Worth Investing in Analog Devices (ADI) Based on Wall Street's Bullish Views?": 0.5,
  "Costco (COST) Is Considered a Good Investment by Brokers: Is That True?": 0.5,
  "GE HealthCare Technologies Stock: Is Wall Street Bullish or Bearish?": 0.2,
  "What stocks burst during the 2000 Dot Com Bubble, but its price is now reaching its previous peak during 2000? - I've been seeing a lot of stocks that were all the rage during the dot com period, burst go down insane amounts, but now in 2025 they are reaching the same level during the dot com peak. Is this a sign of things to come? Or were these businesses just ahead of their time?": 0.2,
  "Marijuana Legalization? - What stocks do we need to buy? “Donald Trump on Monday confirmed he is considering reclassifying marijuana as a less dangerous drug. So the federal gov can tax the drug. Open the door to federal tax revenue: Reclassification would allow the federal government to treat cannabis businesses like any other, potentially generating billions in tax revenue.”": 0.6,
  "The Zacks Rank Explained: How to Find Strong Buy Computer and Technology Stocks": 0.5,
  "Starbucks upgraded, Shopify downgraded: Wall Street's top analyst calls": 0.2,
  "2025 Brand Reputation Summit | Future-Proof Your Brand - Tactics and Tools from Industry Leaders at the Summit (Philadelphia, PA, United States - October 20-21, 2025)": 0.5,
  "Tesla is hiring robotaxi test drivers in New York City, but company hasn’t applied for permits - Tesla is recruiting test drivers in New York to operate cars with “automated driving systems,” but the company hasn’t applied for the permits it would need to test autonomous vehicles in the nation’s largest city. A job opening on Tesla’s website says the company is looking to hire vehicle operators in the borough of Queens. The hires will": -0.5,
  "Are You a Momentum Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Why Monster Beverage (MNST) is a Top Momentum Stock for the Long-Term": 0.6,
  "Is there any way to invest in IPOs as an individual without being an accredited investor? - The recent buzz around figma on its first day got me interested in the potential return of IPOs vs just my stuff sitting in funds, but any platform I have found that allows individuals to invest in IPO’s requires you to be an accredited investor, in other words, having a net worth of over $1 mill, among some": -0.5,
  "LRCX's ALD Moly Adoption Ramps Up: Will it be a Key Growth Driver?": 0.6,
  "Sinclair Stock Soars 16%. What’s Giving the TV Station Operator a Boost.": 0.8,
  "LRCX vs. AMAT: Which Chip-Equipment Stock Is a Better Buy Right Now?": 0.5,
  "MU vs. FORM: Which Semiconductor Stock Has More Potential Right Now?": 0.2,
  "1 Stock Under $50 to Target This Week and 2 Facing Headwinds": 0.2,
  "1 Cash-Producing Stock Worth Your Attention and 2 We Find Risky": 0.5,
  "HHM Hotels Builds Out Senior Executive Team Hiring Jeremiah Galvin": 0.5,
  "Fastenal Company's (NASDAQ:FAST) Stock Has Seen Strong Momentum: Does That Call For Deeper Study Of Its Financial Prospects?": 0.5,
  "Reputation Rhino Named to 2025 Inc. 5000 List Recognizing Rapid Revenue Growth and Industry Leadership": 0.8,
  "ASML Aims 30% EUV Revenue Growth in FY25: Can it Hit the Target?": 0.5,
  "Any honest Brokerages r/stocks users can recommend? - I've been using a major Brokerage but noticed some Long-term held stock that I sold being flagged as a wash sale. Looking further in a transaction in a tax lot being recorded as two different transactions at two price points. I suspect my brokerage of misrepresenting cost basis of my stock purchases. I having my brokerage sent all statements, trade confirmations mail to me. Will hire a": -0.6,
  "AKOOL Ranks #1 on Inc. Magazine's 2025 Inc. 5000 List": 1.0,
  "Margins Are Falling, Yet Mercado Libre's Moat Keeps Growing": 0.5,
  "President Trump Now Supports Intel CEO Lip-Bu Tan -- What It Means for Investors": 0.5,
  "Palo Alto Networks Stock Is Rising. Why This Analyst Says It’s a Buy.": 0.8,
  "4 GARP Stocks That Investors Can Scoop Up for Maximum Returns": 0.5,
  "Nvidia Stock Slips. Trump’s China Deal Comes with Complications.": -0.5,
  "S&P 500, Nasdaq Back on Record Track": 0.8,
  "Saudi Arabia Frozen Vegetables Market Forecast and Competitive Analysis Report 2025-2033 Featuring Conagra Brands, Hormel Foods, Unilever, Kraft Heinz, Nomad Foods, B&G Foods, Greenyard": 0.2,
  "Billions wiped out as software stocks sink on AI disruption fear": -0.8,
  "Resideo's Cancellation of Indemnification Agreement, Planned ADI Spinoff to Drive Value, Morgan Stanley Says": 0.6,
  "Baird has ‘high conviction’ in Starbucks turnaround strategies; upgrades to Buy": 0.8,
  "Comcast Brings High-Speed Internet and Lift Zone to Gordon County, Celebrates with Laptop Giveaway and Block Party": 0.8,
  "PepsiCo Stock Shows Renewed Momentum: Buy the Rally or Step Back?": 0.5,
  "Circle shares rise as second-quarter revenue jumps 53% on strong stablecoin growth - https://www.cnbc.com/2025/08/12/circle-crcl-earnings-q2-2025.html > Circle Internet Group shares jumped Tuesday after reporting its first quarterly earnings as a publicly listed company. > While charges related to the stablecoin issuer's debut contributed to a second-quarter loss, it reported a 53% increase in revenue, driven by strong growth in stablecoins. Revenue rose to $658.1 million from $430 million in the same period a year ago. >": 0.8,
  "Saudi Arabia Online Gaming Market Growth and Competitive Analysis Report 2025-2033 Featuring Activision Blizzard, Apple, Capcom, Electronic Arts, Microsoft, Nintendo, Sony, Tencent": 0.5,
  "Micron's Fiscal Q4 Guidance Boost Signals Strength in Data Center, Consumer Markets, UBS Says": 0.8,
  "MP Materials - Is there a catch with this stock or am I going crazy? It's already up almost 3% today, and since the start of the year it's up a bit above 500%. In July, the price even doubled in about three days, which I don't remember seeing before. From what I can tell, the investment theses is that it controls a rare-earth mine in the USA and also processes these minerals, making it": 0.5,
  "If Trump Administration pushes for fake economic and census data to be published, how will it impact the market swings? - I’d rather say manipulated rather than outright fake Especially when accounting for the deteriorating state of the economy regardless of what numbers they publish Since lots of firms use US government data on inflation and jobs they will make calls on investments based on that flawed data?": -0.6,
  "BofA: The e-commerce surge continued in July, early data constructive for Amazon": 0.6,
  "Can Rising Casgevy Sales Aid CRISPR Therapeutics Post Q2 Earnings?": 0.2,
  "Micron and BigBear Stocks Diverge After Results. What It Says About the AI Trade.": 0.2,
  "Atlan Launches App Framework with 21 Leading Partners to Make Context Shareable Across the AI-Native Enterprise": 0.5,
  "BigBear.ai, Sea, Starbucks: Trending Tickers": 0.0,
  "Cleanspark Share Price Dips 8% Despite Strong Q3 Earnings Growth": 0.2,
  "Starbucks illegally threatened employees in posted letter about unionization, NLRB finds": -0.8,
  "Perplexity Makes Longshot $34.5 Billion Offer for Chrome - From The Wall Street Journal. [https://www.wsj.com/tech/perplexity-ai-google-chrome-offer-5ddb7a22](https://www.wsj.com/tech/perplexity-ai-google-chrome-offer-5ddb7a22) [Artificial-intelligence startup](https://www.wsj.com/tech/ai-startup-perplexitys-valuation-surges-to-14-billion-in-fresh-funding-round-26124482?mod=article_inline) >Perplexity on Tuesday offered to purchase Google’s Chrome browser for $34.5 billion as it works to challenge the tech giant’s [web-search dominance](https://www.wsj.com/tech/google-search-ai-antitrust-trial-57ec6fdb?mod=article_inline). >Perplexity’s offer is significantly more than its own valuation, which is estimated at $18 billion. The company told The Wall Street Journal that several investors including large venture-capital funds had agreed to back the transaction in": 0.5,
  "Terex, Atkore, Wabash, Old Dominion Freight Line, and Alta Shares Skyrocket, What You Need To Know": 0.8,
  "Am I the only one baffled by the ASTS rally after their report? - So ASTS just recently reported their last quarter. And they missed their targets hard. Again. Looking back at the last four reports: |Quarter|Estimated rev (M)|Actual rev (M)|rev diff (%)|estimated EPS|actual EPS|eps diff| |:-|:-|:-|:-|:-|:-|:-| |Q2 2025|$6.37|$1.16|–82%|–$0.19| –$0.41|–116%| |Q1 2025|$3.85|$0.72|–81%|–$0.17|–$0.20|–18%| |Q4 2024|$80|$1.92|–98%|–$0.14| –$0.12|\\+14%| |Q3 2024|$2.00|$1.10|–45%|–$0.20| –$1.10|\\-450%| And they have the audacity to claim for the second half of 2025 that they're looking at": -0.8,
  "Nominee for BLS commissioner says the agency should suspend monthly job reports - https://www.foxbusiness.com/politics/trumps-bls-pick-could-pause-monthly-jobs-report-over-accuracy-concerns > In an interview with FOX Business ahead of Monday’s nomination announcement, Antoni criticized the data behind the monthly jobs report as unreliable and frequently overstated, warning that it misleads key economic decision-makers from Washington to Wall Street. > > \"How on earth are businesses supposed to plan – or how is the Fed supposed to conduct monetary policy – when": -0.6,
  "Nova Shares Jump 4% on Q2 Earnings Beat, Robust Q3 Guidance": 0.8,
  "Earnings Estimates Rising for AppLovin (APP): Will It Gain?": 0.5,
  "Adobe Drops 9% in a Month: Should You Buy the Dip in ADBE Stock?": 0.2,
  "Shake Shack plans first restaurant in Vietnam for next year": 0.5,
  "Netflix's Content Strength Drives Engagement: What's the Path Forward?": 0.5,
  "AppLovin (APP) is an Incredible Growth Stock: 3 Reasons Why": 0.8,
  "Micron Rides AI Wave With Upgraded Outlook, Analysts See More Gains Ahead": 0.8,
  "InHand Networks Introduces the CPE02: Powering Business Networks with High-Speed Connectivity and Smart Management": 0.6,
  "Fastenal Stock: Is Wall Street Bullish or Bearish?": 0.2,
  "US ISPs lean into cybersecurity as a VAS": 0.2,
  "Corn futures tumble following WASDE report": -0.7,
  "Honeywell's Building Automation Growth Picks Up: More Upside to Come?": 0.6,
  "Best stocks to bet against if you are bearish on AI. - Aside from the obvious ones like NVDA, MSFT, META, which tickers would be suitable for shorting or buying puts on, if you are bearish on AI and believe we are in a bubble akin to the dot-com boom? I see that there are two general categories companies can be placed into: 1. Those which actually provide some kind of AI infrastructure/software that other": -0.2,
  "T-Mobile US (TMUS) Launches Feature-Packed Revvl 8 Smartphone With Exclusive Offers": 0.8,
  "How to invest in gold: 5 ways to buy and sell it": 0.2,
  "Target Stock Could Use Two Things for a Turnaround": 0.2,
  "Sector Update: Health Care Stocks Advance in Afternoon Trading": 0.5,
  "DoorDash (DASH) Expands Drone Deliveries And Enhances AI Supply Chain Capabilities": 0.6,
  "Starbucks, Krispy Kreme, Noodles, Shake Shack, and Bloomin' Brands Stocks Trade Up, What You Need To Know": 0.5,
  "Dow Jones Leader Cisco, Magnificent Seven Stock Alphabet In New Buy Zones": 0.5,
  "Resideo Technologies Pops As Honeywell Indemnity Buyout Boosts Growth Story": 0.8,
  "Cushman & Wakefield, Comcast, and MGM Resorts Shares Are Soaring, What You Need To Know": 0.6,
  "Amphastar Pharmaceuticals, QuidelOrtho, Integra LifeSciences, Select Medical, and Regeneron Stocks Trade Up, What You Need To Know": 0.5,
  "Palo Alto Networks, Rapid7, Monday.com, GitLab, and Atlassian Stocks Trade Up, What You Need To Know": 0.5,
  "Micron analysts parse updated outlook and tweak stock price targets": 0.2,
  "Arm Holdings' (NASDAQ:ARM) Promising Earnings May Rest On Soft Foundations": -0.5,
  "I just sold a decent amount of stock.. - 32, $890k networth, I decided to be a little manic and sell a good amount of stock today. I sold: APLD +70% NBIS +90% ALAB +150% RDDT +90% ONDS +100% SMCI +10% (small position) That now puts me at 32% cash, not sure why I'm sharing, just thought I would, I see a lot of repetitive information on here, so I thought I would share something": 0.2,
  "Top Research Reports for Bank of America, Roche & Intuit": 0.0,
  "CrowdStrike Named the Only Leader and Outperformer in the 2025 GigaOm Radar Report for SaaS Security Posture Management (SSPM)": 0.8,
  "Hold or Sell? - Hello. I’m trying to learn more about stocks. I have around $4035 in stock on Robinhood. I started buying stocks in 2021, just for learning experience. I don’t check my stocks every day but I sometimes buy stocks if I have extra money ($100). I have never sold any of my stocks because I didn’t need the money and I didn’t want to report it on my taxes and all of": 0.2,
  "[Latest] US Remittance Market Size/Share Worth USD 16.8 Billion by 2034 at a 12.07% CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trends, Forecast, Segmentation, Growth Rate, Value, SWOT Analysis)": 0.5,
  "Exa Capital Named to the 2025 Inc. 5000 List of America’s Fastest-Growing Private Companies": 0.8,
  "Why Texas Instruments (TXN) Stock Is Up Today": 0.5,
  "Why Resideo (REZI) Stock Is Trading Up Today": 0.5,
  "These Are The 5 Best Stocks To Buy Now Or Watch": 0.5,
  "Micron, Qorvo, and Impinj Shares Are Soaring, What You Need To Know": 0.8,
  "Magnachip, Intel, Microchip Technology, NXP Semiconductors, and onsemi Shares Skyrocket, What You Need To Know": 0.8,
  "Entegris, IPG Photonics, Universal Display, Kulicke and Soffa, and Lam Research Shares Skyrocket, What You Need To Know": 0.8,
  "Analog Devices, Monolithic Power Systems, MACOM, Qualcomm, and Photronics Shares Skyrocket, What You Need To Know": 0.8,
  "Sector Update: Health Care Stocks Rise Late Afternoon": 0.5,
  "Breakout Watch: Nvidia, Broadcom In Focus, But Don't Forget This Semiconductor Stock": 0.5,
  "ParkerVision Reports Second Quarter 2025 Results": 0.0,
  "QuickLogic Reports Fiscal Second Quarter 2025 Financial Results": 0.0,
  "Nuclear Play Oklo Reported Another Quarterly Loss But Analysts Are Still Bullish": 0.5,
  "Stock market today: S&P 500 closes above 6,400 for first time as rate cut bets jump after CPI inflation report": 0.6,
  "Sector Update: Tech Stocks Climb Late Afternoon": 0.5,
  "Big Tech is driving the stock market to new records": 0.6,
  "EA Stock Hits Record High On Buzz For New Video Game": 0.8,
  "S&P 500, Nasdaq Rise to Records After Inflation Data Boosts Fed Rate Cut Expectations": 0.8,
  "What Could Be Next for Intel After CEO Tan’s White House Meeting With Trump": 0.2,
  "These Stocks Moved the Most Today: BigBear.ai, Hanesbrands, Cardinal Health, AST SpaceMobile, Mercury Systems, Oklo, Fluence, and More": 0.2,
  "These 3 Companies Shattered Quarterly Records": 0.8,
  "NXP Semiconductors Announces Pricing of Senior Unsecured Notes Offering": 0.0,
  "Stock Market Today: Dow Rallies, S&P 500 And Nasdaq Make History; Nvidia, Palantir Both Do This": 0.8,
  "Circle Internet Aces Its First Earnings Test. The Stock Rises.": 0.8,
  "Crypto stock jumps 182% after Peter Thiel buys stake": 0.8,
  "Stocks to Watch Recap: Sea, Alphabet, Celanese, CoreWeave": 0.0,
  "‘Impossible position’ cited by truck manufacturers in lawsuit against California": -0.5,
  "Autodesk launches freemium access to Autodesk Flow Studio, with new pricing tiers making world-class VFX AI more affordable to all creators": 0.8,
  "Pixelworks (PXLW) Reports Q2 Loss, Misses Revenue Estimates": -0.7,
  "Synopsys (SNPS) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Adobe Systems (ADBE) Rises Higher Than Market: Key Facts": 0.5,
  "Broadcom Inc. (AVGO) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Why CrowdStrike Holdings (CRWD) Outpaced the Stock Market Today": 0.5,
  "Ross Stores (ROST) Rises But Trails Market: What Investors Should Know": 0.1,
  "Podcast: Inflation Report Fuels Investors’ Hopes for a Rate Cut": 0.6,
  "Thoughts on beaten down SAAS players - Some of these SAAS players are beaten down a lot due to AI fears and slow growth projection from Fortinet. As AI reduces headcount, the number of licenses these companies sell will also reduce. However the stocks are at very low RSI so expecting a small 5 to 7% upside. Also it will take some time for AI related headwinds to materialize. So there is some market overreaction.": 0.5,
  "(Item 2.02) . Results of Operations and Financial Condition. On August 13, 2025, Cisco Systems, Inc. (“Cisco”) reported its results of operations for its fiscal fourth quarter and fiscal year 2025 ended July 26, 2025. A copy of the press release issued by Cisco concerning the foregoing results is furnished herewith as Exhibit 99.1. The information contained herein and in the accompanying exhibit shall not be incorporated by reference into any filing of Cisco, whether made before": 0.0,
  "Lululemon Stock Is Down 50% in 2025. Is This a Once-in-a-Lifetime Buying Opportunity Before the Stock Goes Parabolic?": 0.5,
  "Functional Safety Market Set to Surpass $7,896.7 Million by 2029 Amid Rising Demand for Risk Mitigation": 0.8,
  "Seeing a lot of hate for AMZN lately - Ads up 23% yoy (high margin) 15.7 billion last quarter alone equaling a third the size of meta. AWS still beat expectations although not as much as the competitors (important to remember it’s significantly larger but I still would’ve liked to see 20% growth instead of 17%). Subs grew 12%, e-commerce growth reaccelerated to 11% growth. North American e-commerce operating income was up 50% y/y to": 0.2,
  "UEC Looking Like the King of Energy Plays - UEC’s Sweetwater uranium complex in Wyoming was selected for fast-tracked permitting under the FAST‑41 program, meaning approvals for in-situ recovery could come much faster than normal timelines and once complete, it’ll be the largest dual‑feed uranium facility in the U.S., capable of processing both conventional ore and ISR resin. Now, what does this mean? Bullish: Fast-track status could bring Sweetwater online years sooner, making it the": 0.8,
  "[Latest] US Personalized Medicine Market Size/Share Worth USD 252.93 Billion by 2034 at a 17.32% CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trends, Forecast, Segmentation, Growth Rate, Value, SWOT Analysis)": 0.6,
  "Cathie Wood Bets $19 Million More On Jack Dorsey's Block Amid Bitcoin's All-Time High Push, Dumps Shopify Stock": 0.2,
  "KLAC Q2 Deep Dive: AI Demand and Advanced Packaging Fuel Growth Amid Tariff Headwinds": 0.5,
  "The Top 5 Analyst Questions From Cadence’s Q2 Earnings Call": 0.2,
  "ON Q2 Deep Dive: Market Reacts to Weak Margins Despite Automotive and AI Data Center Momentum": -0.5,
  "Lam Research’s Q2 Earnings Call: Our Top 5 Analyst Questions": 0.2,
  "CDNS Q2 Deep Dive: AI Demand and Product Expansion Drive Upbeat Outlook": 0.8,
  "QCOM Q2 Deep Dive: Broad-Based Growth, AI Strategy, and Market Skepticism": 0.5,
  "The Top 5 Analyst Questions From KLA Corporation’s Q2 Earnings Call": 0.2,
  "SHOP Q2 Deep Dive: International Expansion and AI Drive Growth Momentum": 0.6,
  "Applied Materials (AMAT) Q2 Earnings: What To Expect": 0.5,
  "5 Revealing Analyst Questions From Qualcomm’s Q2 Earnings Call": 0.2,
  "MELI Q2 Deep Dive: E-commerce Initiatives Drive Top-Line Strength, Margin Pressures Persist": 0.2,
  "LRCX Q2 Deep Dive: AI Demand and China Upside Shape Guidance Amid Margin Caution": 0.5,
  "5 Must-Read Analyst Questions From onsemi’s Q2 Earnings Call": 0.2,
  "5 Revealing Analyst Questions From Kraft Heinz’s Q2 Earnings Call": 0.2,
  "The Top 5 Analyst Questions From MercadoLibre’s Q2 Earnings Call": 0.5,
  "KHC Q2 Deep Dive: Margin Pressures, Strategic Review, and Emerging Market Growth": 0.5,
  "“Could Intel be the next stock about to take off?” - We all know that Intel’s fundamentals are currently very weak, but it seems Trump is determined to fully support lifting Intel up. Coupled with the fact that global tariff negotiations are still at a very high tariff level, is there a possibility that Trump might require other countries to invest in Intel or mandate that they use a portion of Intel products in exchange": 0.2,
  "5 Must-Read Analyst Questions From Marriott’s Q2 Earnings Call": 0.2,
  "CHTR Q2 Deep Dive: Flat Revenue, Subscriber Pressures, and Strategic Shifts Highlight Quarter": -0.5,
  "5 Revealing Analyst Questions From Commvault Systems’s Q2 Earnings Call": 0.2,
  "WBD Q2 Deep Dive: Streaming Growth and Franchise Strategy Drive Near-Term Challenges": -0.5,
  "AXON Q2 Deep Dive: Software, AI, and International Expansion Drive Outperformance": 0.8,
  "The 5 Most Interesting Analyst Questions From Charter’s Q2 Earnings Call": 0.5,
  "Axon’s Q2 Earnings Call: Our Top 5 Analyst Questions": 0.2,
  "MAR Q2 Deep Dive: International Strength and Brand Expansion Shape Outlook": 0.5,
  "Caliche Development Partners Puts The Largest Helium Salt Cavern In The World Into Operation Under A Long-Term Linde Contract": 0.8,
  "5 Revealing Analyst Questions From DexCom’s Q2 Earnings Call": 0.2,
  "The Top 5 Analyst Questions From Resideo’s Q2 Earnings Call": 0.2,
  "Clarivate Plc (CLVT) Appoints Maroun S. Mourad as President of Intellectual Property Division": 0.5,
  "REGN Q2 Deep Dive: New Indications and Pipeline Progress Offset EYLEA Challenges": 0.5,
  "AMGN Q2 Deep Dive: Volume Growth, Pipeline Progress, and Guidance Raise Meet Investor Skepticism": -0.5,
  "5 Revealing Analyst Questions From Biogen’s Q2 Earnings Call": 0.2,
  "BIIB Q2 Deep Dive: New Launches Offset Legacy Pressure, Pipeline Advancements Drive Guidance": 0.6,
  "Winners And Losers Of Q2: Fastenal (NASDAQ:FAST) Vs The Rest Of The Maintenance and Repair Distributors Stocks": 0.5,
  "VRTX Q2 2025 Deep Dive: New Product Launches and Pipeline Update in a Volatile Market": 0.5,
  "Zscaler, Inc. (ZS) Acquires Red Canary; Evercore ISI and Cantor Fitzgerald Maintain Bullish Stance": 0.8,
  "5 Insightful Analyst Questions From Amgen’s Q2 Earnings Call": 0.5,
  "The 5 Most Interesting Analyst Questions From Vertex Pharmaceuticals’s Q2 Earnings Call": 0.6,
  "DXCM Q2 CY2025 Deep Dive: Volume Growth, Leadership Changes, and New Product Launches Shape Outlook": 0.6,
  "CMCSA Q2 Deep Dive: Product Simplification, Parks Expansion, and Streaming Strategy Reshape the Story": 0.6,
  "5 Insightful Analyst Questions From Regeneron’s Q2 Earnings Call": 0.5,
  "MSTR Q2 Deep Dive: Bitcoin Leverage Strategy Shapes Financial Results and Guidance": 0.5,
  "Unpacking Q2 Earnings: Keurig Dr Pepper (NASDAQ:KDP) In The Context Of Other Beverages, Alcohol, and Tobacco Stocks": 0.2,
  "5 Revealing Analyst Questions From ADP’s Q2 Earnings Call": 0.2,
  "ADP Q2 Deep Dive: Product Investments, AI Momentum, and International Expansion Shape Outlook": 0.6,
  "The Top 5 Analyst Questions From Comcast’s Q2 Earnings Call": 0.2,
  "The Top 5 Analyst Questions From MicroStrategy’s Q2 Earnings Call": 0.5,
  "Oppenheimer Raises PT on Intuit Inc. (INTU) to $868; Maintains ‘Outperform’ Rating": 0.8,
  "1 Software Stock on Our Watchlist and 2 We Ignore": 0.2,
  "3 Stocks Under $50 We Find Risky": -0.5,
  "RBC Capital Raises PT on T-Mobile US, Inc. (TMUS) to $270; Maintains ‘Sector Perform’ Rating": 0.6,
  "3 Market-Beating Stocks to Research Further": 0.5,
  "UBS Reduces PT on Charter Communications, Inc. (CHTR) from $425 to $355; Maintains ‘Neutral’ Rating": -0.5,
  "Agoda and ASEAN launch 'A Destination for Every Dream' Campaign this ASEAN Day": 0.5,
  "CDW’s Q2 Earnings Call: Our Top 5 Analyst Questions": 0.2,
  "5 Insightful Analyst Questions From Airbnb’s Q2 Earnings Call": 0.5,
  "DoorDash’s Q2 Earnings Call: Our Top 5 Analyst Questions": 0.2,
  "The 5 Most Interesting Analyst Questions From AppLovin’s Q2 Earnings Call": 0.6,
  "5 Insightful Analyst Questions From Shopify’s Q2 Earnings Call": 0.5,
  "Wall Street Is Warming to These 6 Industrial Stocks. They Don’t Depend on Nvidia or AI.": 0.5,
  "Costco Stock: Is Wall Street Bullish or Bearish?": 0.2,
  "Are Wall Street Analysts Predicting Honeywell International Stock Will Climb or Sink?": 0.2,
  "A Secret to Buffett’s Success at Berkshire: Issue Little Stock for Deals, None to Employees": 0.5,
  "r/Stocks Daily Discussion Wednesday - Aug 13, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.2,
  "[Latest] Global Generative AI in IT Operations Market Size/Share Worth USD 29.13 Billion by 2034 at a 32.82% CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trend, Forecast, Segmentation, Growth Rate, Value, SWOT Analysis)": 0.5,
  "Heard on the Street Tuesday Recap: Is a Rate Cut Coming?": 0.2,
  "Consumer Sentiment, Retail Sales, Cisco Earnings: Still to Come This Week": 0.5,
  "Meet the Unstoppable Artificial Intelligence (AI) Stock That Doubled Over the Past 12 Months (Hint: Not Palantir or Nvidia)": 0.6,
  "3 No-Brainer AI Stocks to Buy Right Now": 0.5,
  "Stock Market News for Aug 13, 2025": 0.0,
  "Global Equities Markets Rise After U.S. Inflation Data": 0.5,
  "Bull of the Day: AppLovin (APP)": 0.2,
  "Should You Buy Palo Alto Networks Stock Before Aug. 18?": 0.2,
  "3 Artificial Intelligence (AI) Stocks That Are Quietly Beating the Market": 0.5,
  "1 Super Stock Down 32% to Buy Hand Over Fist in August, According to Wall Street": 0.6,
  "XTransfer Attends Brazil's Largest E-Commerce Summit": 0.5,
  "1 Unstoppable Artificial Intelligence (AI) Stock to Buy Right Now": 0.8,
  "Hotel CEOs weigh in on widespread US RevPAR declines": -0.5,
  "Six-Time NBA Champion Scottie Pippen Says Bitcoin Inventor Satoshi Nakamoto Keeps Appearing In His Dreams": 0.2,
  "Is This \"Boring\" Stock-Split Stock Worth Buying in 2025?": 0.1,
  "How the unraveling of two Pentagon projects may result in a costly do-over": -0.6,
  "Is American Electric Power Company, Inc. (NASDAQ:AEP) A High Quality Stock To Own?": 0.2,
  "Counter-UAS Solutions Company Radar Report 2025 | Anduril, BlueHalo, D-Fend, Dedrone by Axon, DroneShield, ELTA, Fortem, Honeywell, L3Harris, Rafael Advanced Defense Systems, SAIC, Sentrycs": 0.2,
  "2 Top Artificial Intelligence Stocks to Buy Right Now": 0.5,
  "Is There Life After AI for Big Software?": 0.1,
  "4 Reasons to Buy PayPal Stock Like There's No Tomorrow": 0.8,
  "Social Buzz: Wallstreetbets Stocks Mixed Premarket Wednesday; CAVA Group to Fall, OpenDoor to Rise": 0.2,
  "Metaplanet to Launch Preferred Shares, Bitcoin-Backed Yield Curve Plan": 0.2,
  "The Healthcare Businesswomen's Association (HBA) Honors AstraZeneca and Viseven with 2025 ACE Awards for Workforce Innovation and Global Impact": 0.8,
  "Palantir Technologies Stock: Will It Hit a $500 Billion Valuation This Year?": 0.5,
  "A Look At The Fair Value Of Copart, Inc. (NASDAQ:CPRT)": 0.1,
  "Buy these 2 security software stocks after strong VAR survey feedback: analyst": 0.6,
  "Stock Market Today: Dow and Russell surge as Fed talk continues": 0.8,
  "McDonald’s launches first-party delivery channel with DoorDash": 0.5,
  "AppLovin's (NASDAQ:APP) Performance Is Even Better Than Its Earnings Suggest": 0.8,
  "Alibaba, JD.com, Tencent Stocks Jump. Thank U.S. Rate-Cut Hopes.": 0.6,
  "Stocks Gain Pre-Bell as Fed Rate Cut Expectations Rise Following Latest Inflation Data": 0.8,
  "Truckmakers sue California over emissions standards enforcement": -0.5,
  "[Latest] Global AI in Synthetic Biology Market Size/Share Worth USD 192.95 Billion by 2034 at a 28.63% CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trends, Forecast, Segmentation, Growth Rate, Value, SWOT Analysis)": 0.5,
  "Peter Thiel-Backed Bullish Is About to IPO. Should You Buy BLSH Stock?": 0.5,
  "AI Chips Today - Tsecond's BRYCK Block Revolutionizes AI-Driven Edge Storage": 0.6,
  "3 Stocks Currently Estimated To Be Up To 28.5% Below Their Intrinsic Value": -0.5,
  "$BLSH IPO DD - Key Financial Metrics 1. Revenue: - Trailing 12 Months (ended March 31, 2025): $167 million, as reported in IPO-related filings. - Fiscal Year 2024: $250.26 billion, a 114.80% increase from $116.51 billion in the prior year. This figure seems unusually high and may reflect a reporting error or inclusion of trading volume rather than operational revenue. Most sources align with the $167 million figure for recent revenue, suggesting the $250.26 billion": -0.5,
  "5 Stocks to Buy on S&P 500's 16th Record Closing High of the Year": 0.6,
  "Datadog Stock: Analyst Estimates & Ratings": 0.0,
  "Shopify's (NASDAQ:SHOP) Solid Profits Have Weak Fundamentals": -0.5,
  "Fewer Failed Charging Attempts Signal Progress in EV Infrastructure, J.D. Power Finds": 0.6,
  "Medidata Accelerates Business Transformation with Lisa Moneymaker as Chief Strategy Officer": 0.5,
  "NeoLogic wants to build more energy-efficient CPUs for AI data centers": 0.6,
  "Allied Global Marketing Names Reina Basu Vice President of Business Development, Accelerating Global Brand Experience Strategy": 0.5,
  "Is It Time To Consider Buying CSX Corporation (NASDAQ:CSX)?": 0.5,
  "Here's The Most You Could Have Made On A Single Stock This Year": 0.5,
  "Does Costco Wholesale (NASDAQ:COST) Deserve A Spot On Your Watchlist?": 0.2,
  "Musk's bid to dismiss OpenAI's harassment claims denied in court": -0.5,
  "Dow Jones Futures Rise, CoreWeave Tumbles After Stock Market Runs On Fed": 0.5,
  "Unimarket Recognized as Workday Innovation Partner to Deliver Better Procurement Outcomes for Higher Education": 0.6,
  "The Zacks Analyst Blog Highlights Bank of America, Roche, Intuit and TSS": 0.0,
  "Hologic Eyes Organic Growth Rebound in 2026 on Breast Health Strength": 0.6,
  "AppLovin and Carter have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Zacks Industry Outlook Highlights Broadcom and Applied Materials": 0.0,
  "Is Costco Stock Worth Buying Now or Too Pricey to Touch?": -0.5,
  "Parks Associates Forecasts the Market for Smart Thermostats Will Reach Unit Sales of 8.1 million in 2030, with Annual Revenues Exceeding $1.1 billion": 0.8,
  "ISRG's Ion Platform Procedure Grows 52%: Can This Trend Continue?": 0.5,
  "Peachtree Group Receives USCIS Approval for EB-5 Funded Madison Bradenton Multifamily Development": 0.5,
  "Cadence Accelerates Development of Billion-Gate AI Designs with Innovative Power Analysis Technology Built on NVIDIA": 0.5,
  "Impartner Releases AI Partner Playbook to Guide Practical AI Adoption Across Partner Programs": 0.5,
  "Dear Cisco Stock Fans, Mark Your Calendars for August 13": 0.5,
  "Here is What to Know Beyond Why Texas Instruments Incorporated (TXN) is a Trending Stock": 0.2,
  "ON Semiconductor Corporation (ON) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Zscaler, Inc. (ZS) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Vertex Pharmaceuticals Incorporated (VRTX) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "lululemon athletica inc. (LULU) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Constellation Energy Corporation (CEG) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Datadog Insiders Sell US$58m Of Stock, Possibly Signalling Caution": -0.5,
  "McDonald’s and DoorDash Expand Global Partnership with New Online Ordering Experience in U.S.": 0.5,
  "Are Wall Street Analysts Predicting Analog Devices Stock Will Climb or Sink?": 0.1,
  "Beijing E-Town sues US firm Applied Materials alleging trade secrets leak": -0.7,
  "Should You Consider Investing in Linde plc (LIN)?": 0.0,
  "Europe Battery Energy Storage System Market Forecast and Company Analysis Report 2025-2033 Featuring CATL, Fluence Energy, Tesla, BYD, LG Energy, Samsung, Wartsila, Northvolt, Saft Groupe, Panasonic": 0.5,
  "Here’s Why You Should Consider Buying Regeneron Pharma (REGN)’s Shares": 0.5,
  "$OKLO Selected for Three Projects Under U.S. Department of Energy’s Reactor Pilot Program, Targeting July 2026 - Oklo Inc. and its subsidiary, Atomic Alchemy Inc., **have been selected for three of the U.S. Department of Energy’s (DOE) reactor pilot projects** under the newly established Reactor Pilot Program. Oklo was selected for two projects, and Atomic Alchemy was selected for one. The Reactor Pilot Program aims to demonstrate criticality in at least three test reactors by": 0.8,
  "Treasury Secretary proposed Fed to Lower Rates by at least 150 Basis Points. - Scott Bessent suggested to the Federal Reserve that the central bank lower its benchmark by at least 1.5 percentage points. “I think we could go into a series of rate cuts here, starting with a 50 basis point rate cut in September,” “If you look at any model,\" it suggests that “we should probably be 150, 175 basis points lower,” Bessent": 0.8,
  "FedEx Dataworks: A gem in the right hands": 0.8,
  "Cat's Out of the Bag: Birdie & Louie on Winning Streak - Scores UNFI Excellence Award, Lands on INC 5000, and Hits Shopify Milestone": 0.8,
  "Insights Into Palo Alto (PANW) Q4: Wall Street Projections for Key Metrics": 0.2,
  "Saudi Arabia Blood Glucose Device Market Trends and Company Analysis Report 2025-2033 Featuring Abbott Laboratories, Medtronic, Dexcom, Braun, DarioHealth, Sanofi, Bionime, and Novo Nordisk": 0.2,
  "Here’s What Justified Alibaba’s (BABA) Appreciation Over Time": 0.5,
  "Micron Eyes High-Teen DRAM Demand Growth: Is It Sustainable?": 0.5,
  "NVIDIA Wins China Sales Approval: Will H20 Chip Deal Boost Growth?": 0.5,
  "MORE INNOVATION FROM LEVERAGE SHARES BY THEMES – Further expanding its leveraged products with its Capped Accelerated Series. These ETFs will offer investors:": 0.5,
  "FriskaAi and Dexcom Enter CGM Data Integration Agreement": 0.5,
  "Project Portfolio Management Market Surges to $13.7 billion by 2029 - Dominated by Oracle (US), Smartsheet (US), Microsoft (US)": 0.6,
  "Saudi Arabia Osteoporosis Drugs Market Analysis Report 2025-2033 Featuring Amgen, Eli Lilly and Co, F. Hoffmann La Roche, GlaxoSmithKline, Merck, Novartis, Pfizer, Teva Pharmaceutical, UCB": 0.5,
  "Florida Hospital Selects SCWorx for Data Management for Workday Implementation": 0.5,
  "Why Paypal (PYPL) is a Top Value Stock for the Long-Term": 0.6,
  "C3 AI downgraded, Capri upgraded: Wall Street's top analyst calls": 0.2,
  "US Treasury secretary floats rolling out export tax to more industries": -0.5,
  "Why This 1 Growth Stock Could Be a Great Addition to Your Portfolio": 0.8,
  "Monster Beverage (MNST) is a Top-Ranked Growth Stock: Should You Buy?": 0.6,
  "CheckedUp Named to Inc. 5000 List of America’s Fastest-Growing Companies for 4th Time, with Three-Year Revenue Growth of 268%!": 1.0,
  "Saudi Arabia Diabetes Drug Market Trends & Forecast Report 2025-2033 | New Therapeutic Agents Like SGLT2 Inhibitors, GLP-1 Receptor Agonists, and Biosimilar Insulins Fueling Growth": 0.6,
  "Deutsche Bank upgrades Palo Alto on growth, CyberArk deal potential": 0.6,
  "BLSH Allocated 6M Shares to Retail for IPO - Per CEO Tom Farley on CNBC this morning, Bullish has apparently allocated 6M shares to retail for its IPO. According to him, this is much larger than most IPOs. Is there any validity to this? I requested 75 shares on Robinhood, but only received 1 of 100 shares of FIG the other week. Anyone else in on this one? EDIT: Was just allocated 17 of 75": 0.2,
  "AI in Education Market Surges to $5.82 billion by 2030 - Dominated by Microsoft (US), IBM (US), Google (US)": 0.5,
  "Introducing World Soccer Ticket: Over 1500 Matches From the World’s Most Important Leagues, All in One Place, Only From Xfinity": 0.5,
  "Form 8.3 - Qualcomm Incorporated": 0.0,
  "How we found TeaOnHer spilling users’ driver’s licenses in less than 10 minutes": -0.7,
  "Analog Devices (ADI) Earnings Expected to Grow: Should You Buy?": 0.5,
  "AI/R Company Subsidiary, WEBJUMP, Launches AI-powered Component Library to Accelerate Adobe AEM Implementations": 0.6,
  "Moss Breaks Ground on The Dunes Fort Lauderdale, an Autograph Collection Hotel": 0.5,
  "Comcast debuts soccer-focused video package ahead of World Cup": 0.5,
  "This Peter Thiel-Backed Crypto Stock Has Soared 400%. Why It’s the Next MicroStrategy.": 0.8,
  "Bitcoin, Ethereum, XRP Rise With Stocks. Why Crypto Records May Fall.": 0.5,
  "Should You Stay Invested in or Sell Nebius Stock Post Q2 Earnings?": 0.0,
  "Former Google Employees' AI Startup OpenArt Raises $5 Million As 6M Users Create 'Brainrot' Videos In Just One Click": 0.8,
  "RBLX Stock Trades at Premium Value: Should You Buy, Sell or Hold?": 0.5,
  "BLSH IPO not tradeable yet - So Im Sittin here having gotten up at 5 am(alaska time) with my sleep mask still on expecting to be able to start trading this new IPO right when the market opens, but on robinhood it still says its in flight and i cant buy it yet. Anyone else haveing this issue or is it expected to launch later in the day": -0.5,
  "Figma's Blockbuster Debut Latest Sign Tech Emerging From IPO Hibernation": 0.6,
  "Hexnode Announces HexCon25: The Annual User Conference Set for September 17–18, 2025, in Atlanta": 0.5,
  "BC-Most Active Stocks": 0.0,
  "MercadoLibre Faces Ongoing Margin Strain: Is Profit Growth Slowing?": -0.6,
  "AMD Brushes Off China AI Sales Hit as Citi Calls Impact 'Largely Immaterial'": 0.5,
  "As Elon Musk Lashes Out at Apple, How Should You Play TSLA and AAPL Stock?": 0.2,
  "McDonald’s launches new online ordering channel in partnership with DoorDash": 0.5,
  "MKL Outperforms Industry, Trades at a Discount: How to Play the Stock": 0.5,
  "Most large pension funds reducing exposure to US stock market - The CEO of La Caisse, one of the largest pension funds in the world with about $360B AUM, says it is still investing in the US, but less than before, and that his peers around the world are doing the same, essentially saying that it’s been a nice ride with US stocks but with all the risks (labor statistics chief dismissal, pressure on JPow,": -0.6,
  "TJX Stock and Other Off-Price Retailers Are Hard-to-Beat Bargains": 0.8,
  "Amazon grocery, Webtoon & Disney deal, Gildan to buy Hanes": 0.5,
  "This Former Tech Exec Worked At Meta, TikTok And Netflix — Then Built A Million-Dollar Business Linking South Korea To The US Market": 0.8,
  "What's the outlook on BLSH? Are we expecting a pop? - The BLSH IPO is today and shares were allocated about an hour ago. There seems to be extremely strong investor demand (20x oversubbed), and yet, unlike FIG, it looks as if most people will be getting a few shares. So, what's the outlook? Are these early signs indicative of a pop à la FIG, or are we expecting a dump at open? Update: Sold": 0.2,
  "Palantir Nears Record High As Trump's $175 Billion Missile Defense Plan Opens Door To Massive SHIELD Contracts": 0.8,
  "After Hitting 30th 52-Week Low, Is Adobe Too Cheap to Ignore?": 0.5,
  "Lanchi Ventures-Backed ONERWAY Secures 10 Million Series A+ to Bolster Global Payments Infrastructure": 0.8,
  "Nuclear Power Is Having a Pop Culture Moment": 0.5,
  "CoreWeave's Q2 miss raises bar for Nvidia earnings expectations": 0.2,
  "Bessent Sees Nvidia, AMD China Agreements as a Model for Others": 0.6,
  "In Trump’s year of cost-cutting and efficiency, national debt soars past $37 trillion": -0.8,
  "Stocks Can Climb the ‘Wall of Worry’ as Long as These Anchors Remain in Place": 0.5,
  "New York sues Zelle, says security lapses led to $1 billion consumer fraud losses": -0.8,
  "Snowflake, Datadog show strong July growth, MongoDB stabilizes": 0.6,
  "CoreWeave stock plummets as AI cloud company reports 'deteriorating' operating income outlook": -0.8,
  "Meta Looks Strong Now, But Long-Term Growth May Hit a Ceiling": -0.5,
  "lululemon vs. Ralph Lauren: Which Premium Apparel Brand Holds the Edge?": 0.5,
  "Stocks to Watch Wednesday: Bullish, Cava, Alibaba": 0.5,
  "The Top Performing S&P 500 Stocks of 2025: Can Momentum Sustain?": 0.5,
  "Fastenal (FAST) Up 7.4% Since Last Earnings Report: Can It Continue?": 0.5,
  "Meta’s ‘superintelligence’ isn’t here yet. But its AI bets are already paying off": 0.5,
  "Top Midday Stories: CoreWeave Q2 Loss Misses Expectations; Hillenbrand Mulls Potential Sale": 0.1,
  "MRVL vs. ALAB: Which AI-Connectivity Stock is a Better Buy?": 0.2,
  "Is Lucid Ready to Deliver on Its 2026 Midsize EV Launch?": 0.2,
  "CoreWeave's Q2 Loss Narrows Y/Y, Revenues Up, Stock Down": 0.2,
  "AMD CEO won’t offer $100 million salaries to poach talent like Mark Zuckerberg. She says it’s more important staff don’t feel like ‘a cog in the wheel’": 0.5,
  "Take-Two Interactive: GTA VI unit sales estimates remain too low says analyst": 0.5,
  "Intel Rises 7.9% in the Past Year: Should You Buy the Stock?": 0.6,
  "Electrify Expo Returns to the Bay Area August 23-24 with Expanded Automotive Lineup Just One Month Before EV Tax Credits End": 0.5,
  "AMD, KinderCare, 180 Life Sciences: Trending Tickers": 0.0,
  "Micron (MU) Raises the Bar for Q4, Mizuho Stays Bullish on HBM Upside": 0.6,
  "Workday (WDAY) Sustains Growth with Strong Backlog and Margin Expansion": 0.8,
  "BofA Sees Qualcomm (QCOM) Riding IoT and Automotive Growth to $200 Target": 0.8,
  "Analog Devices (ADI) Sees Bullish Sentiment Backed by Sector Tailwinds": 0.8,
  "Morgan Stanley Maintains Buy on Palo Alto (PANW) as CyberArk Deal Strengthens Growth Outlook": 0.8,
  "Tilray (TLRY) Stock Trades Up, Here Is Why": 0.5,
  "Why Palo Alto Networks (PANW) Stock Is Trading Up Today": 0.5,
  "Why Is Warner Bros. Discovery (WBD) Stock Soaring Today": 0.5,
  "As degrees get branded worthless, LinkedIn’s just revealed the universities that give Gen Z the best shot at corner office jobs": 0.2,
  "Is Mondelez's Pricing Power Enough to Offset Cocoa Cost Surge?": 0.1,
  "Starbucks turnaround check-in: 1 yr. since CEO shake-up": 0.5,
  "Reddit Stock Rallies Back To New Highs. How It's Shaking Off Google AI Fears.": 0.6,
  "ALAB Jumps 113% in a Month: Here's Why the Stock is Still a Buy": 0.8,
  "Will Digital Engagement Drive Starbucks' Customer Spend Growth?": 0.5,
  "Micron Unleashes Gen 5 and Gen 6 SSDs in Bid to Dominate AI Data Center Storage": 0.6,
  "Axon Uses AI to Enhance Public Safety": 0.5,
  "Apple faces Musk's wrath in explosive AI bias allegations": -0.6,
  "CoStar Group (CSGP) Loses on 6th Day on Investor Caution": -0.6,
  "3M Company Rises 22.3% YTD: Should You Buy the Stock Now or Wait?": 0.5,
  "Travel-Industry Outlook Stabilizes as Higher-Income Americans Pack Their Bags": 0.6,
  "Trump's unconventional chip gambit might leave Nvidia and AMD with more questions than answers": -0.5,
  "Microsoft Goes Long In Farmland; Could This Investing Sector Exceed The $3.8 Trillion Commercial Office Market?": 0.6,
  "Nuclear Stocks Shine as Demand for Zero-Carbon Energy Accelerates": 0.8,
  "Autodesk (ADSK) Launches New Affordable Pricing With AI-Powered Flow Studio Expansion": 0.8,
  "lululemon's Inventory Play: Streamlining or Straining Growth?": 0.1,
  "Apple Stock Is Gaining Momentum, Is AAPL Stock a Buy?": 0.6,
  "CoreWeave Stock Drops. This Could Slam the Brakes on Its Growth Plans.": -0.6,
  "short-long term CAVA play - I just bought 200 shares of CAVA at a 70.33 average because I believe the 15% drop was a major overreaction to their earnings report. Everyone I know eats here often and slowly but surely its becoming a serious competitor to others in the space (chipotle, sweetgreen). I’m betting on it to recover to at least 74-75 in the short term and of course return back to normal levels within": 0.8,
  "Perplexity's Google Chrome offer may be a PR stunt aimed at Apple": 0.2,
  "Amazon boosts same-day delivery to take on Instacart, Walmart": 0.5,
  "Instagram is developing a feature that helps users find shared interests": 0.6,
  "Peter Thiel-Backed Crypto Exchange Bullish Nearly Doubles in Trading Debut": 0.8,
  "Wash sale rule when purchase occurs before sale - The [wash sale rule](https://www.schwab.com/learn/story/primer-on-wash-sales) seems fairly simple: >*If you sell a security at a loss and buy the same or a substantially identical security within 30 calendar days before or after the sale, you won't be able to take a loss for that security on your current-year tax return. However, there are some compensations: You will be able to add the amount of the loss back": -0.2,
  "Striim Announces 5.2 - Major Release adds new AI Agents for Predictive Analytics and Vector generation for building novel Gen AI Enterprise Applications with real-time Intelligence": 0.6,
  "Prediction: Buying Palantir Stock Today Could Set You Up for Life": 0.8,
  "Are You a Soccer Junkie? Comcast Has an $85 Bundle for You": 0.2,
  "Treasury Secretary Bessent suggests the US may expand export taxes to more industries (beyond just Nvidia and AMD) - https://www.ft.com/content/1434c913-be45-44b4-8947-4b53fadc9cd7 > > US Treasury secretary Scott Bessent has raised the prospect of the White House rolling out the unprecedented revenue-sharing agreement it struck with chipmakers Nvidia and AMD to other industries. > > President Donald Trump upended corporate norms this week after Nvidia and AMD agreed to give the US government 15 per cent of": 0.2,
  "Sector Update: Tech Stocks Mixed Wednesday Afternoon": 0.0,
  "Casual Dining Hits Headwinds: What’s Next for CAVA, Cheesecake Factory, and Shake Shack?": -0.5,
  "Solid Earnings Reflect DoorDash's (NASDAQ:DASH) Strength As A Business": 0.8,
  "The ICON Is Yours: Introducing the All-New Class of FC 26 ICONs": 0.5,
  "CoreWeave Shares Tumble on Bigger-Than-Expected Loss; Tigress Financial Points to Demand Acceleration": -0.5,
  "Ansys collaborates with Nvidia to embed Omniverse in simulation solutions": 0.5,
  "Apple Plots Expansion Into AI Robots, Home Security and Smart Displays": 0.5,
  "Arm (ARM) Gets Buy Rating and $150 Target as Analyst Sees Triple Market Reach": 0.8,
  "Amazon Just Crushed Instacart--And It's Not Even Close": 0.8,
  "Metaplanet announces “Metaplanet Prefs” and a Japanese, Bitcoin-backed yield curve": 0.2,
  "Dear CrowdStrike Stock Fans, Mark Your Calendars for August 27": 0.5,
  "Dave Ramsey Says Friend Invested $10,000 In Crypto To 'Get A Rise' Out Of Him: 'He Wanted Me To Call Him An Idiot And I Did'": -0.7,
  "Amazon Stock Gains On Big Expansion Of Perishable Delivery. Instacart, Grocery Stocks Fall.": 0.5,
  "ETHZilla Follows Strategy's Playbook With Ethereum Treasury Plans. Its Stock Is Soaring": 0.8,
  "Investors Playing More Defense Even as Stocks Climb to New Highs": -0.5,
  "KeyBanc Reaffirms Overweight on Constellation (CEG), Eyes Year-End Deal": 0.5,
  "Amazon's Latest Prime Grocery Move Is a Big 'Shot' at the Competition": 0.8,
  "Largest U.S. Pension Buys Up Coinbase, Palantir, Nvidia, and Robinhood Stock": 0.8,
  "Datadog (DDOG) Price Target Raised to $147 on Strong Born-in-AI Growth": 0.8,
  "Anthropic Offers Claude To U.S. Government For $1": -0.5,
  "Melius Raises Apple (AAPL) PT to $260, Cites Upcoming iPhone Cycles": 0.8,
  "NVIDIA (NVDA) Gets $220 Target on Strong AI Chip Demand, China Deal": 0.8,
  "$34.5 Billion Shock Bid: Perplexity Tries to Snatch Chrome from Google Before Antitrust Hammer": -0.6,
  "Grocery Outlet (GO) Stock Trades Down, Here Is Why": -0.5,
  "Why Sprouts (SFM) Stock Is Falling Today": -0.5,
  "Global Trade Is Booming--Just Without America": 0.6,
  "Amazon Launches Same-Day Fresh Grocery Delivery in 1,000 U.S. Cities": 0.8,
  "It's Time Investors Give Qualcomm Stock a Little 'Respect'": 0.6,
  "Mizuho Raises Micron (MU ) PT to $155 Due to Improved Pricing, Strong Execution": 0.8,
  "DoorDash Expands Partnership with RELEX Solutions for AI-Driven Supply Chain Optimization": 0.5,
  "Piper Sandler Raises IDEXX Laboratories (IDXX) PT to $700, Cites Strong Q2 Results": 0.8,
  "Google announces major investment in Oklahoma: Here's how much, where": 0.5,
  "INTC (intel) MACD on weekly and monthly have inverted. Also fell below bollinger midpoint for weekly and monthly. - I am expecting a pull back on these levels. Just something to keep an eye on for y’all. I am getting puts after riding this up from 19s. Be careful at this level y’all, it has pulled back multiple times here.": -0.6,
  "Jim Cramer on Broadcom: “It’s Been One of My Best”": 0.8,
  "Laird Superfood Expands Distribution with New Costco Availability Across Key U.S. Regions": 0.5,
  "Apple's New Plan for Artificial Intelligence": 0.5,
  "Kalutkiewicz on Nvidia Deal, Tariffs, Trade Pressures": 0.1,
  "Is Perplexity the next Google?": 0.2,
  "3 No-Brainer Chip Stocks to Buy Right Now": 0.5,
  "Markets Wait for Impact of US Deals With Nvidia, AMD": 0.2,
  "Fortinet’s (FTNT) Q2 Results Impress as Billings and Operating Margin top Guidance": 0.8,
  "Jefferies Downgrades The Trade Desk (TTD) on Revenue Slowdown and Competition Concerns": -0.7,
  "Apple (AAPL) Upgrading Siri with AI-Powered Apple Intent": 0.5,
  "NVIDIA Corp (NVDA) Agrees 15% Charge on H20 Sales to China": -0.5,
  "Empowering Cloud Transformation: NetApp and AWS Expand VMware Integration with FSx for ONTAP": 0.6,
  "Automatic Data Processing (ADP) Declares Quarterly Dividend on Solid Q2 Results": 0.8,
  "Piper Sandler Cuts Lululemon (LULU) Price Target to $200 on Growing Competition": -0.5,
  "Stifel Affirms ‘Buy’ Rating on Lam Research (LRCX) on Higher China Wafer Demand": 0.6,
  "CDW Corporation (CDW) Declares Quarterly Dividend after 10.2% Sales Growth": 0.6,
  "Dear Tesla Stock Fans, Mark Your Calendars for September 30": 0.5,
  "Google CEO adds a new calendar feature at Stripe co-founder’s request": 0.5,
  "AI leader stuns Google with move that could reshape the internet": 0.8,
  "Jim Cramer Says Apple is “Run by One of the Greatest Value Creators on Earth”": 0.8,
  "Jim Cramer In AECOM: “I’ve Been Waiting for an Opportunity”": 0.5,
  "Nvidia Is the ‘Most Efficient’ Magnificent 7 Stock. Is NVDA Still a Buy Here?": 0.5,
  "Macquarie Upgrades NIO (NIO) to Outperform on ONVO L90 SUV Launch": 0.6,
  "China's Credit Market Just Did Something It Hasn't in 20 Years -- Here's What It Means for Investors": 0.5,
  "Breaking: S&P, Nasdaq Hit Records as Tech Stocks Ignite Rally": 0.8,
  "Repeat - Tevogen.AI Expands Collaboration With Databricks and Microsoft to Build the Beta Version of Its PredicTcell™ Model With a Focus on Oncology": 0.5,
  "Nvidia Stock Wavers, AMD Gains. What’s Driving the AI Chip Players.": 0.2,
  "Bessent says unusual Nvidia, AMD revenue-sharing deal could be a ‘model’ for other industries": 0.5,
  "Sonoma Pharmaceuticals Announces Launch of Diaper Rash Product in Walmart and other U.S. Chains": 0.8,
  "Waymo finally has a music experience worthy of its robotaxi": 0.6,
  "Zevra Therapeutics Crashes, Reversing 89% Run. Why It Could Be An 'Overreaction.'": -0.5,
  "CISCO REPORTS FOURTH QUARTER AND FISCAL YEAR 2025 EARNINGS": 0.5,
  "Mondelēz International to Participate in Barclays Global Consumer Staples Conference on September 3, 2025": 0.0,
  "Resideo Announces Completion of Transaction with Honeywell To Accelerate Payment of All Potential Monetary Obligations Under Indemnification and Reimbursement Agreement": 0.5,
  "Magnachip, AMD, NXP Semiconductors, onsemi, and Qorvo Stocks Trade Up, What You Need To Know": 0.5,
  "Trump's Nvidia deal sets 'worrisome precedent,' market expert says": -0.6,
  "Amazon same-day delivery, Apple's AI, Centrus: Trending Tickers": 0.2,
  "Cisco projects upbeat quarterly revenue as AI fuels networking equipment demand": 0.8,
  "Cisco: Fiscal Q4 Earnings Snapshot": 0.0,
  "Cisco Fiscal Q4 Earnings, Sales Beat As AI Product Orders Reach $800 Million": 0.8,
  "Cisco posts slight Q4 earnings beat": 0.2,
  "Trump-Backed Crypto Token WLFI Has a Treasury Company.  Here's What That Means.": 0.2,
  "Google pledges $9 billion to expand AI, cloud infrastructure in Oklahoma": 0.8,
  "Stonegate Capital Partners Updates Coverage On Surf Air Mobility Inc. (SRFM) 2025 Q2": 0.2,
  "Tesla Stock Didn’t Make It Six Straight. Musk Has Put Robo-Taxis Back in Focus.": 0.1,
  "Cisco (NASDAQ:CSCO) Posts Q2 Sales In Line With Estimates, Quarterly Revenue Guidance Slightly Exceeds Expectations": 0.5,
  "Elon Musk broadens his long-running feud with OpenAI’s Sam Altman by bringing in a third party: Apple": -0.5,
  "Top Stock Reports for Broadcom, Philip Morris & Novo Nordisk": 0.0,
  "Cisco Posts Higher Earnings, Revenue on AI Infrastructure Demand": 0.8,
  "OpenAI's Sam Altman & Elon Musk's antitrust feud: What to know": 0.1,
  "Nvidia Or AMD: Who's Winning In Trump China AI Chips Move?": 0.2,
  "Cisco's CEO Sees 'Massive Opportunity' as AI Infrastructure Orders Grow": 0.8,
  "These Stocks Are Moving the Most Today: CoreWeave, Bullish, Paramount Skydance, Cava, Alibaba, Instacart, Webtoon, and More": 0.5,
  "Newsweek and Plant-A Insights Group Announce America’s Greatest Companies 2025": 0.5,
  "Cisco Systems Beats Fourth-Quarter Views Amid Demand Momentum": 0.8,
  "Nuclear Stocks Are Hot. This One Just Got a Big Target-Price Increase.": 0.8,
  "Cisco Stock Drops After Earnings": -0.5,
  "It’s a Big Year for Videogames. EA and Battlefield 6 Are the Next Winners.": 0.6,
  "Cisco fiscal Q4 results beat estimates, in-line guidance underwhelms": 0.2,
  "Earnings live: CoreWeave stock tumbles 20%, Cava falls, Cisco posts slight beat on AI demand": 0.1,
  "UN/COMMON Named to 2025 Inc. 5000 List, Celebrating a Decade of Growth & Client Success": 0.8,
  "U.S. Reportedly Uses Trackers In AI Chip Shipments": -0.5,
  "Tesla Eyes New York City for Robotaxis With Test-Driver Job Posting": 0.5,
  "Sam Altman To Back Merge Labs, Neuralink Rival": 0.2,
  "Musk Must Face OpenAI Harassment Claim as Legal Battle Escalates": -0.5,
  "S&P 500 Gains & Losses Today: Amazon Expands Same-Day Food Deliveries, Hitting Kroger, DoorDash": 0.5,
  "Heard on the Street Recap: Anxiety in the Grocery Space": -0.6,
  "Cisco Systems (CSCO) Tops Q4 Earnings and Revenue Estimates": 0.8,
  "Adobe, Bill.com, Atlassian, Bandwidth, and Wix Shares Skyrocket, What You Need To Know": 0.5,
  "Amazon Expands Same-Day Grocery Delivery. Walmart and Instacart Should Be Worried.": 0.5,
  "Workday, Workiva, Zoom, Tenable, and Amplitude Shares Are Soaring, What You Need To Know": 0.6,
  "Cathie Wood buys $13.4 million of surprising tech stock": 0.5,
  "Coherent Reports Solid Earnings. Stock Drops on Guidance.": -0.5,
  "Podcast: Hopes for Interest Rate Cut Lead to Modest Stock Gains": 0.5,
  "Google Finds Workaround for Lobbying Rules That Omits Big Bosses": 0.2,
  "XAI co-founder Babuschkin departs to launch AI safety investment firm": 0.5,
  "Costco (COST) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "Micron (MU) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Lululemon, Gap, Advance Auto Parts, Lithia, and Macy's Shares Are Soaring, What You Need To Know": 0.5,
  "Biogen, Moderna, Align Technology, QuidelOrtho, and Masimo Shares Skyrocket, What You Need To Know": 0.8,
  "Analog Devices (ADI) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Compared to Estimates, Cisco (CSCO) Q4 Earnings: A Look at Key Metrics": 0.5,
  "AI demand propels electronics giant Foxconn's second-quarter profit": 0.8,
  "Autodesk (ADSK) Laps the Stock Market: Here's Why": 0.5,
  "Stock Market Today: Dow Rockets 400 Points; S&P, Nasdaq Extend Rally On Rate Hopes To New Highs; Crypto Stock Catapults": 0.8,
  "3 Magnificent S&P 500 Dividend Stocks Down Roughly 26% to 60% to Buy and Hold Forever": 0.8,
  "Advertisers Forced to Find Safe Solutions to Reach Young Audiences as Australia Expands Under-16 Social Media Ban to YouTube": -0.5,
  "Starbucks Struggles to Find a New Identity in Cutthroat China": -0.6,
  "July PPI, Deere earnings, initial jobless claims: What to Watch": 0.0,
  "Bitcoin touches record high as crypto rally rages on amid bullish 'fundamental changes'": 0.8,
  "Best Home-Buyer Plays in advance of Rate Cuts - Before reading further, let me make my strategy clear. I’m fully aware this summer is about to be ROUGH when it comes to home sales. My strategy is to get into housing adjacent stocks (furnitures/appliances/DIY tools) at the housing markets low point [imo for this cycle, it seems like we’re pretty close if not AT the low point this summer]. I want to find a stable": 0.6,
  "Earnings Outlook Remains Strong & Improving: A Closer Look": 0.8,
  "Apple's AI Comeback Plans Include Robots, Lifelike Siri": 0.5,
  "'Incremental' Growth May Not be Enough in Tech: Crawford": 0.1,
  "Three Stocks Morgan Stanley Recommends for Playing the ‘Nuclear Renaissance' - The pace of nuclear capacity expansion has only increased since last year, according to the Morgan Stanley analysts. The firm now expects investment in nuclear energy to total $2.2 trillion through 2050, up from last year’s forecast of $1.5 trillion. Morgan Stanley divides nuclear-exposed stocks into three categories: power generators, uranium miners, and equipment and plant providers. The firm’s three favorite U.S. stocks to": 0.8,
  "Google Confirms Non-Custodial Wallets Exempt From New Crypto App Rules on Play Store": 0.5,
  "Rumors of Shale’s Peak Were Premature": 0.1,
  "Democrats Try to Halt Silicon Valley’s Swing to the Right": -0.5,
  "Virtual Reality Market to Reach $38 Billion by 2029: Key Trends & Forecasts": 0.5,
  "The Crypto Payment Paradox: Why Nobody's Actually Buying Coffee With Bitcoin In 2025": -0.7,
  "CPI came in right on target. Markets still think September is a cut. Powell sounds less sure. - Yesterday’s CPI numbers were exactly what Wall Street was looking for. Headline inflation came in at 2.8 percent year over year and core was at 3.1 percent. For most traders, that keeps the September rate cut firmly in play. Futures pricing hasn’t budged from making it the base case. But Powell’s last press conference was noticeably cooler": 0.2,
  "College Counseling Firm, Prepory, Ranks on the 2025 Inc. 5000 List of America's Fastest-Growing Private Companies": 0.8,
  "Questions about PLTR vs larger stocks like VOO ? - God bless whoever has the patience to explain things to me like I am 5. I don’t understand how people get money from stocks and if you can take the $$ out at any time. I have $10-15K to invest in the stock market. I keep seeing chatter about PLTR. If I invest in this and my stock increase, do I need to monitor it": 0.2,
  "Surprising Google Chrome bid upends Apple AI rumors": 0.5,
  "Goodbye, $165,000 Tech Jobs. Student Coders Seek Work at Chipotle. - As companies like Amazon and Microsoft lay off workers and embrace A.I. coding tools, computer science graduates say they’re struggling to land tech jobs. Definitely speaks to tech companies and non-technical businesses being able to capture massive employee cost efficiency going forward. AI centric companies so get profit flow as infuriating industries continue to shed high paying white collar jobs abs watch this savings": -0.6,
  "These stocks were pushing the Dow toward 45,000 and maybe a record": 0.8,
  "Trump’s Pay-For-Play Chips Deal Generates Alarm and Optimism": 0.5,
  "ADBE - incredibly undervalued? - I have been looking for some Buffett like fat pitches and keep coming back to ADBE. I think the drama about AI eating their lunch is totally overblown - they are massively integrated into the work flow of millions of designers, etc. and they are doing a good job of adding AI on their own. Not to mention they are still kicking off catch. I think they are a case": 0.8,
  "Dow Jones Futures: Is Stock Market Rotating? This Cathie Wood, Nancy Pelosi Pick Is A Buy": 0.5,
  "Trump’s Emerging Market Behavior Is Unsettling Investors. How It Could Hit Markets.": -0.7,
  "'Tesla shame' bypasses Norway as sales jump despite Musk's politics": 0.2,
  "The list of major companies laying off staff this year includes Oracle, Nextdoor, Intel, Scale AI, and more": -0.5,
  "There May Be Some Bright Spots In Coca-Cola Europacific Partners' (AMS:CCEP) Earnings": 0.5,
  "WhatsApp says Russia is trying to block it": -0.5,
  "Nvidia Partner Hon Hai’s Profit Climbs After AI Spending Rises": 0.5,
  "Seth Klarman's Strategic Moves: Fiserv Inc. Takes Center Stage with 3.75% Portfolio Share": 0.5,
  "Cisco Systems Inc (CSCO) Q4 2025 Earnings Call Highlights: Strong Revenue Growth and AI Momentum": 0.8
}