{
  "Zacks Industry Outlook Highlights Marriott, Hilton Worldwide and Choice Hotels": 0.5,
  "Gold may have the strongest bull case in modern history - I get it, I get it. Youre seeing those neon green vertical lines of SPY and GOOG and saying, pfft another dumb bear coming along to ruin the fun, and for now, you’re absolutely right. Ride the bubble while you can, but I think we can all agree that this is not sustainable by any means. Gold isn’t king because of the AI bubble": 0.2,
  "GOOGL up 130% since April lows ... why do you think it’s climbing so fast? - Alphabet has jumped more than 130% since the April lows, and it’s hard not to notice. Some people point to their AI initiatives and cloud growth as the main drivers, while others say strong ad revenue and consistent execution are giving investors confidence even in a volatile market. Personally, I think the way they’ve been integrating AI across search": 0.8,
  "Cadence Design Systems (CDNS): Exploring Valuation After Recent 12% Pullback in Share Price": 0.5,
  "Will Robust Recurring Revenue and Earnings Growth Change Intuitive Surgical’s (ISRG) Investment Narrative?": 0.5,
  "MercadoLibre (NasdaqGS:MELI): Is the Stock Undervalued After Recent Modest Share Price Uptick?": 0.5,
  "CitizenM rebrands to Another Star": 0.2,
  "US Stock Market Today: S&P 500 Futures Slip as Rate Cut Bets Rise Amid Weak Jobs Data": -0.5,
  "Gilead scoops up a preclinical cancer program": 0.5,
  "Analysts Bullish on PANW as AI-Driven Cybersecurity Demand Accelerates": 0.8,
  "CyberRatings.org and NSS Labs Announce Follow-On Enterprise Firewall Results": 0.2,
  "Calculating The Intrinsic Value Of Texas Instruments Incorporated (NASDAQ:TXN)": 0.1,
  "Keurig Dr Pepper replaces CFO ahead of JDE Peet’s acquisition": 0.1,
  "Marriott International (MAR): Evaluating Valuation Following Launch of 'Series by Marriott' and India Expansion": 0.2,
  "Should Lam Research’s US$65 Million Tualatin Expansion Shift Investor Focus to AI-Driven R&D Capacity at LRCX?": 0.2,
  "Is Cadence Design Stock Underperforming the Nasdaq?": -0.5,
  "November 2025's Top Growth Companies With Significant Insider Stakes": 0.0,
  "Optimistic on LULU? This Bull Put Spread May Fit Perfectly": 0.8,
  "Investors in Amgen (NASDAQ:AMGN) have seen decent returns of 76% over the past five years": 0.6,
  "5 Stocks With Strong Sales Growth to Bet on Amid Volatile Markets": 0.6,
  "Axon Enterprise (AXON) Cooled Down After Years of Outperformance": 0.5,
  "Internal Issues and Competition Impacted Trade Desk’s (TTD) Performance in Q3": -0.5,
  "Keurig Dr Pepper Appoints Anthony DiSilvestro as Chief Financial Officer": 0.5,
  "Eisai Completes Rolling Submission to US FDA for LEQEMBI® IQLIK™ (lecanemab-irmb) Supplemental Biologics License Application as a Subcutaneous Starting Dose for the Treatment of Early Alzheimer’s Disease Under Fast Track Status": 0.5,
  "Could This AI Stock Become the Next Trillion-Dollar Chip Giant?": 0.5,
  "Carillon Eagle Mid Cap Growth Fund’s Views on Dexcom (DXCM)": 0.2,
  "Semtech's Q3 Earnings Surpass Estimates, Revenues Increase Y/Y": 0.8,
  "Internova Travel Group Named to Forbes' List of Most Trusted Companies in America": 0.8,
  "Lam Research Soars 109% YTD: Is LRCX Stock Still Worth Buying?": 0.5,
  "Avantor® Receives 2025 Edison Patent Award for Sustainable Viral Inactivation Technology": 0.6,
  "Piper Sandler Initiates Coverage of Roper Technologies (ROP) with ‘Overweight’ Rating, $600 PT": 0.8,
  "Wedbush Bullish on Booking Holding (BKNG), Recognizes Company for Best-Positioned OTA": 0.8,
  "Is Gilead Sciences Stock Outperforming the Dow?": 0.2,
  "Is T-Mobile (TMUS) One of the Best Communication and Media Stocks": 0.6,
  "Wall is Street Bullish on ​AppLovin Corporation (APP)": 0.6,
  "Wedbush’s Ives lists top 10 tech stocks to own into year-end": 0.5,
  "Oppenheimer Downgrades T-Mobile (TMUS) to ‘Perform’, Removes PT Due to Subscriber Growth Concerns, Heightened Competition": -0.6,
  "Morgan Stanley, Truist Cautious on DexCom (DXCM) Cites Weaker Gross Margins, Modest Q3 Beat": -0.5,
  "Baird Cuts Copart (CPRT) PT to 52 Due to Persistent Insurance Industry Headwinds": -0.6,
  "RBC Capital Cautious on Charter (CHTR) After Q3 Miss on Broadband Subscribers, EBITDA": -0.5,
  "Wells Fargo Remains Cautious on CoStar Group (CSGP) but Sees Rival Lawsuits as Neutral to Positive News": 0.5,
  "JPMorgan Stays Cautious on Thomson Reuters (TRI) Following Q3 2025 Earnings Report": 0.1,
  "Truist Cautious on Microchip Technology (MCHP) After Q3 Beat But Below-Consensus Q4 Guidance": -0.5,
  "Jefferies Upgrades DoorDash (DASH) to ‘Buy’ with $260 PT, Cites Investment Flexibility, Long-Term AI Platform Potential": 0.8,
  "RBC Capital Initiates Coverage of Axon Enterprise (AXON) with ‘Outperform’, $860 PT": 0.8,
  "A 17-Year-Old Dave Ramsey Caller Makes $1,700 At A Gym And Buys An $8,000 Honda Accord From A Friend. Now He's Stuck Paying $1,100 Per Month": -0.6,
  "Is Amgen Stock Underperforming the Nasdaq?": -0.5,
  "GE HealthCare introduces Genesis™ Radiology Workspace: a cloud-first solution with a goal for smarter, faster diagnosis": 0.8,
  "GlucoGuard a Division of American Diversified Holdings (ADHC) Successfully Submits Level 2 App Integration Through Dexcom's Developer Partner Program": 0.6,
  "CSX Chief Financial Officer and Chief Operating Officer to Address UBS Global Industrials and Transportation Conference": 0.0,
  "Q3 2025 Contract Research Organization (CRO) Activity and Intel Report Featuring ICON, Astrazeneca, Akesobio, CSPPC Pharmaceutical, ImmunityBio, and Boryung": 0.2,
  "Voxpopme Announces Winners of the Viddy's 2025 Customer Excellence Awards": 0.5,
  "Investors Heavily Search Palo Alto Networks, Inc. (PANW): Here is What You Need to Know": 0.5,
  "Investors Heavily Search Constellation Energy Corporation (CEG): Here is What You Need to Know": 0.5,
  "T-Mobile Unwraps the Ultimate Apple Bundle — All on Us for Black Friday": 0.8,
  "Ross Stores, Inc. (ROST) Hits Fresh High: Is There Still Room to Run?": 0.5,
  "Here Are Tuesday’s Top Wall Street Analyst Research Calls: Applied Materials, CDW, Exact Sciences, Harley-Davidson, Oshkosh, ServiceNow and More": 0.2,
  "Why GE HealthCare Technologies (GEHC) is a Top Stock for the Long-Term": 0.8,
  "Should You Invest in Ross Stores (ROST) Based on Bullish Wall Street Views?": 0.5,
  "Analog Devices (ADI) Q4 Earnings: How Key Metrics Compare to Wall Street Estimates": 0.5,
  "Brinker upgraded, Coinbase downgraded: Wall Street's top analyst calls": 0.2,
  "HPE vs. CSCO: Which Networking Stock Has an Edge Right Now?": 0.2,
  "Here's Why Cognizant (CTSH) is a Strong Value Stock": 0.8,
  "Explain the Google, TSMC, Nvidia dynamic to me - **Update: I’d like to think some people at Wallstreet read this post and concluded it made no sense for TSM to go down with NVDA. If you bought the TSM dip when I wrote this post, you'd be up 4%. Enjoy the small profit on me.** TSM tends to trade with Nvidia. Nvidia goes up, TSM goes up. Makes sense. AI trade. Google goes up because": 0.5,
  "Mutual Funds Gobble Up This Energy Stock And This Chip Equipment Name": 0.5,
  "ADI vs. TXN: Which Semiconductor Stock Has an Edge Now?": 0.2,
  "Clover Security Launches with $36M to Redefine Product Security for the AI Era": 0.6,
  "The Stock Market Is Struggling. Blame Nvidia, Crypto Stocks.": -0.6,
  "Applied Materials Stock Rises on Upgrade. This ‘Spending Surge’ Makes It a Buy.": 0.8,
  "Applied Materials: UBS turns bullish on DRAM-led upswing": 0.8,
  "Biogen Inks Research Deal With Dayra to Boost Immunology Pipeline": 0.5,
  "SNY & REGN's Dupixent Gets EU Nod for Chronic Spontaneous Urticaria": 0.5,
  "Applied Materials to Reap Benefits of Upcoming Demand Surge for DRAM Wafer Fab Equipment, UBS Says": 0.8,
  "Multi-Award Nominated Battlefield 6 Offers Special Free Trial of the Best-Selling First-Person Shooter of 2025": 0.8,
  "Ceasefire Speculation Tests Oil’s Floor": 0.1,
  "Analog Devices Stock Rises on Earnings. Chip Maker Is ‘Well Positioned’ for 2026.": 0.8,
  "Fleet Space finds massive lithium deposit using AI and satellites": 0.6,
  "Raymond James Reinstates Semi Coverage, Calls ARM a Key AI Beneficiary": 0.5,
  "FE vs. AEP: Which Stock Is the Better Value Option?": 0.2,
  "This Morning, Wall Street is Bullish on AMAT, NVDA and AAPL": 0.8,
  "Applied Materials Stock Pops After UBS Upgrade and Street-High DRAM Forecast": 0.8,
  "Esports Nations Cup Confirms New Official Publishing Partners": 0.5,
  "FDA Decision Opens Bigger Market for Novartis’s Blockbuster Gene Therapy": 0.8,
  "Intuit Expands SMB MediaLabs Reach via The Trade Desk Partnership": 0.5,
  "3 Growth Companies With Up To 36% Insider Ownership": 0.2,
  "DASH Total Order Growth Picks Up: Is the Growth Thesis Strengthening?": 0.6,
  "APP or ARM: Which AI-Driven Tech Stock Looks More Compelling Now?": 0.5,
  "Gilead snaps up Sprint’s TREX1 immunotherapy programme for $400m": 0.5,
  "AMD fell 6% in premarket trading but had gained 5% the previous trading day. - I believe the stock plunged nearly 6% before today's market open. It feels like this stock is either poised to break out or deliberately trying to confuse everyone. Is this merely normal volatility after a sharp rally, or did market sentiment shift overnight?I'm staying calm for now, but such violent swings certainly grab attention.Are some buying the dip? Others taking": 0.2,
  "MercadoLibre Just Got Ambushed: Amazon, Temu, and Shopee Are Crashing Its Holiday Party": -0.6,
  "2 Software Stocks Worth Investigating and 1 We Turn Down": 0.2,
  "3 Nasdaq 100 Stocks with Questionable Fundamentals": -0.5,
  "1 S&P 500 Stock to Own for Decades and 2 That Underwhelm": -0.5,
  "2 Growth Stocks Set to Flourishand 1 Facing Challenges": 0.5,
  "1 Nasdaq 100 Stock Worth Your Attention and 2 We Brush Off": 0.2,
  "1 Volatile Stock on Our Buy List and 2 We Avoid": -0.5,
  "Confused with Microsoft. Other tech stocks are doing fine. whats up with MSFT - MSFT recent earnings were great. and exceeded expectations. other tech stocks are doing fine and / or atleast stable. Yet MSFT is down \\~\\~10% since their last earnings call. I am thinking about moving my cash that were on standby to MSFT. but i am not quite sure if im missing something here. What is the current dynamics thats going on": -0.2,
  "3 High-Quality Stocks Getting Stomped by the Market. Time to Buy?": -0.5,
  "Did Dr. Luc Van den hove's Appointment Just Shift Cadence Design Systems' (CDNS) Innovation Trajectory?": 0.1,
  "Will Mondelez International's (MDLZ) Expanded Cocoa Sourcing Strategy Shift Its Narrative on Commodity Costs?": 0.2,
  "AstraZeneca's Imfinzi Regimen Approved in US for Early-Stage Stomach Cancer": 0.8,
  "'Big Short' investor Michael Burry on why he's short-selling Nvidia stock": -0.5,
  "How Investors Are Reacting To Verisk Analytics (VRSK) Partnering With Earnix To Automate Insurance Compliance": 0.2,
  "1 of Wall Street’s Favorite Stock Worth Your Attention and 2 We Find Risky": 0.2,
  "2 of Wall Street’s Favorite Stocks with Exciting Potential and 1 That Underwhelm": 0.5,
  "3 Low-Volatility Stocks That Concern Us": -0.5,
  "US Equity Indexes Rise as Consumer Confidence, Retail Sales Weakness Keep Fed Rate-Cut Bets Elevated": 0.5,
  "Arrowhead Pharmaceuticals Reports 2025 Fiscal Year-End Results": 0.0,
  "Intuit CEO Sasan Goodarzi to Present at the UBS Global Technology and AI Conference": 0.5,
  "Analog Devices Inc (ADI) Q4 2025 Earnings Call Highlights: Record Revenue and Strong Growth ...": 0.8,
  "TERAGO Partners with Fortinet to Deliver Advanced Managed Networking Solutions with Integrated Security": 0.6,
  "Cadence to Present at UBS Global Technology and AI Conference": 0.5,
  "Stocks Settle Higher as US Economic News Lifts Fed Rate Cut Expectations": 0.8,
  "Top Analyst Reports for NVIDIA, AT&T & Amgen": 0.0,
  "US Equity Indexes Jump as Weakness in Consumer Confidence, Retail Sales Help Rate-Cut Bets Fly High": 0.6,
  "Aliko Dangote, The Richest Black Man In The World, Partners With Honeywell For Dangote Refinery Expansion": 0.8,
  "Autodesk (ADSK) Q3 Earnings: Taking a Look at Key Metrics Versus Estimates": 0.2,
  "Autodesk (ADSK) Q3 2026 Earnings Call Transcript": 0.2,
  "What's the next steps moving forward with Google and AI? - For those who have a more technical background, I’m curious on how Google’s TPU integration could work on a large scale. From my understanding, utilizing TPUs would require a complete refactoring of current AI projects, along with a change from the industry standard CUDA. Also, due to the TPUs' more “specific nature,” they would not be a “plug and play” alternative to the general": 0.2,
  "Warner Bros. Sale Rumors Heat Up: What Investors Need to Know": 0.5,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On November 26, 2025, Exelon Corporation (“Exelon”) announced that David Glockner, Executive Vice President, Compliance, Audit and Risk, will depart Exelon effective as of January 1, 2026. Mr. Glockner will receive benefits pursuant to the previously disclosed terms of Exelon’s Senior Management Severance Plan applicable to a termination of employment other than for “cause.” Upon Mr.": -0.2,
  "Workday posts lukewarm quarterly subscription revenue, shares fall": -0.5,
  "IMDELLTRA's FDA Approval and Guideline Upgrade Could Be a Game Changer for Amgen (AMGN)": 0.6,
  "Review & Preview: Who Needs AI?": 0.0,
  "Why I'm down-voting everyone who says, \"wHaT seLLoFf??\" The market is not only the Mag7! - It seems like every time someone posts anything about a sell-off or dip, the comments section is absolutely flooded with people saying, \"What sell-off?! A 2% dip? You don't even know what a dip is.\" Friends... If your only way of evaluating the market is by looking at SPY, then please dig a little deeper. Yes, this last month": -0.6,
  "Why Lululemon Stock Vaulted Almost 5% Higher Today": 0.6,
  "What QUALCOMM (QCOM)'s Data Center and AI Updates Mean for Shareholders": 0.2,
  "Regeneron Pharmaceuticals (REGN): Examining Valuation After Recent Share Price Momentum": 0.5,
  "Q3 Earnings Highs And Lows: NXP Semiconductors (NASDAQ:NXPI) Vs The Rest Of The Analog Semiconductors Stocks": 0.2,
  "Fastenal (FAST): Buy, Sell, or Hold Post Q3 Earnings?": 0.2,
  "Is Qualcomm’s Partnership a Hint at Synaptics (SYNA) Redefining Its AI Competitive Edge?": 0.2,
  "Can Datadog’s New Cloud Partnerships Justify Its Current Share Price?": 0.2,
  "Stock Market News: Alphabet inches closer to $4T, consumer spending rises in Midwest": 0.5,
  "ADSK Q3 2025 Deep Dive: AI, Cloud, and Platform Expansion Drive Outperformance": 0.8,
  "Palo Alto Networks’s Q3 Earnings Call: Our Top 5 Analyst Questions": 0.5,
  "TD Cowen Raises Applied Materials (AMAT) Price Target to $260, Maintains Buy Rating": 0.8,
  "Is Analog Devices’ (ADI) Robust Capital Return Plan a Sign of Enduring Business Strength?": 0.5,
  "Trump sign “GENESIS” AI - The modern day Manhattan/ Apollo project - President Trump signed an executive order meant to accelerate scientific discovery through the use of artificial intelligence, directing the Energy Department and its national labs to build an integrated AI platform using their existing and future supercomputers. White House officials told reporters on the conference call that they want to bring in AI supercomputing technology to speed the research and scientific discovery process": 0.8,
  "The Zacks Analyst Blog NVIDIA, AT&T and Amgen": 0.0,
  "r/Stocks Daily Discussion Wednesday - Nov 26, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.0,
  "Zacks.com featured highlights include Take-Two Interactive, Globus, Rockwell Automation, Canadian and VICI": 0.2,
  "Zacks Industry Outlook Highlights The Coca-Cola, Monster Beverage, Keurig Dr Pepper and Vita Coco": 0.5,
  "Nike vs. Lululemon: Which Stock Is the Better Buy Now?": 0.5,
  "Is QUALCOMM Stock Underperforming the Nasdaq?": -0.5,
  "Autodesk Inc (ADSK) Q3 2026 Earnings Call Highlights: Strong Financial Performance and ...": 0.8,
  "What Honeywell International (HON)'s Digital Security Push Means for Its Retail Technology Edge": 0.5,
  "CFOs On the Move: Week ending Nov. 26": 0.0,
  "How Is Applied Materials’ Stock Performance Compared to Other Semiconductor Stocks?": 0.2,
  "Is Cisco Systems Stock Outperforming the Nasdaq?": 0.5,
  "Has MELI Stock Been Good for Investors?": 0.2,
  "Candy Kittens owner to Graze on Unilever snack brand": 0.1,
  "Centers for Medicare & Medicaid Services Unveils $12 Billion Net Savings From Reduction in Drug Prices": 0.8,
  "Unlocking Festive Memories at The Ritz-Carlton, Bali": 0.5,
  "Stock Market News for Nov 26, 2025": 0.0,
  "Applied Materials (AMAT): Valuation in Focus After Fresh Earnings Beat and New Revenue Guidance": 0.6,
  "Is T-Mobile US Stock Underperforming the Nasdaq?": -0.5,
  "Asiacell Collaborates with Cisco to Deliver AI-Driven Network Assurance and Boost Connectivity Reliability for its Network in Iraq": 0.6,
  "United States Non-GMO Food Market Report 2025-2033, Profiles of Amy's Kitchen, Blue Diamond Growers, Organic Valley, Hain Celestial, Nestle, Kellogg's, PepsiCo, Pernod Ricard, Clif Bar, Danone": 0.1,
  "Hedge Funds Pile Into Health Stocks Leading Market in Rotation": 0.5,
  "ASML stock rises as Morgan Stanley names it ’Top Pick’": 0.8,
  "Stock Index Futures Gain on Fed Rate-Cut Optimism, U.S. Economic Data on Tap": 0.6,
  "lululemon athletica inc. Announces Third Quarter Fiscal 2025 Earnings Conference Call": 0.0,
  "Comcast (CMCSA)’s Reported Bid For Warner Bros. Is Good, According to Jim Cramer": 0.6,
  "Insider-Owned Growth Leaders To Watch In November 2025": 0.5,
  "Form 8.3 - Qualcomm Incorporated": 0.0,
  "IMFINZI® approved in the US as first and only perioperative immunotherapy for patients with early gastric and gastroesophageal cancers": 0.8,
  "ALAB vs. CSCO: Which Stock Offers Greater AI Infrastructure Upside?": 0.5,
  "Stocks Rise Pre-Bell as Investors Assess Latest Economic Data; Fed Rate-Cut Optimism Continues": 0.8,
  "If You Are Bullish on Agentic AI and Nvidia, Buy This 1 Stock": 0.6,
  "From Hospitals to ASCs: Will Refurbished Xi Systems Broaden ISRG's Reach?": 0.2,
  "Kymera Trades Near 52-Week High: Time to Buy, Sell or Hold the Stock?": 0.2,
  "BMNR's Shares Down 46.1% in a Month: Should You Buy the Dip?": 0.2,
  "GE HealthCare unveils Pristina Recon DL for mammography – deep learning image reconstruction technology delivering clearer image quality": 0.6,
  "Autodesk to present at upcoming investor conferences": 0.0,
  "Dow Jones Futures Rise With Market Above Key Level; What To Do Now": 0.5,
  "Nasdaq 100: Who's In And Who's Out Of QQQ. Walmart, Strategy, Lululemon?": 0.2,
  "Starbucks (SBUX) Valuation in Focus After Strikes Escalate and Tariffs Lifted on Brazilian Coffee": 0.2,
  "PEP vs. CELH: Which Beverage Stock Is the Better Bet Now?": 0.5,
  "Is Texas Instruments Stock Underperforming the Nasdaq?": -0.5,
  "A Brave New World in AI Hardware: Are Qualcomm's and Alphabet's New Chips Game Changers?": 0.5,
  "Tax implications from GOOGL - need some advice - I hope there are some great legal minds here that can help me with a tax question: I bought GOOGL at 100 and went pretty hard in. It has now grown to be almost 40% of my portfolio. I want to de-risk as i am not overly confident GOOGL will grow more than 15% annually from these levels. My problem is that my tax on gains": -0.5,
  "Texas Instruments Incorporated (TXN) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "The Trade Desk (TTD) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Autodesk upgrade follows clean quarter lifting confidence in long-term growth": 0.8,
  "Autodesk Had an ‘Uneventful’ Quarter. The Stock Is Surging Anyway.": 0.5,
  "GEHC Stock Gains Post Latest Launch to Optimize Radiology Workflows": 0.6,
  "SoftBank Sold Its Entire Nvidia Stake. Is This a Warning Sign for Investors?": -0.5,
  "Deere outlook misses amid farming worries, Urban Outfitters Q3 sales": -0.5,
  "Naver Offer $10.3 Billion Stock Swap to Acquire Upbit Operator Dunamu - Naver Financial, the financial services division of South Korea’s tech behemoth Naver, said it is planning on buying Dunamu in a deal that likely won’t see any cash exchange hands. Dunamu is the technology company that operates Upbit, the largest cryptocurrency exchange in the country. Citing regulatory filings, TradingView reported that Naver Financial is looking to pay 15.1 trillion won ($10.3 billion) for": 0.5,
  "Autodesk upgraded, Nio downgraded: Wall Street's top analyst calls": 0.2,
  "Autodesk Q3 Earnings & Revenues Surpass Estimates, Rise Y/Y": 0.8,
  "Analog Devices Q4 Earnings Beat Estimates, Revenues Rise Y/Y": 0.8,
  "Nvidia, Microsoft Lead Wedbush New Tech List -- The 10 'Must-Own' Stocks": 0.5,
  "Is PepsiCo Stock Underperforming the S&P 500?": -0.5,
  "Applied Materials' Margins Expand: Will the Momentum Sustain?": 0.5,
  "Does the Recent Merger Signal Opportunity in Keurig Dr Pepper Stock for 2025?": 0.5,
  "Constellation Energy vs. Duke Energy: Which Stock Shines Brighter?": 0.5,
  "Comcast Commits $2.5 Million To Expand Digital Opportunity in Rural Communities Across the Country": 0.8,
  "Strength in Aerospace Segment Drives Honeywell: Can the Momentum Sustain?": 0.6,
  "is my portfolio too tech heavy even given my age? - i’m a teenager, been in the market for a few years now. portfolio weights are as follows: 20% QQQ 20% NVDA 19% VOO 14% AMD 13% AAPL 10% META 4% ANET i know it’s basically all tech, how should i diversify? been looking at mid to large cap healthcare but most are at ATHs while i prefer to enter on pullbacks in uptrends. industrials": -0.5,
  "Roper's Application Software Strength Holds Firm: More Upside Ahead?": 0.6,
  "Workday Q3 Earnings Beat Estimates on Solid Revenue Growth": 0.8,
  "Cadence (CDNS) Down 11% Since Last Earnings Report: Can It Rebound?": -0.5,
  "Keurig Dr Pepper (KDP) Down 6.2% Since Last Earnings Report: Can It Rebound?": -0.5,
  "NXP (NXPI) Down 10.3% Since Last Earnings Report: Can It Rebound?": -0.5,
  "Autodesk Q3 Results 'Strong' on Upfront Revenue, Store Traction, RBC Says": 0.6,
  "Portfolio management - Hi guys, I normally use yahoo finance to track my investments but is there a portfolio management app that you could suggest? I tried portseido but the features are not so interesting to justify the expense. Thanks": 0.2,
  "Trying to Understand Where Tesla Is Really Heading - Tesla’s recent numbers create a split picture. Sales are clearly under pressure, dropping 30% this year with an even sharper 48.5 percent decline in Europe as competition tightens. Margins are sliding too, with gross margin at 17.01% and operating margin at 4.74%, which I think shows how hard the environment has become. But at the same time, I noticed Tesla moving forward in areas it believes": -0.5,
  "Top Midday Stories: Deere Shares Fall on Weak Guidance; ByteDance is Nvidia's Top Chinese Customer This Year": 0.1,
  "CIB or HON: Which Is the Better Value Stock Right Now?": 0.2,
  "Fresh Data Tilts Markets Into Rate-Cut Camp, But Fed's December Move Not Guaranteed, Macquarie Says": 0.2,
  "Ross Stores (ROST) Is Up 8.36% in One Week: What You Should Know": 0.6,
  "Mortgage rates dropped this week amid fresh signs of job market weakness": -0.7,
  "Workday Targets 15% Q4 Growth as AI Demand Builds": 0.6,
  "Top 10 stock picks of 2025 from Wedbush's Dan Ives": 0.5,
  "Top Growth Companies With Strong Insider Ownership For November 2025": 0.5,
  "Why Lululemon (LULU) Stock Is Trading Up Today": 0.5,
  "Affirm is Winning Transactions, But the Price Tag Bites Hard": -0.6,
  "Top Stock Movers Now: Robinhood, Dell, Deere, HP, and More": 0.5,
  "Tech analyst Dan Ives flags 10 stocks to own, insists there's no AI bubble": 0.2,
  "Ashley Partners with PayPal to Provide AI-Powered Shopping Experience": 0.6,
  "Read the memo Verizon sent to the 13,000 employees it just fired": -0.6,
  "Thoughts on BRK and their cash reserve as a safehaven for any market downturn in the next 1-2 years? - Berkshire is holding a large reserve of cash at the moment. There’s nonstop talk about an AI bubble popping/ incoming recession. Can’t time the market, obviously - so wondering if BRK would be a a good safehaven + lower my exposure from my currently all equities portfolio. Would love to hear your thoughts": 0.5,
  "US Equity Indexes Jump in Broad-Based Rally Among Cyclicals": 0.8,
  "Workday Beat Earnings Estimates. The Stock Is Down 10% Anyway.": -0.5,
  "Analog Devices Moves Higher as Super-Cycle Gains Momentum": 0.8,
  "Dupixent gains chronic spontaneous urticaria indication in Europe": 0.5,
  "Qualcomm Stock: How To Find & Own America's Greatest Opportunities": 0.5,
  "US Rig Count Falls Off a Cliff In Thanksgiving Week": -0.7,
  "Sector Update: Health Care Stocks Mixed in Afternoon Trading": 0.0,
  "Enterprise Software, Health Care Stocks Miss Out on Broader Rally": -0.5,
  "These 2 Energy Titans Just Scored Major Wins to Close Out November": 0.6,
  "Warner Bros. Ups Its Price, Tells Bidders To Come Back With Better Offers": -0.5,
  "A comprehensive list of 2025 tech layoffs": -0.5,
  "XXEC Investment Advisors Sells 17,000 Badger Meter Shares Worth $4.4 Million": -0.5,
  "Northland Raises PT on Palo Alto Networks (PANW) to $190 From $177, Keeps a Market Perform Rating": 0.5,
  "Citi Maintains a Hold on QUALCOMM Incorporated (QCOM)": 0.0,
  "What Do Analysts Think About Vertex Pharmaceuticals (VRTX)?": 0.0,
  "TD Cowen Reduces PT on Honeywell International (HON) Stock": -0.5,
  "Costco pulls a popular product line from its warehouse shelves": -0.5,
  "Crude Prices Settle Higher on Dampened Optimism for a Russian-Ukrainian Peace Deal": 0.2,
  "Full recap - Interview with Nebius CRO Marc Boroditsky - Hi folks! Watched a recent interview online with Nebius CRO Marc Boroditsky and thought I'd share a full recap here because I keep seeing posts and comments that tell me many people still fail to understand the industry as a whole and more specifically Nebius' long term vision and market positioning. For key segments that I do believe are still highly misunderstood to this day,": 0.5,
  "Citi Reduces PT on MercadoLibre (MELI) to $2,500 From $2,700, Keeps a Buy Rating": 0.2,
  "Sector Update: Health Care Stocks Softer Late Afternoon": -0.5,
  "Sector Update: Tech Stocks Gain Late Afternoon": 0.5,
  "Workday's Weak Organic Guidance Clouds Strong Third Quarter, Oppenheimer Says": 0.2,
  "6 Steps To Double Your Savings in 2026, According to Humphrey Yang": 0.5,
  "How a 10% Dividend Could Save Charter Communications Stock": 0.2,
  "Roblox Isn’t Playing Games. Why the Stock Could Jump 50%.": 0.5,
  "US Equity Markets Close Higher Amid Broad Market Gains as Fed Rate Cut Expectations Remain Strong": 0.8,
  "Medicare Slashes Ozempic's Price Tag 71%; Why Novo Nordisk Rallied": 0.5,
  "S&P 500 Gains and Losses Today: Robinhood Pops on Prediction Markets Play, Workday Stock Slumps": 0.2,
  "Should You Buy the Post-Earnings Dip in Zscaler Stock?": 0.2,
  "Autodesk Breaks Above Key Moving Averages on Earnings Pop. Should You Buy ADSK Stock Here?": 0.5,
  "Wall Street Rises For Fourth Straight Session Amid Tech Jump": 0.6,
  "Zscaler stock plunges: CEO explains earnings, guidance": -0.5,
  "US Equity Indexes Rise Amid Thin Volumes as Weak Economic Data Keeps Policy Easing Bets Elevated": 0.2,
  "Stock Market Today: Dow Ends Rally Up 314 Points; Eldorado Gold Eyes New Entry (Live Coverage)": 0.5,
  "An Event Got Me Exploring Stock Futures, and I Didn’t Expect to Actually Like It - I started exploring stock futures recently because I came across an event that focused on trading popular names like TSLA, NVDA, AAPL and a bunch of others on Bitget. A lot of my peers have been into stocks recently but i never tried. I’ve always thought stocks were too complicated or “too serious” for me, but once I actually": 0.5,
  "Hot take on today s Fed shift - So JPM just flipped *again*. A week ago they swore the Fed would hold until January… and now they’re saying we might actually get a **December rate cut**. What changed? Apparently the recent “soft landing” vibes from multiple Fed officials especially Williams were enough for JPM s economists to rethink their whole call. They’re now expecting **two 25 bps cuts: Dec + Jan**. As someone who s": 0.2,
  "Broadcom DD: Highly overvalued - As of today, Broadcom's marketcap is roughly 1.8T (it's closer to 1.9T but still) Nvidia's marketcap in comparison is roughly 4.3T This brings Broadcom at about 40% valuation of Nvidia Now Broadcom made about 15.9 B dollars in profit, for a 4.2 B in Net Revenue. About 9.2 B ( \\~ 60%) comes from Semiconductor related business And the rest, 6.8 B (\\~ 40%) comes from Software Now Broadcom bought": -0.8,
  "Lululemon (LULU) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Stocks to Watch Wednesday Recap: Deere, HP, Dell, Workday": 0.5,
  "Should AEP's $3.5 Billion Equity Program Shift Prompt Action From American Electric Power (AEP) Investors?": 0.1,
  "Basis and carry trade unwind - I'm hearing a lot of concerns about the basis and carry trades unwinding in December the way they did in 2020 and 2024. Is there an actual concern over that or is it just fear mongering. Logic's kinda there but idk if the situation is on the knife's edge where we could see a slip.": -0.2,
  "Apple Hospitality REIT (APLE): Exploring Valuation Following Recent Share Price Recovery": 0.2,
  "Lam Research (LRCX): Assessing Valuation After Raised 2025 Outlook and Strong AI-Driven Earnings Results": 0.8,
  "How Is Booking Holdings’ Stock Performance Compared to Other Travel Tech Stocks?": 0.2,
  "Behind the Sudden Sonder-Marriott Breakup That Left Guests Stranded": -0.6,
  "ASML Stock Rises 48.6% in 2025 Amid Global Chip Demand—Is the Price Justified?": 0.5,
  "Arm Holdings Tumbles 25.8% as AI Partnerships Spark Debate on Future Valuation": -0.6,
  "Thoughts on $BULL? - I have a position with a cost basis of $14 so clearly I'm kind of holding the bag at the moment But their latest earnings report looked pretty good, and from a TA point of view it seems to finally be breaking this long (imo oversold) downtrend Was thinking of adding 100 more shares here sub $10 What are your thoughts on the ticker?": 0.6,
  "How Analyst Views Are Shaping the Evolving Story Behind Workday’s Growth and Valuation": 0.5,
  "How Recent Developments Are Rewriting the Story for Biogen": 0.5,
  "Alibaba Releases AI Glasses in Rare Consumer Gadget Foray": 0.5,
  "The Smartest Dividend Stocks to Buy With $3,000 Right Now": 0.5,
  "Is Autodesk Fairly Priced After Recent 3.5% Share Rally?": 0.5,
  "How the Story Around Qualcomm Is Evolving With AI Momentum and Analyst Upgrades": 0.5,
  "Margins Cracked, Not the Business: Why I'm Buying Axon Here": 0.5,
  "Why Billionaire David Tepper Just Sold 92% of UnitedHealth Group and Is Buying These 3 Stocks Instead": 0.5,
  "OpenAI’s 200m paying user goal by 2030 is delusional. Here is the bear case nobody talks about. - Saw the news that OpenAI expects to hit 220 million paying users by 2030. That is roughly 14x their current subscriber count. I have been crunching the numbers and looking at the competitive landscape since the Gemini 3.0 / Claude Opus 4.5 releases, and honestly? The math is broken. There is a massive bias in this sub": -0.8,
  "How the Story Behind Exelon Is Shifting Amid Growth Hopes and Renewed Caution": 0.2,
  "A Fresh Look at Trade Desk (TTD) Valuation After Recent Share Price Drop": 0.5,
  "Trending tickers: ASML, Pop Mart International, Evoke, Boohoo and Halfords": 0.0,
  "r/Stocks Daily Discussion & Options Trading Thursday - Nov 27, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why": 0.2,
  "Wall Street Has a Mixed Opinion on ​PayPal Holdings (PYPL), Here’s Why": 0.1,
  "Comcast Corporation (CMCSA) Submits Bid For the First Round Offers to Warner Bros Discovery": 0.2,
  "J.P. Morgan Sounds the Bullhorn for These 2 Tech Stocks": 0.5,
  "Nvidia just posted 57 billion in revenue are you buying the business or the price - Nvidia’s latest quarter was huge. Revenue was 57 billion dollars, up 62%year on year. Net income was 31.8 billion dollars, up 59%. Earnings per share reached 1.30 dollars, up 60%. Guidance for next quarter is revenue around 65 billion dollars with a small range and gross margin near 75%. The question now is pretty simple….. If you buy Nvidia": 0.8,
  "Analysts Have Been Trimming Their Copart, Inc. (NASDAQ:CPRT) Price Target After Its Latest Report": 0.1,
  "Are Pepsi Shares Attractive After a 5.5% Drop in the Past Year?": 0.2,
  "NXP Semiconductors N.V. (NXPI) Approves Quarterly Dividend as CEO Affirms Strategic Focus": 0.5,
  "Buy Now Pay Later Model Strengthens PayPal Holdings, Inc. (PYPL) Growth Prospects amid Margin Expansion": 0.8,
  "Charter Communications, Inc. (CHTR) Partners with Amazon Web Services to Accelerate Generative AI Integration": 0.6,
  "How Is Honeywell International's Stock Performance Compared to Other Industrials Stocks?": 0.2,
  "Where Will Vertex Pharmaceuticals Be in 5 Years": 0.1,
  "3 Insider-Loved Growth Stocks To Watch Now": 0.5,
  "US High Growth Tech Stocks to Watch in November 2025": 0.5,
  "ASML Stock Climbs After Morgan Stanley Tags It a 'Top Pick' for 2026": 0.8,
  "Denmark Buy Now Pay Later Business Report 2025: A $9.5+ Billion Market by 2030 Featuring Klarna, Afterpay, Paypal, Smoothie, Billie, Viabill, Splitit, and Revolut": 0.5,
  "Netherlands Buy Now Pay Later Business Report 2025: A $16.4 Billion Market by 2030 with Klarna, Afterpay, Paypal, Riverty, Alfa, Aplazame, and Snoop at the Forefront": 0.5,
  "AppLovin Corporation (APP) Revenues Rose 77% YOY. Here’s Why": 0.8,
  "Mondelez Delivers a Solid Q3: Does the Guidance Cut Signal Trouble?": 0.5,
  "Here’s Sands Capital Select Growth Strategy’s View on DoorDash (DASH)": 0.1,
  "Here’s Why Dexcom (DXCM) Traded Down in Q3": -0.5,
  "BEAM vs. NTLA: Which Gene Editing Stock Holds More Potential?": 0.5,
  "Some see the S&P 500 hitting 8,000 in 2026 with the \"New Bull Market\" - * On Tuesday, **Deutsche Bank set a year-end 2026 price target of 8,000 with double-digit returns in the Mid-Teens.** * Deutsche Bank's equities strategy team stated, \"In 2026, we see robust earnings growth and equity valuations remaining elevated.\" * JPMorgan's target is 7,500 to >8,000. JPMorgan **expects two additional rate cuts** before the central bank pauses. * HSBC's 2026 target": 0.8,
  "Atlassian (TEAM) Fell Amid Concerns Over AI Dominance": -0.5,
  "Lam Research Stock: Is LRCX Outperforming the Technology Sector?": 0.5,
  "Statutory Profit Doesn't Reflect How Good Intuit's (NASDAQ:INTU) Earnings Are": 0.5,
  "Investors Heavily Search Intuit Inc. (INTU): Here is What You Need to Know": 0.5,
  "Axon Enterprise, Inc (AXON) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Is Trending Stock Airbnb, Inc. (ABNB) a Buy Now?": 0.2,
  "Marvell Technology, Inc. (MRVL) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Institutional investors are Warner Bros. Discovery, Inc.'s (NASDAQ:WBD) biggest bettors and were rewarded after last week's US$2.0b market cap gain": 0.8,
  "How Investors Are Reacting To Axon Enterprise (AXON) Analyst Initiation Amid AI and Recurring Revenue Growth": 0.2,
  "A Fresh Look at Comcast (CMCSA) Valuation Following Recent Share Price Declines": 0.5,
  "Is Intuitive Surgical Stock Underperforming the Nasdaq?": -0.5,
  "Using Probability Density to Extract a Huge Payout from Microchip’s Potential Breakout": 0.6,
  "Zscaler (ZS) Slashes 13% on Profit-Taking": -0.6,
  "Workday (WDAY) Ends 3-Day Run on Weak Outlook": -0.5,
  "Marvell Stock Ignites Rally After UBS Says 'AI Optics Boom Is Here'": 0.8,
  "Wall Street Analysts Think Analog Devices (ADI) Is a Good Investment: Is It?": 0.5,
  "Microsoft CEO Satya Nadella Admits 'I Don't Have Warm Shells To Plug Into' — While OpenAI CEO Sam Altman Warns Cheap Energy Could Upend AI": -0.2,
  "AstraZeneca or Merck: Which Oncology Giant Has the Edge?": 0.5,
  "MongoDB Gears Up to Report Q3 Earnings: What's in the Offing?": 0.2,
  "Familial Hypercholesterolemia Market Intelligence Report 2025-2035 Featuring Regeneron, Amgen, Esperion, Aegerion, Novartis and Other Key Players - Precision Medicine Fuels Personalized Treatment Approaches": 0.6,
  "Should You Reconsider The Trade Desk After Shares Fall 27% This Month?": 0.1,
  "Marvell Technology (MRVL) Is Up 7.9% After Refocusing on AI and Data Centers With Key Partnerships": 0.8,
  "Follicular Lymphoma Market Trends, Opportunities, Growth Challenges and Competitive Intelligence 2025-2035": 0.5,
  "How the Narrative Around Ross Stores Is Evolving After Recent Analyst Upgrades": 0.5,
  "AXON's Software & Services Growth Picks Up: Can the Momentum Sustain?": 0.5,
  "SBUX Green Apron Gains Traction: Will Staffing Boost Traffic?": 0.5,
  "Intuit Stock: Is INTU Underperforming the Technology Sector?": -0.5,
  "Intel Rides on Strength in Client Computing Group: Will it Persist?": 0.5,
  "Travel Stocks Gains Focus on Thanksgiving-- Here are Top 5 Names to Watch": 0.6,
  "Is Vertex Still a Bargain After Latest Pipeline Progress and Five Year 90.6% Gain?": 0.6,
  "Why Is Booking Holdings (BKNG) Down 3.2% Since Last Earnings Report?": -0.5,
  "Why Is CoStar (CSGP) Down 3.8% Since Last Earnings Report?": -0.5,
  "Why Is Electronic Arts (EA) Up 0.9% Since Last Earnings Report?": 0.5,
  "Mondelez (MDLZ) Down 1.1% Since Last Earnings Report: Can It Rebound?": -0.5,
  "Regeneron (REGN) Up 20.2% Since Last Earnings Report: Can It Continue?": 0.5,
  "T-Mobile shares holiday offer customers won't want to pass up": 0.8,
  "Did Growing Legal and AI Challenges Just Shift CoStar Group's (CSGP) Investment Narrative?": 0.1,
  "Take-Two Interactive (TTWO): Exploring Valuation as Shares Hold Steady and Analyst Targets Diverge": 0.2,
  "Cracker Barrel CEO feels 'fired by America,’ but shareholders voted to keep her. What $100M gaffe meant to customers": -0.5,
  "Marriott sued over environment, complaint seeks demolition": -0.8,
  "Is Axon Stock Worth Its Price After Major Police Department Contracts in 2025?": 0.2,
  "Everyone is chasing NVIDIA, but Micron might be the better risk and reward - NVIDIA continues to dominate the AI narrative due to the scarcity of computing chips and ecosystem barriers, yet the market often overlooks another equally critical and even more resilient during AI expansion cycles sector: storage and high bandwidth memory. Micron stands as the primary beneficiary here. As AI training scales up exponentially, GPU performance is no longer the sole bottleneck. HBM,": 0.6,
  "Could This Be the Best Way to Invest in AI Without Buying a Single Chip Stock?": 0.5,
  "What Analysts Say Is Shaping the New Story for Autodesk Investors": 0.5,
  "CAD Hedged Stocks - As a Canadian, what are the drawbacks of buying a CAD Hedged version of a US Security? Also how do the price movements of such securities on a day like today where the market is closed correlate to their US counterparts?": 0.0,
  "Examining Palo Alto Networks After Recent Share Price Decline and Cybersecurity Partnerships": 0.5,
  "Nearly Half Of Gen Z Lives With Their Parents To Save Money — Here's How They're Cutting Costs Everywhere Else": 0.5,
  "Are GE HealthCare Shares Worth a Closer Look After AI Imaging Platform Expansion?": 0.5,
  "Celsius (CELH) Q3 2025 Earnings Call Transcript": 0.1,
  "Monster (MNST) Q3 2025 Earnings Call Transcript": 0.0,
  "Airbnb (ABNB) Q3 2025 Earnings Call Transcript": 0.1,
  "Datadog (DDOG) Q3 2025 Earnings Call Transcript": 0.2,
  "MercadoLibre (MELI) Q3 2025 Earnings Transcript": 0.2,
  "Vertex (VRTX) Q3 2025 Earnings Call Transcript": 0.0,
  "Eisai Submits New Drug Application for Subcutaneous Formulation of “LEQEMBI®” for the Treatment of Early Alzheimer’s Disease in Japan": 0.5,
  "This AI Dividend Stock Is a Buy Even as the S&P 500’s Yield Falls to Dot-Com Lows": 0.5,
  "Exclusive-Huawei, ZTE seal 5G deals in Vietnam after US tariffs, as ties with China warm​": 0.6,
  "Anyone sold 0DTE options before on a half day like tomorrow? - Anyone have any experience selling 0DTE options on SPX / SPY on the day after thanksgiving (tomorrow) given that it’s a half day? The theta crush will be accelerated as is the gamma tail risk but trying to understand what else to be aware of, is it a good idea or will you be sitting out tomorrow, etc? Any insight would be very": 0.2,
  "Cross over to Adventure: Agoda's Guide to Must-Visit Bridges in Asia": 0.6,
  "What are the repercussions of falling OpenAI valuation? - There is a lot of speculation now that OpenAI is cooked since their spending is huge with not much revenue yet and most of the AI are caught up with their best models. OpenAI is not a public company but it is like the mascot of the AI companies and the startup companies. Just assume that OpenAI is not able to even get a 50 billion": -0.6,
  "Rate/Roast my portfolio - I have held this portfolio for about 2 years now VGT 55% Google 20% Meta 18% Bitcoin 5% Symbotic 4% Rocket Lab 3% People will probably say I am too heavy in tech and that it is risky. But for the past 30 years, tech has been the strongest performing sector. Can my portfolio drop 50%? Yes. Am I fine with that? Yes, because tech has always recovered and moved higher": 0.5,
  "Kidney Disease Trial Success Might Change The Case For Investing In Vertex Pharmaceuticals (VRTX)": 0.5,
  "A Look Back at Beverages, Alcohol, and Tobacco Stocks’ Q3 Earnings: Monster (NASDAQ:MNST) Vs The Rest Of The Pack": 0.2,
  "Why The Narrative Around Warner Bros. Discovery Is Shifting Amid Fresh Bidding and Analyst Upgrades": 0.5,
  "Ross Stores (ROST): Evaluating Valuation After Recent Momentum in Share Performance": 0.5,
  "A Closer Look at Electronic Arts (EA) Valuation Following Recent Stock Gains": 0.5,
  "Is EA’s 38% Stock Surge Justified After New Game and Partnership News?": 0.2,
  "How Investors Are Reacting To KKR (KKR) Acquiring €65 Billion of PayPal’s European BNPL Loans": 0.2,
  "Is AppLovin Stock Outperforming the S&P 500?": 0.2,
  "Wall Street Bullish on Arm Holdings plc (ARM) amid AI and Data Center Opportunity": 0.8,
  "Advanced Micro Devices, Inc. (AMD), Cisco, and HUMAIN Team Up to Build Saudi Arabia’s Next AI Powerhouse": 0.8,
  "Is Starbucks Stock Underperforming the Dow?": -0.5,
  "Citi Maintains a Buy on Texas Instruments Incorporated (TXN)": 0.5,
  "Deutsche Bank Maintains a Buy Rating on Sanofi (SNY)": 0.5,
  "Company News for Nov 28, 2025": 0.0,
  "Stock Market News for Nov 28, 2025": 0.0,
  "The Bull Case For Regeneron (REGN) Could Change Following European Approval of Dupixent for CSU Patients": 0.5,
  "Is Dutch Bros the Next Starbucks -- or the Next Shake Shack?": 0.2,
  "Can anyone explain in simple terms, the different types of derivatives, named in the book \"The Big Short\"? - I'm reading the book and I constantly ask the AI about the definitions im reading about, but still. The differences are kinda hard to understand. For example: CDOs: Pool various forms of debt into tranches, distributing risk and offering varying returns. (feels like the same as MBS, just diversified?) MBS: Directly linked to mortgage payments; an": 0.1,
  "1 No-Brainer Artificial Intelligence (AI) Stock to Buy With $200 in December and Hold for the Long Term": 0.8,
  "Navitas Semiconductor (NVTS): Assessing Valuation After New Supply Chain Partnerships and Capital Raise": 0.5,
  "If TPUs are strong, is it a good time to buy NVIDIA? - Yes. Nvidia is $180 right now, it's still undervalued I think. I'm expecting $NVIDIA to hit $260 at the end of next year, and for this year, $210 is no pressure. For TPU and GPU, they’re built for different things. Google TPU: Not a GPU killer, but accelerator for deep learning, especially LLMs. For training + cloud inference, Google deeply integrates TPU": 0.6,
  "North America Business Process Outsourcing Market Forecast and Company Analysis Report 2025-2033 Featuring Accenture, Triniter, IBM, Cognizant, Concentrix, Wipro, Genpact, and Amdocs": 0.5,
  "Zacks.com featured highlights include NVIDIA and Micron Technology": 0.5,
  "Kinross Gold and Carter's have been highlighted as Zacks Bull and Bear of the Day": 0.2,
  "Is Comcast Corporation Stock Underperforming the Nasdaq?": -0.5,
  "US Stock Market Today: S&P 500 Futures Tick Higher as Global Growth Jitters Linger": 0.5,
  "r/Stocks Daily Discussion & Fundamentals Friday Nov 28, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is": 0.2,
  "Starbucks to rethink India strategy amid investment slowdown": -0.5,
  "How Investors May Respond To DexCom (DXCM) Balancing Innovative Diabetes Tech Launches With Legal and Regulatory Challenges": 0.1,
  "Why Constellation Energy (CEG) Is Up 6.2% After Landmark DOE Loan and Calpine Deal News": 0.8,
  "Why drinks companies should invest in soil-carbon monitoring": 0.2,
  "Why food companies should invest in soil-carbon monitoring": 0.5,
  "Is Vertex Pharmaceuticals Stock Underperforming the Nasdaq?": -0.5,
  "Why US Utility Stocks Are Falling After the AI Power Surge": -0.5,
  "IBM Secret Weapon: AI and Quantum Deals Drive Massive Cost Cuts": 0.8,
  "Newegg links up with PayPal to make AI shopping actually effortless": 0.8,
  "Top Growth Companies With Strong Insider Confidence November 2025": 0.5,
  "AI Chips Update - AlphaTON Invests $82.5M In Nvidia-Powered AI Expansion": 0.8,
  "3 Stocks Possibly Trading Below Estimated Value": 0.5,
  "Liberty Broadband resumed with a Buy at Citi": 0.6,
  "Zscaler Slides Despite Strong Quarter": -0.5,
  "Has Monster Beverage Corporation's (NASDAQ:MNST) Impressive Stock Performance Got Anything to Do With Its Fundamentals?": 0.2,
  "Why Navitas Semiconductor (NVTS) Is Up 10.3% After New Partnerships to Accelerate GaN Power Technology": 0.8,
  "Is Regeneron Pharmaceuticals Stock Underperforming the S&P 500?": -0.5,
  "Is Palo Alto Networks Stock Underperforming the Dow?": -0.5,
  "4 Security Stocks in Focus Amid the Prospering Industry Trend": 0.5,
  "How Semtech’s Data Center Chips Are Powering the AI Boom": 0.5,
  "Stock Market Rally Revives; Google, Broadcom, Kohl's Big Winners: Weekly Review": 0.6,
  "Is Anyone Else Noticing This Weird Shift Between Apple, Nvidia, and Alphabet Lately? - Alphabet suddenly ripping toward a multi-trillion valuation on the back of its AI rollout, Apple climbing quietly without leaning on AI hype at all, and Nvidia losing a massive chunk of market cap even though demand for GPUs is supposedly still sky-high…none of this lines up with the narratives we were all trading on earlier this year. I was trying to": -0.5,
  "Baker Hughes' (NASDAQ:BKR) investors will be pleased with their strong 158% return over the last five years": 0.8,
  "Airbnb Stock: Is ABNB Underperforming the Consumer Cyclical  Sector?": -0.5,
  "Stocks making big moves this week: Deere, Marvell Technology, Elevance Health, Align Technology, and Tenet Healthcare": 0.5,
  "Dow Jones Signals Further Gains After Holiday; ASML Leads 5 Stocks Flashing Buy Signals": 0.5,
  "How Recent Developments Are Shaping the Analog Devices Investment Story": 0.5,
  "Here's Why You Should Offload Copart Stock From Your Portfolio Now": -0.8,
  "If You Invested $1000 in Analog Devices a Decade Ago, This is How Much It'd Be Worth Now": 0.5,
  "Is the Options Market Predicting a Spike in ADP Stock?": 0.2,
  "Bristol Myers vs Gilead Sciences: Which Biotech Stock Is a Better Bet Now?": 0.5,
  "Analog Devices Stock: Is ADI Underperforming the Technology Sector?": -0.5,
  "See How Bullish Inflows Make Cisco a Big Money Favorite": 0.8,
  "Is Trending Stock Comcast Corporation (CMCSA) a Buy Now?": 0.2,
  "Cisco Systems, Inc. (CSCO) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Insiders At NXP Semiconductors Sold US$3.5m In Stock, Alluding To Potential Weakness": -0.6,
  "Is Credo Technology a Buy, Sell, or Hold Ahead of Q2 Earnings Release?": 0.0,
  "Private Sector Job Losses Ahead of Holidays Could Be a Game Changer for ADP (ADP)": -0.5,
  "Workday Q3 Earnings Beat on Strength in Subscription Services": 0.8,
  "Meta Throws Billions at Google AI Chips -- The Winners and Losers": 0.2,
  "Is Mondelez Stock Underperforming the S&P 500?": -0.5,
  "Here's Why GE HealthCare Technologies (GEHC) is a Strong Momentum Stock": 0.6,
  "Can NTLA's In Vivo Pipeline Drive Long-Term Growth Amid Rivalry?": 0.1,
  "Micron Stock Is Having a Stellar Year. Dell and HP Earnings Explain Why It Could Get Even Better.": 0.8,
  "Trading your own cash & Not prop firms? - Does anyone here trade between 70-100k of your own cash money? Curious to know since I’m considering trying a prop firm one day. I’m pretty much self taught mostly green taking profits monthly but I’m learning on my own through trial and error with hard earn money from my business. I’m also limited my trading but have managed to be profitable, anyone else on the same": 0.2,
  "Retail Stocks Move Cautiously Higher. Beware the ‘Silly Season.’": 0.2,
  "This International ETF Might Be a Better Buy Than the VOO or QQQ": 0.5,
  "Airbnb (ABNB): Revisiting Valuation Following Record Q3 Results and Platform Expansion": 0.5,
  "European Equities Traded in the US as American Depositary Receipts Rise in Friday Trading, Gain 4% for Week": 0.5,
  "PYPL Stock Down 27.5% YTD: Is it a Buying Opportunity or Time to Exit?": -0.5,
  "ADP (ADP) Down 2.8% Since Last Earnings Report: Can It Rebound?": 0.2,
  "Why Is AEP (AEP) Up 0.7% Since Last Earnings Report?": 0.3,
  "Cognizant (CTSH) Up 6.7% Since Last Earnings Report: Can It Continue?": 0.5,
  "GE HealthCare (GEHC) Up 7.5% Since Last Earnings Report: Can It Continue?": 0.5,
  "Kraft Heinz (KHC) Up 4.2% Since Last Earnings Report: Can It Continue?": 0.5,
  "Why Is MercadoLibre (MELI) Down 13.9% Since Last Earnings Report?": -0.6,
  "Why Is Old Dominion (ODFL) Down 1.7% Since Last Earnings Report?": -0.5,
  "Why Is Starbucks (SBUX) Up 4.3% Since Last Earnings Report?": 0.5,
  "Why Is Verisk (VRSK) Up 2.9% Since Last Earnings Report?": 0.2,
  "Crude Prices Push Higher on Dollar Weakness and Russian-Ukrainian Peace Uncertainty": 0.5,
  "AI Stocks You Should Buy to Boost and Reenergize Your Portfolio": 0.6,
  "Here’s Why Wall Street is Bullish on Axon Enterprise (AXON)": 0.5,
  "Trade Desk (TTD) Down More Than 14% Since Q3 Earnings, Here’s Why": -0.7,
  "What Makes Idexx Laboratories (IDXX) a Strong Momentum Stock: Buy Now?": 0.6,
  "Idexx (IDXX) Upgraded to Buy: Here's What You Should Know": 0.6,
  "A buried Nvidia warning could shake the entire AI buildout": -0.5,
  "i've been hesitant on leverage but how about QLD? - im in mid 30s and i'm investing long term (individual / retirement). is QLD also a good option for long term retirement? (not in retirement fund but in individual brokerage, along with META, GOOGL, AMZN, MSFT, AAPL). im sure majority people have index ETF such as SPY, QQQ, VOO etc knowing it will most likely go up next decades. with that thinking in mind, is": 0.1,
  "What Catalysts Could Shift the Narrative for ADP Amid New Analyst and Market Trends": 0.2,
  "Constellation Energy (CEG): Valuation Spotlight Following Nuclear Expansion Orders and Major Growth Investments": 0.5,
  "Arm Holdings' Power Efficiency Sets the Stage for AI and IoT Expansion": 0.8,
  "lululemon Dips 10% in 3 Months: Time to Buy the Dip or Stay Cautious?": -0.5,
  "Top Growth Companies With Strong Insider Ownership November 2025": 0.5,
  "Comcast Chief Eyes Warner Bros. Bidding War": 0.2,
  "Crypto stocks rise, Starbucks strike, GameStop pops: Trending stocks": 0.5,
  "Why Netflix’s biggest hit could hit its bottom line": -0.5,
  "Micron (MU) Stock Rises as AI Boom Sparks Fresh Wave of Chip Price Hikes": 0.6,
  "No, Nvidia is Not Enron –The Real Nightmare is Cisco’s Ghost": -0.5,
  "Intel popping 10%… feels like the market finally exhaled today - Pretty strong close for a Friday. All three indexes green, and Intel ripping double digits definitely wasn t on my bingo card. META and AMD quietly riding the strength too. What caught my eye wasn t just the numbers it s the tone. Feels like money is rotating back into big tech after weeks of hesitation. Silver names also waking up out of nowhere.": 0.8,
  "S&P 500 Ends November With Broad Weekly Climb, Slight Monthly Rise": 0.5,
  "Urban Outfitters Stock Sees RS Rating Dresses Up For Holidays": 0.5,
  "Strategist talks what he's watching in healthcare, retail sectors": 0.0,
  "Honeywell (HON): Valuation Perspectives After Strong Q3, Upbeat Guidance, and New Innovation Moves": 0.8,
  "Analog Devices Stock Scores Relative Strength Rating Upgrade": 0.5,
  "2 No-Brainer Growth Stocks to Buy Right Now": 0.5,
  "Walmart Stock Hits Record High On Black Friday, Along With Analog Devices And A Metals Miner": 0.8,
  "Microsoft is last train to catch? - 5 days: Meta 10.2% Goog 7.69% Amazon 7.84% Tesla 7.27% Microsoft 2.9% Seems like everyone forgot that Microsoft exist. I guess lack of news. But seems like big tech going up again. 1 by 1. Seems like last good chance to buy dip or what is your thoughts?": 0.2,
  "Crude Prices Erase Early Gains on Optimism for a Ukrainian Peace Deal": 0.5,
  "Analyst flags 9 bargain stocks in a ‘Black Friday’-style dip": 0.5,
  "Everybody Loves Languages Reports Financial Results for the Third Quarter Ended September 30, 2025": 0.0,
  "How the Narrative Around Booking Holdings Is Evolving Amid New Analyst Insights and Industry Shifts": 0.5,
  "The Best Stocks to Invest $1,000 in Right Now": 0.5,
  "Salesforce earnings, September PCE, auto sales: What to Watch": 0.0,
  "Does DexCom’s Recent 5% Jump Signal a Real Value Opportunity for 2025?": 0.2,
  "Is Gilead Sciences a Bargain After 40% Share Price Surge and Pipeline Updates?": 0.5,
  "The Bull Case For IBM (IBM) Could Change Following New AI and Quantum Security Partnerships": 0.5,
  "Marvell Technology (MRVL) Outperforms Broader Market: What You Need to Know": 0.5,
  "Texas Instruments (TXN) Outperforms Broader Market: What You Need to Know": 0.6,
  "If Nvidia is so good, why is AMD outperforming them? - Like Nvidia is monopoly in many things. And has best graphic cards. And Ai. And AMD doesn't have it. But somehow AMD made 93% profit while Nvidia only 31% in 6 months. But AMD P/E is 107 while Nvidia 43 Can someone explain me?": 0.1,
  "Mondelēz Global LLC Conducts Limited Voluntary Recall of 1 SKU of RITZ Peanut Butter Cracker Sandwiches in New York, New Jersey, Pennsylvania, Georgia, Arkansas, Missouri, Oklahoma, and Alabama": -0.5,
  "Nasdaq Notches First Monthly Loss Since March as Dow, S&P 500 Make Gains": 0.2,
  "How Recent Shifts Are Changing the Analyst Story for AstraZeneca": 0.2,
  "Will Expanding Lenacapavir Access in Africa Reshape Gilead Sciences' (GILD) Global Healthcare Narrative?": 0.5,
  "Your Top 2 Moonshot Stocks for the Next 3–5 Years? - Hi folks, I know this might sound like a bit of a FOMO question but I’m genuinely interested: If you had to choose only two stocks to hold for the next 3–5 years that you think could realistically 5-10x, which ones are you betting on and why? I’m looking for ideas with real conviction. Whether it’s a company in a fast-growing sector, something heavily": 0.5,
  "A Look at ON Semiconductor’s (ON) Valuation as Strategic Shift Boosts Profit Outlooks and Investor Confidence": 0.6,
  "Lululemon Is Having an Identity Crisis. Its Founder Blames the CEO.": -0.6,
  "Is ORCL basically an inverse bond now? - It seems like Oracle’s performance in the stock market is largely based on its credit risk and whether or not it can pay off its debt. After its 2026 Q1 earnings it reported positive figures, and its stock price went up. But over time investors started selling the stock, causing its price to go down, out of fear of the risk its RPOs and debt presented. I": -0.5,
  "The Ultimate Growth Stock to Buy With $2,000 Right Now": 0.8,
  "At what point would be a long enough time horizon that you’re able say you’re decent at picking individual stocks? - People always tell me don’t buy individual stocks you’re better off investing in an index fund, which is why im asking this question. I’ve been investing for almost 9 years, pretty happy with my results so far and have learned a ton along the way. In this account I leave a portion for swing": 0.2,
  "The Bull Case For Cisco Systems (CSCO) Could Change Following Major AI Telecom Win in Iraq – Learn Why": 0.5,
  "Micron Technology (MU) Price Targets Raised by Analysts": 0.5,
  "Intel (INTC) Shares Strategic Direction at Global Technology Conference": 0.5,
  "AppLovin (APP) Sees Bullish Updates from Analysts": 0.8,
  "US Government Supports Launch of Crane Clean Energy Center by Constellation Energy (CEG)": 0.5,
  "Morgan Stanley Lifts PT on ON Semiconductor (ON) Stock": 0.5,
  "Loop Capital Raises PT on Arm Holdings (ARM) stock": 0.5,
  "Coca-Cola Europacific Partners (AMS:CCEP) Is Looking To Continue Growing Its Returns On Capital": 0.5,
  "How Analyst Shifts and Market Moves Are Rewriting the Story for Marvell Technology": 0.2,
  "Micron to invest $9.6 billion in Japan to build AI memory chip plant, Nikkei reports": 0.8,
  "US stocks rise for a fifth straight day to close out a volatile month - Wall Street rose for a fifth straight day to put the wraps on a volatile month. The S&P 500 rose 0.5% in abbreviated trading Friday and closed out November with a slim gain of 0.1%. The Dow Jones Industrial Average rose 289 points, or 0.6%. The Nasdaq gained 0.7% but ended November with a drop of 1.5% because of losses": 0.6,
  "A Fresh Look at Micron Technology (MU) Valuation as Analyst Optimism Grows on AI-Driven Memory Demand": 0.6,
  "Texas Instruments (TXN): Assessing Valuation After Recent Share Price Rally": 0.2,
  "Does T-Mobile US' (TMUS) AI-Powered Switching Experience Redefine Its Subscriber Growth Potential?": 0.5,
  "Has PEP Stock Been Good for Investors?": 0.2,
  "Is Intuitive Surgical's Dominance Safe? 10 Years of Healthcare Upside": 0.5,
  "UBS Raises AMAT Outlook as 2026–2027 WFE Market Accelerates": 0.5,
  "BofA Reaffirms Buy on ASML, Citing DRAM Upside and Recovery Potential in China": 0.6,
  "UBS Raises Marvell (MRVL) Price Target to $110, Citing Strong Optics and Microsoft ASIC Wins": 0.8,
  "Copper Thieves Are Wreaking Havoc Across America": -0.6,
  "Cantor Fitzgerald Reiterates Overweight on Workday (WDAY) With $280 Target After Q3 Earnings": 0.6,
  "/r/Stocks Weekend Discussion Saturday - Nov 29, 2025 - This is the weekend edition of our stickied discussion thread. Discuss your trades / moves from last week and what you're planning on doing for the week ahead. Some helpful links: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips *": 0.2,
  "Cadence Design Systems (NASDAQ:CDNS) investors are up 3.7% in the past week, but earnings have declined over the last five years": -0.5,
  "Fastenal's (NASDAQ:FAST) investors will be pleased with their respectable 90% return over the last five years": 0.8,
  "MarketBeat Week in Review – 11/24 - 11/28": 0.0,
  "How Recent Developments Are Shaping the CyberArk Investment Story": 0.5,
  "Comcast mulling sweetened bid for Warner Bros. Discovery, NY Post says": 0.5,
  "Diamondback Energy Insiders Sold US$8.5m Of Shares Suggesting Hesitancy": -0.5,
  "Don't Give Up on Dividend Stocks. Investing $7,500 in These 3 High-Yield Stocks Should Help You Generate Over $1,000 in Yearly Dividends.": 0.8,
  "Is Analog Devices Still a Smart Pick After New Product Launches and a 25% Rally in 2025?": 0.5,
  "What Catalysts Could Shift the Story for TI Amid Margin Pressures and Tariff Uncertainty": 0.2,
  "The Bull Case For UFP Technologies (UFPT) Could Change Following Labor Disruptions and New Contract Talks": 0.5,
  "1 Travel Stock That Should Be on Every Investor's Holiday List": 0.8,
  "You Only Need $500,000 To Retire If You Follow Vincent Chan's Framework: 'The Less Money You Spend, The Earlier You Can Retire'": 0.5,
  "Those who invested in O'Reilly Automotive (NASDAQ:ORLY) five years ago are up 239%": 0.8,
  "Why Everyone Is Talking About Lululemon Stock Now": 0.5,
  "Are Mondelez Shares Poised for a Comeback After Recent Emerging Market Investments?": 0.5,
  "U.S. Black Friday online sales hit record $11.8 billion, Adobe reports - Nov 29 (Reuters) - American shoppers spent a record $11.8 billion online on Black Friday, up 9.1% from last year, final data from Adobe Analytics showed. Adobe Analytics, which tracks over 1 trillion U.S. retail site visits, expects shoppers to spend $5.5 billion on Saturday and $5.9 billion on Sunday, up 3.8% and 5.4% from a year earlier respectively. Separately, software firm Salesforce": 0.8,
  "These Are 2 of the Smartest Growth Stocks to Invest $5,000 in Today": 0.8,
  "T-Mobile will soon make it harder to contact customer service": -0.8,
  "'We needed to go to work': Hilton CEO details how a winning offering evolved": 0.2,
  "r/Stocks Weekly Thread on Meme Stocks Saturday - Nov 29, 2025 - The meme stock scheduled posts will now run weekly and post Saturday afternoon and won't be a sticky; you're probably seeing this because automod sent you here! [Full list of meme stocks here.](https://www.reddit.com/r/stocks/wiki/meme-stocks) This will be updated every once in a while. ------ Welcome traders who just can't help them selves discuss the same exact stock that's been discussed 100s of times a": 0.1,
  "Honeywell - Solstice Spin-Off Served On A Silver Platter": 0.8,
  "How Analyst Views on Applied Materials Are Shifting With New Growth and Competitive Risks": 0.2,
  "Jim Cramer Says “The New Consumer Just Isn’t Buying Kraft Heinz”": -0.6,
  "Benchmark Maintains Buy Rating on Analog Devices (ADI) After Solid Q4 Results": 0.8,
  "UBS Predicts Strong EPS Acceleration for Linde plc (LIN) in 2026": 0.8,
  "UBS Raises Cisco Systems (CSCO) Price Target After Strong Hyperscale Customer Growth": 0.8,
  "Gilead Sciences (GILD) Stock Outlook: Mizuho Lifts Target Amid Stronger Biktarvy Timeline": 0.6,
  "Analysts See 27% Upside Potential For Honeywell International Inc. (HON)": 0.8,
  "1 Growth Stock Down 7% to Buy Right Now": 0.5,
  "Jim Cramer Says He is “Particularly Fond” of Johnson & Johnson": 0.8,
  "Jim Cramer Notes “TJX is at Its Highest, Tremendous Momentum”": 0.8,
  "Jim Cramer on Keurig Dr Pepper: “They’re Doing Some Good Things”": 0.6,
  "Jim Cramer on Marvell: “I Want to Wait for That Fluff to Be Taken Out of It”": 0.2,
  "Thoughts about retail investors entering into the private equity/bitcoin investment associated with retirement accounts - I’m curious to people’s thoughts on this podcast. It discusses about the ramifications of the new executive order to opening up private equity and bitcoin to become part of a retirement fund investment. The overall tone from it is pessimistic and of caution regarding the potential diminishing returns and increased volatility of the future 401k accounts. I’m curious to people’s": -0.7,
  "Has Axon Stock Been Good for Investors?": 0.2,
  "Costco quietly drops name brand items for generic replacements": -0.5,
  "Here's My Top Artificial Intelligence (AI) Stock to Buy in December (Hint: It's Not Broadcom)": 0.5,
  "Another Big Tech Visionary Left to Launch an AI Startup—Is the AI Boom Really in its Earlier Innings?": 0.5,
  "A Look at ASML (ENXTAM:ASML) Valuation Following Recent Share Price Surge": 0.2,
  "Netflix: Yield on Watching": 0.2,
  "Netflix Turns To In-Person Shopping Experiences As Gen Z Returns To The Mall": 0.2,
  "IDEXX Laboratories (IDXX): A Fresh Look at Valuation After Recent Momentum Shift": 0.5,
  "Will Qualcomm (QCOM) announce a partnership with OpenAI? - Couple weeks ago Qualcomm announced AI chips to compete with AMD and Nvidia. The stock pumped 20% to $205. Soon this pump completely tapered off and then some. Meanwhile, AMD, Broadcom, Oracle, Amazon, Intuit all announced partnerships with OpenAI. Often coincided with their stocks pumping too. Could there soon be a partnership between announced between QCOM and an AI lab, even OpenAI? I feel like it": 0.2,
  "How Has LULU Stock Done for Investors?": 0.0,
  "A Fresh Look at Old Dominion Freight Line’s (ODFL) Valuation Following Recent Share Price Decline": 0.5,
  "Tencent and GIC-Backed Joint Venture in China Could Be a Game Changer for Starbucks (SBUX)": 0.5,
  "Can Lululemon’s (LULU) New Executive Lineup Revitalize Its US Growth Strategy?": 0.5,
  "Is Netflix Stock a Buy With a Fresh Stock Split Behind It?": 0.2,
  "Charter Communications (CHTR): Evaluating Valuation After Strategic AI Partnership With Amazon Web Services": 0.5,
  "3 Things Lululemon Must Fix Before the Stock Can Recover": -0.5,
  "Jim Cramer made cost me 10 years of work - Edit: What I mean to say is that I cost myself 10 years of work by following his advice - my fault - obviously he did not hold a gun to my head. Back then he was not a clown with a show... he was a fund manager just like the fund managers you see as guests on shows today (there was less internet and": -0.5,
  "Best Stock to Buy Right Now: Target vs. Costco": 0.5,
  "Is Lululemon's Brand Losing Its Heat?": -0.5,
  "Is Amgen’s Recent Rally Justified After Strong Clinical Trial Results?": 0.5,
  "This Stock-Split Stock Is Up 88,600% Since Its IPO -- and Wall Street Thinks It's a Buy Right Now": 0.8,
  "Axon Enterprise’s (AXON) Acquisition Strategy Drives Bullish Analyst Sentiment Despite Earnings Miss": 0.8,
  "Who deserves to win Company of the Year?": 0.0,
  "Should You Investigate Fortinet, Inc. (NASDAQ:FTNT) At US$81.13?": 0.1,
  "Atlassian (NASDAQ:TEAM) investors are sitting on a loss of 43% if they invested a year ago": -0.7,
  "Fortinet (FTNT): Exploring Current Valuation Following Recent Share Price Swings": 0.2,
  "3 Stocks to Buy and Hold: the Long-Term Play for Your Portfolio": 0.5,
  "I’m a Real Estate Agent: 5 Housing Market Trends To Prepare for in 2026": 0.5,
  "Stocks drift back toward record highs as the final month of 2025 gets underway: What to watch this week": 0.5,
  "Don't Buy PepsiCo, Inc. (NASDAQ:PEP) For Its Next Dividend Without Doing These Checks": -0.5,
  "Insiders At Datadog Sold US$52m In Stock, Alluding To Potential Weakness": -0.6,
  "Indie Games Power Up as Big-Budget Rivals Sacrifice Creativity to Profit": 0.5,
  "What are the good casual things to invest in? I don't want to trade stocks but I want something I can easily make profit in 10+ years - I had a mutual fund a long time ago and it did okay but I don't know what the options are for those or what similar things I could buy are I just want to buy something now and rest assured it'll be worth a decent profit": 0.2,
  "GE HealthCare unveils next-generation SIGNA MRI technology, aiming to boost efficiency, enhance patient experience, and advance sustainability": 0.8,
  "Netflix is Still Cheap Here - Shorting Out-of-the-Money Puts Works Well": -0.5,
  "Intel’s Black Friday Breakout: Apple Rumors Fuel a Holiday Rally": 0.6,
  "3 Stocks That Outperformed Palantir in 2025. Can They Repeat in 2026?": 0.5,
  "GE HealthCare builds on a century of innovation to shape the future of radiology at RSNA 2025": 0.8,
  "Kraft Heinz: A Classic Value Trap Disguised as a Dividend Play": -0.8,
  "Fairgen Launches Fairgen Check, a Last-Line Quality Firewall for Research Data": 0.5,
  "Costco Is on Track for Its Worst Performance Relative to the S&P 500 in 23 Years. Is The Blue-Chip Dividend Stock a No-Brainer Buy for 2026?": -0.5,
  "These 2 Under-the-Radar Dividend Kings Just Declared Dividend Raises": 0.5,
  "Can Disney can benefit from AI? - Disney has built up a huge collection of ip which has huge brand recognition world wide. For the longest time they were biggest entertainment creator for kids until YouTube came along and stole the attention because YouTubers are able to push put out way more content daily, even if it’s low quality. ok now how does ai come into play? In probably around 10 years vr tech could": 0.1,
  "If the U.S. actually hits Venezuela… what happens to the markets ? - So Trump randomly talking about shutting down airspace around Venezuela got me thinking about what actually happens to the markets if the US really goes after them again. I’m not making predictions or anything, just trying to understand the market side of it. Venezuela doesn’t export like it used to but they still sit on a massive amount of oil, so even": 0.1,
  "Gilead (GILD) Earns Buy Rating at Truist as HIV Franchise Continues to Deliver": 0.8,
  "SentinelOne - What am I missing? - So, I just saw a suggestion for CRWD and was looking for it's competitors - and saw SentinelOne. SentinelOne's revenue is growing at 30%+ for last 5 years but stock is down 60%. CRWD has a revenue of $3.95B and market cap of $127B (that's 32x) but SentinelOne with a revenue of $0.8B has a market cap of only $5.4B (which is 6.75x). Although SentinelOne's net income is": 0.2,
  "Morgan Stanley Revises AEP Price Target Following Performance Review": 0.0,
  "Question about stock/taxes - Hello everyone. If you DCA to an ETF over many years but then decide that you need to withdraw a large amount for an unexpected purchase, will it tax at the income rate (because of recent transactions) or capital gains because it's been over an extended period? Example: Account created Jan 2025, I put in $1000/mo in VOO continuously. Then, Dec 2027, I need to withdraw $20K for an unexpected purchase.": -0.5,
  "Piper Sandler Highlights ABV Headwinds and Company Updates in MDLZ Review": 0.2,
  "Analysts Warn Shifting Consumer Trends Are Reshaping PepsiCo’s (PEP) Outlook": 0.1,
  "My 3 Favorite Stocks to Buy Right Now": 0.5,
  "Here's How Americans Spent a Record $18 Billion Chasing Thanksgiving Week Deals": 0.5,
  "5 Amazing Growth Stocks to Buy Before 2026": 0.5,
  "50% of holiday shoppers plan to use buy now, pay later to cover their expenses. Here are some alternatives": 0.2,
  "Does a Stock Split and Stranger Things Finale Shift the Outlook for Netflix (NFLX) Investors?": 0.2,
  "Black Friday Weekend Wrap: Retailers Give a Thumbs-up": 0.6,
  "The Costco Effect Highlights How New Costco Stores Transform Local Economies: 'Surrounding Businesses Raise Wages Up To 40% More'": 0.8,
  "(Item 8.01) Other Events. Establishment of Cash Reserve On December 1, 2025, Strategy Inc (“Strategy”) announced that it has established a US dollar reserve (“USD Reserve”) of $1.44 billion to support the payment of dividends on its preferred stock and interest on its outstanding indebtedness (“Dividends”). The USD Reserve was funded using proceeds from the sale of shares of class A common stock under Strategy’s at-the-market (“ATM”) offering program. Strategy’s current intention is to maintain a USD\n\n(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On December 1, 2025, Strategy announced the appointment of Thomas C. Chow as its Executive Vice President & General Counsel and Corporate Secretary, effective immediately. Thomas Chow brings more than 20 years of legal, policy, and operational leadership across digital asset, fintech, and software companies. Before joining Strategy, he was Chief Legal Officer at Chia Network and": 0.1,
  "(Item 8.01) . Other Events. Diamondback Energy, Inc. (“Diamondback”) has entered into a letter agreement with SGF FANG Holdings, LP (“SGF”), dated November 28, 2025, which provides SGF with the right, but not the obligation, to sell up to 3,000,000 shares of Diamondback common stock to Diamondback per calendar quarter through December 31, 2026 at the most recent NASDAQ closing price prior to any such transaction, subject to certain terms and conditions set forth in the letter": 0.1,
  "(Item 8.01) – Other Events ​ On November 24, 2025, Greg Henslee, Executive Chairman of the Board of Directors of O’Reilly Automotive, Inc. (the “Company”), established a plan in accordance with Rule 10b5-1 of the Securities Exchange Act of 1934, as amended, for the trading of the Company’s common stock. The plan provides for the sale of up to 138,705 shares at specific market prices, subject to specified limitations over a period beginning around March 5, 2026": 0.0,
  "3 Value Stocks That Look Undervalued After the Recent Market Pullback": 0.5,
  "Stock Ideas from Barron's 12/1: RBLX, D, SHOP, GOOGL - Some of the best ideas I've gotten to invest in stocks over the last 20 years have come from the pages of Barron's Magazine, so I'm going to start trying to summarize some of the stock picks made by Barron's in the current week's magazine. Barron's is released on Fridays after the market closes, so Monday is the first day to trade on their picks,": 0.6,
  "Unpacking Q3 Earnings: Axon (NASDAQ:AXON) In The Context Of Other Aerospace and Defense Stocks": 0.2,
  "Dow Jones Futures Fall; Trump Says He's Made Fed Chief Decision": -0.5,
  "Should You Buy This Biotech Stock That Just Gained 5% in 1 Day?": 0.5,
  "S&P 500, Dow recovers, silver soars, tech rebounds: Weekly Market Wrap": 0.5,
  "Portfolio Check – Lost $200K in 2021-22, rebuilding now with $10K/month plan (Wealthsimple) - Hey Everyone, I am rebuilding my investment portfolio after taking a big hit during the 2021-2022 crash(almost lost 200k). Back then I was very new to the stocks and not enough knowledge, was listening way too much to WSB I guess. I have had financials difficulties and had to file a consumer proposal. Lost mu business and house that I could": -0.8,
  "Indian Families Chase the Chill with 30% Rise in Cold-Weather Travel Interest This Festive Holiday Season": 0.6,
  "Musk says he would invest in NVDA & Google-Interview - When asked about one company outside any of his own, that he would own stocks of “to meet a capitalistic end and not an altruistic one”, Elon Musk sought to distance himself from investing. “I don't really buy stocks. I'm not like an investor, I don't look for things to invest in. I just try to build things. And then there happens to be stock": 0.2,
  "How Is Marriott International’s Stock Performance Compared to Other Hotel Stocks?": 0.1,
  "Is Automatic Data Processing Stock Underperforming the S&P 500?": -0.5,
  "Marriott International Celebrates 700th Hotel in Asia Pacific excluding China with the Opening of Legacy Mekong, Can Tho, Autograph Collection in Vietnam": 0.6,
  "Faron Pharmaceuticals Ltd: Appointment of CFO": 0.0,
  "Is CSX Corporation Stock Underperforming the S&P 500?": -0.5,
  "Is PayPal Holdings Stock Underperforming the Nasdaq?": -0.5,
  "Overblown AI Competition Worries Sees Rating Change for Booking Holdings (BKNG)": 0.1,
  "Is Kraft Heinz Poised for a Turnaround After Recent Sustainability Commitments?": 0.5,
  "History Says the Nasdaq Will Soar: 2 Artificial Intelligence (AI) Stocks to Buy Before 2026, According to Wall Street": 0.8,
  "Building a better robot: How Virtual Incision plans to challenge Intuitive": 0.2,
  "NBA Finals 2025 Post Event Analysis Report Featuring 2K Sports, Nike, PepsiCo, Emirates Airline, Michelob Ultra, State Farm, Tissot, AT&T, American Express, Google": 0.0,
  "Is NXP Semiconductors Stock Underperforming the Dow?": -0.5,
  "Global Markets Slip Amid Risk Aversion": -0.7,
  "Micron plans $9.6bn HBM chip facility at Hiroshima site in Japan": 0.5,
  "Cintas Stock: Is CTAS Underperforming the Industrial Sector?": -0.5,
  "Applovin ($APP) Breach of contract reports and first-hand experience - I wanted to share some things going on in Applovin from a personal experience as a mobile developer with 10 years experience in the market that investors here might find relevant. Some indie developers (we) have been affected by Applovin account suspensions in the last month. These are meddium-size accounts (far from large publishers but definitely not small accounts) which were created years ago and": -0.5,
  "How Is Constellation Energy's Stock Performance Compared to Other Utilities Stocks?": 0.2,
  "Trending tickers: Intel, Coupang, EasyJet, Fresnillo and Peel Hunt": 0.0,
  "Rate My Portfolio - r/Stocks Quarterly Thread December 2025 - Please use this thread to discuss your portfolio, learn of other stock tickers & portfolios like [Warren Buffet's](https://buffett.online/en/portfolio/), and help out users by giving constructive criticism. Why quarterly? Public companies report earnings quarterly; many investors take this as an opportunity to rebalance their portfolios. We highly recommend you do some reading: Check out our wiki's list of [relevant posts & book recommendations.](https://www.reddit.com/r/stocks/wiki/index/#wiki_relevant_posts.2C_books.2C_wiki_recommendations) You can find": 0.2,
  "How Recent Developments Are Rewriting the Story for Costco Wholesale": 0.2,
  "US Stock Market Today: S&P 500 Futures Dip as Rate Cut Uncertainty Weighs": -0.5,
  "Best Growth Stocks to Buy for Dec.1": 0.5,
  "Amazon, Visa team on agentic tools": 0.2,
  "Has Shopify (SHOP) Priced in Future Growth, According to Analysts?": 0.2,
  "Advanced Micro Devices’ (AMD) Competitive Position Versus Nvidia Underpins Raymond James’ Confidence": 0.8,
  "Three Mile Island’s Nuclear Revival Pits Those Who Fled Against Job Seekers": 0.1,
  "Processors and Graphics Chips Stocks Q3 Recap: Benchmarking Qualcomm (NASDAQ:QCOM)": 0.2,
  "DoorDash CEO Tony Xu outmaneuvered Uber Eats by obsessing over his customer": 0.8,
  "SocGen's Overnight Economic News Summary": 0.0,
  "CrowdStrike (CRWD) Q3 Earnings: What To Expect": 0.2,
  "Marvell Technology (MRVL) Q3 Earnings Report Preview: What To Look For": 0.5,
  "2 High-Flying Stocks on Our Buy List and 1 We Find Risky": 0.2,
  "3 Small-Cap Stocks with Warning Signs": -0.5,
  "2 Volatile Stocks on Our Buy List and 1 Facing Headwinds": 0.2,
  "2 Value Stocks with Exciting Potential and 1 We Ignore": 0.5,
  "Palo Alto Networks (NASDAQ:PANW) Is Doing The Right Things To Multiply Its Share Price": 0.8,
  "1 Unprofitable Stock Worth Your Attention and 2 Facing Challenges": -0.5,
  "3 Cash-Burning Stocks We’re Skeptical Of": -0.8,
  "3 Market-Beating Stocks with Promising Prospects": 0.6,
  "1 Cash-Producing Stock on Our Watchlist and 2 We Turn Down": 0.2,
  "1 Safe-and-Steady Stock for Long-Term Investors and 2 We Brush Off": 0.0,
  "2 Cash-Producing Stocks Worth Your Attention and 1 We Turn Down": 0.2,
  "Did GE HealthCare's Wave of AI Imaging Launches at RSNA 2025 Just Shift GEHC's Investment Narrative?": 0.2,
  "2 Large-Cap Stocks with Exciting Potential and 1 Facing Challenges": 0.5,
  "AstraZeneca to invest $2B in Maryland manufacturing expansion": 0.8,
  "Bank of Japan, Economic Reports Damp Wall Street Pre-Bell; Asia Mixed, Europe Off": -0.5,
  "Defense Darling Anduril Grapples with Military Tech Glitches": -0.5,
  "US Equity Investors to Focus on Powell's Speech, Fed's Preferred Inflation Report This Week": 0.5,
  "3 High-Growth Companies With Insider Ownership Up To 33%": 0.5,
  "AI Chips Update - Black Forest Labs Secures Series B For Visual AI Expansion": 0.5,
  "Spotlight On Alnylam Pharmaceuticals And 2 Other Stocks Possibly Trading Below Fair Value": 0.5,
  "US High Growth Tech Stocks To Watch": 0.0,
  "ARWR: Multiple Data Readouts Ahead in 2026…": 0.5,
  "Exelon Announces Proposed Offering of $900 Million of Convertible Senior Notes due 2029": 0.1,
  "This Latin American E-Commerce Stock Could Be Worth $500 Billion in 10 Years": 0.8,
  "Regeneron inks gene editing deal with startup Tessera": 0.5,
  "Regeneron and Tessera Therapeutics to Jointly Develop TSRA-196, an Investigational Gene Editing Therapy for Alpha-1 Antitrypsin Deficiency (AATD)": 0.6,
  "Option Volatility and Earnings Report for December 1 - 5": 0.0,
  "With 88% ownership of the shares, Exelon Corporation (NASDAQ:EXC) is heavily dominated by institutional owners": 0.2,
  "CSX (CSX): Evaluating Share Valuation After Recent Momentum in the Transportation Sector": 0.5,
  "3 Cyber Monday Stock Deals: More Than 50% Off in 2025": 0.5,
  "Sokin Raises $50M Series B Following 100% Year-on-Year Growth": 0.8,
  "T-Mobile Launches Most Aggressive Black Friday Wireless Promotion": 0.8,
  "Stoke Therapeutics and Biogen Announce Presentations at the 2025 American Epilepsy Society Annual Meeting": 0.5,
  "Biogen and Stoke Therapeutics Announce Presentations at the 2025 American Epilepsy Society Annual Meeting": 0.5,
  "AI Stocks Face 'Show Me' Moment: Can Apple Rebound In 2026 With Siri?": 0.2,
  "Shares of vaccine makers drop after FDA memo flags reports of child deaths": -0.8,
  "This Week In Digital Payment - Visa Teams Up With Aquanow For Stablecoin Settlement": 0.6,
  "How a data and tech strategy fueled DoorDash’s rise": 0.5,
  "This Trillion-Dollar Stock Could Be the Next Nvidia": 0.5,
  "Should You Buy Costco Before 2026?": 0.0,
  "US Dollar Falls Early Monday, Focus on ADP Payrolls This Week": 0.1,
  "Analyst bumps price targets on Nvidia and Broadcom on AI strength across the board": 0.5,
  "2026's Palantir Stock Debate: Defense Play Or AI Enterprise Growth Machine?": 0.5,
  "ETFs in Focus as AI Tools Boost Record Black Friday Spending": 0.6,
  "Spotnana Announces Partnership with Booking.com": 0.5,
  "Fiserv Appoints Walter Pritchard as Senior Vice President, Head of Investor Relations": 0.5,
  "CrowdStrike Advances Next-Gen SIEM and Cloud Security Access on AWS with Streamlined Onboarding, Flexible Pricing, and Cost-Efficient Data Access": 0.6,
  "Mark Henefeld Joins Roofing Corp of America as Its Chief Financial Officer": 0.5,
  "CrowdStrike Operationalizes and Secures Agentic AI Workloads on AWS": 0.5,
  "CrowdStrike Stops Cloud Attacks in Seconds with Real-Time Cloud Detection and Response Innovations": 0.6,
  "Here’s your dopamine-hit for the day, folks! - Global equities caught in a tug-of-war: as we roll into December, risk-off vibes are creeping in. \\- Europe’s shares drifted into the red as industrial & defence names weighed on the broader index. \\- Asian markets put in a cautious start. Japan’s Nikkei 225 sank nearly 2% after the Bank of Japan hinted at possible rate hikes \\- U.S. futures slipped as tech wobbled and investors waited": -0.6,
  "Marriott's Global Expansion and 17% Surge Raise New Questions About Share Price in 2025": 0.2,
  "Is CSX Trading Above Fair Value Amid Rail Industry Innovation News?": 0.1,
  "Former Gap CEO reveals the only thing that could save Target": 0.5,
  "Here’s Why Sands Capital Technology Innovators Fund Sold CrowdStrike Holdings (CRWD)": 0.1,
  "Cybersecurity Spending Set to Surge 73%: 1 Best-In-Breed Stock to Take Advantage": 1.0,
  "How Is Roper Technologies' Stock Performance Compared to Other Software & Services Stocks?": 0.0,
  "If You Invested $1000 in Idexx Laboratories 10 Years Ago, This Is How Much You'd Have Now": 0.5,
  "Google, Airbus and European defense stocks: Trending stocks": 0.2,
  "Palo Alto Networks Buys Chronosphere: Will Observability Fuel Growth?": 0.5,
  "Falcon Flex Adoption to Aid CrowdStrike's Subscription Revenues in Q3": 0.6,
  "AIM ImmunoTech to Participate in Live ‘Fireside’ Chat on Virtual Investor Closing Bell Series": 0.5,
  "Treasury Yields Little Changed as Markets Position for Fed Cut": 0.1,
  "New Upgraded Points Study: Most Americans Prefer Hotels Over Short-Term Rentals Like Airbnb for Holiday Travel": 0.5,
  "Exchange-Traded Funds, Equity Futures Lower Pre-Bell Monday Ahead of Manufacturing Reports": -0.2,
  "CrowdStrike Delivers Agentic Security to HPE Unleash AI Partner Program": 0.5,
  "GE HealthCare unveils Allia Moveo, designed to deliver next-level mobility, workflow and comfort in the interventional suite": 0.8,
  "Marvell Extends Collaboration with Microsoft, Expanding Azure Global Cloud Security Services in Europe": 0.6,
  "TPx Selects Zscaler as Strategic Partner to Accelerate SASE Strategy": 0.6,
  "Global Traveler Names Airline and Hotel of the Year": 0.5,
  "Flywl Announces Cloud Observability Enabled by Datadog": 0.5,
  "AppLovin to Participate at the UBS Global Technology and AI Conference": 0.5,
  "Intuitive Surgical, Inc. (ISRG) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Is Trending Stock Zscaler, Inc. (ZS) a Buy Now?": 0.2,
  "Palantir Technologies Inc. (PLTR) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Here is What to Know Beyond Why Vertex Pharmaceuticals Incorporated (VRTX) is a Trending Stock": 0.2,
  "Micron Technology, Inc. (MU) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Netflix, Inc. (NFLX) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Applied Materials, Inc. (AMAT) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Correction: Bank of Japan, Economic Reports Damp Wall Street Pre-Bell; Asia Mixed, Europe Off": -0.5,
  "Why Buying This Dominant Travel Disrupter Today Will Net 200% Returns": 0.5,
  "These are the top 10 most popular stocks on Robinhood UK in November": 0.0,
  "If I Could Only Buy and Hold a Single Stock Today, This Would Be It": 0.6,
  "AI Pushes Black Friday E-Commerce Sales to a Record-High: 5 Picks": 0.6,
  "Black Forest Labs raises $300M at $3.25B valuation": 0.8,
  "Intel Corp. (INTC) Climbs 10.3% on Apple Deal Hype": 0.8,
  "3 Tech ETFs to Buy as AI Vanguard Palantir Plunges 19% in a Month": 0.2,
  "Here Are Monday’s Top Wall Street Analyst Research Calls: Archer Aviation, Beta Technologies, Carvana, Chevron, MPLX, Toast, Zscaler and More": 0.5,
  "Celsius Holdings Posts 51.3% Gross Margin in Q3: Is It Sustainable?": 0.2,
  "Don't Overlook Zscaler (ZS) International Revenue Trends While Assessing the Stock": 0.5,
  "Bitcoin slides as crypto sell-off extends into December": -0.7,
  "ChatGPT Turns Three. 5 Stocks That Have Soared in the AI Era and What Comes Next.": 0.5,
  "Take the Zacks Approach to Beat the Markets: MBX Biosciences, Garrett Motion & Monster Beverage in Focus": 0.5,
  "Workiva Appoints Deepak Bharadwaj as EVP & Chief Product Officer to Fuel AI-Powered Platform Innovation": 0.5,
  "Prediction: These 2 Stocks Could Outperform the S&P 500 in 2026": 0.5,
  "William Penn Foundation, Comcast and Partners To Award $8.35 Million To Support Workforce Training, Benefiting Thousands Across the Philadelphia Region": 0.8,
  "Wall Street Analysts Think PDD Holdings Inc. Sponsored ADR (PDD) Is a Good Investment: Is It?": 0.5,
  "Nvidia & Synopsys, Strategy's new reserve, Accenture & OpenAI": 0.0,
  "Zscaler (ZS) Loses 24% in 4 Weeks, Here's Why a Trend Reversal May be Around the Corner": -0.6,
  "Is Apple Giving Intel’s Foundry Ambitions a Much-Needed Boost?": 0.5,
  "Should AMD Investors Worry About Google TPUs and the DRAM Shortage?": -0.5,
  "Is Monster Beverage (MNST) Stock Outpacing Its Consumer Staples Peers This Year?": 0.2,
  "Wall Street lifts Broadcom targets on rising TPU leverage": 0.5,
  "This Artificial Intelligence Stock Could Be the Biggest Surprise of 2026": 0.6,
  "Why Take-Two Interactive (TTWO) is a Top Growth Stock for the Long-Term": 0.8,
  "Carvana initiated, Zscaler downgraded: Wall Street's top analyst calls": 0.1,
  "REGN Gains 21.5% in a Month: Time to Buy, Sell or Hold the Stock?": 0.5,
  "If This AI Theme Really Deteriorates, These Are the 3 Stocks to Short": -0.6,
  "r/Stocks Daily Discussion Monday - Dec 01, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.2,
  "Mixx Technologies Raises $33M Series-A to Redefine AI Infrastructure through Full-Stack Optical Integration": 0.6,
  "Michael Burry says Tesla is 'ridiculously overvalued,' slams Musk pay package": -0.8,
  "US stocks slump, bitcoin sell-off, Trump's top pick for Fed chair": -0.6,
  "Worst CEOs of the Year: Brian Cornell of Target": -0.8,
  "1 Artificial Intelligence (AI) Stock to Buy Hand Over Fist Right Now": 0.8,
  "BC-Most Active Stocks": 0.0,
  "Salesforce, Adobe Forecast Midsingle-digit Revenue Gains for Cyber Monday 2025": 0.5,
  "Can IBM's Tie-Up With Cisco for Quantum Network Aid Its Shares?": 0.2,
  "Michael Burry says Tesla stock is 'ridiculously overvalued'": -0.8,
  "Nvidia Invests $2 Billion In Chip Design Firm Synopsys - Artificial intelligence chipmaker Nvidia (NVDA) on Monday said it has invested $2 billion in electronic design automation firm Synopsys (SNPS). Synopsys stock jumped on the news while Nvidia stock dipped amid a broad market retreat. Further, Synopsys and Nvidia plan to collaborate in engineering and marketing activities. Nvidia has stepped up investments in partner companies, including AI model maker OpenAI. https://www.investors.com/news/technology/nvidia-stock-synopsys-stock-engineering-marketing-partnership/": 0.5,
  "The AI Race Is a Marathon, Not a Sprint. Here Is How AMD Stock Could Still Finish First.": 0.5,
  "SoftBank’s CEO, People who talk about a bubble around AI investment are “not smart enough,” - [https://finance.yahoo.com/news/softbank-son-cried-nvidia-stake-095721630.html](https://finance.yahoo.com/news/softbank-son-cried-nvidia-stake-095721630.html) *SoftBank Group Corp. founder Masayoshi Son said he wouldn’t have sold off Nvidia Corp. shares if his company had unlimited money to bankroll its next investments in artificial intelligence, which include a big bet on OpenAI.* *“I don’t want to sell a single share. I just had more need for money to invest in OpenAI” and other projects,": 0.2,
  "CrowdStrike, Carvana, Home Depot, Lowe's: Top Analyst Calls": 0.5,
  "Could Retail Stocks Rally Into Year End? What the Charts of Marriott, On Holding, Lululemon Say.": 0.2,
  "Proofpoint Appoints Joyce Kim as Chief Marketing Officer": 0.5,
  "AMGN Up Almost 16% in a Month: Should You Buy, Sell or Hold the Stock?": 0.2,
  "The Smartest AI Stock to Buy With $1,000 Right Now": 0.5,
  "Circle Shares Dip 33% in 3 Months: Is it Wise to Hold the Stock Now?": -0.6,
  "European Association for the Study of Diabetes (EASD) Annual Meeting Highlights 2025: Advancements in GLP-1RAs for Diabetes, Cardiovascular Treatments, and Therapies for Resistant Hypertension": 0.6,
  "A Fresh Look at GE HealthCare (GEHC) Valuation as Investor Optimism Grows": 0.8,
  "Starbucks to Pay More Than $35.5 Million to New York City Workers in Settlement of Fair Workweek Law Violation": 0.5,
  "Instinct GPUs Drive Data Center Growth: What's Ahead for AMD Stock?": 0.5,
  "Climb Announces United States Partnership with Fortinet": 0.5,
  "These 2 were the busiest U.S. apparel and beauty stores on Black Friday": 0.5,
  "Elon Musk says AI is 'the only thing' to 'solve' US $38T debt": 0.5,
  "North America Drops 17 Rigs Week on Week": -0.5,
  "Zacks Industry Outlook Highlights CrowdStrike, Fortinet, Okta and Qualys": 0.5,
  "My Strategy Analysis for This Week - I don't think now is a good time to sell stocks. Personally, I would continue to accumulate the following stocks when prices dip: 1) RDDT: An exceptional AI + community company with outstanding revenue and profits this year. I consider it the top community app currently. Moving averages are converging and poised for an upward breakout. Keep adding. 2) BE: A clean energy company. Third-quarter earnings were exceptionally": 0.8,
  "Cathie Wood Is Buying GOOGL Stock as Alphabet Approaches $4 Trillion. Should You?": 0.5,
  "Is Monster Beverage's International Push the Next Big Driver of Sales?": 0.5,
  "Bitcoin slides on 'weak' sentiment, Strategy, Coinbase among crypto stocks hit": -0.6,
  "What’s one stock you sold way too early and still regret it ? - Man, I was looking through some old phone screenshots earlier today and kinda got that stupid sinking feeling again lol. There’s always that one stock you sold way too early, right? Like at the time it felt “smart” or I convinced myself I was locking in profits, and now when I look at where it is today I just shake my": -0.7,
  "Xilam Group Launches First Streaming Platform TOON BOX": 0.5,
  "Google Faces New Rival In Taiwan—GMI Cloud Announces Nvidia-Powered $500 Million AI Data Center With 2M Tokens Per Second": 0.6,
  "GE HealthCare Unveils Next-Gen SIGNA MRI Systems to Elevate Efficiency": 0.6,
  "The Zacks Analyst Blog Highlights PayPal, Visa and Mastercard": 0.5,
  "Update: BofA Securities Adjusts Broadcom Price Target to $460 From $400, Maintains Buy Rating": 0.8,
  "Top Midday Stories: Nvidia's $2 Billion Stake in Synopsys; Starbucks' Nearly $39 Million Fine; Goldman Sachs to Buy Innovator Capital for $2 Billion": 0.5,
  "Michael Burry calls Tesla \"ridiculously overvalued\" in new blog post": -0.8,
  "CaringBridge and DoorDash Partner to Double Donations up to $50,000 on Giving Tuesday": 0.5,
  "OpenAI’s investment into Thrive Holdings is its latest circular deal": 0.1,
  "Netflix Co-CEO Ted Sarandos to Participate in the UBS Global TMT Conference": 0.0,
  "Ross Stores (ROST) Upgraded to Buy: What Does It Mean for the Stock?": 0.5,
  "AMD Stock Drops 15% in a Month: Should You Buy, Sell, or Hold?": -0.5,
  "The Zacks Analyst Blog Highlights AMD, GE Aerospace and IBM": 0.5,
  "Morgan Stanley Just Named This Stock a Top Semiconductor Pick. Should You Buy Shares Now?": 0.5,
  "Will Micron (MU) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Is Now the Right Moment for ADP Shares After a 2.1% Weekly Rebound?": 0.2,
  "Shopify (SHOP): Evaluating Valuation After Boost From New Bombas Store Integration Announcement": 0.5,
  "Top Stock Movers Now: Coinbase, Robinhood, Moderna, Synopsys, and More": 0.5,
  "Can PepsiCo Achieve Its Mid-Teens PBNA Margin Ambition by 2026?": 0.2,
  "Which AI companies are still worth buying in the last month of 2025? - This year, artificial intelligence has been the cheat code for the entire market, but as 2025 draws to a close, hype and reality are finally beginning to diverge. Some so called AI concept stocks have run their course, while others still appear incredibly strong. Currently, I'm primarily focusing on companies that are actually delivering products and addressing genuine market demand, rather": 0.2,
  "Update: Starbucks to Pay More Than $35.5 Million to New York City Workers in Settlement of Fair Workweek Law Violation": 0.8,
  "This Is Palantir’s Price Prediction Heading Into 2026": 0.1,
  "Old Dominion Freight Line (ODFL) Stock Trades Up, Here Is Why": 0.5,
  "Top Growth Stocks With Strong Insider Backing December 2025": 0.5,
  "3 Prominent Stocks Estimated To Be Undervalued By At Least 40.2%": 0.5,
  "Black Friday Online Spending Rises More Than Expected, Adobe Data Show": 0.5,
  "Intuit (INTU) Sees Sustained Analyst Bullishness as November Comes to a Close": 0.8,
  "Analysts Maintain Positivity For Datadog (DDOG)": 0.8,
  "Regeneron and Tessera join forces to forge in vivo AATD gene therapy": 0.5,
  "Nebius Group (NBIS)’s Microsoft Deal Has Impressed Analysts": 0.8,
  "RBC Says Shopify, Constellation, and Kinaxis \"Most Compelling Investment Ideas\" in its Canadian Technology Coverage Universe": 0.8,
  "Adobe to Announce Q4 & FY2025 Earnings Results on December 10, 2025": 0.0,
  "Cyber Monday Trends: Shoppers Spending More While Picking Fewer Items This Holiday Season": 0.5,
  "Why Analysts Are Rewriting the Zscaler Story After Fresh Results and Guidance": 0.5,
  "Amazon's Black Friday sales, Goldman Sachs acquires ETF issuer": 0.5,
  "Only Two Days Left To Cash In On QUALCOMM's (NASDAQ:QCOM) Dividend": 0.5,
  "Shopify says a daylong Cyber Monday outage has been resolved": 0.5,
  "Costco Joins Companies Suing for Refunds If Trump’s Tariffs Fall": 0.1,
  "Sell AAPL or NVDA? - I have long term hold (over 15 years) on AAPL and NVDA! Worth A LOT! Thinking to sell few shares (around 1,000 shares) on one of those stocks to spend on personal matters of just diversify on other promising stocks! Which stock between the two should I sell? Appreciate your opinion with your logic and analysis! Thank you!": 0.5,
  "Lumentum Just Got a New Street-High Price Target. Should You Buy the Laser Stock Fueling the AI Boom?": 0.6,
  "US Equity Indexes Decline, Treasury Yields Surge in Midday Trading": -0.7,
  "Macy’s and Other Retail Stocks Get a Boost. Black Friday Was Better Than Feared.": 0.8,
  "U.S., U.K. Strike Deal on Higher Drug Prices": -0.8,
  "What Is the Best Chip Stock to Own for the Next 10 Years?": 0.2,
  "Nvidia Invests $2 Billion in Synopsys Under Expanded Partnership": 0.5,
  "Sector Update: Consumer Stocks Higher in Afternoon Trading": 0.5,
  "Top Midday Decliners": -0.5,
  "Netflix would be ‘killing three birds with one stone’ by buying Warner Bros. Discovery, BofA says": 0.5,
  "MercadoLibre (MELI) Sees Minor Fluctuation in Analyst Sentiment": 0.1,
  "Analysts Remain Optimistic for Amazon.com (AMZN)": 0.8,
  "Cyber Monday sales to hit $14 billion, fueled by AI, Adobe forecasts": 0.6,
  "Marvell Technology Stock Sees RS Rating Jump To 86": 0.5,
  "Shopify outage disrupts Cyber Monday, Strategy's bitcoin KPI target": -0.5,
  "Equities Fall Intraday as Survey Shows Continued Manufacturing Contraction": -0.7,
  "QCOM's Robust Portfolio Drives Revenue Growth: Will the Trend Persist?": 0.6,
  "Construction workers are cashing in on the AI boom": 0.5,
  "The Best Dividend Stocks for 2026: Strategist": 0.5,
  "Steepening of yield curve after inversion - Everytime the yield curve inverts, we get a lot of youtube videos where they fear monger using this fact. When the yield curve comes out of inversion and steepens, that's when historically, recessions have happened. The common reason cited is that the fed lowers the rate because it sees that the economy is about to break, and is followed by steepening of the unemployment numbers which eventually leads": -0.5,
  "With Apple Poised to Best Samsung in Smartphone Shipments, Should You Buy, Sell, or Hold AAPL Stock?": 0.5,
  "Shopify Issues Black Friday E-Commerce Report, Hit With Outage On Cyber Monday": -0.5,
  "Today's Market: Nasdaq Leads Market Retreat. Nvidia, Meta, Tesla Slide Amid Risk-Off Mood": -0.7,
  "Berkshire Hathaway is classified as a growth stock！ - This is because the compiler of the S&P 500 Growth Index has included Berkshire Hathaway in its composition. At the same time, the company is also included in the S&P 500 Value Index, where it carries a slightly higher weighting. But one company missing from these so called high growth ranks is chipmaker AMD, whose stock has surged and now trades at a 140 times price": 0.2,
  "Starbucks Reaches $38.9 Million Settlement With NYC on Worker Protection Violations": -0.5,
  "Nvidia Buys $2B of Synopsys Stock, DeepSeek Debuts New AI Models": 0.5,
  "Shopify Stock Falls on Tech Outage. Cyber Monday Isn’t Going to Plan.": -0.7,
  "2 Fast-Growing AI Stocks That Could Become the Next NVIDIA": 0.5,
  "Tech etf is pinned up on low volume days - Past 3 days is around 30% lower volume excluding friday which was a bit higher than usual. Buy with caution, i only trust the trend set as of last tuesday when volume was closer to the average. Dont be exit liquitity.": 0.2,
  "SHARON AI To Appoint Mr Drew Kelton To Board of Directors": 0.5,
  "New Agentic Capabilities in AWS Transform Enable Rapid Modernization of Any Code or Application": 0.6,
  "Retail Traders Turn Bearish on SPY Amid $25.8 Trillion Debt Refinancing Concerns": -0.8,
  "‘Big Short’ investor Michael Burry revives his short bet against  Tesla, calling the stock ‘ridiculously overvalued’": -0.8,
  "Starbucks to Pay $38.9 Million in New York City Labor Settlement": 0.5,
  "Market Chatter: Costco Enters Legal Fight for Refunds if Trump's Global Tariffs Fall": 0.1,
  "This defense-AI stock is up 50 percent in 6 months: It’s not Palantir": 0.5,
  "Monster Beverage (MNST): Assessing Valuation After Record Sales and Surging International Growth": 0.5,
  "Major Events in U.S. Stocks This Week - **Monday (December 1st)** **Market Events:** * **AWS re:Invent (Whole Week)**: Focused on Agentic AI, cloud computing, AI infrastructure, and continued support for technological networks. * **Earnings Reports**: MongoDB (MDB) * **High Volatility Stocks**: BMNR, CIFR * **Automobile Transaction Data**: NIO, XPEV, LI, BYD * **IPO Quiet Period and Lockup Events**: Impact on small-cap stocks * **Jerome Powell Speech (21:00)**: One of the most important speeches this week": 0.5,
  "AI trade still a 'dominant force' as investors start to reassess": 0.5,
  "AMD Stock In Focus -- Official Ryzen Listing Ignites High-Performance CPU Hype": 0.8,
  "Why Shopify (SHOP) Stock Is Down Today": -0.5,
  "DoorDash (DASH) Stock Is Up, What You Need To Know": 0.5,
  "Retail shelves were 'very well replenished' on Black Friday": 0.8,
  "With new bids, Warner Bros. Discovery looks to narrow the auction field": 0.5,
  "Monster Beverage Seen Posting 10% US Revenue Growth in 2026, RBC Says": 0.6,
  "Intel Could Break Through Apple Barrier -- Analysts Say This Could Redefine Foundry Competition": 0.6,
  "Wall Street Continues to Underestimate the Growth of Magnificent Seven Companies. Here's Why.": 0.5,
  "Tesla Europe Sales Slide Despite Refresh": -0.5,
  "Tesla (TSLA) Stock Dips as European Sales Plunge Over 50%": -0.8,
  "Elon Musk’s Tesla faces fresh criticism from ‘Big Short’ investor Michael Burry": -0.5,
  "PLTR: Palantir Stock Plunges Nearly 20% in Worst Month Since 2023": -0.8,
  "Electric Plane Maker Dubbed ‘Young Tesla’ Wins Over Analysts": 0.8,
  "Meta Might Use Google TPUs in 2027. Should Nvidia Investors Panic?": -0.5,
  "Nvidia May Not Be Enron, But Does NVDA Stock Still Face AI Bubble Risks Here?": -0.5,
  "Sustainable Investing Is Still Hot With Younger Investors. One Pro’s Stock Picks.": 0.6,
  "AI21 Launches Maestro on Amazon VPC, Bringing Enterprise-Grade Agentic AI to Every Organization": 0.6,
  "MicroStrategy’s Market Cap Falls Billions Below Its Bitcoin Holdings": -0.8,
  "Sector Update: Consumer Stocks Edge Higher Late Afternoon": 0.5,
  "Nvidia Just Took a $2 Billion Stake in Chip Design Company": 0.5,
  "Nvidia Invests $2 Billion in Synopsys to Broaden AI Design Partnership": 0.8,
  "Why AI Stocks’ Wobbles Aren’t a Reason to Worry": 0.5,
  "Buy Now, Pay Later Companies Asked to Share Lending Practices": 0.0,
  "Sector Update: Tech Stocks Mixed Late Afternoon": 0.0,
  "New Zealand Police Use Appian for Case Processing": 0.0,
  "How AI is helping shoppers find the best Cyber Monday deals: ChicagoLIVE": 0.5,
  "AI: Late 2026 will be inflection point for these hyperscalers": 0.2,
  "Stock market today: Dow, S&P 500, Nasdaq slide as bitcoin tumbles to kick off December": -0.5,
  "XPO Provides North American LTL Operating Data for November 2025": 0.0,
  "Adastra Achieves the AWS Agentic AI Specialization": 0.6,
  "MongoDB, Inc. Announces Third Quarter Fiscal 2026 Financial Results": 0.0,
  "Elon Musk Says These Mag 7 Stocks Not Named Tesla Are Set To Dominate": 0.5,
  "US Equity Markets Close Lower as Treasury Yields Jump": -0.7,
  "Stocks to Watch Monday: Strategy, Coinbase, Airbus, Apple": 0.2,
  "Amazon And Google Unveil New Multicloud Link": 0.5,
  "Does the Latest AI Investment News Signal Opportunity for Meta Platforms Stock?": 0.2,
  "Microchip Technology to Present at the UBS Global Technology and AI Conference 2025": 0.5,
  "Amazon and Google Launches Game-Changing Cloud Alliance": 0.8,
  "XPeng and NIO Stocks Fall. December Is a Critical Month for Sales.": -0.5,
  "U.S. Stocks Close: All Three Major Indices Fall; Alibaba Rises Over 4% - Rough close today Dow down almost 1%, S&P and Nasdaq red too. Felt like the whole market just dragged its feet all day. What caught my eye though was BABA actually showing some life for once, up more than 4%. I haven t seen that stock stretch its legs in a while. Meanwhile AVGO took a hit, and NVDA/AAPL bounced a bit,": -0.4,
  "As Nvidia Bets on Synopsys, Should You Buy, Sell, or Hold NVDA Stock in December 2025?": 0.2,
  "Competition Is Heating Up, But Bank of America Still Thinks AMD Stock Is a Buy Here": 0.6,
  "Top Analyst Reports for Palantir, Philip Morris & TotalEnergies": 0.0,
  "Benchmark Is Bullish on Strategy Even as Stock Plunges Amid Possibility of Selling Bitcoin": 0.5,
  "Salesforce CEO Marc Benioff Just Said Gemini 3 Changed the World. Does That Make GOOGL Stock a Buy?": 0.2,
  "Strategy’s Dollar Reserve Fails to Soothe Bitcoin-Sales Concern": -0.5,
  "National AIDS Memorial Marks World AIDS Day with Two Signature Events Highlighting the Power of Communities to Shape Progress in the Fight Against HIV/AIDS and Advance Health and Social Justice": 0.8,
  "Bitcoin Skids On These Factors. Will Uncertainty Prevail, Or Is It Priced In?": -0.5,
  "These Stocks Moved the Most Today: Synopsys, Nvidia, Strategy, Airbus, Tesla, NIO, Coupang, Barrick Mining, and More": 0.2,
  "Everyone is arguing about ChatGPT vs Gemini, but I think the real battle is happening behind the scenes. - I’ve been looking into this stuff lately and honestly, Google has a totally different advantage that nobody really talks about. They don’t have to buy a mountain of Nvidia chips like OpenAI or Microsoft - they make their own TPUs. Way cheaper for them in the long run. And while OpenAI needs you to sign up": 0.2,
  "Stock Market Today: Indexes End Lower; Moderna Dives On FDA Memo; Synopsys, Nvidia Jump (Live Coverage)": -0.2,
  "Shopify Stock Falls After Cyber Monday Outages": -0.5,
  "Amazon launches 30-minute grocery delivery service in select cities": 0.8,
  "Nvidia Just Bet $2 Billion on Synopsys. Should You Buy SNPS Stock Too?": 0.5,
  "Strategy Barely Bought the Bitcoin Dip.  Its Stock Is Getting Crushed.": -0.7,
  "Wall Street Retreats After 5-Day Winning Streak": -0.5,
  "Nvidia Stock Rises After Synopsys Deal. Here’s the Good—and the Bad.": 0.5,
  "These e-commerce companies are gaining back 'tremendous' share": 0.8,
  "S&P 500 Gains and Losses Today: Moderna Plunges; Synopsys Surges on Nvidia Deal": 0.2,
  "The 12 Worst Stocks of 2025—and the 1 That Could Turn Around": 0.2,
  "Seller Exhaustion or a Bottom? Strategy Gains 11% From Session's Worst Levels": 0.5,
  "Circular Financing Worries Surround Nvidia": -0.5,
  "A Closer Look At What Nvidia’s Numbers Might Be Suggesting - I have been looking at Nvidia again and again, and the numbers have given me the feeling that they are sending mixed signals worth slowing down to think about. The stock has been slipping alongside the broader tech weakness and the movement does not look isolated at all. A 1% to 1.8% decline might seem manageable, but when the entire Nasdaq is softening at": -0.5,
  "Costco Joins Dozens of Businesses Suing Over Trump's Tariffs": -0.5,
  "Tesla Stock Makes a Comeback as the Market Slips": 0.5,
  "Instacart stock falls after Amazon plans ultrafast grocery delivery": -0.7,
  "FlightSafety International Appoints Eric Hinson as Chief Executive Officer": 0.5,
  "Synopsys Just the Latest to Strike a Deal With Nvidia. What It Means for the Stock.": 0.5,
  "How DoorDash’s Expansion and Recent Price Swings Are Shaping Its 2025 Valuation": 0.1,
  "Heard on the Street Recap: Crypto Blues": -0.5,
  "Strategy, the Bitcoin-Buying Company, Raises $1.44 Billion to Weather Crypto Downturn": 0.5,
  "These Stocks Could Join the S&P 500 in Rebalancing": 0.5,
  "John Giannandrea to retire from Apple": -0.5,
  "Costco (COST): Evaluating Valuation After Strong Q4 Sales, Earnings Beat, and Steady Membership Growth": 0.6,
  "Is MercadoLibre Still a Bargain After 17% Jump and Fintech Expansion in 2025?": 0.2,
  "Stocks To Watch As Google Drives Rattled But Rebounding Market": 0.5,
  "UK and US agree zero tariff deal on pharmaceuticals": 0.8,
  "Costco sues the Trump administration, seeking a refund of tariffs": -0.5,
  "Shopify Sees Uptick in Black Friday, Cyber Monday Sales": 0.8,
  "Credo Technology Group Holding Ltd. (CRDO) Surpasses Q2 Earnings and Revenue Estimates": 0.8,
  "Trillion-Dollar Companies Now Go To 11; Google Is No. 3": 0.5,
  "Runway's New Video Model Challenges Rivals Google, OpenAI": 0.2,
  "Netflix Makes Mostly Cash Offer for Warner Bros.": 0.2,
  "Jim Cramer blames ‘vicious’ market sell-off on Japan, MicroStrategy": -0.6,
  "Apple’s artificial intelligence chief is stepping down, company says - Apple’s head of artificial intelligence, John Giannandrea, will step down from his position, the company announced on Monday. The move is the most visible shakeup in Apple’s artificial intelligence group since the company announced Apple Intelligence, its AI software suite, in 2024. Apple Intelligence, which was intended to put Apple alongside AI leaders like OpenAI and Google, has not been well-reviewed by users and critics.": -0.6,
  "Diversify Your Portfolio: These 5 AI ETFs Could Surge 200% by 2030": 0.8,
  "Why Figma Stock Fell 28% in November": -0.6,
  "Here's Why Intuitive Surgical, Inc. (ISRG) Fell More Than Broader Market": -0.5,
  "UMA Launches from Europe to Shape the Global Future of Physical AI": 0.6,
  "Warner Bros gets mostly cash offer from Netflix in new bidding round - Bloomberg": 0.5,
  "Amazon Just Made a Major AI Announcement. Here's What It Means for Investors.": 0.5,
  "Market Chatter: Warner Bros. Discovery Gets Netflix Cash Offer in New Bidding Round": 0.5,
  "Intuit (INTU): A Fresh Look at Valuation After Recent Share Price Movement": 0.5,
  "How the Narrative for Tesla Is Evolving With Shifting Analyst Views and Recent Developments": 0.5,
  "$100 Billion Global AI Infrastructure Partnership Could Be a Game Changer For Brookfield Asset Management (TSX:BAM)": 0.6,
  "Apple's AI chief abruptly steps down": -0.5,
  "Bitcoin Rout Picks Up Steam as Investors Fret Over a New ‘Crypto Winter’": -0.8,
  "2 Tariffic Microcaps To Check Out": 0.5,
  "Apple names Amar Subramanya new VP of AI, replacing John Giannandrea": 0.2,
  "Apple AI chief Giannandrea to step down as company reshuffles leadership": -0.5,
  "2 Stocks That Can Turn $100,000 Into $1 Million by 2035": 0.5,
  "‘Buy Now, Pay Later’ Firms Pressed by States for Loan Details": 0.1,
  "A Retirement Marks Another Chapter in Apple’s AI Reshuffle": 0.1,
  "Stock market today: Dow, S&P 500, Nasdaq futures inch down after stocks, bitcoin get hit to begin December": -0.5,
  "CrowdStrike earnings, auto sales, Fed's Powell: What to Watch": 0.0,
  "What are the next stocks most likely to be added to s and p 500 in Friday rebalancing announcement? - I used to follow more closely but haven’t recently so not sure on best contenders that meet eligibility criteria. But some from prior research were mrvl, vrt, crh, snow, ares, lng, ferg. Sofi and rddt I also saw mentioned somewhere but not sure if they meet all rqts. Vrt I think has a strong case": 0.2,
  "The Dealmaking 3 – Paramount Lands UEFA Media Rights, Sony & ATP Media’s Strategic Partnership, Apple Adds MLS": 0.5,
  "Is it Time to Buy the Dip in CoreWeave Stock?": 0.5,
  "Netflix Makes Majority Cash Bid for Warner Discovery": 0.2,
  "Shopify Breaks Down on Busy Cyber Monday": -0.7,
  "The Social G Co. Unveils New Brand Identity After Securing Comcast RISE Grant and Earning Top Platinum Honors in Digital and Social Media Marketing": 0.8,
  "BMNR upcoming catalyst with upcoming upgrade and utilization of their largest asset. - * BitMine Immersion (BMNR) Announces ETH Holdings Reach 3.73 Million Tokens with Crypto, Cash Holdings, and \"Moonshots\" total $12.1 Billion. BitMine is the 39th most traded stock in the US * The BMNR price often correlates with ETH since it is the largest treasury holder of Ethereum, and ETH is set to undergo its biggest update yet on Wednesday. The ETH price": 0.6,
  "Costco sees shift in member behavior": 0.2,
  "3 Top Stocks to Buy in December": 0.5,
  "Siri-us setback: Apple’s AI chief steps down as company lags behind rivals": -0.7,
  "Intel to invest additional $208 million in Malaysia, PM says": 0.5,
  "Review & Preview: Rally Regrets": -0.5,
  "AI Becomes the Operating Backbone of the Power Sector": 0.5,
  "APAC marketers will increase spending across online video, e-commerce and influencer content in 2026": 0.6,
  "Why The Narrative Around Micron Is Shifting After Recent Analyst and Market Developments": 0.5,
  "Q3 Earnings Season: 3 Companies That Crushed Expectations": 0.8,
  "Trump administration to inject up to $150 million into chip laser startup xLight": 0.5,
  "Peter Schiff Says Michael Saylor Strategy-Bitcoin Model Is 'Fraud' And MSTR Is 'Broken'": -0.8,
  "Apple to Revamp AI Team After Announcing Top Executive’s Departure": -0.5,
  "Better $3 Trillion AI Stock to Buy Now: Microsoft or Alphabet": 0.5,
  "Agoda's Localization Pays Off: Agoda Report Finds Asia's Most Adaptable Hotels Outperform Peers by 59%": 0.6,
  "Tracking the Evolving Google Narrative as AI and Cloud Drive New Growth Signals": 0.5,
  "Cisco Systems (CSCO): Evaluating Valuation Following Earnings Beats and New AI Partnerships": 0.5,
  "Could This AI Infrastructure Stock Become the Nvidia of the 2030s?": 0.8,
  "Exelon Prices Offering of $900 Million of 3.25% Convertible Senior Notes due 2029": 0.2,
  "Samsung’s Next Salvo Against Apple: A Triple-Folding Smartphone": 0.5,
  "Netflix Offers Mostly Cash for Warner Bros. in New Bid Round": 0.2,
  "Dow Jones Futures: Apple, Broadcom, Nvidia, Shopify Are Big Movers; Credo, MongoDB Soar Late": 0.5,
  "Apple AI chief leaving as iPhone maker plays catch-up": -0.5,
  "Prediction: The Data Center Boom Is Just Starting, Making AMD a Long-Term AI Power Player": 0.8,
  "Costco Joins Companies Suing Trump Administration Over Tariffs": -0.5,
  "Should You Buy Nvidia Stock (NVDA) in December?": 0.2,
  "Is Microsoft Stock a Good Buy for 2026?": 0.2,
  "The Pitfalls of Selling Stocks (and How to Avoid Them)": 0.5,
  "Stock market news: Dow, S&P, Nasdaq slip; US big pharma deal with UK, and Bitcoin falters": -0.2,
  "What does it mean when Uncle Sam is one of your biggest shareholders? Chip startup xLight is about to find out": 0.1,
  "Why AMD Stock Fell 15% in November": -0.6,
  "Is Old Dominion Freight Line’s Recent 20% Drop a Chance for Investors in 2025?": 0.2,
  "2 Dividend Stocks to Double Up On Right Now": 0.5,
  "Marvell in advanced talks to buy Celestial AI in multi-billion-dollar deal, The Information says": 0.5,
  "Bank of America resets Broadcom stock price target": 0.0,
  "Does Recent Hospital Expansion Mean Opportunity in Intuitive Surgical Stock for 2025?": 0.2,
  "Warner Bros Discovery gets mostly cash offer from Netflix: source": 0.2,
  "After Missing the NVDA Run, I Coded a Script to Catch the Next Big Mover Early - Quietly developed a Pine Script strategy focused on high-momentum names like NVDA, and the 3-minute chart is showing some wild patterns. While everyone debates if NVDA is overvalued, I’m tracking something more immediate: intraday reversal zones that keep repeating. Tested flags entries when NVDA approaches VWAP after a 1.5% move, combining volume spikes with RSI divergence. So far": 0.6,
  "Nvidia Stock Climbs as AI Deal With HPE Expands Across Europe": 0.8,
  "CrowdStrike Heads Into Earnings With High Expectations and a High Valuation": 0.6,
  "Pre-filled Syringe Presentation of BYOOVIZ®, Samsung Bioepis' Biosimilar to Lucentis (Ranibizumab), Gains European Approval": 0.6,
  "UST Deploys Microsoft 365 Copilot and GitHub Copilot to Accelerate AI-driven Transformation": 0.5,
  "Shop price inflation eases with early Black Friday deals across beauty and electricals": 0.5,
  "Why the state pension tax surprise won’t help everyone": -0.5,
  "Microsoft (MSFT) Cleared by French Watchdog in Qwant Search Engine Dispute": 0.5,
  "Burry Shorts Tesla on Valuation and Musk Pay Plan, Fortune Says": -0.5,
  "BofA Positive on Trane Technologies (TT)": 0.6,
  "Sonesta International Hotels Implements Industry-Leading Cloud Security Through AccuKnox Collaboration": 0.5,
  "BNP Paribas Analysts Have a Positive Outlook on General Dynamics (GD)": 0.8,
  "Honeywell (HON) to Support Major Expansion at Nigeria’s Dangote Refinery by 2028": 0.6,
  "Accord Healthcare Announces Launch of Denosumab∇ - Second Biosimilar in Bone Health": 0.5,
  "Form 8.3": 0.0
}