{
  "Warren Buffett's Berkshire Hathaway Just Exited Its Stake in T-Mobile and Loaded Up on an Artificial Intelligence (AI) Infrastructure Stock That's Risen 7,850% Since Its IPO": 0.8,
  "Capture the World: Agoda Develops a Curated Guide to Picture-Perfect Nature Destinations this World Photography Day": 0.6,
  "DoorDash's planned takeover of Deliveroo to be reviewed under EU's simplified merger procedure": 0.1,
  "Wellness Tourism Market Set to Soar: From $1.00 Trillion in 2024 to $1.68 Trillion by 2033": 0.8,
  "HEINZ Launches Irresistible New Mayonnaise-Style Sauces, Bringing Flavour to Every Bite": 0.8,
  "Tradr Unveils First-to-Market Leveraged ETFs on Lam Research & MongoDB": 0.5,
  "Diamondback Energy, Inc.’s Subsidiary Viper Energy, Inc. Closes Acquisition of Sitio Royalties": 0.5,
  "Viper Energy, Inc., a Subsidiary of Diamondback Energy, Inc., Has Completed Its Acquisition of Sitio Royalties Corp. In All-Equity Transaction": 0.5,
  "CEO pay at top US companies accelerates at fastest pace in four years": 0.5,
  "Oscar Mayer Debuts Hot Dogs for \"EveryBun\" – The First-Ever Pack of Wieners and Plant-Based Hot Dogs": 0.5,
  "Intel’s CEO Draws Support for Revival From SoftBank, Trump": 0.5,
  "This Week In Energy Transition - OCI Energy Sabanci Renewables Partner on Texas Solar Expansion": 0.5,
  "Three Companies That Might Be Priced Below Their Estimated Value": 0.5,
  "High Growth Tech Stocks in the US for August 2025": 0.5,
  "2 Dividend Stocks to Double Up on Right Now": 0.5,
  "Do Wall Street Analysts Like Paychex Stock?": 0.2,
  "Are Wall Street Analysts Bullish on Automatic Data Processing Stock?": 0.5,
  "CMR Surgical hires Chris O’Hara to drive US robot expansion": 0.5,
  "eGenesis Appoints Douglas Williams, Ph.D., and Adam Craig, M.D., Ph.D., to its Board of Directors": 0.5,
  "Synchron Expands Executive Team with Appointment of Andy Rasdal as Chief of Staff and Mark Brister as VP R&D": 0.5,
  "Zipline AI Raises $7M to Build Infrastructure for AI Applications": 0.5,
  "Monster Beverage (NASDAQ:MNST) Knows How To Allocate Capital": 0.6,
  "DoorDash, BHP, Nvidia: Trending Stocks": 0.0,
  "ISRG's International Push for Ion: Strategic Bet or Overstretch?": 0.1,
  "AppLovin Insider Sells $21 Million as Stock Hits Record High": 0.5,
  "Podean and Commerce Canal Join Forces to Create the Largest Independent Global Marketplace Focused Agency": 0.5,
  "Investors Heavily Search Intuitive Surgical, Inc. (ISRG): Here is What You Need to Know": 0.5,
  "Applied Materials, Inc. (AMAT) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Sector Update: Energy Stocks Decline Pre-Bell Tuesday": -0.5,
  "Why Axon Enterprise (AXON) is a Top Stock for the Long-Term": 0.8,
  "Is It Worth Investing in ASML (ASML) Based on Wall Street's Bullish Views?": 0.5,
  "Wall Street Analysts Think Applied Materials (AMAT) Is a Good Investment: Is It?": 0.5,
  "Strategic Partnerships Power Tempus AI's Healthcare Expansion": 0.6,
  "Will EXEL's Share Repurchase Program Boost Value for Investors?": 0.5,
  "Company News for Aug 19, 2025": 0.0,
  "Are You a Value Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Amer Sports, Arm, Nexstar & Tegna: Trending Tickers": 0.0,
  "Oppenheimer hikes estimate for Electronic Arts’ BF6 open beta player base": 0.5,
  "Analysts Boost Profit Estimates On E-Commerce Giant, App Design Name. Both Stocks Are In Buy Zones.": 0.8,
  "Stocks Slightly Lower as Retailer Earnings Arrive": -0.2,
  "Intel Stock Soars After SoftBank’s $2 Billion Investment. Why It’s About More than Money.": 0.8,
  "TSM's Overseas Fabrication Push Ramps Up: Are Margins Sustainable?": 0.2,
  "Stocks Pressured by Weakness in Tech": -0.5,
  "AMAT Stock Trades at a P/E of 16.69X: Should You Buy, Sell or Hold?": 0.2,
  "FTNT vs. QLYS: Which Cybersecurity Stock Deserves Your Investment?": 0.0,
  "Booking.com parent in $9.5 million 'junk fee' settlement with Texas": -0.5,
  "FTNT Rides on Strong Billings Trend: Will the Momentum Sustain?": 0.6,
  "TXN's Top Line Rebounds: Is Semiconductor Recovery the Catalyst?": 0.5,
  "MCE Adds Ex-T-Mobile Executive Aleeta Willcuts to its Advisory Board to Help Redefine Telco Retail-Digital Customer Experience in U.S.": 0.6,
  "China's Pop Mart, maker of the Labubu doll, says profit soars nearly 400% in first half - [https://www.reuters.com/world/china/chinas-pop-mart-maker-labubu-doll-says-profit-soars-nearly-400-first-half-2025-08-19/](https://www.reuters.com/world/china/chinas-pop-mart-maker-labubu-doll-says-profit-soars-nearly-400-first-half-2025-08-19/) SHANGHAI, Aug 19 (Reuters) - China's Pop Mart [(9992.HK), opens new tab](https://www.reuters.com/markets/companies/9992.HK), which has taken the world by storm with its ugly-cute Labubu doll, reported a nearly 400% first-half net profit on Tuesday on high demand for the toys and a shift towards higher-margin overseas [markets.Net](http://markets.Net) profit of 396.5% and a 204.4% jump in revenues exceeded numbers": 0.8,
  "US oil and gas M&A activity quadrupled last year, report says": 0.6,
  "Commerce Secretary Lutnick says Intel has to give government equity in return for CHIPS Act funds - https://www.cnbc.com/2025/08/19/lutnick-intel-stock-chips-trump.html > Commerce Secretary Howard Lutnick said Tuesday that Intel must give the U.S. government an equity stake in the company in return for CHIPS Act funds. > > “We should get an equity stake for our money,” Lutnick said on CNBC’s “Squawk on the Street” Tuesday. “So we’ll deliver the money, which was already committed under the": 0.1,
  "What's Going On With AMD Stock Tuesday?": 0.0,
  "NVDA: Nvidia, Broadcom Lead as Citi Bets on More Upside in Chip Sector": 0.6,
  "Meta is planning to downsize its AI division overall, in latest shake up - https://www.nytimes.com/2025/08/19/technology/mark-zuckerberg-meta-ai.html > > On Tuesday, Meta is expected to announce that it will split its A.I. division - which is known as Meta Superintelligence Labs - into four groups, two people with knowledge of the plans said. One will focus on A.I. research; one on a potentially powerful A.I. called “superintelligence”; another on products; and one on infrastructure such as data": -0.5,
  "Why is pretty much everything going down today? - I've been looking at the stock market today and pretty much everything is going down, mostly starting at the same time. HAG, PLTR, GOOG, RXRX, BA, RDDT, TSM, HOOD, MSTR, WBD, NVDA are just some of the stocks. Is there a specific reason for this?": -0.6,
  "Kraft Heinz (KHC) Expands With New Plant-Based Hot Dogs And Mayo Flavours": 0.5,
  "[Latest] Global Pipeline Safety Market Size/Share Worth USD 17.84 Billion by 2034 at a 8.97% CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trends, Forecast, Segmentation, Growth Rate, Value, SWOT Analysis)": 0.5,
  "Bullish's $1.15B in IPO Proceeds Was Entirely in Stablecoins—A First for Public Market": 0.5,
  "Top Dividend Stocks To Watch In August 2025": 0.5,
  "August 2025's Top Three Stocks That May Be Priced Below Their Estimated Value": 0.5,
  "DASH's Total Orders Growth Momentum Continues: A Sign of More Upside?": 0.6,
  "18 Illinois Communities Receive a Total of $150,000 in Environmental Grants from ComEd, Openlands": 0.5,
  "Comcast to Participate in Goldman Sachs Investor Conference": 0.0,
  "Sector Update: Consumer Stocks Mixed in Late Afternoon Trading": 0.0,
  "Cirrus Logic and GlobalFoundries Expand Strategic Investment to Advance Next-Generation Mixed-Signal Semiconductor Manufacturing in the U.S.": 0.8,
  "SoftBank and Trump may not be enough to save Intel": -0.5,
  "OpenAI’s Sam Altman sees AI bubble forming as industry spending surges - https://www.cnbc.com/2025/08/18/openai-sam-altman-warns-ai-market-is-in-a-bubble.html > “When bubbles happen, smart people get overexcited about a kernel of truth,” Altman told a small group of reporters last week. > > “Are we in a phase where investors as a whole are overexcited about AI? My opinion is yes. Is AI the most important thing to happen in a very long time? My opinion is also yes,” he was": 0.2,
  "Why Lululemon (LULU) Stock Is Down Today": -0.5,
  "Why SoFi (SOFI) Shares Are Getting Obliterated Today": -0.8,
  "REV Group, TPI Composites, AeroVironment, nLIGHT, and Axon Shares Plummet, What You Need To Know": -0.7,
  "Arm Ropes In Amazon AI Executive to Boost Chip Plans": 0.5,
  "Marvell Technology (MRVL) Dips More Than Broader Market: What You Should Know": -0.5,
  "The Actual Reason NASDAQ Dropped Today - MIT Report Finding 95% of AI Projects Fail - [MIT came out with a report that found that 95% of AI initiatives failed to achieve revenue growth or a positive return on investment](https://news.mit.edu/news-clip/fortune-66) The concern is that this study places doubts on the feasibility of future AI investments, which threatens the earnings growth of large tech companies that rely on selling AI hardware, AI cloud capacity, or AI": -0.8,
  "Fortinet (FTNT) Downgraded to Hold: Analyst Warns of Slower Growth Ahead": -0.7,
  "Datadog (DDOG) Set to Cross $3.5B ARR, Says Needham Analyst": 0.6,
  "Why does the market move at seemingly arbitrary times with no real catalyst? Usually on the hour or half hour like 1pm 2pm etc - I’ve seen many time everything is going up and at 1 pm it’ll plunge and then come back up. I’ve seen everything reverse after 3. Usually after you can’t buy 0dtes at 340. Are there people timing it together? It’s not one company it’s usually everything.": -0.5,
  "Autodesk (ADSK) Flow Studio Brings Hollywood-Style AI VFX to More Creators": 0.6,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders 1. At our annual meeting of stockholders held on August 19, 2025, our stockholders elected each of the following individuals to serve on the Board until the next annual meeting of stockholders, or until his or her successor is duly elected and qualified. Nominees Votes For Votes Against Abstentions Broker Non-Votes Ellen L. Barker 433,271,695 17,841,369 376,070 32,580,778 Rick Cassidy 443,160,746 7,951,850 376,538 32,580,778 Matthew": 0.5,
  "(Item 2.02) . Results of Operations and Financial Condition On August 20, 2025, Analog Devices, Inc. (the “Registrant”) announced its financial results for its fiscal third quarter ended August 2, 2025. The full text of the press release issued by the Registrant concerning the foregoing results is furnished herewith as Exhibit 99.1. The information in this\n\n(Item 2.02) and in the accompanying Exhibit 99.1 shall not be incorporated by reference into any filing of the Registrant, whether made before or after the date hereof, regardless of any general incorporation language in such filing, unless expressly incorporated by specific reference to such filing. The information in this\n\n(Item 2.02) , including Exhibit 99.1, shall not be deemed to be “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of that section or Sections 11 and 12(a)(2) of the Securities Act of 1933, as amended.": 0.0,
  "(Item 8.01) . Other Events. On August 18, 2025, Marriott International, Inc. (“we”) entered into a Terms Agreement with Wells Fargo Securities, LLC, PNC Capital Markets LLC, Scotia Capital (USA) Inc., Truist Securities, Inc. and the other Underwriters listed on Schedule I thereto (the “Terms Agreement,” which incorporates by reference the Underwriting Agreement General Terms and Provisions, dated March 3, 2021 (which we previously filed on March 5, 2021 as Exhibit 1.1 to our Current Report on": 0.1,
  "(ITEM 8.01) . OTHER EVENTS. On August 18, 2025, Charter Communications Operating, LLC, a Delaware limited liability company (“CCO”), Charter Communications Operating Capital Corp., a Delaware corporation, CCO Holdings, LLC, a Delaware limited liability company, and the other guarantors party thereto entered into an underwriting agreement (the “Underwriting Agreement”) with Citigroup Global Markets Inc., J.P. Morgan Securities LLC and Morgan Stanley & Co. LLC, as representatives of the several underwriters named in Schedule I thereto, with respect": 0.0,
  "Is Constellation Energy Stock a Buy Now?": 0.2,
  "When analysts state a target price... - When do they think the target price should be reached? Why do they think they stock will move from price X to price Y? Do they mostly tend to use the same criteria, or are some looking at charts while others are looking at cash flow or whatever? Do you put any value on any of their predictions? It seems like the market would know most of what": -0.5,
  "Agoda Travel Swag Now Available on Shopee and Lazada in Thailand": 0.5,
  "Shares of Energy Fuels plunged 18% amid a uranium selloff, with Uranium Energy down 9% and Cameco off 4%. - The slump followed news that Kazakhstan, the world’s top uranium producer, will boost output. KATKO, a JV between France’s Orano (51%) and Kazatomprom ($ KAPq, 49%), plans to raise production at the Moinkum deposit to 4,000 tons annually from 2026, up from \\~2,100 since 2017. The expansion includes a new processing facility at Tortkuduk, launched": -0.6,
  "Data & Business Process Services Stocks Q2 Highlights: CoStar (NASDAQ:CSGP)": 0.5,
  "Truist Financial Lowers PT on Atlassian from $275 to $230, Keeps Buy Rating": 0.2,
  "1 S&P 500 Stock to Consider Right Now and 2 We Find Risky": 0.2,
  "Honeywell’s (HON) Building Automation Drives Upgraded 2025 Revenue Projection": 0.6,
  "2 S&P 500 Stocks to Target This Week and 1 Facing Challenges": 0.2,
  "2 Cash-Producing Stocks with Exciting Potential and 1 We Ignore": 0.6,
  "A New Era of Loyalty Begins: Marriott Bonvoy and Flipkart launch a strategic partnership, opening a world of unrivalled value and experiences for Indian consumers": 0.8,
  "r/Stocks Daily Discussion Wednesday - Aug 20, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.2,
  "3 Steps Ramit Sethi Takes To Save Hundreds per Month": 0.5,
  "What's Wrong With Vertex Pharmaceuticals Stock?": -0.5,
  "AlzeCure Appoints Cecilia Wadell as New Head of Development": 0.5,
  "2 Artificial Intelligence (AI) Growth Stocks Hovering Around 52-Week Lows Even as the Nasdaq Hits New Highs": 0.2,
  "Customer Data Platform (CDP) Case Studies and Market Forecast to 2030 Featuring Orange, Tealium, Teradata, Swedbank, Allergan, Segment, Twilio, Snowflake & More": 0.5,
  "Smart Learning Systems Markets and Competition Analysis 2025-2030: Adoption of AI, Cloud Tech, and Flexible Learning Solutions Shaping the $177.8 Billion Industry": 0.6,
  "DoorDash adds loyalty program for partner restaurants": 0.5,
  "The AI Boom Continues: 3 Top AI Stocks to Buy for the Rest of 2025": 0.6,
  "3 Cheap Stocks Under $100 That Look Like Absolute Steals Right Now": 0.8,
  "3 Dow Jones Dividend Stocks With Above-Average Yields You Can Buy Now and Hold for at Least a Decade": 0.6,
  "With Grand Theft Auto 6 Slated for May 2026, Is Take-Two Interactive Stock a Steal in 2025?": 0.5,
  "Alaska Airlines teams up with T-Mobile to offer ultra-fast, free Wi-Fi to Atmos™ Rewards members": 0.8,
  "Earnings Season Check-In: What to Watch Next With PayPal": 0.5,
  "PayPal, Mesh jump into crypto conversion": 0.5,
  "Copart's Global Reach: How Top Market Presence Fuels Its Durable Duopoly": 0.6,
  "Update: Booking Reaches $9.5 Million Settlement With Texas AG Over 'Junk Fee Practices'": 0.2,
  "Cytokinetics Names Jim Daly to Board of Directors": 0.5,
  "Lightwave Logic, Inc. Announces Appointment of Dr. Sundar Ramamurthy to Technical Advisory Board": 0.5,
  "The Quantum Computing Race Is On: These 2 Stocks Appear Poised to Lead": 0.5,
  "AI Chips Update - Metasurface Tech Revolutionizes Biometrics With Metalenz Innovations": 0.6,
  "3 Crypto-Centric Stocks to Grab Before the Next Bitcoin Rally": 0.5,
  "BTS and clients recognized with 59 Brandon Hall Group Excellence Awards in 2025": 0.5,
  "CDW to Participate in the Citi 2025 Global TMT Conference": 0.0,
  "Zscaler and CrowdStrike Expand Partnership to Strengthen AI-Driven Security Operations": 0.6,
  "Investing in Cadence Design Systems (NASDAQ:CDNS) five years ago would have delivered you a 212% gain": 0.8,
  "Exelon Corporation (NASDAQ:EXC) is largely controlled by institutional shareholders who own 87% of the company": 0.1,
  "HONEYWELL ACQUIRES SPARKMETER'S DATA PLATFORM AND SOFTWARE TECHNOLOGIES TO STRENGTHEN ITS PORTFOLIO OF UTILITY SOLUTIONS": 0.5,
  "Dow Jones Futures: Palantir, Oracle, Other Growth Leaders Keep Falling; What To Do Now": -0.5,
  "Does The Trade Desk (TTD) Have a Substantial Runway For Future Growth?": 0.5,
  "Consumer Strength Signal Flashing Short-Term Caution Sign": -0.5,
  "A Nuclear Showdown: OKLO's Bold Vision vs. CEG's Proven Power": 0.5,
  "If You Buy O'Reilly Automotive With $10,000 in 2025, Will You Become a Millionaire in 10 Years?": 0.2,
  "G2 Diesel Products Launches Direct-to-Consumer Sales of Premium Remanufactured Diesel Injectors": 0.5,
  "Think I’m gonna sell half of my SOXX for some BATT - Brand new to this, have been lurking here and keeping up with yahoo finance, chatgpt, friends who know more than me, etc. I have very very little in anything rn, just hoping to contribute $5k each year (insert laugh track), really just trying to learn and hoping for my money to grow. Portfolio is roughly: 60% FXAIX 25% SOXX 5% ASML 5% GOOGL": 0.5,
  "O’Reilly to Host Second AI Codecon on Coding for the Agentic World": 0.2,
  "It's a 10 Haircare Appoints Ulta Beauty Veteran Ashley Schauer as Vice President of Sales & Marketing to Accelerate Retail & Professional Distribution Growth": 0.8,
  "Fortinet Connects Tepper Sports & Entertainment Teams with Unified SASE Solution": 0.5,
  "Warner Bros. Discovery Announces Conference Participation for the Month of September": 0.1,
  "Exclusive Networks North America Strengthens its Services Business, Adding Justin Crotty as VP of Services and GM of Cloudrise": 0.6,
  "HONEYWELL ANNOUNCES PARTICIPATION AT UPCOMING INVESTOR CONFERENCES": 0.0,
  "Investors Heavily Search Synopsys, Inc. (SNPS): Here is What You Need to Know": 0.5,
  "Is Trending Stock ASML Holding N.V. (ASML) a Buy Now?": 0.2,
  "Axon Enterprise, Inc (AXON) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Is Baker Hughes Company (NASDAQ:BKR) Trading At A 27% Discount?": 0.1,
  "LRN Corporation Wins Seven Brandon Hall Group Awards": 0.5,
  "Mountaingate Capital Partners with Podean and Commerce Canal to Form the Largest Independent Global Marketplace Focused Agency": 0.5,
  "Nu double upgraded, Novavax downgraded: Wall Street's top analyst calls": -0.5,
  "Why Lam Research (LRCX) is a Top Growth Stock for the Long-Term": 0.8,
  "Airbnb Investors Once Counted Easy Profits. Now One Says, 'Last Year, It Paid For Itself And Made Us $8k—This Year We're $6k In The Hole'": -0.6,
  "Are You a Momentum Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Does Mondelez International (NASDAQ:MDLZ) Have A Healthy Balance Sheet?": 0.5,
  "Tech Weakness and Negative Corporate News Weigh on Stocks": -0.7,
  "Trump buys more than $100 million in bonds since inauguration, disclosure shows": 0.5,
  "Honeywell's Industrial Automation Unit Hit by Weak Sales: Recovery Ahead?": -0.5,
  "Why Target's new CEO won't have a honeymoon period: Opening Bid top takeaway": 0.1,
  "Paychex Fiscal Q1 Earnings Expected To Top Forecasts, RBC Says": 0.6,
  "SPECTRUM MOBILE LAUNCHES REPAIR AND REPLACEMENT PREMIUM": 0.2,
  "Signos Unveils First Ever FDA-Cleared Glucose Monitoring Breakthrough for Weight Management, Enabling Millions of Americans to Take Control of Their Health": 0.8,
  "Trump is pressuring yet another top Fed official to resign - https://www.cnn.com/2025/08/20/economy/trump-pushes-for-fed-governor-lisa-cook-resignation > President Donald Trump on Wednesday called on a top policymaker at the Federal Reserve to resign, after one of his allies alleged that she committed mortgage fraud. In a letter dated August 15, Federal Housing Finance Agency director Bill Pulte urged the Justice Department to investigate a pair of mortgages taken out in recent years by Fed Governor Lisa Cook. On Wednesday,": -0.8,
  "Where can I get historical price target data? - For weeks now I've been fiddling with a personal project, but I keep hitting a major roadblock: nowhere has the data I need. Does anyone know where I can buy (API access to) recommendations (buy/sell/hold) and price targets for stocks, INCLUDING HISTORICAL data? I was about to buy two separate subscriptions on finnhub until I noticed that the price targets aren't historical, only current snapshots -": -0.6,
  "Stock Losses Accelerate on a Rout in Tech Stocks": -0.8,
  "PepsiCo vs. Keurig: Which Beverage Giant Is a Refreshing Pick?": 0.5,
  "EYLEA HD® (aflibercept) Injection 8 mg Applications for Expanded U.S. Label and Prefilled Syringe Receive FDA Review Period Extension": 0.1,
  "Will Headwinds Derail Trade Desk's Double-Digit Growth Trajectory?": 0.1,
  "GEHC Positioned for Growth With AI, Global Expansion and Margins": 0.8,
  "DexCom Expands Access and Innovation While Balancing Headwinds": 0.5,
  "What's after the AI/Tech bubble? Where do you think the big money will flow next? - What the title says. I think at some point we'll get a correction, smart money that made a fortune from money being pumped into tech & AI will trim or sell their positions and will be positioning somewhere else. Which sector(s) do you think will attract money flows next? Any good stories on your radar?": 0.2,
  "AI anxiety has sent markets into a tizzy, but experts say the jitters will only ‘punish those chasing the froth’": 0.2,
  "ComEd Urges Customers to Take Advantage of ComEd Bill-Support Options Available Amid Peak Energy Usage Season": 0.5,
  "Why Is NXP (NXPI) Up 0.6% Since Last Earnings Report?": 0.2,
  "Roper Technologies (ROP) Down 5.5% Since Last Earnings Report: Can It Rebound?": -0.5,
  "AI Is Ushering in a ‘Power Revolution.’ Buy These 5 Energy Stocks, Melius Says.": 0.5,
  "Adobe's AI-Powered Portfolio Gaining Traction: What's Ahead?": 0.6,
  "Intuit Q4 Earnings Preview: Should You Buy the Stock Now or Wait?": 0.5,
  "Why Is Wall Street So Bearish on Lululemon? There's 1 Key Reason.": -0.5,
  "T-Mobile to Host Q3 2025 Earnings Call on October 23, 2025": 0.0,
  "Crest Data Launches a Migration Acceleration Service for Datadog": 0.5,
  "Google debuts Pixel Watch 4 with domed display, emergency satellite communication": 0.5,
  "Analog Devices Stock Gains as Earnings Bring Hope for ‘True Recovery’": 0.8,
  "Sony hikes PlayStation 5 prices in US as tariff uncertainty weighs": -0.6,
  "Qualcomm primed for long-awaited driver-assistance debut with BMW at IAA Mobility showcase": 0.6,
  "SoFi makes history as the first US Bank to utilize Blockchain for cross-border money transfers. - Fintech Bank SoFi has partnered with Lightspark to power blockchain-enabled international money transfers set for launch later this year. Starting with remittance to Mexico. It involves real-time conversion of US dollars into Bitcoin. The fund is then transferred via the Bitcoin Lightning Network to the destination and converted back to the local currency. Money can be transferred instantly at": 0.8,
  "Trump buys more than $100 million in bonds in office, disclosure shows": 0.2,
  "Why Food Stocks Might Be Cooked": -0.5,
  "Marvell Technology, Angi, Peloton, Amplitude, and Duolingo Shares Plummet, What You Need To Know": -0.7,
  "Google’s Pixel 10 Lineup Lands at T-Mobile with Early Access to T-Satellite Ready Google Apps": 0.5,
  "TI Chief Financial Officer Rafael Lizardi to speak at Citi investor conference": 0.2,
  "As Marvell Stock Price Drops, This Bearish Trade Makes Sense": -0.6,
  "Avis Budget Group, Option Care Health, C3.ai, The RealReal, and DoorDash Shares Plummet, What You Need To Know": -0.7,
  "Sector Update: Tech Stocks Decline Late Afternoon": -0.5,
  "Tech stock selloff from misinterpretation of Sam Altman's AI Bubble comments - *Ignore any downvotes. This post is for long-term investors that want to profit from the AI era:* We are in another DeepSeek like Tech stock selloff (remember Feb'25) because of misinterpretation of Sam Altman's AI bubble comments: **SOURCE (from Sam Altman's interview with The Verge):** [https://www.theverge.com/command-line-newsletter/759897/sam-altman-chatgpt-openai-social-media-google-chrome-interview](https://www.theverge.com/command-line-newsletter/759897/sam-altman-chatgpt-openai-social-media-google-chrome-interview) >ChatGPT has roughly quadrupled its user base in a year and is now reaching over 700 million": 0.2,
  "Vertex to Participate in Upcoming September Investor Conferences": 0.0,
  "Billionaire Paul Singer Just Sold This Chip Stock. Should You?": 0.2,
  "Lam Research Corporation Announces Participation at Upcoming Conferences": 0.0,
  "Datadog for Government Achieves 'In Process' Authorization for GovRAMP High": 0.6,
  "Gilead Sciences to Present at Upcoming Investor Conferences": 0.0,
  "Cadence to Present at Deutsche Bank Technology Conference": 0.0,
  "Figma Stock Gets Buy Rating After Post-IPO Swoon": 0.6,
  "From $4,500 Per Episode On SNL To A $200 Million Net Worth — Eddie Murphy Reveals Why He Walked Away From 'Rush Hour'": 0.5,
  "Exclusive-CVS holds off adding Gilead’s new HIV prevention shot to drug coverage lists": -0.5,
  "/C O R R E C T I O N -- Skylo/": 0.0,
  "Trump Embarks on $104 Million Bond-Buying Spree in Office": -0.7,
  "S&P 500 Gains and Losses Today: Intel Stock Retreats; Analog Devices Jumps After Strong Earnings": 0.5,
  "FDA Pushes Back Eylea HD Review; Regeneron Still Gains": 0.5,
  "Nvidia Circles Quantum Giant Quantinuum in $10B Power Play": 0.5,
  "What happened at Target? And what now? A veteran trader and analysts weigh in": 0.2,
  "US Senator Sanders favors Trump plan to take stake in Intel, others - Liberal U.S. Senator Bernie Sanders on Wednesday threw his support behind President Donald Trump's plan to convert U.S. grants to chipmakers, including $10.9 billion for Intel, into government stakes in the companies. \"If microchip companies make a profit from the generous grants they receive from the federal government, the taxpayers of America have a right to a reasonable return on that investment,\"": 0.5,
  "Arm (ARM) Expands Into Chipmaking With Key Amazon Hire": 0.5,
  "Marvell (MRVL) Stock in Focus as Microsoft Selects LiquidSecurity for Azure Cloud HSM": 0.6,
  "M&A Frenzy Reshapes U.S. Oil Patch Into 40 Power Players": 0.5,
  "(ITEM 2.02) RESULTS OF OPERATIONS AND FINANCIAL CONDITION. On August 21, 2025, Intuit Inc. announced its financial results for the fiscal quarter and year ended July 31, 2025 and provided forward-looking guidance. A copy of the press release is attached to this Report as Exhibit 99.01. The information in this Report and the exhibit attached hereto shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange\n\n(ITEM 8.01) OTHER EVENTS. On August 21, 2025, Intuit also announced that its Board of Directors approved a cash dividend of $1.20 per share. The cash dividend will be paid on October 17, 2025 to shareholders of record as of the close of business on October 9, 2025. Future declarations of dividends and the establishment of future record dates and payment dates are subject to the final determination of the Intuit Board of Directors. A copy of": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On August 21, 2025, the Company issued a press release regarding the Company’s financial results for its fiscal quarter ended August 2, 2025. The full text of the Company’s press release is attached hereto as Exhibit 99.1. The information furnished with this\n\n(Item 2.02) , including Exhibit 99.1, shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), nor shall it be deemed incorporated by reference into any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as expressly set forth by specific reference in such a filing.": 0.0,
  "(Item 1.01) Entry into a Material Definitive Agreement. On August 15, 2025, Verisk Analytics, Inc. (the “Company”) entered into (i) a Term Credit Agreement (the “Term Credit Agreement”) among the Company, the lenders party thereto, and Bank of America, N.A., as administrative agent, and (ii) the Third Amended and Restated Credit Agreement (the “Third A&R Credit Agreement” and, together with the Term Credit Agreement, the “Credit Agreements”) among the Company, the borrowing subsidiaries from time to time\n\n(Item 1.01) of this Current Report on Form 8-K with respect to the Credit Agreements is incorporated by reference into this\n\n(Item 8.01) Other Events. On August 7, 2025, the Company entered into an Underwriting Agreement (the “Underwriting Agreement”) by and among the Company and Goldman Sachs & Co. LLC, BofA Securities, Inc. and Wells Fargo Securities, LLC as representatives of the underwriters named therein (the “Underwriters”), pursuant to which the Company agreed to sell to the Underwriters $750,000,000 aggregate principal amount of its 4.500% Senior Notes due 2030 (the “2030 Notes”) and $750,000,000 aggregate principal amount of": 0.1,
  "(Item 8.01) – Other Events On August 21, 2025, Workday, Inc. (“Workday”) entered into a definitive agreement (the “Agreement”) by and among Workday, Paradox, Inc. (“Paradox”), and certain other parties thereto. Pursuant to the Agreement, Workday will, subject to the satisfaction of certain conditions and receipt of required regulatory approvals, acquire all of the outstanding capital stock of Paradox. A copy of the press release announcing the entering into of the Agreement is attached hereto as Exhibit": 0.1,
  "(Item 2.02) – Results of Operations and Financial Condition On August 21, 2025, Workday, Inc. (“Workday”) issued a press release announcing its results for its fiscal quarter ended July 31, 2025. A copy of the press release is attached as Exhibit 99.1 to this current report on Form 8-K and is incorporated by reference herein. Workday uses its blogs.workday.com website as a means of disclosing material non-public information and for complying with its disclosure obligations under Regulation": 0.0,
  "If you spot a bubble, where do you go from there? - I've seen the AI craze come to life and peak in the past few years. But I have this conviction that LLMs have been massively oversold. In my opinion, and the opinion of many experts in the field, they have fundamental and serious limitations. AI companies have been allocated way too much capital, and there's no way this matches the value of their": -0.6,
  "Meta freezes AI hiring after spending spree - As per WSJ https://www.wsj.com/tech/ai/meta-ai-hiring-freeze-fda6b3c4 With the sell offs the past two days, I wonder how this news will affect the markets, if anything. Also considering the chatgpt-5 issues, Sam Altman comments regarding AI, and with the feds speaking on Friday. I wonder how the market would be the next few days.": -0.2,
  "Design Software Stocks Q2 In Review: Adobe (NASDAQ:ADBE) Vs Peers": 0.2,
  "Jim Cramer on ASML: “I’m Concerned About the Stock”": -0.6,
  "Jim Cramer Discusses Competition Faced by Adobe": 0.1,
  "Jim Cramer Believes “TE Connectivity is an Excellent Company”": 0.8,
  "Morgan Stanley Remains Bullish on Adobe (ADBE)": 0.8,
  "Baird Lifts PT on Intuitive Surgical (ISRG) to $600 From $590, Keeps an Outperform Rating": 0.6,
  "Bernstein Maintains a Buy Rating on Applied Materials (AMAT), Sets a $195 PT": 0.8,
  "RBC Capital Remains a Buy on Autodesk (ADSK)": 0.5,
  "Wellness and Walkability Shape European Travel Preferences, Agoda Advises Hoteliers": 0.5,
  "2 Reasons to Like ISRG (and 1 Not So Much)": 0.5,
  "Constellation Energy’s (CEG) Q2 Results Top Estimates on Strong Energy Demand": 0.8,
  "3 High-Flying Stocks We Keep Off Our Radar": -0.5,
  "5 Must-Read Analyst Questions From Applied Materials’s Q2 Earnings Call": 0.2,
  "ADI Q2 Deep Dive: Industrial Automation and Robotics Lead Broad-Based Recovery": 0.6,
  "Form 8.3 - Qualcomm Incorporated": 0.0,
  "Autonomous driving stock, what's your choice? - Honestly, if I had to narrow it down, my top pick right now is WeRide. Tesla? gets all the hype with its robotaxi service in Austin, but I'm betting heavier on WRD. NVIDIA's fav son. After they pulled in big investments, deals just started stacking, Uber, Grab, and others rolling out thousands of robotaxis with them. Muli millions USD investment and the numbers are finally looking strong. Their": 0.6,
  "Analog Devices Inc (ADI) Q3 2025 Earnings Call Highlights: Strong Revenue Growth Amidst Challenges": 0.8,
  "Lululemon Athletica Stock Outlook: Is Wall Street Bullish or Bearish?": 0.1,
  "CoStar Group Stock: Analyst Estimates & Ratings": 0.0,
  "Palo Alto Shares Jump on Strong Outlook. Can the Momentum in the Stock Continue?": 0.6,
  "Disney's new ESPN streaming service has arrived, ushering in new era for sports and the cable bundle": 0.6,
  "What Are the 3 Top Artificial Intelligence (AI) Stocks to Buy Right Now?": 0.5,
  "Biogen Stock: Analyst Estimates & Ratings": 0.0,
  "J&J to invest $2 billion to boost US manufacturing as drug tariffs loom": 0.5,
  "DoorDash announces commerce platform expansion with new tools": 0.5,
  "Are Wall Street Analysts Bullish on Verisk Stock?": 0.5,
  "Amazon’s Big Bet on Groceries Isn’t a Knockout Blow for Rivals": 0.2,
  "r/Stocks Daily Discussion & Options Trading Thursday - Aug 21, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why": 0.2,
  "Travel Tech Association CEO talks major tourism events, hotel legislation": 0.5,
  "SINGZYME WINS 2025 AMGEN X NSG GOLDEN TICKET FOR BREAKTHROUGH BIOCONJUGATION PLATFORM": 0.8,
  "1 S&P 500 Stock to Keep an Eye On and 2 Facing Challenges": 0.2,
  "2 Profitable Stocks Worth Investigating and 1 We Ignore": 0.2,
  "Starbucks’ CEO is ditching a merit system and giving all salaried staff a flat 2% pay raise instead": 0.2,
  "Does Microchip Technology's (MCHP) Conservative Forecast Reveal a Shift in Its Margin Priorities?": 0.1,
  "Does Diamondback Energy Offer Opportunity After Year-To-Date Drop and $26B Endeavor Deal?": 0.5,
  "lululemon athletica inc. Announces Second Quarter Fiscal 2025 Earnings Conference Call": 0.0,
  "What tariffs on Brazilian coffee mean for Starbucks & Dutch Bros": 0.0,
  "DexCom (NASDAQ:DXCM) Shareholders Will Want The ROCE Trajectory To Continue": 0.5,
  "Market Chatter: CVS Health Won't Cover Gilead's New HIV Prevention Drug Yet": -0.5,
  "The Ultimate Growth Stocks to Buy With $1,000 Right Now": 0.8,
  "ADP to Present at Upcoming Investor Conference": 0.0,
  "Why investors should buy Amphenol & avoid Vertex Pharmaceuticals": -0.5,
  "Edgewater Wireless CEO to join \"Catalysts of Innovation\" Event in Silicon Valley": 0.5,
  "CEOs at America’s 100 largest low-wage employers are paid 632 times as much as the average worker, study finds": -0.8,
  "Take-Two Interactive Software Stock: Analyst Estimates & Ratings": 0.0,
  "Novo’s facility issues delay FDA decisions on Regeneron’s Eylea HD": -0.5,
  "Applied Materials to Participate in Upcoming Investor Conferences": 0.0,
  "Energy Transition Today - Green Hydrogen Growth Driven By Global Sustainability Trends": 0.8,
  "Gilead dives into ‘in vivo’ cell therapy with $350M buyout of Interius": 0.5,
  "Cognizant's \"Vibe Coding\" Event Sets GUINNESS WORLD RECORDS™ Title": 0.6,
  "GE HealthCare management to present at upcoming investor conferences": 0.5,
  "There Are Reasons To Feel Uneasy About Texas Instruments' (NASDAQ:TXN) Returns On Capital": -0.6,
  "Cognizant, Temenos team up for core banking solutions in Australia": 0.5,
  "5 Things You’re Buying That Are Stopping You From Getting Rich, According to Financial Advisors": -0.5,
  "A Rise In Surgical Robotics Could Send These 2 Healthcare Stocks Soaring": 0.8,
  "Hazeltree Shortside Crowdedness Report Reveals Uptick in Tech Shorts and Record-High Utilization in APAC and EMEA": 0.5,
  "Kite to Acquire Interius BioTherapeutics to Advance In Vivo Platform": 0.5,
  "Walmart hikes sales and earnings outlook even as it says tariff costs are rising - Walmart on Thursday raised its full-year earnings and sales outlook as its online business posted another quarter of double-digit gains, even as the company said costs are rising from higher tariffs. The big-box retailer topped Wall Street’s quarterly sales estimates but fell short of earnings expectations, the first time it missed on quarterly earnings since May 2022. The company said": 0.2,
  "Cadence Design Stock: Analyst Estimates & Ratings": 0.0,
  "Latest News In E-Commerce - Generative AI Revolutionizing Retail With Immersive Shopping Experiences": 0.8,
  "Gilead stock falls after CVS holds off adding HIV prevention shot to plans": -0.6,
  "Thoma Bravo Adds Dayforce To Growing Software Portfolio In $12 Billion Deal": 0.8,
  "Nestlé lauds new cocoa harvesting technique designed to cut waste": 0.8,
  "Cintas Corporation Recognized as One of Selling Power’s 60 Best Companies to Sell For in 2025": 0.8,
  "2 Growth Stocks to Buy and Hold Forever": 0.5,
  "How to Find Strong Computer and Technology Stocks Slated for Positive Earnings Surprises": 0.8,
  "Booking Holdings Inc. (BKNG) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Here is What to Know Beyond Why Airbnb, Inc. (ABNB) is a Trending Stock": 0.2,
  "Can J&J Navigate Stelara, Talc Suits, Tariff & Other Headwinds?": -0.5,
  "What Makes Lam Research (LRCX) a Good Long-Term Buy?": 0.8,
  "Update: Market Chatter: CVS Health Won't Cover Gilead's New HIV Prevention Drug Yet": -0.5,
  "Should You Hold Diamondback Energy (FANG) for the Long Term?": 0.2,
  "Stock Market News for Aug 21, 2025": 0.0,
  "Company News for Aug 21, 2025": 0.0,
  "Physical Security Market Surges to $151.50 billion by 2030 - Dominated by Johnson Controls (Ireland), Bosch Building Technologies (Germany), Honeywell (US)": 0.5,
  "Wall Street Bulls Look Optimistic About Synopsys (SNPS): Should You Buy?": 0.8,
  "Can CEG's Diverse Power Generation Portfolio Aid Profitability?": 0.2,
  "CoreWeave upgraded, Instacart downgraded: Wall Street's top analyst calls": 0.2,
  "Viper Energy Closes Sitio Deal, Raises Q3 Production Outlook": 0.5,
  "Is Backblaze (BLZE) Stock Outpacing Its Computer and Technology Peers This Year?": 0.5,
  "Multiple Catalysts Prompted Artisan Value Fund to Add ASML Holding N.V. (ASML) to Its Portfolio": 0.5,
  "CRUS, GlobalFoundries Deepen Alliance on Next-Gen Chip Technologies": 0.5,
  "Demand Uptick Lifted Booking Holdings (BKNG) in Q2": 0.5,
  "Are Options Traders Betting on a Big Move in Old Dominion Stock?": 0.2,
  "Here's Why Lam Research (LRCX) is a Strong Momentum Stock": 0.6,
  "FDA Extends Review Period of REGN's Submission for Eylea HD": 0.1,
  "Bears are Losing Control Over AppLovin (APP), Here's Why It's a 'Buy' Now": 0.6,
  "LinkSquares Appoints Kellie Snyder as Chief Customer Officer": 0.5,
  "Attack Surface Management Market Surges to $3.3 billion by 2029 - Dominated by Palo Alto Networks (US), IBM(US), Microsoft (US)": 0.5,
  "Forget pumpkin spice: Starbucks has a new focus on health—and protein": 0.5,
  "Autodesk (ADSK) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "Michael Burry Is Betting Big on Lululemon Stock. Should You?": 0.5,
  "Are Wall Street Analysts Predicting Autodesk Stock Will Climb or Sink?": 0.2,
  "Is there any value left in Nasdaq?": -0.2,
  "ASTS vs. QCOM: Which Connectivity Stock Has Better Growth Potential?": 0.5,
  "Stocks Pressured by Weak Walmart Earnings and Higher Bond Yields": -0.7,
  "Lam Research Stock Trades at Low P/E: Should You Buy, Sell or Hold?": 0.5,
  "PANW Bets on Prevention-First ASPM: Will it Drive Platform Adoption?": 0.2,
  "Red River Appoints David Raffetto as Senior Vice President and General Manager of Technology Solutions": 0.5,
  "Here’s what Wall Street experts are saying about Walmart ahead of earnings": 0.2,
  "Dayforce to Be Taken Private by Thoma Bravo in Buyout Deal Valued at $12.3 Billion": 0.5,
  "Real Authentication Helps Consumers Recover Funds Lost to Counterfeit Luxury Goods": 0.6,
  "Instacart Facing 'Increased Competition' from Amazon's Same-Day Grocery Delivery, Wedbush Says": -0.5,
  "Polaris Pharmacy Services Named Exclusive U.S. Distributor of AstraZeneca’s FluMist® Home Service—The World’s First At-Home Nasal Spray Flu Vaccine": 0.8,
  "Ascensus Names Jeri Hawthorne Chief Human Resources Officer": 0.5,
  "HPU Graduates to Learn From the CEOs of Three Global Brands During Commencement Ceremonies": 0.8,
  "Coty, Gilead Sciences, Rent the Runway: Trending tickers": 0.0,
  "CRISPR Therapeutics Gains 41.4% in 3 Months: How to Play the Stock": 0.6,
  "Analysts Intuitive Surgical (ISRG) Boost Price Target on Da Vinci 5 Launch": 0.6,
  "Why Gilead Sciences (GILD) Shares Are Sliding Today": -0.5,
  "TXN vs. ADI: Which Stock Has an Edge in the Analog Signal Processing?": 0.1,
  "Amazon Makes A Big Grocery Splash. Will It Be Enough To Erase Walmart's Lead?": 0.5,
  "Why Is Baker Hughes (BKR) Down 4.1% Since Last Earnings Report?": -0.5,
  "Why Is CoStar (CSGP) Down 3% Since Last Earnings Report?": -0.5,
  "Why Is Paccar (PCAR) Down 2.9% Since Last Earnings Report?": -0.5,
  "Texas Instruments (TXN) Up 7.8% Since Last Earnings Report: Can It Continue?": 0.5,
  "Will Credo's Strong Cash Position Aid in Capturing AI Opportunities?": 0.5,
  "SIEGY vs. FAST: Which Stock Is the Better Value Option?": 0.2,
  "OpenAI may soon be the most valuable private company—but Sam Altman’s net worth won’t jolt, as the CEO holds no equity and makes just $76,001 a year": -0.5,
  "My Trust Owns Cisco Systems, Inc. (CSCO), Says Jim Cramer": 0.5,
  "Palo Alto Networks, Inc. (PANW)’s Share Price Weakness Is A “Buying Opportunity,” Says Jim Cramer": 0.8,
  "J&J signs $2bn incumbency deal at CDMO Fujifilm’s new hub": 0.5,
  "AppLovin's AI Technology Drives Explosive Revenue Growth in 2025": 0.8,
  "Trump says U.S. will not approve solar or wind power projects - https://www.cnbc.com/2025/08/20/trump-says-us-will-not-approve-solar-or-wind-power-projects.html > President Donald Trump on Wednesday said his administration will not approve solar or wind power projects, even as electricity demand is outpacing the supply in some parts of the U.S. > > “We will not approve wind or farmer destroying Solar,” Trump, who has complained in the past that solar takes up too much land, posted on Truth Social. “The days": -0.8,
  "Rokid Sets Stage for AI Glasses Launch in New York": 0.5,
  "Gilead Needs Insurers to Cover New HIV Prevention Shot. CVS Isn’t Paying.": -0.5,
  "Steve Jobs didn’t actually become a billionaire thanks to leading Apple—but rather from his work with a film company he bought off George Lucas": 0.2,
  "Analog Devices (ADI) Soars as Earnings Impress": 0.8,
  "Analog Devices Positioned to Continue Outperforming, Morgan Stanley Says": 0.8,
  "[Latest] Global Biologics and Biosimilars Market Size/Share Worth USD 1,320.19 Billion by 2034 at a 10.42% CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trends, Forecast, Segmentation, Growth Rate, Value, SWOT Analysis)": 0.5,
  "FanDuel Sports Network Extends Carriage Agreement with Comcast": 0.5,
  "Honeywell vs. 3M: Which Industrial Conglomerate Stock Should You Bet On?": 0.2,
  "Starbucks launches coconut water beverages as part of health and wellness drive": 0.5,
  "Trump’s Slashes to Renewables Will Send $CVX, $OXY, and $BE to the Moon - Yesterday, Trump announced that the US will not approve solar or wind power projects moving forward. This in and of itself may sound as bullish news for the oil, gas, and coal industries as money rotates into these sectors from renewables, but my bull case for stocks in the power industry has more to do with the direction of AI advancement": 0.6,
  "Analog Devices Unlocks New Growth Engines In AI, Aerospace, And Robotics": 0.8,
  "Apple boosts subscription price for TV+ to $12.99": -0.5,
  "FTC Chair warns tech firms not to weaken data privacy to comply with EU, UK laws - FTC Chairman Andrew Ferguson warned companies like Apple, Google, Amazon, Microsoft, and Meta that **complying with EU and UK digital laws** could **violate U.S. law** if it weakens privacy protections for American users. European regulations aim to control harmful content, but may require measures like **backdoors in encrypted systems**, which U.S. authorities oppose. The Trump administration is pressuring": -0.5,
  "FVRR is insanely cheap - FVRR Stock is at $22 and has almost $20 cash on hand per share. Forward PE is only 8. Completely irrational and overblown ai competition fear. This company is a focal point (connecting the avg joe and ai) benefiting from ai and its boosting earnings. Earnings expected to grow by over 20% next year and has never had a year of negative revenue growth. It’s currently buying back over 10%": 0.8,
  "Verizon vs. AT&T: Which Telecom Stock Has More Upside Potential?": 0.5,
  "Adobe: Gen AI Shopping Traffic Sees 4,700% Uptick in July": 0.8,
  "Sephora’s Former CEO Is Joining Ulta Beauty’s Board": 0.5,
  "GPT5 was the AI canary in the coal mine - we are rounding the top of the diminishing return curve - OpenAI is one of the leaders in the AI space right now with the top two or three models currently available for the last 5-6 years. GPT 5 was just released and though it typically scores on the top of benchmarks, [this is only for the top model. This is also after working on": 0.2,
  "Netflix's APAC Focus Boosts Prospects: Will the Momentum Continue?": 0.6,
  "Cantor Fitzgerald Maintains ‘Neutral’ Rating on Fortinet, Inc. (FTNT) With $87 PT": 0.1,
  "Alphabet (GOOGL) Unveils New Pixel 10 Series with T-Satellite Connectivity and AI Features": 0.6,
  "T-Mobile US (TMUS) Launches New Pixel Lineup With Starlink Connectivity And Exclusive Offers": 0.5,
  "SHOP's Subscriptions Solutions Gain Momentum: A Sign of More Upside?": 0.6,
  "Acquisitions Drive Oil Output Surge, Strengthening Outlook for Viper Energy": 0.6,
  "Shopify (SHOP) Powers BARK's Enhanced Subscription Platform With Ordergroove Integration": 0.5,
  "Affirm's Repeat Users: A Strong Signal for Sustainable BNPL Growth?": 0.5,
  "Trump goes on $100 million bond-buying spree: Here’s what it could signal about future interest rates": 0.2,
  "Why CSX Needs a ‘Kick in the Pants’—and What It Means for the Stock": 0.2,
  "Box, Intuitive Surgical, and Surgery Partners Stocks Trade Down, What You Need To Know": -0.2,
  "Mag 7 AI deals are creating zombie startups: ‘You hollowed out the organization’ - https://www.cnbc.com/2025/08/19/how-ai-zombie-deals-work-meta-google.html > Jeff Wang got a big promotion last month. There were lots of tears, but not the happy kind. The 39-year-old was unexpectedly named interim CEO of artificial intelligence coding startup Windsurf. The company had been in discussions with OpenAI about a potential acquisition that would have resulted in a handsome payday for many employees. But the talks fell apart": -0.6,
  "Got $5,000? 3 Tech Stocks to Buy and Hold for the Long Term": 0.5,
  "NBCUniversal and MLB Nearing 3-Year Deal Approaching $600 Million": 0.5,
  "Trump to Tap Airbnb Co-Founder as First Government Design Chief": 0.5,
  "3 Stocks Down Over 30% That Look Like Buys": 0.5,
  "Sector Update: Health Care Stocks Mixed Late Afternoon": 0.0,
  "Samsara Announces Appointment of Gary Steele to Board of Directors": 0.5,
  "Market Chatter: Comcast's NBCUniversal and MLB Close to 3-Year Deal Worth $600 Million": 0.8,
  "Honeywell Unveils Strategic Board of Directors to Lead Solstice Advanced Materials": 0.5,
  "Honeywell Announces Filing of Form 10 Registration Statement and Upcoming Investor Day for Planned Spin-Off of Solstice Advanced Materials": 0.5,
  "Gilead Topples On A Surprise Setback For Its 99.9% Effective HIV Drug": -0.8,
  "Why AppLovin Stock Crept Almost 2% Higher Today": 0.5,
  "Robolink Launches Drone Coding in Classrooms — Directly from a Texas Instruments Graphing Calculator": 0.5,
  "Walmart Just Missed Earnings for the First Time in 3 Years - Walmart (NYSE:WMT) stumbled in the market after reporting its first profit miss in three years, even as sales momentum stayed strong. Second-quarter adjusted earnings landed at 68 cents per share, six cents shy of Wall Street estimates, weighed down by higher insurance claims, legal costs, and restructuring charges. The stock slipped as much as 4.4% in early New York tradingits sharpest drop since": -0.6,
  "Ross Stores climbs on Q2 beat; touts strong demand ahead as consumer seek value": 0.8,
  "Intuit, Ross Stores, Workday: Stocks to Watch Afterhours": 0.5,
  "Why Zscaler (ZS) Dipped More Than Broader Market Today": -0.5,
  "PepsiCo (PEP) Suffers a Larger Drop Than the General Market: Key Insights": -0.5,
  "Ross Stores tops quarterly profit estimates as shoppers seek discount apparel": 0.6,
  "Workday's forecast for quarterly subscription revenue disappoints": -0.7,
  "Markets Close in the Red, but Off Session Lows": 0.5,
  "How Trump Will Decide Which Chips Act Companies Must Give Up Equity": 0.1,
  "Why Earnings Season Matters": 0.0,
  "ESPN Launches New Streaming Service at Key Moment for Television": 0.5,
  "ReAlta Life Sciences Secures European Orphan Drug Status for Graft-vs-Host Disease Treatment": 0.6,
  "SPGI, V, or MA? - I have a very tech heavy portfolio I’ve been building for over a year. It has done me well in where I beat the S&P, but I believe I have to diversify. I have a bit less than 2k WMT so I am exposed to the consumer sector but I am looking to buy into the finance sector. I am stuck between Mastercard, Visa, and SPGI. I’m doing my own": 0.2,
  "Trump administration is not eyeing equity in TSMC, Micron, official says": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers On August 22, 2025, Honeywell International Inc. (the “Company” or “Honeywell”) announced the appointment of Mr. Peter Lau, age 46, as President and CEO of its Industrial Automation segment (“IA”), effective October 15, 2025. Mr. Lau will be an executive officer of the Company, reporting to Chairman and CEO Mr. Vimal Kapur. The current President and CEO": 0.1,
  "(Item 8.01) Other Events. On August 21, 2025, the Board of Directors of Fortinet, Inc. (“Fortinet”) (i) authorized an increase of Fortinet’s share repurchase program by $1 billion worth of shares of common stock for an aggregate authorized repurchase amount of up to $9.25 billion and (ii) extended the share repurchase program from February 28, 2026 to February 28, 2027. As of August 21, 2025, approximately $1.23 billion remained available under the existing program, including the $1": 0.6,
  "Meta inks $10B Cloud deal with Google Cloud - https://finance.yahoo.com/news/meta-signs-10-billion-plus-230020207.html In a strategic shift from traditional AWS and Azure,, Meta has reportedly entered into a six-year, $10 billion-plus cloud deal with Google, leveraging Google Cloud's servers, storage, and networking to power its massive Al infrastructure and operations.": 0.6,
  "Cohesity Catalyst 1 to Bring Together Cyber Resilience Experts, Celebrity Guest Appearance by Andre Agassi": 0.5,
  "Nvidia orders suppliers to halt work on China-focussed H20 AI chip, The Information says - Aug 21 (Reuters) - Nvidia [(NVDA.O), opens new tab](https://www.reuters.com/markets/companies/NVDA.O) has told some component suppliers to suspend production of its H20 AI chip, designed specifically for the Chinese market, the Information reported on Thursday, citing two people with direct knowledge of the communications.According to the report, Nvidia instructed Arizona-based Amkor Technology [(AMKR.O), opens new tab](https://www.reuters.com/markets/companies/AMKR.O) to stop production of the H20": -0.6,
  "30-Year Returns: Nasdaq 3,765% vs S&P 500 1,033% - I compared the returns over the last 30 years (1995-2025) and the Nasdaq is up about 3,765% while the S&P500 is up about 1,033%. Pretty decent result both of them. I always thought they were maybe 1.5x apart, but clearly not. For short-term investing, I still think going all in on the Nasdaq is risky considering 2000–2015 stretch was pretty rough. Mixing in the S&P 500": 0.5,
  "Agoda Launches AI-Powered Bot to Instantly Answer Hotel Questions": 0.5,
  "Q2 Earnings Highlights: Honeywell (NASDAQ:HON) Vs The Rest Of The General Industrial Machinery Stocks": 0.2,
  "Walmart's miss pulls a major market segment lower": -0.6,
  "3 Reasons CSGP is Risky and 1 Stock to Buy Instead": -0.5,
  "DOJ Won’t Pursue Coders Who Build Decentralized Platforms in Good Faith": 0.5,
  "1 Semiconductor Stock Worth Your Attention and 2 We Find Risky": 0.2,
  "2 Semiconductor Stocks Worth Your Attention and 1 We Brush Off": 0.2,
  "1 Unpopular Stock That Deserves a Second Chance and 2 We Turn Down": 0.2,
  "1 Unpopular Stock That Deserves Some Love and 2 Facing Headwinds": 0.2,
  "3 Growth Stocks with All-Star Potential": 0.5,
  "2 Growth Stocks to Add to Your Roster and 1 Facing Headwinds": 0.2,
  "Starbucks expects non-binding bids for China business within two weeks, sources say": 0.2,
  "Ross Stores Inc (ROST) Q2 2025 Earnings Call Highlights: Navigating Tariff Challenges and ...": 0.2,
  "Sweden's Wallenberg groups launch joint AI company": 0.5,
  "Bull of the Day: Micron Technology (MU)": 0.5,
  "CrowdStrike too expensive ? - Great company. I’m up 3x on it Do you think $crwd is too expensive here. I own it and up a lot but looks like it got crazy expensive 26 price to sales. If I use analyst estimates 5 years out on pe of 40 I get to break even. Am I missing something on that ? Dan Ives added to ai list": 0.5,
  "Has Costco Wholesale's Stock Peaked?": -0.5,
  "My 5 Favorite Stocks to Buy Right Now": 0.5,
  "1 Magnificent S&P 500 Dividend Stock Down 35% to Buy and Hold Forever": 0.8,
  "Aimbridge names Chris O’Donnell president for select service": 0.5,
  "r/Stocks Daily Discussion & Fundamentals Friday Aug 22, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is": 0.2,
  "$CRWV The early surge was a welcome, albeit brief, reprieve for investors, as CoreWeave’s stock has tumbled since the earnings report. - While tech stocks in general have sold off in recent days, CoreWeave has been hit especially hard; the stock’s price is down 39% since earnings were reported after the Aug. 12 close, and it has lost 50.5% since its record close of $183.58 on June 20. Jane Street and CoreWeave have a close": -0.8,
  "The Zacks Analyst Blog Highlights Health Care Select Sector SPDR, SPDR S&P 500 ETF Trust, UnitedHealth, Regeneron, CVS Health and Novo Nordisk": 0.2,
  "Analog Devices (ADI): Examining Valuation Following Strong Q3 Results and Upbeat Growth Guidance": 0.8,
  "US small caps, housing stocks rally as Powell opens door to rate cuts": 0.8,
  "How Cisco’s Valuation Stacks Up After 13% Gain and $87 Bull Case in 2025": 0.5,
  "PayPal (PYPL): Evaluating Valuation After Recent Share Price Slide": 0.1,
  "What the Latest MLB Broadcast Deal Means for Netflix Shares in 2025": 0.2,
  "The Smartest Growth Stock to Buy With $2,000 Right Now": 0.5,
  "Strong Product Launches and Upbeat Guidance Could Be a Game Changer for Vertex Pharmaceuticals (VRTX)": 0.8,
  "Marriott International (MAR): Exploring the Valuation After Recent Share Pullback": 0.5,
  "ASUS Announces Limited-Time Back to School Sales Event: August 22 – September 4": 0.5,
  "Trending tickers: Nvidia, Zoom, Tesla, Starbucks": 0.0,
  "Walmart Sent a Warning to Stock Markets and the Fed. Why Powell Faces an Inflation Crisis.": -0.5,
  "Gilead’s Kite scoops in vivo CAR-T specialist Interius for $350m": 0.5,
  "Federal Reserve View Lifts Wall Street Pre-Bell; Asia Europe Up": 0.5,
  "Stocks Rise Pre-Bell Ahead of Powell's Jackson Hole Speech": 0.5,
  "This Overlooked Biotech Stock Is a Buy for Its Hidden Strengths": 0.6,
  "ARS Pharmaceuticals And 2 Other Growth Stocks With Strong Insider Ownership": 0.5,
  "AI Chips Today - Nucleus Advances Speed in GPU Data Processing": 0.5,
  "August 2025's Stock Selections With Estimated Undervaluations": 0.0,
  "Texas Instruments Incorporated (TXN) Slid on Investor Concerns": -0.6,
  "What are your expectations & opinion on ORCL? - I see all these positive news for ORCL, that they're gonna work with White House, working with Google to deploy Gemini, got so & so new customers, gonna do well in cloud & big data domain so on. I don't see much discussion on ORCL here. I'm no expert at valuations and hence asking for opinion. Is this a good stock to hold to pump on": 0.6,
  "Cisco to Participate in August 2025 Deutsche Bank Technology Conference": 0.0,
  "Investors Like Buffett Grabbed These 5% Yields — And Got Slapped": -0.6,
  "4 Medical Devices Behemoths to Buy Amid Extensive AI Applications": 0.5,
  "Stocks to watch next week: Nvidia, Dell, Prudential, JD Sports and Delivery Hero": 0.5,
  "Dow Jones Futures Rise Ahead Of Fed Chief Powell; Nvidia Said To Halt AI Chip": 0.5,
  "Investors Await Fed Chair's Jackson Hole Speech as US Futures Rise Friday Pre-Bell": 0.5,
  "Intuitive Surgical Stock: Analyst Estimates & Ratings": 0.0,
  "Honeywell Appoints Peter Lau to Lead Industrial Automation": 0.5,
  "Palo Alto Networks to Present at Upcoming Investor Event": 0.0,
  "ROST Q2 Deep Dive: Broad-Based Sales Improvement, Tariff Pressures, and Store Expansion": 0.5,
  "Affirm Keeps Taking Share In Booming 'Buy Now, Pay Later' Market. Earnings Are Due Next Week.": 0.8,
  "Micron Technology and Albany have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Wall Street Set to Open Higher Friday as Investors Await Powell's Speech at Jackson Hole": 0.5,
  "Is Trending Stock Palo Alto Networks, Inc. (PANW) a Buy Now?": 0.2,
  "Here is What to Know Beyond Why Amgen Inc. (AMGN) is a Trending Stock": 0.2,
  "Is Trending Stock AppLovin Corporation (APP) a Buy Now?": 0.2,
  "Investing in Amgen (NASDAQ:AMGN) three years ago would have delivered you a 35% gain": 0.6,
  "Jeffrey Katzenberg and Kimbal Musk talk new company telling stories via drone": 0.2,
  "Exchange-Traded Funds, Equity Futures Higher Pre-Bell Friday Ahead of Powell's Jackson Hole Speech": 0.5,
  "This Vietnam vet, 84, was forced to sell her ‘dream’ home after new owners jacked up her monthly fees 365%": -0.9,
  "TTD Banks on Kokai's Widespread Adoption: Path to Greater Monetization?": 0.2,
  "Company News for Aug 22, 2025": 0.0,
  "Honeywell Expands Smart Energy Portfolio With SparkMeter Acquisition": 0.8,
  "Is MercadoLibre (MELI) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "NVDA before or after earning report? - Looking to add NVDA to my portfolio and I’m wondering if I should buy in before or after their earnings update on the 27th. I’m leaning towards before since I bet the update will be positive giving their last year": 0.5,
  "Gap downgraded, Ulta upgraded: Wall Street's top analyst calls": 0.2,
  "Is UPS a golden buy right now? I think so. - Ok so, the facts: - a huge network and well established business in a market with huge barriers to entry -Steady growth - is currently at a historic low BC of macro economics instability due to trump and tarrifs - insider buying is huge rn - in the long term will offer good returns - senate member have bought it Edit: I'm a fairly": 0.6,
  "Are Industrial Products Stocks Lagging  Fastenal (FAST) This Year?": 0.1,
  "Netflix, Comcast Near MLB Deals, Report Says. The Sports Streaming War Is Ramping Up.": 0.5,
  "Roper Technologies Stock Outlook: Is Wall Street Bullish or Bearish?": 0.2,
  "Here's Why Idexx Laboratories (IDXX) is a Strong Momentum Stock": 0.8,
  "NVIDIA Likely to Beat Q2 Earnings Estimate: How to Play the Stock?": 0.5,
  "GILD Stock Slips as CVS Health Excludes New HIV Drug Yeztugo": -0.5,
  "Thoughts on CHYM currently below their IPO price? - It's a competitive market and I already hold CashApp through XYZ. Is there a real model here or is the underlying business not strong enough to invest in. It seems to me like their core growth and path to profitability comes from interchage fees which seems wholly reliant on an increased user base. I am on the fence.": -0.6,
  "The markets rise on Fed Chair's Jackson hole speech - [https://www.bloomberg.com/news/articles/2025-08-22/powell-says-shifting-risks-may-warrant-adjusting-interest-rates?sref=6RluRBXJ](https://www.bloomberg.com/news/articles/2025-08-22/powell-says-shifting-risks-may-warrant-adjusting-interest-rates?sref=6RluRBXJ) The markets have responded well to this with the S&P 500 up 1.21, but the 10-year remains steady at 4.3%.": 0.8,
  "Ross Stores Tops Q2 Earnings Estimate, Expects Modest Pressures in Q3": 0.5,
  "Powell Sends Strongest Signal Yet That Interest Rate Cuts Are Coming - Source :- https://www.nytimes.com/2025/08/22/business/powell-speech-jackson-hole-fed-inflation.html Just watched Powell at Jackson Hole. So basically, cuts are finally on the table. He didn’t say that he is gonna cut rates now but he basically opened the door and left it ajar. He called out a weird labor market where both hiring and the supply of workers are cooling at the same time and his words made it": 0.8,
  "BC-Most Active Stocks": 0.0,
  "Nvidia & Marvell Technology: AI Chip Stocks Ahead of Earnings": 0.5,
  "3 Networking Stocks to Consider From a Flourishing Industry": 0.5,
  "CrowdStrike's Pre-Q2 Earnings Analysis: Hold or Fold the Stock?": 0.2,
  "Should You Buy the Post-Earnings Pop in Analog Devices Stock?": 0.1,
  "Workday, Nio, Ross: Trending Tickers": 0.0,
  "CSX, BNSF announce new intermodal services, offering seamless coast-to-coast rail solutions": 0.6,
  "AMAT's Display Revenues Rebound: Is it a Sign of Stability?": 0.5,
  "TransPerfect Solidifies Leadership Position in Language AI by Acquiring Unbabel": 0.6,
  "Roblox vs. Electronic Arts: Which Stock Has More Upside Now?": 0.5,
  "Why Is CSX (CSX) Up 2.5% Since Last Earnings Report?": 0.2,
  "Why Is O'Reilly Automotive (ORLY) Up 4.8% Since Last Earnings Report?": 0.2,
  "Why Is T-Mobile (TMUS) Up 4.3% Since Last Earnings Report?": 0.5,
  "Top Midday Stories: Stocks Soar on Powell Speech; Cenovus Energy to Acquire MEG Energy for $5.68 Billion": 0.8,
  "PYPL vs. MA: Which Stock Should Value Investors Buy Now?": 0.2,
  "Trump Administration Says It's Not Looking to Take Stakes in TSMC, Micron": 0.2,
  "CSX shares drop as BNSF service deal falls short of merger hopes": -0.6,
  "CSX-BNSF railroad pact lessens expectations of quick merger, analysts say": 0.1,
  "Dow Jones Hits Record High On Dovish Powell After AI Worries, Walmart Woes: Weekly Review": 0.5,
  "Is lululemon's Product Innovation Enough to Defend Market Share?": 0.2,
  "Will Strength in Cloud Infrastructure Space Drive Growth for Intel?": 0.5,
  "Workday Q2 Earnings Beat Estimates on Solid Revenue Growth": 0.8,
  "AMZN vs. SHOP: Which E-Commerce Stock Has Better Upside Potential?": 0.5,
  "Verizon Stock Has Been a Telecom Laggard. Why That Is Changing.": 0.5,
  "Amazon’s Grocery Ambitions Are Enticing. ‘Proceed With Caution,’ Analyst Says.": 0.2,
  "Bitcoin-Volatility Collapse Forces Risk-Loving Traders Elsewhere": -0.5,
  "Arm Holdings Faces Market Scrutiny Over Steep Valuation": -0.5,
  "CSX–BNSF Railway, Opendoor surges, Cracker Barrel sell-off eases": 0.2,
  "Why Workday (WDAY) Stock Is Falling Today": -0.5,
  "Dow Hits Record Highs, Small Caps Soar On Powell's Shift: What's Moving Markets Friday?": 0.5,
  "Ross Stores (ROST) Stock Trades Up, Here Is Why": 0.5,
  "Intuit (INTU) Stock Trades Down, Here Is Why": -0.5,
  "Intuit (INTU) Reports Q4 Earnings Growth and Expands US$3,200 Million Buyback Plan": 0.8,
  "Why Atlassian (TEAM) Stock Is Trading Up Today": 0.5,
  "CSX (CSX) And BNSF Announce New Coast-To-Coast Intermodal Services Across The U.S.": 0.6,
  "Starbucks Is Making a Play for the Wellness Market. Will it Work?": 0.2,
  "US Equity Indexes Jump as Powell's Jackson Hole Speech Sends September Rate-Cut Bets Sharply Higher": 0.8,
  "AstraZeneca (LSE:AZN) Joins Forces To Launch Sovereign AI Supercomputer With Sferical AI": 0.5,
  "Honeywell International (HON) Announces Leadership Shifts and Solstice Spin-Off Plans": 0.5,
  "Why onsemi (ON) Stock Is Trading Up Today": 0.5,
  "Why NXP Semiconductors (NXPI) Stock Is Up Today": 0.5,
  "Lattice Semiconductor (LSCC) Stock Trades Up, Here Is Why": 0.5,
  "Scale and Integration of PayPal's BNPL: Will it Outpace Competitors?": 0.5,
  "Block's Ecosystem Expansion: Will Partnerships Boost Profitability?": 0.5,
  "How Nvidia's chips became central to the U.S.-China trade war": 0.1,
  "Intel announces $8.9 billion investment from US government, which will own 9.9% of chipmaker": 0.5,
  "Trump Says Intel Has Agreed to Give the US a 10% Equity Stake - https://www.bloomberg.com/news/articles/2025-08-22/trump-poised-to-unveil-intel-deal-for-equity-stake-on-friday >President Donald Trump said Intel Corp. had agreed to give the US government a 10% equity stake in the beleaguered chipmaker, with a formal announcement expected on Friday, according to people familiar with the matter. > >“They’ve agreed to do it and I think it’s a great deal for them,” Trump told reporters Friday at the White House. He said": 0.6,
  "TD Cowen Reiterates Buy Rating on Workday Stock Despite 4% Drop": 0.6,
  "Intuit Stock Slips Despite Strong Quarter; RBC Keeps $850 Price Target": 0.2,
  "Shopify (SHOP) Stock Is Up, What You Need To Know": 0.5,
  "Why Is AppLovin (APP) Stock Rocketing Higher Today": 0.6,
  "Why Intuit Stock (INTU) Is Sinking Today": -0.5,
  "The Trade Desk (TTD) Stock Is Up, What You Need To Know": 0.5,
  "Powell's Hint at Fed Policy Easing Sends Equities Higher Intraday; Yields Decline": 0.5,
  "Ross Benefits From Value Shoppers But Tariff Challenges Continue": 0.1,
  "Housing stocks pop, NIO extends gains, Workday outlook miss": 0.2,
  "XYZ Block stock valuation - I feel like this stock is undervalued. I try to look at stock and divide them into 3 category: Value, growth and hyper growth. Value stock being the boring, predictable ones with a low P/E ratio and hyper growth being the one that can 10x + in a decade and I feel like Block fits into everything category. Block seems to be valued like a value stock with a P/E": 0.8,
  "Oil Rig Count Falls by 1; Crude Set to Snap Two-Week Decline": 0.5,
  "BNSF and CSX announce new joint domestic and international intermodal service": 0.5,
  "Intuit's Guidance Falling Short of Expectations Weighing on Stock Despite In-Line Fiscal Q4 Results, UBS Says": -0.5,
  "Robinhood kicks off football season with new prediction markets": 0.5,
  "The World's 10 Wealthiest People Became $33 Billion Richer After Powell's Jackson Hole Speech - A broader market rally, sparked by Federal Reserve Chair Jerome Powell’s signaling possible interest rate cuts on Friday, added billions of dollars to the net worths of the world’s wealthiest. What Did Powell Say In Jackson Hole? Powell’s comments, which came Friday at the central bank’s symposium in Jackson Hole, Wyoming, were widely read to suggest interest rate cuts were": 0.8,
  "Workday Guidance Reflects 'Uninspiring' Fiscal 2026 Second Half, Oppenheimer Says": -0.5,
  "Why Is MercadoLibre (MELI) Stock Rocketing Higher Today": 0.6,
  "Workday's Fiscal 2026 Outlook Signals Stable but Tough Demand Backdrop, UBS Says": 0.2,
  "Western Digital, Warner Music Group, PayPal, IMAX, and FirstCash Shares Skyrocket, What You Need To Know": 0.8,
  "Palantir, Shopify Peer Attracting Eyeballs – And Top Funds. Here's Why.": 0.5,
  "Stock market today: Dow jumps 800 points to record, S&P 500, Nasdaq soar as Powell's Jackson Hole finale fuels bets on September rate cut": 0.8,
  "Zscaler to Present at Upcoming Investor Conferences": 0.0,
  "CSX and Warren Buffett’s BNSF Made News. Why Investors Are Disappointed.": -0.6,
  "US Equity Markets Rise After Powell Hints at Interest Rate Cut in September": 0.8,
  "Nuclear Stocks Weren't Immune To AI-Led Stock Market Retreat But Then Powell Spoke": 0.2,
  "Nvidia CEO Praises TSMC, Says Buying Stock Is 'Very Smart'": 0.8,
  "Top Analyst Reports for NVIDIA, Cisco & Linde": 0.5,
  "Stock Market Week Ahead: Nvidia, Dollar Stores And Canada's Big 5 Banks": 0.5,
  "S&P 500 Posts Third Consecutive Weekly Gain Amid Rate Cut Hopes": 0.8,
  "Dr. Shveta Miglani Introduces Career Guide, \"Navigate Your Career - Strategies for Success In New Roles and Promotions,\" to Support Professionals in Career Transitions": 0.5,
  "Fed Chair Powell's Boost for September Rate-Cut Triggers Rally in US Equity Indexes": 0.8,
  "IBD Stock Of The Day: Online Travel Booking Leader Eyes Buy Point": 0.5,
  "Trump Announces Probe Into Furniture Imports, Setting Up Tariffs - https://www.bloomberg.com/news/articles/2025-08-22/trump-announces-probe-into-furniture-imports-setting-up-tariffs > President Donald Trump said the US is conducting a “major Tariff Investigation on Furniture coming into the United States,” setting the stage for industry-specific levies. > > “Within the next 50 days, that Investigation will be completed, and Furniture coming from other Countries into the United States will be Tariffed at a Rate yet to be determined,” Trump said in a social-media post": -0.6,
  "T-Mobile Announces Redemption of 5.375% Senior Notes due April 15, 2027": 0.0,
  "Tech, Media & Telecom Roundup: Market Talk": 0.0,
  "These Stocks Moved the Most Today: Nvidia, Builders FirstSource, Zoom, Intuit, Workday, BJ’s, Ubiquiti, and More": 0.2,
  "Dow Hits Record High as Powell's Dovish Tilt Fuels Stock Market Rally": 0.8,
  "Stocks to Watch Recap: Tesla, Carnival, Intuit, Nvidia": 0.0,
  "The Score: Intel, Home Depot, Meta and More Stocks That Defined the Week": 0.5,
  "S&P 500 Gains and Losses Today: Index Surges as Expectations of a Rate Cut Climb": 0.8,
  "Auto & Transport Roundup: Market Talk": 0.0,
  "At what moment do you realize the market increase has broadened out - My loser tickers are all gaining and have inched higher. Next 6 months will be the dumbest everything rally stage. My top percentage losers change from 1 month ago 1. SND and L -92% to -82% 2. Jmia -90% to -82% 3. Lly -16% to -21% 4. Qcom -23% to -17% 5. Lnth -18% to -33% 6. Psx -29% to -19% 7.": 0.2,
  "OPINION: The power of the channel": 0.0,
  "Starbucks to cut production to five-day schedule at US coffee plants, Bloomberg News reports": -0.5,
  "Intuitive Surgical, Inc. (ISRG) Rises Yet Lags Behind Market: Some Facts Worth Knowing": 0.1,
  "Intel Has Lots of Problems. A U.S. Stake Won’t Help.": -0.6,
  "Autodesk (ADSK) Rises Yet Lags Behind Market: Some Facts Worth Knowing": 0.1,
  "Copart, Inc. (CPRT) Laps the Stock Market: Here's Why": 0.5,
  "CSX, BNSF Pact Sparks Debate on Whether Another Rail Merger Is Approaching": 0.2,
  "Podcast: Dow Hits New Record After Fed Chair Opens Door for Rate Cut": 0.8,
  "Nvidia earnings, new home sales data, July PCE: What to Watch": 0.2,
  "12 Cheap Consumer Stocks for a Rocky Market": 0.1,
  "Comcast Donates $50,000 to San Bruno Education Foundation (SBEF) to Support the Advancement of Digital Opportunities": 0.8,
  "Duolingo Stock Overvalued - DUOL has been in a downtrend ever since it peaked at $544 in May. It beat earnings earlier this month which led to a spike, peaking at $446 but has since continued down to $334. From what I've personally seen, duolingo has gained a lot of popularity earlier this year with their social media manager Zaria Parvez excellently marketing the brand. I've seen dozens of videos of a person dressed as": -0.5,
  "Why Analysts Say NVIDIA Remains the Best AI Play": 0.8,
  "Travelers Ditch Screens For Real-Life Adventures, Choosing Local Culture, Nature, And Hands-On Experiences Over Digital Entertainment": 0.8,
  "Micron (MU) Stock in Focus: AI Demand Fuels $150 Price Target": 0.6,
  "Daiwa Cuts Applied Materials (AMAT) Rating to Neutral, Lowers PT to $170": -0.5,
  "Zscaler and CrowdStrike (CRWD) Team Up to Boost AI-Powered Cybersecurity": 0.6,
  "High probability of a pullback in Aug-Sep - Monthly bearish divergence is undefeated when RSI is overbought on the monthly.. historically, August and September for the weakest months out of the year.. I will be looking to open hedges after the market digests Jackson hole to protect myself from any downside risk.. I will also keep dry powder on the side as this pullback will provide asymmetric trades long and optimal buy the dip opportunities..": -0.6,
  "Citi Lowers PT on Atlassian Corporation (TEAM) to $240 From $300, Keeps a Buy Rating": -0.2,
  "Citi Keeps Buy, $150 Target on Micron (MU) as AI Tailwinds Build": 0.6,
  "BofA Stays Constructive on Cisco (CSCO) with Price Target Raised to $85": 0.8,
  "The Guns N’ Roses-inspired company helping to make job search less soul-crushing": 0.6,
  "The Donald Trump Administration Is Pondering Equity Stakes in Intel, TSMC, Micron, and Samsung -- and It Sets a Dangerous Precedent": -0.8,
  "2 Soaring Stocks I'd Buy Now With No Hesitation": 0.8,
  "Broadcom Inc. (AVGO)’s Director Sells 80 Shares at $307.46 Each; Goldman Sachs Reiterates ‘Buy’ Rating": 0.5,
  "Bernstein Reaffirms ‘Hold’ Rating on Advanced Micro Devices, Inc. (AMD) Despite Market Share Gains": 0.2,
  "Morgan Stanley Reaffirms ‘Buy’ Rating on Intuit Inc. (INTU) Amid Strong Earnings Outlook": 0.8,
  "Cantor Fitzgerald Raises PT on Datadog, Inc. (DDOG) Following Strong Q2 Results": 0.8,
  "Bernstein Reduces PT on Atlassian Corporation (TEAM) Following Q4 Earnings Release": -0.5,
  "Freedom Broker Downgrades ASML Holding N.V. (ASML) to ‘Hold’ Following Q2 Results": -0.5,
  "JPMorgan Raises PT on Shopify Inc. (SHOP) Citing Strongest Growth Trends Since Pandemic": 0.8,
  "Truist Securities Raises PT on Palo Alto Networks, Inc. (PANW) Following Strong Fiscal Q4 2025 Results": 0.8,
  "Truist Securities Raises PT on Shopify Inc. (SHOP) to $150 Following Strong Q2 Results": 0.8,
  "Coca-Cola explores sale of Costa Coffee, source says": 0.2,
  "The AI Chip War: A Look at the Unexpected Winners of the Next 5 Years": 0.5,
  "1 No-Brainer Artificial Intelligence (AI) Stock to Buy for Under $200 in August": 0.8,
  "Why SBC is seen as a ’critical lever’ in AI talent wars": 0.5,
  "Are Wall Street Analysts Bullish on Marriott International Stock?": 0.5,
  "/r/Stocks Weekend Discussion Saturday - Aug 23, 2025 - This is the weekend edition of our stickied discussion thread. Discuss your trades / moves from last week and what you're planning on doing for the week ahead. Some helpful links: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips *": 0.2,
  "The Weekend: Russia pours water on Ukraine peace hopes as tech trade takes a hit from AI doubts": -0.5,
  "Does Charter’s (CHTR) Legal Scrutiny Over Disclosures Reshape Confidence in Its Growth Strategy?": 0.1,
  "The Bull Case For GlobalFoundries (GFS) Could Change Following Cirrus Logic Chip Technology Partnership Expansion": 0.5,
  "Is Now the Right Moment for Micron After White House Backs Away From Taking a Stake?": 0.2,
  "Does Recent PepsiCo Rally Signal a Shift in Market Sentiment for 2025?": 0.5,
  "Should You Revisit DoorDash After Its 92% Run and New Alcohol Delivery Expansion?": 0.2,
  "Recent 4.2% pullback isn't enough to hurt long-term Marvell Technology (NASDAQ:MRVL) shareholders, they're still up 95% over 5 years": 0.8,
  "Investing in Ross Stores (NASDAQ:ROST) three years ago would have delivered you a 75% gain": 0.8,
  "Investors Will Want Palo Alto Networks' (NASDAQ:PANW) Growth In ROCE To Persist": 0.5,
  "Uber Leads 5 Stocks Near Buy Points As Market Rebounds": 0.6,
  "The week in business: Airlines get sued, Cracker Barrel gets a glow-up, and grocery store shrimp goes radioactive": -0.5,
  "Thoughts on wulf? Google has 8 percent stake in it. - Just wondering about your guys thoughts on this. Stocks is up from 77 percent in last 30 days. And is consolidating nicely around 8.50 to 9 zone for 1 week now. Also important to mention they have done convertible notes offering and have raised around 1.8 billion I believe it is in last 2 weeks from the offering they are transitioning from bitcoin mining": 0.5,
  "The Ultimate Growth Stock to Buy With $1,000 Right Now": 0.8,
  "We Ran A Stock Scan For Earnings Growth And Fortinet (NASDAQ:FTNT) Passed With Ease": 0.6,
  "Is Now the Time to Buy Palo Alto Networks Stock?": 0.5,
  "Investing in Monster Beverage (NASDAQ:MNST) five years ago would have delivered you a 49% gain": 0.8,
  "Ross Stores price target raised to $160 from $150 at Telsey Advisory": 0.5,
  "This week in Trumponomics: A government hedge fund?": -0.5,
  "2 Super Growth Stocks to Buy in Bunches in August": 0.5,
  "I’m 66 and retiring next month — but now my boss wants me to stay on to train my replacement. What do I do?": -0.6,
  "r/Stocks Weekly Thread on Meme Stocks Saturday - Aug 23, 2025 - The meme stock scheduled posts will now run weekly and post Saturday afternoon and won't be a sticky; you're probably seeing this because automod sent you here! [Full list of meme stocks here.](https://www.reddit.com/r/stocks/wiki/meme-stocks) This will be updated every once in a while. ------ Welcome traders who just can't help them selves discuss the same exact stock that's been discussed 100s of times a": 0.1,
  "Esports World Cup Foundation Announces Esports Nations Cup": 0.5,
  "Prediction: This Artificial Intelligence (AI) Chip Stock Will Skyrocket After Aug. 27 (Hint: It's Not Nvidia)": 0.8,
  "Your thoughts on two portfolio management ideas. - I have not backtested them. But it makes me wonder how it'd work on a time horizon of five to ten years. In case you have thoughts about it, or backtested it, I'd love to hear about it. 1. Instead of buying SPX so that you keep track of the market, simply buy ATM call options for one year (LEAPS) for the same number of quantities. You'd": 0.2,
  "Thoughts on BITO? - I've read pros and cons from people but honestly the bullish people sound like they have less experience investing and the more cautious or bearish opinions sounded more educated. I don't completely understand how their dividend is different from a traditional one, but I am interested in holding around 100 shares with a cost average of below 20. I do hold ETH, quite a large position, and an extremely small amount": 0.2,
  "Prediction: This Quantum Computing Stock Will Still Be Worth More Than Berkshire Hathaway, Palantir, and Tesla Combined in 2030": 0.8,
  "Renting in San Francisco turns cutthroat as AI jobs boom collides with low supply": -0.6,
  "Thoughts on why $MSFT has been weak since blowout earnings? - Gathering opinions on if I'm missing some narrative. Not the end of the world as it's had a strong run since the tariff, but it's odd. Down around 8% from the highs (up 20% YTD) on what was objectively stellar earnings and guidance from among the MAG 7 cohort. Price action has been very weak comparatively with a controlled sell off every day. Even": 0.2,
  "Ancora Issues Letter to CSX’s Board of Directors Regarding the Need to Avert a Permanent Impairment of Value and Aggressively Pursue a Value-Maximizing Merger": 0.6,
  "US consumers continue to seek value: What recent earnings tell us": 0.2,
  "Suze Orman reveals her favorite stock right now and the investing mistake that shaped her strategy": 0.5,
  "Which of These Discount Retailers Is the Better Investment Choice?": 0.0,
  "People Love 'Money Saving Hacks,' But Some End Up Costing More Over Time. Like The Dad Who 'Bought At Least 10 Cordless Drills'": -0.6,
  "1 Top Cryptocurrency to Buy. Michael Saylor Predicts It Will Soar 17,696%.": 0.5,
  "3 Breakout Growth Stocks You Can Buy and Hold for the Next Decade": 0.5,
  "Found Paper Stock Certificates For Private Conpany - We’re finalizing some estate paperwork and came across 2 paper stock certificates for a company called M&C Systems, Inc. founded 1977 in Hazlet, NJ. The company appears to possibly still exist, but is privately held and I’m having trouble finding contact information for them. We have the CUSIP number and are trying to find if the stock is worth anything today. I’m open to suggestions on the": 0.2,
  "2 Soaring Growth Stocks to Buy and Hold Forever": 0.5,
  "'We quit our jobs to launch a £2.5m tequila cocktail business'": 0.8,
  "Netflix, Inc. (NFLX) Becomes Corient IA LLC’s 4th-Largest Holding": 0.5,
  "Corient IA LLC Adds 9,000 Shopify Inc. (SHOP) Shares": 0.5,
  "Amazon AI Chip Executive Joins Arm to Build Complete Chips": 0.5,
  "Dimensional Fund Advisors Deepens Investment in PayPal Holdings, Inc. (PYPL)": 0.5,
  "Adobe Removed from Daniel Ives’ AI 30": 0.0,
  "Comcast Comcast Corporation (CMCSA) and Local Media Association (LMA) Launches Economic Opportunity Lab": 0.5,
  "Charter Communications, Inc. (CHTR)’s Spectrum Announces Extension of Its Seamless Entertainment Experience": 0.6,
  "Charter Communications, Inc. (CHTR) Offers Senior Secured Notes": 0.0,
  "UBS Cuts The Trade Desk, Inc. (TTD)’s Price Target to $80, Maintains Buy Rating": 0.5,
  "UBS Slashes lululemon athletica inc. (LULU)’s Price Target to $240, Maintains Neutral Rating": -0.5,
  "Adobe Inc. (ADBE) Announces Launch of Acrobat Studio. Here Is What You Need To Know": 0.5,
  "Shopify Stock Popped 22% After Earnings. Is it Too Late to Buy?": 0.5,
  "If You'd Invested $10,000 in Starbucks Stock 3 Years Ago, Here's How Much You'd Have Today": 0.5,
  "Investing $1,000 in Each of These Growth Stocks Could Go a Long Way for Patient Investors": 0.8,
  "Jackson Hole 1982: The Fed Meeting That Sparked a Historic Bull Market | Investing.com UK - the story of two dramatic Friday the 13th (of August) markets, the first being the time President Nixon gathered his Brain Trust in Camp David to devalue the dollar and close the gold window. The second dramatic Friday, August 13th, came in 1982 – after America suffered 140% inflation in the 11 years after that gold-to-dollar devaluation. On Friday,": 0.5,
  "Analog Devices (ADI) Is Up 8.9% After Strong Q3 Earnings and Upbeat Automation Outlook - What's Changed": 0.8,
  "How Investors Are Reacting To Cadence Design Systems (CDNS) Breakthrough in Billion-Gate AI Power Analysis": 0.5,
  "Will Diamondback Energy's (FANG) Raised 2025 Production Outlook Redefine Its Growth Trajectory?": 0.5,
  "Is It Too Late to Consider AppLovin After 390% Rally and Record Q1 Revenue?": 0.5,
  "Is CoStar Group’s 29% Rally in 2025 Backed by Strong Fundamentals?": 0.2,
  "Does Booking Holdings Still Offer Value After 50% Jump and Dutch Legal News in 2025?": 0.1,
  "How Does CrowdStrike Stack Up After Announcing a $1.3B Buyback Program?": 0.5,
  "Americans have reached their tipping point as gratuities spiral ‘out of control’ — where Dave Ramsey draws a firm line": -0.5,
  "Should You Forget Palantir and Buy These 2 Millionaire-Maker Stocks Instead?": 0.5,
  "'Powell clearly opens the door': Markets surge as speculative bets get another boost from dovish Jay Powell": 0.8,
  "7 to-dos for Target's new CEO": 0.1,
  "Nvidia earnings set to test AI trade with stocks near record highs: What to watch this week": 0.5,
  "What Does NXP Semiconductors N.V.'s (NASDAQ:NXPI) Share Price Indicate?": 0.1,
  "2 Biotech Stocks That Could Soar 21% and 245% According to Wall Street's Top Analysts": 0.8,
  "Following a 23% decline over last year, recent gains may please lululemon athletica inc. (NASDAQ:LULU) institutional owners": 0.6,
  "1 Reason PayPal (PYPL) Is 1 of the Best Financial Stocks You Can Buy Today": 0.8,
  "Why You Might Be Interested In CSX Corporation (NASDAQ:CSX) For Its Upcoming Dividend": 0.5,
  "Comcast Insiders Sell US$21m Of Stock, Possibly Signalling Caution": -0.5,
  "Applied Materials Third Quarter 2025 Earnings: Revenues Beat Expectations, EPS Lags": 0.2,
  "Analyst Estimates: Here's What Brokers Think Of Ross Stores, Inc. (NASDAQ:ROST) After Its Second-Quarter Report": 0.5,
  "The \"Ten Titans\" Stocks Now Make Up 38% of the S&P 500. Here's What It Means for Your Investment Portfolio": 0.2,
  "why NXP Semiconductors N.V. is part of the S&P500 and not ASML? - NXPI (stock ticker) similar to ASML are Euorpean (both Netherlands) based companies and are in semi-conductor space. NXPI \\~ USD Market Cap $59-$60 billion. ASML \\~ USD Market Cap $293 billion Quick math with just market cap, shows that ASML is \\~ 4x of NXPI **Question - why is NXPI part of S&P500 (google search shows that it was included back in": -0.5,
  "This Magnificent S&P 500 Dividend Stock Is Down 18% -- Time to Buy?": 0.5,
  "The Motley Fool Just Ranked the Biggest Consumer Staples Stocks. Here's Why the No. 7 Pick Is a \"Recession-Proof\" Goldmine.": 0.5,
  "5 Warren Buffett Stocks to Buy Hand Over Fist and 1 to Avoid": 0.5,
  "A shocking 19% of retirees say they’re living a ‘nightmare’ — how to save yourself from the same terrible fate": -0.8,
  "Nvidia, Alibaba, CrowdStrike, Snowflake, Inflation, and More to Watch This Week": 0.5,
  "This Artificial Intelligence (AI) Stock Will Outperform Nvidia Through 2028": 0.6,
  "‘KPop Demon Hunters’ Is Netflix’s First No. 1 Box-Office Hit": 0.8,
  "Netflix’s ‘KPop Demon Hunters’ is probably the biggest movie in theaters": 0.6,
  "NC wife says husband stopped paying taxes, they now owe IRS $500K — don’t ‘go down’ with him urges Ramsey Show": -0.6,
  "Michael Saylor Hints Fresh Bitcoin Purchases as All-Time Profits Near $26B": 0.8,
  "Where Will Netflix Be in 5 Years?": 0.0,
  "Why DCA into a rising stock and give yourself a worse cost average? - Probably a dumb question but if my original cost basis for a stock is 5 dollars, and it rises nicely and I buy the same number of shares again at 10 dollars, my average will now be 7.50. If the price goes up again to 15 and I increase my shareholdings again so (eg) my new cost basis is 12.50, but": -0.5,
  "Prediction: All \"Ten Titans\" Stocks Will Surpass $1 Trillion in Market Cap by 2030": 0.8,
  "2 Growth Stocks With Sky-High Potential to Hold for Decades": 0.8,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Departure of Chief Accounting Officer On August 22, 2025, Mr. Philip Carter informed Advanced Micro Devices, Inc. (“AMD”) of his resignation as Corporate Vice President and Chief Accounting Officer of AMD, effective September 5, 2025. Mr. Carter has accepted a position as Chief Financial Officer at another company. His resignation is not the result of any dispute": -0.2,
  "(Item 1.01) Entry into a Material Definitive Agreement. On August 22, 2025, Intel Corporation (the “ Company ”) entered into a Warrant and Common Stock Agreement (the “ Purchase Agreement ,” and the transactions contemplated thereby, the “ Transaction ”) with the United States Department of Commerce (the “ DOC ”). Pursuant to the terms of the Purchase Agreement, the Federal Government of the United States of America (the “ US Government ”) agreed to make a\n\n(Item 1.01) above is incorporated by reference herein. The offer and sale of the Shares and the Warrants will be made in reliance upon an exemption from registration under the Securities Act of 1933 (the “ Securities Act ”), pursuant to Section 4(a)(2) thereof for a sale of securities in transactions not involving any public offering. Any Warrant Shares issued upon exercise of the Warrants will be issued in reliance upon the exemption from registration in Section\n\n(Item 8.01) Other Events. The Company is providing the additional risk factor to supplement the risks described in \"Risk Factors\" in the Company’s 2024 Form 10-K, Q1 2025 Form 10-Q and Q2 2025 Form 10-Q. Risk Factors The consummation of the transactions under the Purchase Agreement are subject to a number of risks and uncertainties and the US Government’s ownership of significant equity interests in the Company may subject the Company and it stockholders to a number": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. As part of its ongoing process to strengthen its leadership team and advance its succession plans, T-Mobile US, Inc. (the “Company”) has implemented some changes to its senior leadership team. The Company has appointed André Almeida, a member of the Board of Directors of the Company (the “Board”), as its President of Growth and Emerging Businesses effective": 0.2,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (b) On August 25, 2025, Neil Martin, Senior Vice President, Finance and Chief Accounting Officer (Principal Accounting Officer) of QUALCOMM Incorporated (the Company), accepted the role of Senior Vice President, Corporate Development, where he will lead the Company’s Mergers & Acquisitions (M&A) efforts and other strategic initiatives. In connection with this transition, Mr. Martin decided to": 0.1,
  "(Item 8.01) . Other Events 2024 Minnesota Electric Rate Case In November 2024, Northern States Power Company, a Minnesota corporation ( NSP-Minnesota), and a wholly owned subsidiary of Xcel Energy Inc. filed an electric rate case in Minnesota, seeking a total revenue increase of $491 million (13.2%) over two years, based on a return on equity (ROE) of 10.3%, a 52.5% equity ratio and rate base of $13.2 billion in 2025 and $14 billion in 2026. NSP-Minnesota": -0.2,
  "(Item 8.01) Other Events. ATM Updates On August 25, 2025, Strategy Inc (“Strategy” or the “Company”) announced updates with respect to its at-the-market offering programs: ATM Program Summary During Period August 18, 2025 to August 24, 2025 As of August 24, 2025 Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) Common ATM 875,301 MSTR Shares - $309.9 $16,732.4 $21 billion of class A common stock, $0.001": 0.1,
  "(Item 1.01) Entry into a Material Definitive Agreement Merger Protocol On August 24, 2025, Keurig Dr Pepper Inc. (“ KDP ” or the “ Company ”) and JDE Peet’s N.V. (“ JDE Peet’s ”) entered into a merger protocol (the “ Merger Protocol ”). Pursuant to the Merger Protocol, KDP will commence a tender offer to acquire all of the issued ordinary shares, excluding ordinary shares held in treasury (the “ Shares ”) of JDE Peet’s (the\n\n(Item 1.01) regarding the Bridge Credit Agreement is incorporated herein by reference.": 0.1,
  "A federal contract play - So, as a disabled veteran, I get to see doge and the big bungled bill play out from the other side. Project 2025 calls for the privatization of claims processing and rating. The lobbyists for this were retained by among other companies, optumserve and ves. These companies currently do contracted claims exams for disability benefits. I foresee the inevitable. The same companies churning claims through the denial and appeal process": -0.6,
  "J.P. Morgan Advises Playing the Lower Interest Rates Theme With These 2 Food Stocks": 0.5,
  "Dividend Income - Questions and I admit that I am green. I'm looking for a dividend position that will generate the most quarterly dividend for the smallest investment. I'm not looking to retire yet, but who isn't. How would you generate $40k a quarter in dividend return? What kind of initial investment would you need? I understand that this is not a good tax position while you're working, but when I'm at $5K with SSC,": 0.2,
  "Purr-fect Destinations: Agoda's Top Picks in Asia for Cat Lovers": 0.6,
  "Why didn’t Intel go up as expected? - So I was watching INTC pretty closely this week, especially after the headlines that the US government was planning to take a roughly 10% stake in Intel through the CHIPS Act funding. That sounded like a massive vote of confidence, so I was honestly expecting a strong move up. There *was* a small intraday jump, but the stock faded pretty quickly and ended up flat. Given the": 0.2,
  "Trump Threatens NBC, ABC Licenses Over News Coverage": -0.8,
  "Dow Jones Futures: Nvidia Is Next Big Market Test After Powell-Led Rally": 0.5,
  "A Look Back at Analog Semiconductors Stocks’ Q2 Earnings: Texas Instruments (NASDAQ:TXN) Vs The Rest Of The Pack": 0.1,
  "Gemini Going Public In September - There’s a chance it gets listed on Sept. 2. With a crypto-friendly administration, Bitcoin and even ETH recently hitting all-time highs, especially with record inflows into ETFs and more companies adding them to reserves anything crypto related is doing crazy good. Stocks tied to crypto, like Circle and Bullish, have seen some crazy gains during their IPO day. Not financial advice... I’m just going to keep looking into it": 0.8,
  "JP Morgan Raises MercadoLibre (MELI) Target Despite Rising Competition Concerns": 0.5,
  "DoorDash (DASH) Expands McDonald’s Partnership to Boost Growth and Access": 0.6,
  "JP Morgan Raises Take-Two (TTWO) Target on Strong Q1 and GTA VI": 0.8,
  "Raymond James Rates Microchip (MCHP) Strong Buy on AI and Earnings": 0.8,
  "Shopify’s (SHOP) Q3 Guidance Points to Strong Growth": 0.8,
  "Advanced Micro Devices (AMD) Pursues Semiconductor Growth Opportunities in Malaysia": 0.5,
  "2 Growth Stocks with All-Star Potential and 1 We Ignore": 0.5,
  "1 Growth Stock Set to Flourishand 2 Facing Challenges": 0.2,
  "2 Volatile Stocks with Solid Fundamentals and 1 That Underwhelm": 0.2,
  "2 Semiconductor Stocks with Exciting Potential and 1 We Turn Down": 0.5,
  "1 Unpopular Stock That Deserves Some Love and 2 We Avoid": 0.2,
  "3 Volatile Stocks We Think Twice About": -0.7,
  "The 5 Most Interesting Analyst Questions From Palo Alto Networks’s Q2 Earnings Call": 0.6,
  "Do Wall Street Analysts Like Vertex Pharmaceuticals Stock?": 0.2,
  "Austria and Germany to become the first markets in the European Union (EU) to launch LEQEMBI® (lecanemab)": 0.5,
  "Intel Stock Still Looks Like Dead Money. Why This Chip Maker Is a Better Bet.": -0.5,
  "My 3 Favorite Stocks to Buy Right Now": 0.5,
  "Mechanical & Electromechanical Locks Market Insights Report 2025-2030 Featuring Prominent Vendors - Allegion, ASSA ABLOY, Fortune Brands Innovations, dormakaba Group, and HONEYWELL": 0.2,
  "Should You Buy Broadcom Stock Before Sept. 4? The Answer Might Surprise You.": 0.5,
  "\"Was Powell serious about his dovish signals at Jackson Hole?\" - Look at that crazy PPI in July and then Walmart’s earnings call, all this is telling us inflation is coming And Powell even assumes that under normal conditions tariff inflation is just temporary, doesn’t he realize Trump’s global tariffs are completely new, no history at all, an extra cost that can’t be avoided or digested anywhere And in this situation he even talks about": -0.6,
  "These 5 AI Stocks Could Be Smart Buys for Long-Term Investors": 0.8,
  "Prediction: 3 Magnificent Stocks That'll Be Worth More Than Palantir by 2028": 0.5,
  "Post-Quantum Cryptography Market Outlook Report 2025-2035, with Profiles of Crypta Labs, ISARA, MagiQ Technologies, NEC, NXP Semiconductors, Quantum Xchange, Qubitekk, QuintessenceLabs, and More": 0.2,
  "4 medtech topics to watch for the rest of 2025": 0.0,
  "Software shares are in the doldrums. Blame AI": -0.6,
  "Crypto Giants Galaxy, Jump and Multicoin Seek $1B to Raise Largest Solana Treasury: Report": 0.5,
  "Should You Buy Intuitive Surgical Stock Today, or Wait for a Better Price?": 0.2,
  "MicroStrategies NAV Premium Is Too High": -0.6,
  "If You'd Invested $1,000 in SoFi Technologies (SOFI) Stock 3 Years Ago, Here's How Much You'd Have Today. (Spoiler: Wow.)": 0.8,
  "The Earnings Party Hits a Wall: Strong Q2 Profits Can't Overcome Macro Fears": -0.6,
  "US Equity Investors to Look Out for Fed's Preferred Inflation Data, Nvidia's Earnings This Week": 0.5,
  "Intelligent AI Dashboard Agent (2025): QuickBooks Named Best All-in-One Real-Time Business Insights Tool by Software Experts": 0.8,
  "Xscape Photonics and Tower Semiconductor Unveil the Industry’s First Optically Pumped On-Chip Multi-Wavelength Laser Platform for AI Datacenter Fabrics": 0.8,
  "BeOne Medicines Announces IMDELLTRA Royalty Purchase Agreement for up to $950 Million": 0.8,
  "Fortune Global Forum 2025 to Convene in Riyadh, Saudi Arabia Oct. 26-27": 0.5,
  "The big 'question mark' Intel still needs to answer": -0.5,
  "Jeffrey Katzenberg talks AI in media, Disney, Netflix, Skydance": 0.2,
  "Stocks Set to Open Lower as Fed Rate-Cut Optimism Fades, Nvidia Earnings and U.S. PCE Inflation Data Awaited": -0.5,
  "Daiichi Sankyo and AstraZeneca’s Datroway receives approval in China": 0.5,
  "How Investors Are Reacting To Micron Technology (MU) Upgrading Its Q4 Revenue and Earnings Forecasts": 0.5,
  "Royalty Pharma to Acquire Royalty Interest in Amgen’s Imdelltra for up to $950 Million": 0.5,
  "What Intuitive Surgical (ISRG)'s Expected Earnings Growth and System Placements Mean for Shareholders": 0.5,
  "What MercadoLibre (MELI)'s Surge in Institutional Buying Means for Shareholders": 0.5,
  "What Datadog (DDOG)'s Progress Toward GovRAMP High Authorization Means for Shareholders": 0.5,
  "Does Broadcom's (AVGO) AI Push Signal a New Phase in Its Data Infrastructure Strategy?": 0.5,
  "Why Palo Alto Networks (PANW) Is in Focus After CTO Transition and 2026 Earnings Guidance Update": 0.2,
  "Did Uphold’s New PayPal Integration Mark a Turning Point in PYPL’s Digital Asset Strategy?": 0.5,
  "Does Kraft Heinz's (KHC) Flavor Expansion Hint at a Deeper Shift in Brand Strategy?": 0.2,
  "Palantir Technologies (PLTR) Is Down 8.8% After Insider Selling and Valuation Concerns Despite Strong Results": -0.6,
  "What the Rally in Constellation Energy Means After Its $600 Million Nuclear Investment": 0.5,
  "Is Lam Research's (LRCX) Aggressive Buybacks and Analyst Optimism Shaping a New Growth Narrative?": 0.6,
  "Slower Ad Growth and Analyst Downgrade Might Change the Case for Investing in Trade Desk (TTD)": -0.5,
  "The Bull Case For Alphabet (GOOGL) Could Change Following T-Mobile’s Launch of Gemini-Powered Pixel 10 Devices": 0.5,
  "How Investors Are Reacting To Fortinet (FTNT) Expanding Its Share Buyback Program by $1 Billion": 0.5,
  "Is Costco Still a Good Bet After Recent Earnings Growth Slows in 2025?": -0.5,
  "The Bull Case For Marvell Technology (MRVL) Could Change Following Microsoft Expanding Azure Security Partnership": 0.5,
  "Is Celsius Still a Good Value After the 53% Rally and PepsiCo Distribution Milestone?": 0.5,
  "Atlassian (TEAM) Valuation: Gauging Upside After Strong Revenue Beats and Market Optimism": 0.6,
  "PDD Holdings Announces Second Quarter 2025 Unaudited Financial Results": 0.0,
  "2 Magnificent Dividend Stocks Down 17% and 27% I'm Buying Right Now": 0.5,
  "Royalty Pharma to pay up to $950 million for royalties from Amgen's lung cancer drug": 0.5,
  "Air Taxi Market Forecast and Company Analysis 2025-2033 Featuring Honeywell International, AB Corporate Aviation, Skyway, Airbus, Kitty Hawk, Fly Aeolus, Neva Aerospace, Hyundai, Joby, Talkeetna": 0.5,
  "Temu-owner PDD tops revenue estimates, competition squeezes margins": 0.1,
  "Stablecoins set to transform cross-border payments": 0.8,
  "Keurig Dr Pepper to Acquire JDE Peet's in $18.37 Billion Deal, Split Into Two Independent Companies": 0.5,
  "Timken Names Lucian Boldea President and Chief Executive Officer": 0.5,
  "Trump Threatens NBC, ABC's Licenses Over Alleged \"Bias\" in Reporting": -0.8,
  "Biogen and Stoke Therapeutics Announce Presentations of Clinical Data from Studies of Zorevunersen for the Potential Treatment of Dravet Syndrome at the 36th International Epilepsy Congress": 0.5,
  "Domaine Launches AI Commerce Suite to Help Ecommerce Brands Capture Surging AI Traffic on Shopify": 0.5,
  "Which Is the Better Buy Right Now: Costco or Home Depot Stock?": 0.0,
  "Stoke Therapeutics and Biogen Announce Presentations of Clinical Data from Studies of Zorevunersen for the Potential Treatment of Dravet Syndrome at the 36th International Epilepsy Congress": 0.5,
  "Option Volatility And Earnings Report For Aug 25 – 29": 0.0,
  "Why Texas Instruments Incorporated (NASDAQ:TXN) Could Be Worth Watching": 0.5,
  "Furniture stocks, Keurig Dr Pepper fall premarket; Verint rises": 0.2,
  "These AI Stocks Face 'Show Me' Moment: Nvidia, Snowflake, Palantir, CoreWeave": 0.2,
  "PDD Holdings shares rally as Q2 earnings smash expectations": 0.8,
  "Figma draws 'neutral' ratings as Wall Street wary of lofty valuation, rising competition": -0.5,
  "I was laid off at 61 and got approval to start Social Security — then I got a job offer. Should I crawl back to work?": 0.2,
  "Joby Aviation promised 2,000 jobs in Ohio… but progress looks slow, will it affect stock? - Last year, Joby Aviation made headlines for announcing a huge project in Dayton, Ohio 2,000 jobs and nearly $500M in investment. In exchange, Ohio pledged up to $200M in incentives. **Fast forward to now:** the facility they leased is still quiet, their website only shows a handful of open roles in Dayton, and their CEO sidestepped questions about progress": -0.6,
  "Stocks Decline Pre-Bell as Traders Brace for Key Inflation Report, Nvidia Earnings": -0.5,
  "[Latest] Global Targeted Drug Delivery Market Size/Share Worth USD 39.6 Billion by 2034 at a 15.5% CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trends, Forecast, Segmentation, Growth Rate, Value, SWOT Analysis)": 0.5,
  "Rising Demand in Electronics to Drive Data Converter Market to $7.4 Billion by 2028": 0.8,
  "Are Wall Street Analysts Bullish on Trade Desk Stock?": 0.5,
  "Fed Rate Cut Outlook Dents Wall Street Pre-Bell; Asia up, Europe Off": -0.5,
  "Retail Investors' Top Stocks With Q2 Earnings This Week: NVIDIA, Webull, IREN And More": 0.5,
  "CDW Corporation Stock Outlook: Is Wall Street Bullish or Bearish?": 0.2,
  "5 Things to Know Before the Stock Market Opens": 0.0,
  "Spotlight On AppLovin And Two Other Top Insider-Owned Growth Stocks": 0.5,
  "Buy Cisco on Strong Guidance, Estimate Revisions and Short-Term Upside": 0.8,
  "This Week In AI Chips - AI Transforms Truck Parking on California's I-10 Corridor": 0.5,
  "I’m 60 and have been diagnosed with a terminal illness requiring constant care. How am I going to pay for it?": -0.8,
  "PDD Holdings Inc. Sponsored ADR (PDD) Q2 Earnings and Revenues Top Estimates": 0.6,
  "Applebee’s names new chief marketing officer and chief operations officer": 0.2,
  "GoBolt Joins Shopify Fulfillment Network, Offering Brands Speed, Flexibility, and Cost Savings": 0.8,
  "Immuneering Announces Clinical Supply Agreement with Lilly to Evaluate Atebimetinib in Combination with Olomorasib": 0.5,
  "Better Fintech Stock: Block vs. PayPal": 0.5,
  "We Like Adobe's (NASDAQ:ADBE) Returns And Here's How They're Trending": 0.6,
  "Before Top Stocks Usher In The Golden Sell Rule, Here's When To Cut Losses Faster": 0.2,
  "This AI Stock Just Snagged an NFL Deal. Should You Buy Shares Here?": 0.5,
  "Market Sunrise exclusive: Synthesia": 0.0,
  "Michael Saylor's Strategy Added 3,081 Bitcoin, Bringing Stack to Nearly 632.5K": 0.8,
  "Strategy sells 875,301 MSTR shares after updating its 2.5x mNAV guidance": 0.5,
  "Exchange-Traded Funds, Equity Futures Lower Pre-Bell Monday Ahead of Economic Data": -0.5,
  "Royalty Pharma buys BeOne stake in Amgen lung cancer drug sales": 0.1,
  "Here's How Much You'd Have If You Invested $1000 in Analog Devices a Decade Ago": 0.5,
  "Synopsys Stock Outlook: Is Wall Street Bullish or Bearish?": 0.2,
  "Michael Saylor’s Strategy Adds 3,081 BTC in $356.9M Purchase": 0.8,
  "KLA Corporation Stock: Analyst Estimates & Ratings": 0.0,
  "White House's Hassett says US could take stakes in other chip companies": 0.2,
  "Temu Owner PDD’s Profit Falls Less Than Expected": 0.5,
  "Digital Payment Today - Vietnam's Fintech Boom: A Cashless Future Emerges": 0.8,
  "Jerome Powell’s rate cut hint puts tech stock rally to the test": 0.2,
  "IDEXX Gains 56.2% in a Year: What's Driving the Rally?": 0.6,
  "If You'd Invested $10,000 in Shopify Stock 10 Years Ago, Here's How Much You'd Have Today": 0.5,
  "New Book Empowers Construction Professionals with Essential Knowledge on Surety Bonds: \"The Contractor's Guide to Surety Bonds: A Primer on Contract Surety Bonding for Construction Professionals\" by C. Constantin Poindexter Now Available on Amazon and Barnes & Noble": 0.6,
  "US Equity Futures Decline as Traders Temper Rate Cut Optimism": -0.5,
  "QCOM Gaining Traction in V2X Market: Will it Be a Key Growth Driver?": 0.6,
  "REPATHA® NOW INDICATED FOR ADULTS AT INCREASED RISK FOR MAJOR ADVERSE CARDIOVASCULAR EVENTS DUE TO UNCONTROLLED LDL-C": 0.2,
  "Kraft Heinz to Participate at 2025 Barclays Global Consumer Staples Conference": 0.2,
  "Here is What to Know Beyond Why Shopify Inc. (SHOP) is a Trending Stock": 0.2,
  "Is Trending Stock Datadog, Inc. (DDOG) a Buy Now?": 0.2,
  "Here is What to Know Beyond Why Cadence Design Systems, Inc. (CDNS) is a Trending Stock": 0.2,
  "Is Trending Stock Costco Wholesale Corporation (COST) a Buy Now?": 0.2,
  "Here's Why You Should Give Old Dominion Stock a Miss Now": -0.8,
  "Nvidia, Best Buy, Ulta Beauty and Amazon are part of Zacks Earnings Preview": 0.2,
  "Improve Your Retirement Income with These 3 Top-Ranked Dividend Stocks": 0.5,
  "Zacks Market Edge Highlights: ARKK, Tesla, Palantir Technologies, Robinhood Markets and Tempus": 0.2,
  "Update: Market Chatter: India to Use Amazon, Flipkart Data in Inflation Index Revamp": 0.2,
  "DHL Expands its International Shipping Services on Shopify for U.S. Merchants": 0.5,
  "Wall Street's Insights Into Key Metrics Ahead of Marvell (MRVL) Q2 Earnings": 0.5,
  "Countdown to Autodesk (ADSK) Q2 Earnings: A Look at Estimates Beyond Revenue and EPS": 0.2,
  "Zacks Investment Ideas feature highlights: Chipotle Mexican Grill and Fortinet": 0.5,
  "Traffic Management Company Benchmark Report 2025 | Huawei, Mundys SpA, and Cisco Lead with Smart Infrastructure, Real-Time Data, and Scalable Digital Solutions": 0.6,
  "Zacks Investment Ideas feature highlights: Nvidia and Marvell Technology": 0.5,
  "Stock Market News for Aug 25, 2025": 0.0,
  "Company News for Aug 25, 2025": 0.0,
  "Is It Worth Investing in Zscaler (ZS) Based on Wall Street's Bullish Views?": 0.5,
  "Earnings Growth & Price Strength Make Lam Research (LRCX) a Stock to Watch": 0.8,
  "Earnings Growth & Price Strength Make Micron (MU) a Stock to Watch": 0.8,
  "Zacks Industry Outlook Highlights Cisco Systems Extreme Networks and RADCOM": 0.0,
  "The Zacks Analyst Blog Highlights NVIDIA, Alphabet, Meta Platforms, Amazon.com and Microsoft": 0.5,
  "How to Find Strong Buy Computer and Technology Stocks Using the Zacks Rank": 0.5,
  "The Zacks Analyst Blog Highlights NVIDIA, Cisco and Linde": 0.5,
  "Are You a Growth Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Here's Why Workday (WDAY) is a Strong Growth Stock": 0.8,
  "PDD Stock Swings After the Temu Parent’s Earnings Smashed Expectations. Here’s Why.": 0.6,
  "r/Stocks Daily Discussion Monday - Aug 25, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.2,
  "Keurig Dr. Pepper (KDP) buys Peet’s (JDE) for $18B and will split into two separate companies - Keurig Dr Pepper will buy the owner of Peet's Coffee in an $18 billion (15.7 billion euro) deal, then break itself in two, with one company selling coffee and the other selling cold beverages like Snapple, Dr Pepper, 7UP and energy drinks. The agreement anounced Monday will essentially unwind the 2018 merger of Keurig and Dr. Pepper and": 0.2,
  "AI Chip Boom Sends Aehr Stock Surging As Major Cloud Giant Places Big Test System Order": 0.8,
  "Bitcoin, Ethereum, XRP Fall Amid Crypto Flash Crash. Why They’ve Given Up Gains.": -0.6,
  "My OKTA Earnings analysis - Here is my analysis of Okta Inc.'s earnings – ticker: OKTA – after the market close tomorrow. General information about the company: Okta Inc. is a leading provider of cloud-based identity and access management solutions for businesses. Its business model is based on providing a platform that allows employees and customers to log in securely and seamlessly to a wide variety of applications (“Identity as a Service”). Core products include": 0.2,
  "Currency spikes and Trump tariffs take bite out of European results": -0.6,
  "DexCom Insiders Sold US$11m Of Shares Suggesting Hesitancy": -0.5,
  "Strategy Buys 3,000 More Bitcoins. Why the Stock Is Falling.": -0.5,
  "Intel stock little changed after Trump says, 'I love seeing their stock price go up'": 0.5,
  "Burke Wealth Management Sold Airbnb (ABNB) due To Elevated Economic Sensitivity And Reduced Visibility": -0.6,
  "Nvidia Earnings Bring Focus to China. What It Means for the Stock.": 0.5,
  "CrowdStrike Q2 Earnings Preview: What to Expect From Upcoming Report": 0.5,
  "Supermicro, Lambda Expand AI Infrastructure With Nvidia Blackwell-Powered Servers": 0.5,
  "Take the Zacks Approach to Beat the Markets: WisdomTree, SkyWest & PepsiCo in Focus": 0.5,
  "Can The Trade Desk's CTV Momentum Fend Off Rising Competition?": 0.2,
  "Keurig Dr Pepper to buy JDE Peet's in $18.4B deal: What to know": 0.2,
  "'He shares our values.' Timken Co. lands its new CEO": 0.5,
  "HBM Drives Micron's Growth: Can MU Sustain the Momentum?": 0.5,
  "Figma, Netflix, Disney, Comcast: Trending Tickers": 0.0,
  "CRDO vs. AVGO: Which Data Center Connectivity Stock is the Better Buy?": 0.5,
  "Coinbase, Circle, Strategy, MARA Lead Crypto Stock Post-Rally Sell-Off": 0.2,
  "Robomart unveils new delivery robot with $3 flat fee to challenge DoorDash, Uber Eats": 0.5,
  "NVIDIA Blackwell-Powered Jetson Thor Now Available, Accelerating the Age of General Robotics": 0.8,
  "Here's How Costco's Digital Shift Is Emerging as Key Growth Driver": 0.5,
  "Starbucks' behind-the-scenes shift hints at brewing struggles": -0.5,
  "Cybersecurity Stocks: CrowdStrike Price Target Cut, Verint Acquired And Netskope IPO": 0.2,
  "Bill Gates And Jeff Bezos Bet On Robots: FieldAI Hits $2 Billion Valuation After $405 Million Raise Backed By Nvidia": 0.8,
  "Trump gets a fallen icon in Intel: Opening Bid top takeaway": 0.1,
  "Nvidia’s new ‘robot brain’ goes on sale for $3,499 as company targets robotics for growth - Nvidia announced Monday that its latest robotics chip module, the Jetson AGX Thor, is now on sale for $3,499 as a developer kit. The company calls the chip a “robot brain.” The first kits ship next month, Nvidia said last week, and the chips will allow customers to create robots. After a company uses the developer kit to prototype": 0.6,
  "Fortinet Expands Share Buyback Program by $1B: Buy Now or Hold?": 0.5,
  "Piper Sandler Remains Bullish on Diamondback Energy (FANG)": 0.6,
  "If RKLB and ASTS make up ~44% of your portfolio, would you add more at current prices? - RKLB and ASTS make up \\~33% and \\~11% of my portfolio today (admittedly a very modest <300K portfolio at 40 years old). RKLB is my largest holding, and 2nd place switches between ASTS and QQQM depending on the day. My gains sit at about \\~850% and \\~100% on the 2 stocks. I am adding to my overall": 0.5,
  "Meta Partners with Midjourney to Improve Visual Generation Elements": 0.5,
  "What a $1 Billion Solana Treasury Play Would Mean for SOL": 0.5,
  "Help finding this BigChart sector rotational data chart - In an old tool I had called Investools, there used to be a visual indicator from Big Charts showing the recent 3 month weekly percentage ranking values for industry and sector. It showed it as a colored bar like this circled on the linked image below. What is this indicator called and can it be found in the same way on Big Charts or somewhere else?": 0.0,
  "BZLFY or MDLZ: Which Is the Better Value Stock Right Now?": 0.2,
  "Roku's Ad Growth Outpaces OTT Market: Is Revenue Momentum Sustainable?": 0.5,
  "What's Going On With AMD Stock Monday?": 0.1,
  "Nasdaq Gets a Boost From the Mag 7": 0.6,
  "Orlando man wants girlfriend to move in so he can get out of debt sooner — but Dave Ramsey sees huge red flags": -0.7,
  "Virtru and Microsoft Reach Settlement in Patent Infringement Case": 0.5,
  "Cisco (CSCO) Upgraded to Buy: What Does It Mean for the Stock?": 0.5,
  "Why Are Tilray (TLRY) Shares Soaring Today": 0.5,
  "Rocket Lab (RKLB) Shares Skyrocket, What You Need To Know": 0.8,
  "Byrna (BYRN) Stock Trades Up, Here Is Why": 0.5,
  "Why MicroStrategy (MSTR) Stock Is Falling Today": -0.5,
  "MSFT Rides on AI Strategy: Can Rising CapEx Drive Future Growth?": 0.5,
  "PGA of America, Omaha Productions and Pro Shop Studios Announce T-Mobile Breakfast at Bethpage; A First-of-its-Kind Fan Experience Show LIVE from the First Tee of the Ryder Cup Each Morning": 0.5,
  "Trump Says He Wants More Stakes in Companies After Intel Deal": 0.2,
  "Meta Stands to Benefit From White House Opposition to the EU DSA": 0.5,
  "Tesla, GM, Ford EV buyers get extra breathing room ahead of tax credit expiration": 0.5,
  "American Eagle downgraded, Puma soars, Musk sues Apple & OpenAI": -0.5,
  "U.S. Plastics Pact Welcomes Four New Members to Board of Directors": 0.5,
  "Buffett: Berkshire will not bid for CSX or Norfolk Southern": -0.5,
  "XRP lawyer predicts 40% surge for MicroStrategy stock": 0.6,
  "[Latest] Global Chemical Reagents Market Size/Share Worth USD 26.5 Billion by 2034 at a 7.5 CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trends, Forecast, Segmentation, Growth Rate, Value, SWOT Analysis)": 0.5,
  "Trump again pushes US agency to revoke NBC, ABC station licenses": -0.8,
  "The numbers are clear: Average market gains after a rate cut (1,3,6 and 12 months out after a cut) for the last 45 years - You can see the full table here: https://imgur.com/a/gkNRzNq Average gains after: 1 month: -.2% 3 months : 2.1% 6 months: 3.8% 12 months: 13.9% So the first month is down but after that you’ll see some good gains (on average). You can see the median numbers too. It should be": 0.6,
  "2 AI Chip Stocks Poised to Win on Wall Street Next": 0.5,
  "Okta Stock Gets a Buy Rating Ahead of Earnings. Why It’s Being Upgraded Now.": 0.5,
  "3 Reasons Why Growth Investors Shouldn't Overlook Idexx (IDXX)": 0.5,
  "Amazon, Meta Among Early Adopters Of Nvidia's Jetson Thor Robotics Platform": 0.5,
  "Coca-Cola selling big coffee brand it bought to take on Starbucks": 0.5,
  "3 Railroad Stocks to Watch From the Prospering Industry": 0.5,
  "Musk's X, xAI Sue Apple, OpenAI for Alleged 'Anticompetitive Scheme'": -0.6,
  "NVDA Up 35% Into Earnings - Nvidia reports earnings on Wednesday (Aug 27) after the close, and the setup looks like a textbook high-stakes event. The stock is currently trading at $181.30, up over 35% in the past three months, and the technicals tell a mixed story heading into earnings. On the positive side, the long-term trend is still strong. Nvidia is trading above its 10-day ($179), 50-day ($167), and 200-day ($137) moving averages, which": 0.5,
  "Down 50% From Its Highs, How Should You Play Newly Public Figma Stock Here?": 0.2,
  "Elon Musk sues Apple & OpenAI, Roblox rises, Alphabet's new high": 0.5,
  "Strategy Adds $357 Million in Bitcoin After Resuming Common Stock Offerings to Fund BTC Buys": 0.5,
  "A thorough analysis of PSKY (5-year DCF included) - Background - Skydance Media was a private company founded by David Ellison (son of Larry Ellison, co-founder of Oracle with an estimated ~$300b net worth) in 2006. Skydance co-financed and co-produced major blockbuster films with established studios, such as Paramount. Some of the films they worked on include World War Z, Annihilation, 4 Mission Impossible films, and Top Gun: Maverick. While private, Skydance received a $275m": 0.5,
  "This China EV Name Blows Away Tesla Stock. Here's Why.": 0.5,
  "BeOne Cashes In On Amgen's Cancer Drug Royalties In Multibillion-Dollar Pharma Tie-Up": 0.5,
  "IonQ, Inc. (IONQ) Is A Quantum Computing Stock Jim Cramer Rightly Warned About": -0.5,
  "Microsoft Corporation (MSFT) Is Up 19% Since Jim Cramer’s Quantum Computing Comments": 0.6,
  "Buffett shoots down talk of Berkshire railroad merger, CSX shares slide": -0.5,
  "Nvidia earnings: 'Overpriced optimism' is a 'legitimate risk'": -0.5,
  "Intuit’s (INTU) Disappointing Outlook Makes It an Unusual Options Discount": -0.5,
  "Royalty Pharma (RPRX) Acquires US$885 Million Royalty Interest In Amgen's Imdelltra": 0.5,
  "US Equity Indexes Mixed as Nvidia Helps Lift Nasdaq Composite": 0.5,
  "Sector Update: Tech Stocks Mixed Monday Afternoon": 0.0,
  "Why Palantir Stock Continued to Plunge Today": -0.7,
  "IDrive® e2 Introduces Multi-Factor Authentication (MFA) with Delete Protection for Enhanced S3-Compatible Object Storage Security": 0.6,
  "Equities Mixed Intraday as Markets Await Nvidia Earnings, Key Inflation Data": 0.2,
  "What Cybersecurity, Shoes, and Homebuilders Tell Us About Change": 0.2,
  "3 Stocks That May Be Undervalued By As Much As 46.1%": 0.5,
  "Micron Stock Investors Are Worried About a Potential Trump Admin Investment. How Should You Play MU Here?": 0.1,
  "Warren Buffett Quashes BNSF-CSX Merger Rumors as Railroads Roll Out Coast-to-Coast Services": 0.5,
  "Wall Street Sees 53% Upside in Workday Stock. Is WDAY a Buy Now?": 0.6,
  "Elon Musk accuses Apple and OpenAI of stifling AI competition in antitrust lawsuit": -0.8,
  "FDA Flags Alarming Contamination At Novo Nordisk Indiana Plant, Including Cat Hair, Bacteria, And Foreign Particles": -0.8,
  "ADBE vs. PEGA: Which Enterprise Software Stock is a Better Buy Now?": 0.5,
  "SignalPlus and Deribit summer trading competition breaks records with $10 billion volume": 0.8,
  "AVGO's Strong Portfolio Drives Up Semiconductor Sales: What's Ahead?": 0.6,
  "NVTS vs. ADI: Which Semiconductor Stock is a Better Buy Now?": 0.2,
  "Chime secures new distribution channel with Workday partnership": 0.6,
  "Alphabet Expands Pixel Portfolio: Is it the Next Revenue Pillar?": 0.5,
  "TI CEO Haviv Ilan to speak at Goldman Sachs investor conference": 0.5,
  "NotebookLM’s Video Overviews feature now supports 80 languages": 0.8,
  "Google will require developer verification for Android apps outside the Play Store": 0.2,
  "8 Growth Stocks to Buy That Aren’t Technology. What Makes Them Worth It.": 0.5,
  "Nvidia Q2 Earnings Preview: Can Jensen Huang Lead NVDA Stock, Broader Market to New Highs?": 0.6,
  "At US$537, Is Roper Technologies, Inc. (NASDAQ:ROP) Worth Looking At Closely?": 0.2,
  "Saudi AI firm Humain breaks ground on first data centers, seeks U.S. chips": 0.2,
  "Musk sues Apple and ChatGPT maker for ‘conspiring’ against him": -0.7,
  "AVGO: Broadcom Stock Rises as UBS Lifts Target on Google AI Chip Demand": 0.8,
  "As Meta Overhauls Its AI Team, What Does That Mean for META Stock?": 0.1,
  "CrowdStrike's Q2 Test: Can Profitability and AI Outshine Growth?": 0.5,
  "Alphabet Stock Rises as Reports Hint at Google AI Powering Future Siri": 0.6,
  "Elon Musk’s xAI Sues Apple and OpenAI, Alleging They Are Monopolists": -0.5,
  "Why Nvidia's Earnings Matter for the Markets": 0.1,
  "Veteran analyst sends alert after stock market flashes rare signal": 0.5,
  "Should You Buy, Hold, or Sell CrowdStrike Stock Ahead of Q2 Earnings?": 0.0,
  "What Temu-owner PDD's Q2 beat says about the Chinese economy": 0.2,
  "Amazon Rebounds From Post-Q2 Selloff. Is Amazon Stock A Buy?": 0.5,
  "Here's Why We Think Xcel Energy (NASDAQ:XEL) Might Deserve Your Attention Today": 0.5,
  "Government's Intel stake highlights risks of 'deals-based capitalism,' former Treasury Secretary says": -0.5,
  "Boring Is Better. These 3 Stocks Prove It.": 0.2,
  "Market Chatter: OpenAI's Brockman Supports Launch of $100 Million Initiative to Influence AI Regulation": 0.5,
  "SPECTRUM REACH ACQUIRES SHOWSEEKER": 0.2,
  "How to take your business from $0 to $10M ARR": 0.5,
  "Is Tilray an indication of Change? - With Tilray (TLRY) surging on renewed optimism around U.S. cannabis policy reform and European expansion, do you see its current momentum as the early signal of a broader ‘regulation bull run’ in the cannabis sector? Is now the time to go in deep, or is this just another short-lived pop in a historically volatile space?": 0.2,
  "Analysts rework price target on Broadcom ahead of earnings": 0.2,
  "Inside Elon Musk's suit against Apple and OpenAI: 'This is a tale of two monopolists'": -0.5,
  "A $10 Billion Reason to Buy This Quantum Computing Stock Now": 0.5,
  "Sector Update: Consumer Stocks Mixed Late Afternoon": 0.0,
  "US Equity Indexes Mixed Amid Higher Treasury Yields, Dollar": 0.0,
  "Sector Update: Tech Stocks Mixed in Late Afternoon Trading": 0.0,
  "AI Disruption Fear Sparks Investor Scrutiny of Software Stocks": -0.5,
  "X-energy, Amazon, Korea Hydro & Nuclear Power, and Doosan Enerbility Announce Partnership to Scale Advanced Nuclear Energy for AI Infrastructure": 0.6,
  "AI Stock Averaging 185% Growth Joins Nvidia, Google On Elite List — And Pops Into Buy Range": 0.8,
  "GoPro (GPRO) Stock Trades Up, Here Is Why": 0.5,
  "Stock market today: Dow slides from record, S&P 500, Nasdaq fall with Nvidia earnings looming": -0.5,
  "Skyworks Names Phil Carter as Chief Financial Officer": 0.5,
  "Tesla Stock Flirts With Buy Point As Elon Musk Sounds This FSD Warning": 0.5,
  "Could Trump's Intel deal could be the new norm?": 0.2,
  "Keurig Dr Pepper Is Buying JDE Peet’s. Should You Buy the Dip in KDP Stock Here?": 0.2,
  "Trump wants to call shots at all types of businesses. Here’s why that’s a problem": -0.6,
  "Intel’s Trump Deal Is Just 1 More Reason to Sell, Analyst Says": -0.6,
  "The Stock Market Needs to Think About the Unthinkable: A Disappointment From Nvidia": -0.6,
  "US Equity Markets End Lower Amid Soft Economic Data": -0.5,
  "Keurig Dr Pepper will buy a Dutch coffee group for over $18 billion and split into two companies": 0.5,
  "Tesla Stock Rises. Why Shares Could Be Headed for a Breakout.": 0.8,
  "Apple's Biggest iPhone Overhaul in a Decade Could Redefine the Stock's Next Growth Cycle": 0.8,
  "Market Chatter: EPIC Crude Pipeline Could be Valued at $3 Billion in Possible Sale": 0.6,
  "Why Apple Stock Could Sell Off After iPhone 17 Reveal": -0.6,
  "Elon Musk's X & xAI sue Apple & Open AI: What happens next?": 0.1,
  "$7,500 EV Tax Credit Extended For Tesla, Other Automakers — Kind Of": 0.5,
  "Watch These Intel Stock Price Levels After Chipmaker Agrees to Give Government 10% Stake": 0.2,
  "How major US stock indexes fared Monday, 8/25/2025": 0.0,
  "Musk Sues OpenAI and Apple Over AI Access in App Store": -0.6,
  "CrowdStrike Named a Leader in the 2025 IDC MarketScape: Worldwide Exposure Management": 0.6,
  "Freddie Mac Issues Monthly Volume Summary for July 2025": 0.0,
  "Perplexity AI Unveils $42.5M Publisher Payout Amid Lawsuits and $34.5B Chrome Bid": -0.5,
  "Stock Market Today: Dow Drops, Apple Firm Despite Musk Threat; Cathie Wood Loads Up On This Stock (Live Coverage)": 0.1,
  "Dow Loses About 350 Points After Record-Breaking Run": -0.7,
  "Trump turns Intel into a U.S. ‘national champion’ with new stake": 0.5,
  "These Stocks Are Moving the Most Today: Intel, Keurig Dr Pepper, Wayfair, Strategy, Nvidia, Vital Energy, and More": 0.5,
  "Elon Musk's xAI sues Apple and OpenAI over AI competition": -0.5,
  "Keurig Dr Pepper to acquire JDE Peet’s coffee": 0.5,
  "PDD Stock Jumps as Temu Owner Smashes Q2 Earnings Forecasts": 0.8,
  "Starbucks’ Fall Menu Looks Attractive. So Does the Competition.": 0.5,
  "5 Private Investors Get Shafted As The U.S. Takes 10% Of Intel": -0.6,
  "NVDA Earnings, AI Hype, and Cybersecurity Trends": 0.5,
  "AI sycophancy isn’t just a quirk, experts consider it a ‘dark pattern’ to turn users into profit": -0.6,
  "US Equity Indexes Fall Amid Gains in Treasury Yields, Dollar": -0.5,
  "Trump and RFK Jr. to Ban COVID-19 Vaccine ‘Within Months’ - https://www.thedailybeast.com/donald-trump-and-robert-f-kennedy-junior-to-ban-covid-19-vaccine-within-months/ > The Trump administration will move to pull the COVID vaccine off the U.S. market “within months,” one of Robert F. Kennedy Jr.’s closest associates has told the Daily Beast. Dr. Aseem Malhotra, a British cardiologist who has repeatedly claimed in the face of scientific consensus that the vaccines are more dangerous than the virus, told the Daily Beast that Kennedy’s stance is": -0.8,
  "Palantir CEO Alex Karp Sells More than $60 Million in Stock": -0.5,
  "Temu's U.S. Struggles Deepen, But Profit Outlook Shows Unexpected Strength": 0.5,
  "PDD Stock Gains As Temu Parent's Revenue Beats Expectations": 0.8,
  "Equities Fall as Wall Street Awaits Nvidia Earnings": -0.5,
  "Trading Day: Pivoting on Powell's pivot": 0.5,
  "Earnings live: PDD Holdings stock falls after hours, Wolfspeed gains as Nvidia's earnings countdown begins": 0.2,
  "Marvell Outlook Rises -- Micron, NVIDIA Hit by Memory Price Pressures": 0.2,
  "S&P 500 Gains and Losses Today: Index Pulls Back After Friday's Fed-Fueled Rally": -0.5,
  "Stocks edge downwards after rallying on US rate hopes": -0.5,
  "Skyworks Solutions names AMD executive Philip Carter as CFO": 0.5,
  "Semtech (SMTC) Surpasses Q2 Earnings and Revenue Estimates": 0.8,
  "Heard on the Street Recap: Trump’s New Deal": 0.2,
  "What is driving the EV sales slowdown, according to one analyst": 0.0,
  "Save Big—and Shop Smart—During Lenovo’s Labor Day Sale": 0.6,
  "190,500 ETH Bought in One Week: Inside BitMine’s Shocking Ethereum Strategy": 0.2,
  "Why Keurig Dr Pepper Stock Tanked by More Than 11% Today": -0.8,
  "Stocks to Watch Recap: Keurig Dr Pepper, JDE Peet’s, PDD, Rocket Labs": 0.2,
  "Tesla rejected $60 million settlement before losing $243 million Autopilot verdict": -0.8,
  "Stocks to Watch for a Rebound Amid September Rate Cut Hopes": 0.5,
  "Elon Musk's xAI Rolls Out 'Macrohard' To Challenge Microsoft": 0.5,
  "Meta Could Join $4 Trillion Club By 2027": 0.8,
  "Rocket Lab: Poised for Lift Off?": 0.5,
  "Why Micron (MU) Dipped More Than Broader Market Today": -0.5,
  "Lululemon (LULU) Dips More Than Broader Market: What You Should Know": -0.5,
  "Synopsys (SNPS) Dips More Than Broader Market: What You Should Know": -0.5,
  "Why the Market Dipped But Netflix (NFLX) Gained Today": 0.2,
  "Check Out NVIDIA's Awesome Earnings Chart": 0.8,
  "Nvidia's Earnings on Aug. 27: What History Tells Us About Nvidia Stock's Post-Earnings-Release Moves": 0.2,
  "Podcast: U.S. Stocks Slip Following Friday Rally": -0.5,
  "LinkedIn deepens video ad push, taps more publishers and creators to spur growth": 0.5,
  "Wall St ends down with focus on Nvidia after last week's rally": -0.5,
  "Save Big—and Shop Smart—During Lenovo’s Labour Day Sale": 0.6,
  "What a stake in Intel could mean for U.S. taxpayers now and in the future": 0.5,
  "Interactive Brokers To Join S&P 500; Robinhood, AppLovin Snubbed Again": 0.2,
  "The U.S. Has Created a Stealth Sovereign Wealth Fund. What Comes Next After Intel.": 0.2,
  "Stock market today: Dow, S&P 500, Nasdaq futures fall as Trump ousts Fed governor": -0.7,
  "Fox channels may go dark on YouTube TV from Wednesday over payment dispute": -0.8,
  "Tesla could have avoided that $242.5M Autopilot verdict, filings show": -0.5,
  "Palantir Slipped Today -- Is the Artificial Intelligence (AI) Stock a Buy Right Now?": 0.2,
  "Corrections & Amplifications": 0.0,
  "3 reasons for Palantir's 17% stock tumble in recent weeks": -0.5,
  "Trump says he’s removing Fed Governor Lisa Cook, cites mortgage fraud allegations - https://www.cnbc.com/2025/08/25/trump-fires-lisa-cook-fed-powell.html >President Donald Trump on Monday fired Federal Reserve Governor Lisa Cook, according to a letter on his Truth Social, an unprecedented move and a significant escalation of his attacks on the U.S. central bank. > >“Pursuant to my authority under Article II of the Constitution of the United States and the Federal Reserve Act of 1913, as amended, you are hereby": -0.6,
  "Jeff Bezos Said He Would Have 'Felt Icky' Had He Taken Any More Shares Of Amazon: 'I Just Didn't Feel Good...'": 0.1,
  "The US-Intel investment is a rare kind of deal. Trump says he wants more of them.": 0.5,
  "Trump vows ‘substantial’ new tariffs, chip restrictions on countries with digital taxes - https://www.cnbc.com/2025/08/25/trump-tariffs-digital-taxes.html > President Donald Trump vowed Monday to impose “substantial” new tariffs and restrict U.S. chip exports for all countries that do not remove digital taxes and related regulations. Trump wrote on Truth Social that digital services taxes -- which are imposed by more than a dozen countries -- “are all designed to harm, or discriminate against, American Technology.” “I put all": -0.8,
  "Boxing Aficionado and Tech CEO Dan Herbatschek Believes Boxing's Move to Netflix Signals a Historic Shift Away from the Pay-Per-View Model": 0.6,
  "Why Is Everyone Talking About BYD Stock?": 0.5,
  "Where Will Target Stock Be in 3 Years?": 0.1,
  "Dow Jones Futures Fall: Nvidia, Palantir, Roblox Are Big Movers; Tesla Stock Hits Buy Point": 0.2,
  "Phinge®, Home of Netverse® and Netaverse™ With Verified and Safer AI Announces \"Test the Waters\" Campaign for Potential Regulation A+ Offering": 0.5,
  "Shark Tank's Kevin O'Leary sends harsh message on Intel stock": -0.7,
  "Trump threatens more tariffs for countries with digital taxes": -0.7,
  "Trump Threatens New Tariffs on Countries That Tax Tech Companies": -0.5,
  "China-Linked Hackers Targeted Diplomats in Asia, Google Says": -0.7,
  "Asian shares decline following Wall Street's dip": -0.5,
  "Asian stocks down after Trump Fed firing, tariff threats": -0.7,
  "Agoda Elevates Listings with Next-Gen AI Image Enhancement": 0.5,
  "CrowdStrike Earnings: What To Look For From CRWD": 0.5,
  "Earnings To Watch: Nvidia (NVDA) Reports Q2 Results Tomorrow": 0.5,
  "Consolidated acorns into fidelity account - Is any of this redundant? GOOGL (Alphabet Inc Cap S) - 28.87 VTV (Vanguard Index Fd) - 24.18 OHI (Omega Healthcare) - 69.291 O (Realty Income Corp) - 29.702 VTI (Vanguard Index Fd) - 4.9 SCHD (Schwab US Dividen) - 50 VOO (Vanguard Index Fd) - 2 IXUS (iShares TR Core Ms) - 10 IJH (iShares Core S&P M) - 3 BITO (ProShares Bitcoin) - 5 Should I sell": -0.2,
  "Ross Stores plans a harsh change shoppers will notice in stores": -0.6,
  "Airbnb (ABNB) Introduces ‘Reserve Now, Pay Later’ Option in the US": 0.5,
  "Palantir (PLTR) Expands Partnership with SOMPO in Japan": 0.5,
  "Benchmark Raises Shopify (SHOP) Price Target, Keeps Buy Rating": 0.5,
  "The $5.5bn cup of coffee": -0.5,
  "William Blair Maintains a Buy on lululemon athletica (LULU)": 0.6,
  "Trump vows retaliation against countries proposing digital taxes or regulation on American tech giants": -0.8,
  "How to close the menopause pay gap": 0.0,
  "Xtend Unveils Marketplace-First Ecommerce Solution to Boost Brand Visibility and Conversions in Southeast Asia": 0.8,
  "Pragati: AI for Impact Convening by Meta and The/Nudge Institute advances India's Inclusive AI Agenda": 0.8,
  "Saudi’s Humain to Open Data Centers With US Chips in 2026": 0.5,
  "Form 8.3 - Aqua Acquisition Sub LLC (subsidiary of Qualcomm Incorporated)": 0.0,
  "European Commission Authorizes Twice-Yearly Yeytuo® (Lenacapavir) for HIV Prevention": 0.5,
  "Gilead Sciences' 99.9% Effective HIV Treatment Notches Another Win": 0.8,
  "PDD Holdings Inc (PDD) Q2 2025 Earnings Call Highlights: Navigating Growth Amidst Competitive ...": 0.2
}