{
  "Senhwa Biosciences' CX-5461 Teams Up with Global PD-1 Leaders to Enter the Immunotherapy Arena, Targeting Multi-Billion Dollar Global Market": 0.8,
  "1 Reason Intuitive Surgical (ISRG) Is 1 of the Best Healthcare Stocks You Can Buy Today": 0.8,
  "GlobalFoundries Joins World Economic Forum’s Global Lighthouse Network for Manufacturing Excellence": 0.5,
  "Jim Cramer Wonders Whether “Intel Crushed” Synopsys, Inc. (SNPS)": 0.2,
  "CEO Jack Hightower Retires from HighPeak Energy": 0.0,
  "Immuneering Appoints Dr. Thomas Schall as Chairman of the Board": 0.5,
  "Verisk Launches Generative AI Commercial Underwriting Assistant to Revolutionize Risk Assessment and Underwriting Efficiency": 0.8,
  "Can MercadoLibre, Inc. (NASDAQ:MELI) Maintain Its Strong Returns?": 0.2,
  "What Does the Ryanair Settlement Mean for Booking Holdings Shares in 2025?": 0.1,
  "Drug developer Dualitas launches $65 million funding round": 0.5,
  "Does FDA Progress Reinforce C4 Therapeutics' (CCCC) Platform Validation Story in Autoimmune Disease?": 0.2,
  "Is Analog Devices Stock Still a Smart Choice After Its Strong 2025 Rally?": 0.5,
  "How Investors May Respond To Canadian National Railway (TSX:CNR) Expanding All-Rail Intermodal Service With CSX": 0.5,
  "Insulet names new CFO; Dexcom CEO on leave": 0.0,
  "Cadence Design Systems to spend $3.2B on Hexagon’s simulations tech": 0.2,
  "Marriott partners with Kuzu Group to launch St Regis brand in Bodrum, Türkiye": 0.5,
  "New DualPack 3 IGBT7 Modules Deliver High Power Density and Simplify System Integration": 0.5,
  "Is it a Prudent Move to Retain MYGN Stock in Your Portfolio Now?": 0.2,
  "TEM Strengthens Radiology Portfolio With Pixel's FDA Clearance": 0.8,
  "Cybersecurity firm Netskope lifts IPO price range, eyes $7.3 billion valuation": 0.8,
  "Top 20 Companies Recognized in Labrador Transparency’s 2025 U.S. Transparency Awards": 0.5,
  "Implied Volatility Surging for Cognizant Technology Solutions Stock Options": 0.5,
  "Transact IDX® Adds Mobile Credentials to Apple and Google Wallets, Alongside Additional Features": 0.5,
  "Here is What to Know Beyond Why ON Semiconductor Corporation (ON) is a Trending Stock": 0.2,
  "Investors Heavily Search AppLovin Corporation (APP): Here is What You Need to Know": 0.5,
  "Adobe Inc. (ADBE) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Is DoorDash, Inc. (NASDAQ:DASH) Trading At A 30% Discount?": 0.2,
  "Mark Anderson joins Verkada's Board of Directors": 0.5,
  "CSX CEO: Obsession with profit margins stunting railroads’ growth": -0.5,
  "Coca-Cola Europacific Partners JV eyes largest factory in Philippines": 0.5,
  "OpenTable Launches All-in-One Marketplace for Private and Group Dining": 0.5,
  "Honeywell, Redwire advance collaboration on quantum-secured communications": 0.5,
  "GEHC Eyes icometrix Buyout to Strengthen Neurology Imaging Portfolio": 0.5,
  "Israeli cybersecurity startup Vega raises $65 million, valued at $400 million": 0.8,
  "Why DoorDash, Inc. (DASH) is a Top Momentum Stock for the Long-Term": 0.6,
  "Is Datadog Stock Outperforming the S&P 500?": 0.2,
  "Is Take-Two Interactive Software Stock Outperforming the Nasdaq?": 0.2,
  "PANW's Platform Strategy Builds Momentum: Can it Hit $15B ARR Target?": 0.6,
  "Eaton Accelerates Transformation of Building and Data Center Infrastructure With Autodesk To Deliver AI-Powered Digital Energy Twin and Software Tools": 0.5,
  "Amgen Insiders Sold US$12m Of Shares Suggesting Hesitancy": -0.5,
  "AppLovin Joins S&P 500 as Cramer Hails Stock’s Strong Growth Momentum": 0.8,
  "Cintas Gains Cramer Endorsement as Long-Term Buy Ahead of Q1 Results": 0.6,
  "Okta is providing extra security to AI agents, your data: CEO": 0.2,
  "ISRG Stock Dips Despite Introducing Real-Time Insights on da Vinci 5": -0.2,
  "AppLovin's International Expansion Poised to Supercharge Growth": 0.8,
  "IntelliTrans Expands TMS with Integrated CO₂ Emissions Dashboard, Powered by EcoTransIT World": 0.5,
  "SPECTRUM MARKS ONE YEAR OF INDUSTRY-FIRST CUSTOMER COMMITMENT ACCOMPLISHMENTS": 0.6,
  "New Speakers Announced: 5th Palm Beach CorpGov Forum | Preview Panelists & Topics": 0.2,
  "INTU vs. UPST: Which AI-Driven Fintech Stock Offers Better Upside Now?": 0.5,
  "PepsiCo vs. Monster Beverage: Which Is a Better Buy for Investors Now?": 0.2,
  "BROS vs. KDP: Which Coffee Stock Offers More Growth Potential?": 0.2,
  "New Opendoor Chairman Keith Rabois says he doesn’t know why the company has 1,400 employees: ‘We don’t need more than 200’": -0.8,
  "Charter Communications (CHTR) Launches Internet, Mobile, TV, and Voice Services in Scott County, Kentucky.": 0.5,
  "Morgan Stanley Lowers PT on Synopsys (SNPS), Maintains an Overweight Rating": 0.5,
  "Morgan Stanley Maintains Buy on Atlassian Corporation (TEAM)": 0.6,
  "Keurig Dr Pepper (KDP) to Acquire JDE Peet’s": 0.5,
  "Regeneron Pharmaceuticals (REGN) Releases Results From EMPOWER-Lung 3 trial": 0.5,
  "Wall Street is Bullish on DexCom (DXCM), Here’s Why": 0.8,
  "J.P. Morgan Maintains a Buy on Adobe Inc. (ADBE), Keeps PT": 0.6,
  "Bank of America Securities Maintains a Buy on Intuitive Surgical (ISRG), Keeps PT": 0.5,
  "GitLab Inc. (GTLB): A Bull Case Theory": 0.5,
  "Bernstein Lowers the PT on Charter Communications (CHTR), Keeps a Buy": 0.5,
  "Wall Street is Bullish on Roper Technologies (ROP), Here’s Why?": 0.8,
  "TD Cowen Reduces PT on Paychex, Inc (PAYX), Keeps a Hold": -0.2,
  "Wall Street Bullish on Keurig Dr Pepper (KDP), Here’s Why": 0.8,
  "Mitratech Unveils Premier Partner Awards, Honoring Industry Leaders Driving AI Innovation & Compliance Excellence": 0.8,
  "CoreWeave, Inc. (CRWV): A Bull Case Theory": 0.5,
  "Top Midday Stories: Judge Tosses Terrorism Charges Against Alleged Shooter of UnitedHealth Executive; Hims Shares Fall After FDA Warning Letter": -0.5,
  "Bloom Energy Corporation (BE): A Bull Case Theory": 0.5,
  "Okta CEO on the quarterly reports debate: Less obsession with numbers, more conversation with investors": 0.5,
  "Kymera initiated at Outperform on potential of lead skin drug": 0.8,
  "Software Companies Are Fighting Back With AI. The Stocks Are Still Hurting.": -0.6,
  "AMGN vs. VKTX: Which Biotech Stock Is the Better Obesity Play?": 0.5,
  "Will FTNT's Heavy Infrastructure Build-Out Drive Next Phase of Growth?": 0.5,
  "Celsius Holdings, Inc. (CELH): A Bull Case Theory": 0.5,
  "Starbucks to add ‘hundreds of thousands of seats’ back to its stores": 0.6,
  "EA and Full Circle Launch skate. in Early Access Today": 0.5,
  "Ondaro Appoints Jason Whitesides as Chief Revenue Officer to Drive Growth and Innovation": 0.6,
  "Andrew Yang took inspiration from Mark Cuban for his budget cell carrier Noble Mobile": 0.5,
  "Palo Alto Networks Stock is Up, But Analysts Have Raised Their Targets": 0.5,
  "Benchmark Maintains Buy Rating for MercadoLibre (MELI)": 0.6,
  "Mizuho Maintains Outperform Rating on Intuit (INTU), Sees a Buying Chance": 0.8,
  "DA Davidson Keeps Buy Rating for Adobe (ADBE) After Q3 FY 2025 Results": 0.6,
  "Top Midday Decliners": -0.5,
  "Redburn Atlantic Maintains a Buy on Gilead Sciences (GILD), Sets a $143 PT": 0.6,
  "Canaccord Genuity Reiterates a Buy on Biogen (BIIB)": 0.5,
  "What Do Analysts Think About Amgen Inc. (AMGN)?": 0.0,
  "AI agents could multiply cyber risk, warns Zscaler CEO": -0.6,
  "Celsius Takes Control Of Energy Drink Aisle With PepsiCo Partnership": 0.6,
  "Cintas Corporation Hosts the Cincinnati 9/11 Memorial Stair Climb in Support of the National Fallen Firefighter Foundation": 0.5,
  "US Equity Indexes Lower Ahead of the Fed's Rate-Cut Decision": -0.5,
  "3 Top AI Energy Stocks to Buy and Hold Forever": 0.5,
  "Cybersecurity Stocks: Netskope Hikes IPO Price, Aims To Raise $900 Million": 0.5,
  "Keurig Dr Pepper Declares Quarterly Dividend": 0.5,
  "Paychex, Inc. Schedules First Quarter Fiscal 2026 Earnings Conference Call for September 30, 2025": 0.2,
  "ASML Stock Rises As Semiconductor Equipment Group Rallies": 0.8,
  "The AI Trade Has Stocks Near Highs Again. Some Tech Names Remain on the Sidelines": 0.5,
  "Chipmakers Post Longest Win Streak Since 2017 Amid AI Growth": 0.6,
  "US Equity Markets End Lower Amid Likely Interest Rate Cut Expectations, Increase in Industrial Production": 0.2,
  "Netskope IPO In Demand as AI Era Heightens Cyber Threats": 0.5,
  "US Equity Indexes Lower Ahead of Fed Policy Decision Despite Robust Retail Sales, Surprise Industrial Production Print": -0.5,
  "Corporate Tax Collections Decline as New Law Kicks In": -0.7,
  "HONEYWELL ANNOUNCES PRICING OF SOLSTICE ADVANCED MATERIALS' OFFERING OF SENIOR NOTES IN CONNECTION WITH PLANNED SPIN-OFF": 0.2,
  "CoStar Group Founder and CEO Andy Florance Named 2025 Tech Titan by Washingtonian Magazine": 0.8,
  "S&P 500, Nasdaq Fall From Record Highs as Fed Decision Looms": -0.5,
  "Airbnb, Inc. (ABNB) Advances While Market Declines: Some Information for Investors": 0.5,
  "The Trade Desk (TTD) Suffers a Larger Drop Than the General Market: Key Insights": -0.5,
  "Starbucks (SBUX) Gains As Market Dips: What You Should Know": 0.5,
  "Warner Bros. Discovery (WBD) Falls More Steeply Than Broader Market: What Investors Need to Know": -0.5,
  "Axon Enterprise (AXON) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "MercadoLibre (MELI) Advances While Market Declines: Some Information for Investors": 0.5,
  "Diamondback Energy (FANG) Advances While Market Declines: Some Information for Investors": 0.5,
  "(Item 8.01) – Other Events On September 16, 2025, Workday announced that its Board of Directors authorized the repurchase of up to an additional $4.0 billion of Workday’s outstanding shares of Class A common stock (the “Share Repurchase Program”). The Share Repurchase Program has no expiration date, may be suspended or discontinued at any time, and does not obligate Workday to acquire any amount of Class A common stock. As of July 31, 2025, approximately $1.2 billion": 0.2,
  "(Item 8.01) . Other Events. Olivier Lemire has been appointed as President, U.S. Coffee of Keurig Dr Pepper Inc. (the “Company”). Mr. Lemire has been with the Company since 2011 and previously served as President of the Company’s Canadian business. Patrick Minogue, the Company’s former President of U.S. Coffee, will remain with the Company to support the transition to his successor through September 30, 2025.": 0.5,
  "(Item 5.07) below, at a special meeting of stockholders (the “Special Meeting”) of The Trade Desk, Inc. (the “Company”) held on September 16, 2025, the stockholders of the Company approved the amendment and restatement of the Company’s articles of incorporation (as amended, the “Amended Articles”). The information set forth in\n\n(Item 5.07) of this Current Report on Form 8-K is incorporated by reference into this\n\n(Item 5.07) Submission of Matters to a Vote of Security Holders. On September 16, 2025, the Company held the Special Meeting. As of the record date for the Special Meeting, which was established by the Board to be the close of business on July 21, 2025, there were 445,649,241 shares of the Company’s Class A common stock, par value $0.000001 per share (the “Class A Common Stock”), outstanding (each entitled to one vote per share) and 43,275,936": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers . On September 15, 2025, Heather M. Fernandez notified Atlassian Corporation (the “ Company ”) of her decision to retire as a director of the Company, effective as of September 30, 2025. Ms. Fernandez’s decision to resign was not the result of any disagreement with the Company on any matter relating to its operations, policies, or": -0.2,
  "Review & Preview: The Fed’s Awkward Day": 0.1,
  "Osaka Rises as the Top Choice for Chinese Travelers Celebrating Golden Week, Agoda Reports": 0.6,
  "Arm Holdings (ARM) Stock: Analysts See Nvidia-Like Strategy Taking Shape": 0.5,
  "Stifel Maintains Hold on Datadog (DDOG) After Mid-Quarter Check": 0.1,
  "Citizens JMP Reiterates Market Perform on Adobe (ADBE) Following Q3 Beat": 0.5,
  "AppLovin (APP) Price Target Raised to $725 by Wedbush, Outperform Maintained": 0.8,
  "Firing on All Cylinders: Biogen (NASDAQ:BIIB) Q2 Earnings Lead the Way": 0.8,
  "Goldman Sachs Reiterates Buy on Adobe (ADBE) With $570 PT, Citing AI Momentum": 0.8,
  "1 Nasdaq 100 Stock Worth Investigating and 2 Facing Challenges": 0.0,
  "1 Healthcare Stock Worth Your Attention and 2 We Brush Off": 0.2,
  "1 Oversold Stock Primed to Rebound and 2 That Underwhelm": 0.2,
  "3 Cash-Producing Stocks We Steer Clear Of": -0.5,
  "Ollin debuts with $100M and plans to challenge top-selling eye drugs": 0.5,
  "I Was Making $20K A Month Off 2 Texas Properties In My 20s, But Now I'm Bleeding $1700 Each Month. Should I Sell Them or Raise the Rent?": 0.2,
  "3 Top Stocks to Buy and Hold Forever": 0.5,
  "Zacks Investment Ideas feature highlights: Talen, Amazon, Nvidia, Constellation Energy and MasTec": 0.2,
  "AI Buildouts Push Data Center Switch Sales in Front-end Networks to Record Levels, According to Dell'Oro Group": 0.5,
  "2 High-Yield Dividend Stocks You'll Wish You Had Bought 10 Years From Now": 0.8,
  "This Technology Stock Just Crashed 35% in 1 Day. Time to Buy?": -0.7,
  "Data Center Construction Strategic Industry Report 2025-2030 Featuring Over 200 Companies Including ABB, Aecom, Ascenty, Cisco Systems, and Clayco": 0.5,
  "Stock Index Futures Tread Water With All Eyes on Fed Rate Decision": 0.2,
  "Regeneron Announces Positive Phase 3 Trial in Adults with Ultra-Rare Genetic Disorder Fibrodysplasia Ossificans Progressiva (FOP), Demonstrating that Garetosmab Prevents Greater than 99% of Abnormal Bone Formation": 1.0,
  "Nurix Therapeutics Presents Preclinical Data from Novel IRAK4 Degrader, GS-6791, Demonstrating Potent Inhibition of IL-1 and IL-36 in Vitro and Efficacy in a Model of Dermatitis": 0.8,
  "ECARX Powers Global Launch of Geely Galaxy M9, Delivering a Next-Generation AI Cockpit Experience": 0.8,
  "Will Weakness in Adobe Inc.'s (NASDAQ:ADBE) Stock Prove Temporary Given Strong Fundamentals?": 0.5,
  "Texas Instruments Incorporated's (NASDAQ:TXN) Fundamentals Look Pretty Strong: Could The Market Be Wrong About The Stock?": 0.6,
  "Flowserve Announces the Appointment of Alice DeBiasio as President of Flow Control Division": 0.5,
  "Groq Raises $750 Million as Inference Demand Surges": 0.8,
  "Top Dividend Stocks To Consider In September 2025": 0.5,
  "Strong Results Lifted MercadoLibre (MELI) in Q2": 0.8,
  "Will Eaton’s (ETN) New Digital Partnerships Reshape Its Competitive Edge in Energy Management?": 0.5,
  "How Recent FDA Approval Impacts the Valuation Story for Vertex Pharmaceuticals in 2025": 0.5,
  "Sands Capital Global Growth Fund Sold Airbnb (ABNB) as Top-line Growth Decelerated": -0.5,
  "Can Comcast’s (CMCSA) Community Expansion Efforts Reveal Clues About Its Long-Term Growth Strategy?": 0.2,
  "Texas Instruments (TXN): Valuation Reassessed After China Launches Chipmaker Investigations": -0.5,
  "Cerence AI Collaborates with DSP Concepts to Revolutionize In-Car Audio": 0.8,
  "Cognizant Named to Forbes' list of Canada's Best Employers for Company Culture 2025": 0.8,
  "Amazon Aims to Grow Ad Sales Further by Automating Creation": 0.5,
  "With 77% ownership of the shares, PepsiCo, Inc. (NASDAQ:PEP) is heavily dominated by institutional owners": 0.1,
  "Should Zscaler's (ZS) Z-Flex Adoption and Stock Plan Filing Prompt Investor Attention?": 0.2,
  "Venbrook and Cognizant Partner to Modernize Claims Processing for Insurance Carriers": 0.5,
  "Is Axon Enterprise (AXON) Poised for Continued Durable Growth?": 0.5,
  "Billionaire Mario Gabelli Says He’s Thinking About Buying More Kraft Heinz (KHC) Shares": 0.5,
  "Here’s Why ClearBridge Growth Strategy Added Axon Enterprise (AXON) in Q2": 0.5,
  "Palo Alto Networks (PANW): Evaluating Valuation After AI Expansion and CyberArk Acquisition in Cybersecurity Push": 0.5,
  "Does DexCom's Interim Leadership Shift Alter the Strategic Outlook for DXCM?": 0.1,
  "Could Analyst Optimism Around APP’s Self-Serve Ad Platform Signal a Shift in Its Core Growth Strategy?": 0.5,
  "Gesture-Control Wearables Redefine Human-Technology Interaction": 0.8,
  "Warner Bros Discovery's HBO Max Rolls Out Asia Expansion Ahead of New IT Series": 0.5,
  "GEHC Expands Women's Health Portfolio With AI-Enabled Voluson": 0.5,
  "From Sidelines to Strategy: How Shannon Lima Built a Career on Change, Curiosity, and Opportunity": 0.8,
  "Synopsys, Inc. (SNPS) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Calculating The Intrinsic Value Of Constellation Energy Corporation (NASDAQ:CEG)": 0.0,
  "Sally Beauty and DoorDash Team Up to Deliver Fall Beauty Must-Haves on the Go": 0.5,
  "Israel's Glilot Capital raises $500 million for new AI and cybersecurity investments": 0.8,
  "Sector Update: Health Care Stocks Rise Premarket Wednesday": 0.5,
  "Quantinuum CEO Says It’s at a ‘Turning Point.’ The Company Is Achieving New Feats in Quantum Computing.": 0.8,
  "CommScope Rides on Strength in ANS Segment: Will it Persist?": 0.5,
  "Vertex Plunges Around 24% in Six Months: How to Play the Stock": -0.6,
  "Comcast to Host Third Quarter 2025 Earnings Conference Call": 0.0,
  "Results from Phase 2 COURAGE Trial Demonstrating Potential to Improve Quality of GLP-1 receptor agonist-induced Weight Loss by Preserving Lean Mass, Presented at EASD": 0.5,
  "Is PDD Holdings Inc. Sponsored ADR (PDD) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Cisco: Leveraging Technology To Transform Homeless Services": 0.5,
  "Why Amgen (AMGN) is a Top Value Stock for the Long-Term": 0.6,
  "Apple initiated, Hershey upgraded: Wall Street’s top analyst calls": 0.5,
  "ASYS' Cost Reduction Initiatives: Can it Drive Margin Expansion?": 0.5,
  "Comcast Opens First Xfinity Store in Lawrenceville, Georgia": 0.5,
  "2 Growth Stocks to Buy and Hold Forever": 0.5,
  "DoorDash: Momentum or Mirage After the Rally?": 0.2,
  "ADI's Industrial Segment Improves: What's Driving the Growth?": 0.5,
  "Why Did Redwire Stock Crash Today?": -0.5,
  "This Tech Stock Just Hit Another All-Time High": 0.8,
  "Regeneron Says Antibody Combo May Preserve Muscle During Weight Loss": 0.5,
  "Honeywell's Unit Prices Senior Notes Offering at $1B in Aggregate": 0.5,
  "CrowdStrike Guidance On Key Metric Takes Center Stage At Investor Day": 0.5,
  "Can TTD's Strategies & Innovations Shield Stock in an Uncertain Market?": 0.2,
  "The UK companies partnering with US big tech": 0.5,
  "GitLab (GTLB) Analysts Say Fears of AI Replacing Developers Are Overblown": 0.6,
  "Analysts Say AI Is Not the ‘Death Knell’ for Atlassian (TEAM) Stock": 0.5,
  "Why Is Palo Alto (PANW) Up 10.9% Since Last Earnings Report?": 0.2,
  "NCLH vs. ABNB: Which Stock Is the Better Value Option?": 0.0,
  "PDD vs. GLBE: Which Stock Should Value Investors Buy Now?": 0.2,
  "Starbucks CEO says the coffee chain won’t lose its cash-strapped consumers because it’s on its way to being a ‘world-class customer service’ company": 0.6,
  "DexCom, Inc. (DXCM): A Bull Case Theory": 0.5,
  "Warner Bros. Discovery, Inc. (WBD): A Bull Case Theory": 0.5,
  "Top Midday Stories: Markets Await Fed Rate Decision; China Regulator Reportedly Bans Nvidia Chip Sales to Alibaba, ByteDance": 0.2,
  "Teen Founders, Tap The Brakes: Paul Graham Says Curiosity Beats Companies In High School — Despite YC Wins With Airbnb, Reddit, And Sam Altman At 19": 0.2,
  "Almost Everything Is Rallying Ahead of Fed Decision. What’s Not Matters More.": 0.5,
  "Cathie Wood Goes Bargain Hunting: 3 Stocks She Just Bought": 0.5,
  "GE HealthCare (GEHC) Upgraded to Strong Buy: What Does It Mean for the Stock?": 0.6,
  "Are You Looking for a Top Momentum Pick? Why AppLovin (APP) is a Great Choice": 0.8,
  "Job seekers feel awful about the labor market. Data is finally starting to explain why.": -0.8,
  "Autodesk CEO talks industry impact of new AI architecture tools": 0.5,
  "Winning The Game Within The Game – The Top 5 Highest Earning NIL Deals For College Athletes": 0.5,
  "Families of Victims in Air India 171 Crash Sue Boeing, Honeywell": -0.5,
  "Can FTNT Stock Recover From YTD Drop on AI Security Push? How to Play": 0.2,
  "Starbucks Corporation (SBUX) “Goes Much Higher,” Says Jim Cramer": 0.8,
  "The Kraft Heinz Company (KHC): A Bull Case Theory": 0.5,
  "US High Growth Tech Stocks to Watch for Potential Expansion": 0.5,
  "MELI vs. EBAY: Which Online Marketplace Stock Is the Better Pick?": 0.5,
  "SKYBOXE Secures Nationwide Network Certification from T-Mobile for its 5G Fixed Wireless Access Router": 0.6,
  "Sector Update: Energy Stocks Higher in Afternoon Trading": 0.5,
  "Regeneron Pharmaceuticals (REGN) Advances Allergy Pipeline with Two Positive Phase 3 Trials Evaluating First-in-Class Antibody-Blockers of Cat and Birch Allergies": 0.8,
  "Stifel Analyst Maintains Buy Rating on Adobe (ADBE) After Earnings Beat": 0.8,
  "Honeywell, Caterpillar CTOs say AI can ease labor, skills gaps in manufacturing": 0.6,
  "Boeing, Honeywell sued by Air India crash victim families": -0.8,
  "Strong Buy Alerts: AppLovin & 2 More Momentum Stocks for Big Gains": 0.8,
  "Why Netflix (NFLX) Stock Is Gaining Today?": 0.2,
  "TSMC Extends Lead With 38% Foundry Market Share": 0.8,
  "Lam Research And JSR Strike Chipmaking Partnership": 0.5,
  "Sector Update: Health Care Stocks Edge Higher Late Afternoon": 0.5,
  "‘Red Queen Syndrome’ Hits Global Oil Production": -0.6,
  "Sector Update: Energy Stocks Advance in Late Afternoon Trading": 0.5,
  "AppLovin Stock Hits an All-Time High: Buy, Hold, or Take Profits?": 0.5,
  "IonQ Signs Memorandum of Understanding with U.S. Department of Energy to Advance Quantum Technologies in Space": 0.8,
  "Netflix Stock Upgraded To Buy, Retakes Key Level": 0.8,
  "Biogen Receives European Commission Approval for ZURZUVAE® (zuranolone), the First and Only Treatment Approved for Women with Postpartum Depression in Europe": 0.8,
  "Atlassian Appoints Jason Warner, poolside Co-Founder to Board of Directors": 0.2,
  "Kash Patel Called Krispy Kreme Stock a Buy and Fueled Wild Rally": 0.6,
  "Jim Cramer Says Some People Are “Afraid” To Take Up NVIDIA Corporation (NVDA)": 0.2,
  "Tech Tracker: DoorDash, Uber Eats, more, expand restaurant operator tools": 0.5,
  "Health Care Roundup: Market Talk": 0.0,
  "CoStar Group Founder and CEO Andy Florance Featured on Sixth Annual Virginia 500 Power List": 0.5,
  "Mondelēz 2024 Snacking Made Right Report: Health & Safety": 0.0,
  "Vertex Pharmaceuticals (VRTX) Declines More Than Market: Some Information for Investors": -0.5,
  "Why the Market Dipped But Take-Two Interactive (TTWO) Gained Today": 0.2,
  "Gilead Sciences (GILD) Ascends While Market Falls: Some Facts to Note": 0.5,
  "Why Paccar (PCAR) Dipped More Than Broader Market Today": -0.5,
  "Sangoma Technologies Corporation (SANG) Q4 Earnings and Revenues Top Estimates": 0.8,
  "(ITEM 8.01) . Other Events. The Registrant’s news release dated September 18, 2025, regarding a planned dividend increase, attached hereto as Exhibit 99 is incorporated by reference herein.": 0.0,
  "Fangzhou Wins Gilead ‘Award of Excellence’ for AI-Driven Chronic Disease Management": 0.8,
  "Agoda's World Tourism Day Sale Presents Opportunities for Travel Partners": 0.5,
  "Looking For Yields: Avista, Cogent Communications, And Mondelez Are Consistent Moneymakers": 0.6,
  "Media Stocks Q2 Results: Benchmarking Warner Bros. Discovery (NASDAQ:WBD)": 0.5,
  "3 Reasons to Sell REGN and 1 Stock to Buy Instead": -0.5,
  "3 Reasons to Avoid WBD and 1 Stock to Buy Instead": -0.5,
  "1 Large-Cap Stock Worth Your Attention and 2 We Find Risky": 0.2,
  "2 Cash-Producing Stocks Worth Your Attention and 1 Facing Challenges": 0.2,
  "Baker Hughes Strikes Iraq Deal To Cut Gas Flarin": 0.5,
  "5 Insightful Analyst Questions From Adobe’s Q3 Earnings Call": 0.5,
  "Workday Pops as Elliott Discloses $2 Billion Investment": 0.8,
  "Innate Pharma SA (IPHA) (H1 2025) Earnings Call Highlights: Strategic Focus and Financial ...": 0.5,
  "Zacks Investment Ideas feature highlights: AppLovin, Meta Platforms and Alphabet": 0.5,
  "History Says the Nasdaq Will Soar: 2 Artificial Intelligence (AI) Stocks to Buy Now, According to Wall Street": 0.8,
  "Zacks.com featured highlights include AppLovin, Build-A-Bear Workshop and Tenet Healthcare": 0.2,
  "8x8 Appoints Mary Murray as Country Lead for Ireland, Strengthening Local Commitment and Growth": 0.6,
  "2 Reasons to Buy Lululemon Stock (and 1 Reason to Sell)": 0.5,
  "Venbrook and Cognizant collaborate to improve insurance claims processing": 0.5,
  "Grid Cybersecurity Research Report 2025-2034: Major Players Like IBM, Siemens, and Cisco Focus on Resilient Solutions, While Advancements in AI and Blockchain Enhance Threat Response": 0.6,
  "Deliveroo CEO Will Shu to step down after DoorDash takeover": -0.5,
  "How Workday CEO Carl Eschenbach is pushing employees to get over their fear of AI": 0.5,
  "Wedbush Bullish on Palo Alto Networks (PANW), Calls CyberArk Acquisition a “Game Changer”": 0.8,
  "Groq obtains $750m in funding for AI inference technology": 0.5,
  "Deliveroo founder Will Shu to step down as boss amid DoorDash takeover": -0.5,
  "CSX, CN agree to develop intermodal service into Tennessee": 0.5,
  "Quantinuum Trims the Timeline for Quantum Computing": 0.5,
  "Families Sue Boeing And Honeywell Over Catastrophic Air India Crash": -0.8,
  "AstraZeneca’s Saphnelo SC shows reduction in disease activity in SLE trial": 0.5,
  "Deliveroo CEO to step down following DoorDash takeover": -0.5,
  "Workday’s Plan to Win the AI Agent Race": 0.5,
  "Marengo Therapeutics Advances STARt-002 Clinical Trial into Phase 2 Cohort Expansion Evaluating Invikafusp Alfa with TROP2-directed ADC TRODELVY® in Metastatic Breast Cancer": 0.5,
  "AIRSUPRA® (albuterol/budesonide) US prescribing information updated to reflect the statistically significant severe exacerbation risk reduction in patients with mild asthma compared with albuterol": 0.6,
  "American Express Platinum Card gets pricier and adds new perks, including a $400 dining credit": 0.6,
  "Biogen to buy startup Alcyone, eyeing easier delivery of RNA drugs": 0.5,
  "Nvidia to invest 5 billion in INTC - Nvidia Corp. agreed to invest $5 billion in Intel Corp. and said the two will co-develop chips for PCs and data centers, a surprise move to help prop up an ailing archrival. Nvidia will buy Intel common stock at $23.28 per share, the two companies said on Thursday, a 6.5% discount to Wednesday’s closing price. Intel will use Nvidia’s graphics technology in upcoming PC chips and also": 0.5,
  "XCharge North America’s GridLink Receives Honorable Mention in Fast Company’s 2025 Innovation by Design Awards": 0.6,
  "Biogen’s Zurzuvae approved as first postpartum depression drug in Europe": 0.8,
  "AstraZeneca reports Saphnelo demonstrates reduction in disease activity": 0.6,
  "Is Axon Enterprise Stock Outperforming the Dow?": 0.2,
  "September 2025's Top Insider-Owned Growth Companies": 0.0,
  "How Honeywell’s Three-Way Split Could Impact Its 2025 Share Price Outlook": 0.5,
  "This Week In Energy Transition - Elcogen's New Factory Powers Europe's Clean Energy Future": 0.8,
  "Biogen to Acquire Alcyone Therapeutics, Expanding Drug Delivery Solution Portfolio for Key Product and Pipeline Candidates": 0.6,
  "Shrinking Sales and Margin Pressures Might Change The Case For Investing In Kraft Heinz (KHC)": -0.5,
  "Those who invested in Microchip Technology (NASDAQ:MCHP) five years ago are up 48%": 0.5,
  "What Catalysts Are Shifting the Synopsys Narrative Amid IP Headwinds and Ansys Integration": 0.2,
  "Resilience Investments Unveils Leadership from Airbnb, Ethic to Launch Resilient Affordable Housing Strategy": 0.5,
  "Microchip Introduces Flexible New Family of Gigabit Ethernet Switches with TSN/AVB and Redundancy For Industrial Applications": 0.6,
  "Quantum Computing Stocks Rally. D-Wave Hits Record High Amid Tokyo Conference.": 0.8,
  "Taiwan Semiconductor sinks after Nvidia forges pact with rival Intel": -0.7,
  "Palo Alto Networks Unveils AI-Generated Ad Campaign, Showcasing Secure Innovation in Action": 0.6,
  "General Mills price cuts, Starbucks lawsuit and Amazon pay raises | Consumer news": 0.2,
  "Vertex Announces CASGEVY® Reimbursement Agreement for the Treatment of Transfusion-Dependent Beta Thalassemia and Sickle Cell Disease in Italy": 0.8,
  "This Week In E-Commerce - India's B2C E-Commerce Exports Set For Significant Growth": 0.8,
  "What Makes Verisk Analytics (VRSK) a Must-Have For Major Insurance Companies?": 0.6,
  "Deliveroo boss steps down after near £200m payday": 0.5,
  "AppLovin Corporation (APP) Delivered Exceptional Results in Q2": 0.8,
  "Automatic Trap Company, the USA Distributor for Kiwi-Designed Goodnature Traps, Announces Its New Zealand-Based Supplier Wins a Global Innovation Honor for Its Rodent Control Products": 0.6,
  "Atlassian Enters Into Definitive Agreement to Acquire DX": 0.0,
  "Intuit Hosts Investor Day, Reaffirms First-Quarter and Fiscal 2026 Guidance": 0.5,
  "Qualcomm Taps Adobe GenStudio to Optimize Content Supply Chain with Generative AI": 0.5,
  "PepsiCo, Unilever, and other Major Retail, Food, and Beverage Companies Launch \"STEP up for Agriculture\" Initiative": 0.5,
  "CSX Corp. Announces Date for Third Quarter Earnings Release and Earnings Call": 0.0,
  "Amazon Multi-Channel Fulfillment Expands its Support of Merchants on SHEIN, Shopify, and Walmart": 0.5,
  "Atlassian acquires DX, a developer productivity platform, for $1B": 0.5,
  "Investors Heavily Search Intuit Inc. (INTU): Here is What You Need to Know": 0.5,
  "Is Warner Bros Discovery Stock a Buy Amid Reports of a Potential Paramount Bid?": 0.2,
  "Booking Holdings Inc. (BKNG) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Investors Heavily Search Gilead Sciences, Inc. (GILD): Here is What You Need to Know": 0.5,
  "Axon Enterprise, Inc (AXON) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Marvell Technology, Inc. (MRVL) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Investors Heavily Search Airbnb, Inc. (ABNB): Here is What You Need to Know": 0.5,
  "Why You Should Care About Monster Beverage's (NASDAQ:MNST) Strong Returns On Capital": 0.5,
  "Fastenal's (NASDAQ:FAST) investors will be pleased with their impressive 143% return over the last five years": 0.8,
  "T-Mobile Tops $19M in Hometown Grants, Empowering 425 Local Communities Nationwide": 0.8,
  "CRDO Deepens Ties With Hyperscalers: Key to Next Growth Phase?": 0.6,
  "Atlassian to acquire developer productivity platform DX for $1 billion": 0.5,
  "Intuitive Surgical Stock Is Trading Near Its 52-Week Low. Could This Be a No-Brainer Buy for the Long Haul?": 0.5,
  "Biogen Gets EU Nod for First Postpartum Depression Drug": 0.6,
  "T-Mobile Announces a 16% Quarterly Dividend Increase": 0.8,
  "Is Cadence (CDNS) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Novo Nordisk, Google's Android, GE Healthcare: Trending Tickers": 0.0,
  "Target initiated, Nike upgraded: Wall Street's top analyst calls": 0.5,
  "TSMC, Arm, AMD: Winners and Losers After Nvidia’s Intel Investment": 0.2,
  "Why This 1 Momentum Stock Could Be a Great Addition to Your Portfolio": 0.8,
  "Here's Why Workday (WDAY) is a Strong Momentum Stock": 0.8,
  "Deliveroo CEO Will Shu turned 100-hour weeks on Wall Street into a $4 billion food empire. Now he’s cashing out with $250 million": 0.8,
  "Gorilla Swings 13% Higher on $1.4B Freyr Deal in Southeast Asia": 0.5,
  "Airbus, Honeywell, Lockheed Martin, RTX, and Safran Lead in Digital Transformation Among Aerospace and Defense Manufacturers, According to ABI Research Index": 0.6,
  "Synopsys shares rise on chip sector developments": 0.5,
  "RBC upgrades CSX, says shares gain under most rail merger outcomes": 0.6,
  "Figma vs. Adobe: What's the Better Tech Stock to Buy?": 0.2,
  "National Advertising Division Finds Certain “AT&T Guarantee” Claims Supported; Recommends Other Claims be Modified or Discontinued": 0.2,
  "Intel–Nvidia pact leaves these stocks behind": -0.5,
  "Danaher Corporation (DHR) Among Most Oversold Stocks, Gains Attention with Strategic Biotech Moves": 0.6,
  "The People Behind the Progress: How T-Mobile Is Building a More Resilient Future": 0.5,
  "31-Year-Old Engineer Says Girlfriend Wants To Be A 'Trophy Wife' After Seeing His Savings Account Balance — But He Says 'She Isn't 22 Anymore'": -0.6,
  "Is Warner Bros. Discovery Stock Outperforming the S&P 500?": 0.2,
  "Axon's Connected Devices Unit Gains Momentum: Can It Sustain?": 0.5,
  "T-Mobile US, Inc. (TMUS) Stakeholder Deutsche Telekom Offloads 136K Shares": -0.2,
  "TJX Trading Cheaper Than Industry: What's the Next Best Move?": 0.2,
  "Will Live Sports Be the Next Revenue Driver for TTD's CTV Business?": 0.2,
  "MRVL vs. MU: Which Semiconductor Stock Should You Consider Now?": 0.5,
  "AMAT's Advanced DRAM Gains Traction: Will it Sustain its Momentum?": 0.5,
  "Intuit Sticks To Bold 2026 Outlook With AI Driving Growth": 0.6,
  "Broadcom (AVGO) Sheds 3.8% on China Probe": -0.6,
  "What Are Analysts Saying About ASML Holding N.V. (ASML)?": 0.2,
  "European Equities Traded in the US as American Depositary Receipts Rise in Thursday Trading": 0.5,
  "Why Are Analysts Downgrading Applied Materials, Inc. (AMAT)?": -0.5,
  "Most overlooked/undervalued and most overhyped/overvalued stock right now - In the kind of high valuation environment / bull-run we are in it seems like there is no shortage of overvalued picks. However it is becoming increasingly difficult to find overlooked gems. What stock do you believe still has that multiple expansion multibagger potential that the market is sleeping on? Not some farfetched fantasy turn around or pre-revenue valued on their ”potential”… and not some stock": 0.2,
  "Here Is What Analysts Are Saying About Shopify Inc. (SHOP)": 0.2,
  "J&J Expects Innovative Medicines Growth Despite Stelara LOE: Here's Why": 0.5,
  "CSX Well-Positioned to Benefit From All Potential Rail Merger Scenarios, RBC Says": 0.8,
  "Cracker Barrel, Live Nation, chip stocks: Trending Tickers": 0.1,
  "Why onsemi (ON) Stock Is Trading Up Today": 0.5,
  "McDonald’s taps seasoned exec to lead data, AI": 0.2,
  "JD vs. PDD: Which Chinese E-Commerce Stock is the Better Buy?": 0.2,
  "Why Arm Holdings Stock Was Sliding Today": -0.5,
  "Nvidia–Intel hits AMD, Arm; mortgage rates fall; Bullish in US": 0.5,
  "Lyft (LYFT) Surges 13.1%: Is This an Indication of Further Gains?": 0.6,
  "Numeral raises $35M to automate sales tax with AI": 0.5,
  "Amazon opens fulfillment services to Shein, Shopify and Walmart sellers": 0.5,
  "Amazon Just Made It Easier To Sell On Walmart, SHEIN, And Shopify": 0.5,
  "Workers in 2 states sue Starbucks over dress code changes": -0.5,
  "Intuitive Surgical (ISRG) is an ‘Outperform’ Ahead of Key Product Launches: Bernstein SocGen Group": 0.6,
  "Intuit Inc. (INTU) Focused on AI Innovation to Target 100M Customer Base": 0.6,
  "CrowdStrike Delivers Unified Data Protection for the AI Era": 0.5,
  "Booking Holdings Inc. (BKNG) Taps AI Innovation to Enhance Booking Experiences": 0.6,
  "CrowdStrike Jumps 10% as Jefferies Boosts Price Target On AI Momentum": 0.8,
  "OKTA vs. Cisco Systems: Which Cybersecurity Stock Has an Edge?": 0.2,
  "Insulet gets artistic with Omnipod Mango Pantone colour creation": 0.5,
  "How a new look turned into a labor battle at Starbucks": -0.5,
  "American Express revamps Platinum Card with new perks. You'll have to pay $895 annually": -0.5,
  "Should Investors Buy the ZOOM Stock at a Discounted P/E of 14.8X?": 0.2,
  "Here's Why Shares in Synopsys Soared Today": 0.5,
  "Shopify vs. Wayfair: Which E-commerce Stock is a Better Investment?": 0.5,
  "Why ASML Stock Popped Today": 0.5,
  "Etsy Stock Earns Relative Strength Rating Upgrade": 0.5,
  "Why CrowdStrike Stock Is Soaring Today": 0.5,
  "ARM's Powerful Lumex Launch Poised to Accelerate AI Leadership": 0.8,
  "Wall Street blinked, then Nvidia built its boldest partnership yet": 0.5,
  "MercadoLibre Stock Scores Relative Strength Rating Upgrade": 0.5,
  "Purpose Investments Inc. Announces September 2025 Distributions for Canadian Yield Shares ETFs": 0.0,
  "Intuit's (NASDAQ:INTU) Upcoming Dividend Will Be Larger Than Last Year's": 0.5,
  "TI increases dividend 4% to $1.42 per share, marking 22 consecutive years of increases": 0.8,
  "Nvidia seemingly invested in Intel to gain favor with the current US administration, also the deal doesn't include Intel fabs - https://www.wsj.com/tech/ai/nvidia-intel-5-billion-investment-ad940533 > But Intel’s foundry business has struggled to find outside customers and fallen badly behind rivals on adopting market-leading manufacturing processes. Building up a foundry business is crucial for Intel to execute its turnaround and compete more closely with the world-leading Taiwan Semiconductor Manufacturing. > > “This looks like a product deal, not": -0.2,
  "PayPal Stablecoin Tops $1.3 Billion as PYUSD Expands to Tron, Avalanche": 0.5,
  "Cybersecurity Stocks: Netskope IPO Jumps In First Day Of Trading": 0.5,
  "These Stocks Moved the Most Today: Intel, Nvidia, Micron, Novo Nordisk, 89bio, CrowdStrike, Bullish, Nucor, and More": 0.2,
  "CrowdStrike Jumps After Guiding Key Growth Metric Above Views": 0.8,
  "Why KLA Stock Triumphed on Thursday": 0.5,
  "Heard on the Street Recap: Nvidia Goes Big on Intel": 0.5,
  "PayPal's $1.3B Stablecoin Expands to 9 New Blockchains With LayerZero Integration": 0.5,
  "Tech Deal, Rate Cut Push Stocks to Records": 0.5,
  "Stocks to Watch Recap: Intel, FedEx, Meta, Darden Restaurants": 0.0,
  "Latino families are building wealth through short-term rentals, according to new survey": 0.6,
  "Expedia CEO says any quarterly reporting change won't affect internal decisions": 0.2,
  "MercadoLibre (MELI) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Qualcomm (QCOM) Rises Higher Than Market: Key Facts": 0.5,
  "Why Shopify (SHOP) Outpaced the Stock Market Today": 0.5,
  "Datadog (DDOG) Rises Higher Than Market: Key Facts": 0.5,
  "Cisco Systems (CSCO) Laps the Stock Market: Here's Why": 0.5,
  "AppLovin (APP) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "JFrog, Amplitude, Freshworks, Intuit, and Cloudflare Stocks Trade Up, What You Need To Know": 0.5,
  "Integral Ad Science, SoundHound AI, Fastly, Five9, and Cadence Design Systems Shares Are Soaring, What You Need To Know": 0.8,
  "Asana, Domo, Qualys, Shopify, and Okta Shares Skyrocket, What You Need To Know": 0.8,
  "Health Catalyst, Twilio, Palantir Technologies, Zscaler, and Appian Shares Skyrocket, What You Need To Know": 0.8,
  "Comcast (CMCSA) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Gilead Sciences (GILD) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "NXP Semiconductors (NXPI) Rises Higher Than Market: Key Facts": 0.5,
  "Former Facebook Engineer Quickly Becomes VC Partner After Building $250M Revenue Engine At AI Startup Glean": 0.8,
  "General Mills vs. Kraft Heinz: Bite the Dip in these Popular Food Stocks?": 0.1,
  "Why Lam Research Stock Easily Topped the Market on Thursday": 0.5,
  "(Item 8.01) Other Events. On September 19, 2025, Marvell Technology, Inc. (the “Company”) announced that its Board of Directors had declared the payment of its quarterly dividend of $0.06 per share to be paid on October 30, 2025 to all stockholders of record as of October 10, 2025. A copy of the press release is furnished herewith as Exhibit 99.1 and is incorporated by reference herein. The payment of future quarterly cash dividends is subject to, among": 0.2,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Approval of Amendment and Restatement of the 2017 Stock Incentive Plan On September 18, 2025, the stockholders of Take-Two Interactive Software, Inc. (the “Company”) approved and adopted an amendment and restatement of the Amended and Restated Take-Two Interactive Software, Inc. 2017 Stock Incentive Plan (the “2017 Plan”) at the Company’s annual meeting of stockholders (the “Annual Meeting”).\n\n(Item 5.07) . The amendment and restatement of the 2017 Plan (i) increases the shares reserved under the 2017 Plan by 5,200,000 shares, and (ii) extends the term of the 2017 Plan to September 18, 2035. No other changes were made to the 2017 Plan. The foregoing description of the amendment and restatement of the 2017 Plan is qualified in its entirety by the full text of the 2017 Plan, as amended and restated, which is attached\n\n(Item 5.07) Submission of Matters to a Vote of Security Holders. On September 18, 2025, the Company held its Annual Meeting virtually via live audio-only webcast. As of the record date for the Annual Meeting, the Company had 184,467,164 shares of its common stock, par value $0.01 per share (the “Common Stock”), issued and outstanding. At the Annual Meeting, 162,145,195 shares of Common Stock were represented in person or by proxy. The following matters were submitted to": 0.1,
  "(Item 1.01) Entry into a Material Definitive Agreement. On September 18, 2025, Applied Materials, Inc. (“Applied”) completed a registered public offering of $550 million in aggregate principal amount of 4.000% senior unsecured notes due 2031 (the “2031 Notes”) and $450 million in aggregate principal amount of 4.600% senior unsecured notes due 2036 (the “2036 Notes” and, collectively with the 2031 Notes, the “Notes”) pursuant to an underwriting agreement (the “Underwriting Agreement”) with Citigroup Global Markets Inc., Mizuho\n\n(Item 8.01) Other Events. On September 15, 2025, Applied entered into the Underwriting Agreement for the sale of the Notes. The Underwriting Agreement contains customary representations, warranties and agreements by Applied, and customary closing conditions, indemnification rights and termination provisions. The above description of the Underwriting Agreement does not purport to be complete and is qualified in its entirety by reference to the full text of the Underwriting Agreement, which is filed as Exhibit 1.1 to this": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Retirement of Chief Accounting Officer and Controller On September 17, 2025, Booking Holdings Inc. (the “Company”) announced that Susana D’Emic, the Company’s Chief Accounting Officer and Controller, intends to retire at the end of March 2027. In advance of that date, she will be transitioning to the role of Senior Vice President of Finance in connection": 0.1,
  "Why is $SNAP still losing money? - I see all my younger cousins ranging from age 20-30 always using Snapchat so I'm assuming it's pretty popular with the younger generation. Im just trying to understand how a social media with such a large user base has been unable to turn a profit so far like meta has. What are they doing wrong and is there hope for this company?": 0.2,
  "'Against The Principles Of The Fourth Amendment' 80,000 AI Cameras Track Americans Daily As CEO Claims He Can Eliminate All Crime In 10 Years": -0.8,
  "PayPal’s PYUSD Expands Across New Chains With LayerZero": 0.5,
  "What is going on with Comcast (CMCSA) having a 5.25 PE ratio? - Was looking through a few firms and noticed Comcast/Xfinity sitting at a low PE of 5.25 and high EPS of 6, with a share price of 31. Seems extremely low even for something like a low growth utility, especially with a 4% dividend rate. Anyone know what gives, or if this is a normal P/E for telecommunications firms? Know cable is dying": 0.2,
  "Explore Asia's Aquatic Wonders with Agoda's Curated Aquarium Picks": 0.5,
  "UPS Has A Limited Downside From This Price - United Parcel Service (UPS) $85 **Industry/Sector/Type – – – Transportation/Goods/Cyclical** Biggest catalyst for the stock – High dividend yield and low valuation, scraping the bottom of the barrel for “value” stocks. Cautious buy, expecting a limited downside. **Positives** **Low Valuation:** United Parcel Service trades at a decade-low valuation of 12x earnings, which doesn’t give enough credit to its pivot from low-margin Amazon volumes towards higher-value customers.": 0.6,
  "Jim Cramer Highlights Potential Warner Bros. Acquisition": 0.5,
  "Jim Cramer Says “I Think You Buy Airbnb”": 0.6,
  "Jim Cramer Says Axon “Could Continue to Rally for a Very, Very Long Time”": 0.8,
  "Jim Cramer Explains Why Cisco Remains in the Charitable Trust Portfolio": 0.5,
  "Jim Cramer on Keurig Dr Pepper: “They’re Right to Break Up the Business”": 0.5,
  "Jim Cramer on Resideo Technologies: “Precisely the Kind of Stock That You Should be Buying”": 0.6,
  "Jim Cramer Says “Canadian National is Way Too Cheap”": 0.8,
  "Q2 Earnings Highs And Lows: Atlassian (NASDAQ:TEAM) Vs The Rest Of The Productivity Software Stocks": 0.5,
  "Jim Cramer Advises Holding Warner Bros. Discovery for at Least $20": 0.5,
  "2 Reasons to Watch INTU and 1 to Stay Cautious": 0.5,
  "3 Reasons to Sell ADI and 1 Stock to Buy Instead": -0.5,
  "GOOG and META Bull? - $GOOG and $META is the future of consumer i think Both have proven their willingness to invest years and years of R&D to get us some pretty magical stuff. Don't think OpenAI with their 3 year project for consumer devices will get there any time soon... and AAPL is... asleep (launch fails aside... sh\\*t happens sometimes) Thoughts?": 0.6,
  "Wipro Limited Set to Launch Wipro CyberShieldSM MDR In Collaboration With CrowdStrike": 0.5,
  "BofA Cuts Lululemon (LULU) PT to $185 on Slower China Growth, Reduced Full-Year Revenue Guidance": -0.6,
  "Canadian National Railway, CSX Sign MOU to Launch New All-Rail Intermodal Service to Nashville": 0.5,
  "3 Consumer Stocks with Warning Signs": -0.5,
  "2 Cash-Producing Stocks with Exciting Potential and 1 We Ignore": 0.6,
  "1 Large-Cap Stock with Impressive Fundamentals and 2 We Turn Down": 0.5,
  "2 Profitable Stocks on Our Watchlist and 1 We Turn Down": 0.2,
  "Mexico’s Antitrust Watchdog Investigates MercadoLibre (MELI)": 0.1,
  "Analysts Stay Positive on Intuitive Surgical (ISRG) Despite Stock Dip": 0.8,
  "Intuit (INTU) Partners with Clair to Offer On-Demand Pay": 0.5,
  "Marqeta Appoints Mike Milotich as Chief Executive Officer": 0.5,
  "Exelon (EXC): ComEd Announces Start of V2G Charging Pilot’s Testing Phase": 0.5,
  "Micron's super bull run is making me nervous towards ER - The stock has been an absolute beast and I'm very lucky to be in it. I have shares & leap calls expiring in June & September 2026. I'm up 40% on stocks and 127% on options. September 23 is ER and I'm very nervous going into this. I know today some analysts upgraded this stock to $200 target. But still... with its crazy bull": 0.2,
  "Update on intended recommended public offer by KDP for JDE Peet's": 0.5,
  "Is Opendoor Technologies Stock a Buy Below $10?": 0.2,
  "Heard on the Street Thursday Recap: Nvidia Goes Big on Intel": 0.5,
  "Trending tickers: Intel, FedEx, Cardlytics, Brera and CrowdStrike": 0.0,
  "5G Smart Antennas: Bridging Telecom Giants and Chip Innovators": 0.5,
  "r/Stocks Daily Discussion & Fundamentals Friday Sep 19, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is": 0.2,
  "Thoughts on Investing in EU Defence Stocks? - With NATO countries ramping up defence budgets, I’m thinking it might be a good time to explore EU defence stocks, especially companies involved in drones and advanced tech. My current top 3 picks: * **Thales (HO.PA)** * **Leonardo (LDO.MI)** * **Parrot (PARRO.PA)** I’d love to hear your thoughts: * Are these solid picks, or am I missing better opportunities? * Is now a smart time to invest": 0.6,
  "1 Hidden Benefit of Intel's Deal With Nvidia": 0.5,
  "Amex Puts a Platinum Price Tag on Signature Luxury Card": 0.2,
  "US chip independence is a 'vital necessity': Gary Cohn on AI": 0.5,
  "Regeneron Donates Ebola Treatment for Use in Countries Most at Risk of Outbreaks": 0.8,
  "Intellum Announces 2025 Growth Makers Awards Winners": 0.5,
  "Investors in Baker Hughes (NASDAQ:BKR) have seen enviable returns of 306% over the past five years": 0.8,
  "Arvinas reboots, cuts more staff; Porges joins Lazard": -0.2,
  "Trump-Xi Phone Call Steadies Wall Street Pre-Bell; Asia Off, Europe Flat": 0.5,
  "Deliveroo CEO to step down following acquisition by DoorDash": 0.1,
  "3 Incredible Growth Stocks to Buy Now": 0.8,
  "Analysts positive on INTU after analyst day": 0.8,
  "This Week In AI Chips - NVIDIA's £2B Boost for UK AI Ecosystem": 0.6,
  "Mercado Pago to acquire Nikos DTVM in Brazil – report": 0.5,
  "High Growth Tech Stocks In The US Market September 2025": 0.5,
  "VoPay introduces PayPal and Venmo payouts on its payment platform": 0.5,
  "Where OpenAI's $300b deal with Oracle can come from - I thought the $300b deal was BS when I first saw it. I now think it's real. 1. OpenAI will likely IPO. Right now, they're worth $500b in private valuation based on their last funding round. I'm willing to bet that they can IPO for $1 trillion in valuation today based on pure AI ecstasy and raise a cool $100b - $200b in cash. 2.": 0.6,
  "CrowdStrike and Molson Coors Beverage have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Nvidia Stock Can’t Keep Up With Micron and Other AI Plays. Here’s Why.": -0.5,
  "IRS to Monitor Vacation Home Rentals More Closely - Clear Start Tax Explains How Short-Term Use Can Spark Tax Liability": -0.5,
  "Prediction: 2 Stocks That Will Be Worth More Than ASML 2 Years From Now": 0.5,
  "AZ-VC II Launches to Fill The Funding Gap For Non-Coastal Startups; Eschews Sky-High Coastal Valuations": 0.5,
  "Constellation’s Clean Energy Centers Deliver Near-Perfect Summer Reliability, Backed by $7 Billion in Investments Over the Past Decade": 0.8,
  "Returns At Keurig Dr Pepper (NASDAQ:KDP) Appear To Be Weighed Down": -0.6,
  "Should You Think About Buying Marvell Technology, Inc. (NASDAQ:MRVL) Now?": 0.2,
  "How Is CEG leveraging Natural Gas to Support Growth & Grid Stability?": 0.5,
  "Dow Jones Futures Rise Amid Trump-Xi Call; Palantir Leads 7 New Buys": 0.5,
  "How To Earn $500 A Month From PepsiCo Stock": 0.2,
  "Workday CFO on why $1.1 billion Sana deal aligns with M&A strategy": 0.5,
  "PFE vs. AZN: Which Cancer-Focused Drug Giant Is the Better Pick?": 0.5,
  "Should You Invest in Netflix (NFLX)?": 0.0,
  "Exchange-Traded Funds Higher, Equity Futures Mixed Pre-Bell Friday Ahead of Trump, Xi Talks": 0.5,
  "2 Dividend Powerhouses to Buy Right Now": 0.5,
  "SEC to propose rule change on Trump’s call to end quarterly earnings reporting, says Chair Atkins - Paul Atkins, chairman of the U.S. Securities and Exchange Commission, made the remarks on CNBC’s “Squawk Box” Friday. Earlier this week, President Donald Trump proposed the idea that companies should no longer provide earnings reports on a quarterly basis and switching to semiannual instead. The SEC said the agency is actively looking into that plan. “At President Trump’s": 0.2,
  "Analyst on Adobe Inc (ADBE): ‘I’m on My Last Nerve With This Stock’": -0.6,
  "The Zacks Analyst Blog Highlights Netflix, Amazon, Disney and Apple": 0.5,
  "$CDTX: H5 bird flu results are in - Yesterday I flagged that the results from a study to evaluate in vivo efficacy of Cidara's CD388 pre-exposure prophylaxis against H5N1 (bird flu) would be presented today at the ISRV conference in Singapore. The results are now out ( [A single prophylactic dose of CD388 provides protection against highly pathogenic bovine-origin Influenza A virus in the ferret model](https://www.cidara.com/wp-content/uploads/2025/09/ISRV-2025-Cidara-CD388_H5N1_Andreevl-FINAL.pdf)). The study results were presented by Konstantin Andreev, St.": 0.6,
  "Cathie Wood Just Bought the Dip in Synopsys Stock. Should You?": 0.5,
  "Should You Buy This Little-Known Chip Stock at 52-Week Highs?": -0.5,
  "Investors Heavily Search Netflix, Inc. (NFLX): Here is What You Need to Know": 0.5,
  "Investors in Cadence Design Systems (NASDAQ:CDNS) have seen strong returns of 257% over the past five years": 0.8,
  "Ozen Engineering Merges with SimuTech Group, Uniting Two Leading Partners of Ansys and Synopsys Across North America": 0.5,
  "Got $1,000? 2 Stocks to Buy Now While They're on Sale": 0.5,
  "Samsung secures Nvidia HBM3E qualification as Micron faces HBM4 hurdles": 0.1,
  "What Analyst Projections for Key Metrics Reveal About Cintas (CTAS) Q1 Earnings": 0.2,
  "Will Strength in Aerospace Technologies Continue to Drive HON's Growth?": 0.5,
  "Wall Street Set to Open Slightly Higher Friday as Equities Level Out Following Record Sessions": 0.5,
  "Prediction: This AI Growth Stock Will Become Europe's First $1 Trillion Company by 2035": 0.8,
  "Should You Invest in Workday (WDAY) Based on Bullish Wall Street Views?": 0.5,
  "Earnings Growth & Price Strength Make Adobe Systems (ADBE) a Stock to Watch": 0.6,
  "Wall Street Analysts Think Booking Holdings (BKNG) Is a Good Investment: Is It?": 0.5,
  "Axon (AXON) Is Considered a Good Investment by Brokers: Is That True?": 0.5,
  "New Fortress Energy--Buy or No - * The company recently announced a significant deal with Puerto Rico. * They seem to have shaken the negative rumors of bankruptcy that were plaguing them. * Veteran leadership is returning. * My energy thesis is that the more society's reliance on tech continues to grow, so does our energy needs. It is a \"picks and shovels\" play. I like what I'm seeing. Analysts are largely giving it a": 0.8,
  "Here's Why Paypal (PYPL) is a Strong Momentum Stock": 0.8,
  "Josh Brown Highlights His Top Cheap Stock Pick With ‘Best Long-Term Charts’": 0.6,
  "Amgen's Uplizna Receives European Human Medicines Committee Recommendation for IgG4-Related Disease": 0.5,
  "DAT: Truckload volumes, spot rates dipped in August": -0.5,
  "Liver Cancer Therapeutics Market Size Surpasses USD 13.16 Billion by 2032, Increasing at a CAGR of 16.5% from 2025 to 2033": 0.8,
  "Baker Hughes secures multi-year contract with Petrobras for offshore stimulation vessels": 0.6,
  "Smart Medical Devices Market Size to Reach $180.4 Billion by 2033 - Strategic Growth Opportunities in Chronic Disease Management, Digital Health, and Connected Care": 0.8,
  "BizClik Brings Global Leaders Together at Sustainability LIVE: Climate Week NYC 2025": 0.8,
  "This Bearish Trade Might Work Best If Netflix Stock Is Fading": -0.6,
  "Nvidia explores $500 million investment in UK self-driving startup Wayve - https://finance.yahoo.com/news/nvidia-explores-500-million-investment-085113334.html > U.S. chip designer Nvidia (NVDA) has signed a letter of intent for a possible $500 million investment in the next funding round at Britain's Wayve, the autonomous driving technology group said on Thursday. The development comes after Britain and the United States signed a technology pact aimed at boosting ties in artificial intelligence and other fields. Founded in 2017, Wayve raised over": 0.5,
  "Can Credo Sustain Momentum in Optical Business Amid Competition?": 0.1,
  "Intuit Core Business Positioned Well Amid 'Ample' Runway for Growth, Oppenheimer Says": 0.8,
  "Intel (INTC) Moves 22.8% Higher: Will This Strength Last?": 0.6,
  "Intuitive Surgical: How To Find & Own America's Greatest Opportunities": 0.5,
  "Petrobras Expands Offshore Capabilities With Baker Hughes Partnership": 0.5,
  "Price Hikes Lift Netflix in UCAN: Growth Opportunity or Pitfall?": 0.2,
  "LRCX Bets on TEOS 3D: Will it Strengthen Packaging Leadership?": 0.5,
  "Analog Devices (ADI) Up 0.9% Since Last Earnings Report: Can It Continue?": 0.6,
  "Elliott Management Is Betting Big on Workday Stock. Should You?": 0.5,
  "Paramount and WBD, UPS, Apple iPhone 17: Trending Tickers": 0.0,
  "BYD or TTWO: Which Is the Better Value Stock Right Now?": 0.5,
  "GEHC or A: Which Is the Better Value Stock Right Now?": 0.0,
  "Bull of the Day: CrowdStrike (CRWD)": 0.5,
  "CrowdStrike Stock Soars 80%. Should You Buy CRWD Here?": 0.5,
  "Advanced Energy (AEIS) Soars 7.6%: Is Further Upside Left in the Stock?": 0.6,
  "Intuit Reaffirms Q1 & Fiscal 2026 Guidance: Is It on Track to Deliver?": 0.5,
  "Comcast Opens New Xfinity Store in Canton, Georgia": 0.0,
  "Will Qualcomm's Deep Foray Into AI Realm Work Wonders for the Stock?": 0.5,
  "Why DexCom (DXCM) Shares Are Trading Lower Today": -0.5,
  "Jerome Powell on the labor market and why they chose to cut rates - All direct quotes from the fed meeting: “In the labor market, the unemployment rate edged up to 4.3 percent in August but remains little changed over the past year at a relatively low level. Payroll job gains have slowed significantly to a pace of just 29 thousand per month over the past three months. A good part of the slowing likely": -0.5,
  "NTLA Completes Enrollment in Pivotal Study on HAE Candidate, Stock Up": 0.8,
  "Identify Outliers Like KLA with Money Flows": 0.2,
  "If You Invested In Netflix When It Was Still a DVD Rental Service, Here’s How Much You’d Have Today": 0.5,
  "Why Is Workday Stock Surging This Week?": 0.5,
  "Can Regeneron Change The Paradigm In Multiple Myeloma — And Undercut J&J?": 0.1,
  "EMA Backs Amgen Drug For Rare Autoimmune Disorder": 0.5,
  "U.S. Oil Rig Count Rises for Third Consecutive Week": 0.2,
  "CrowdStrike Honors Top Customers and Partners Driving Innovation in AI-Powered Cybersecurity": 0.8,
  "Synopsys, Inc. (SNPS): A Bull Case Theory": 0.5,
  "Lululemon’s Unusual Options Activity: 3 Safer Plays to Consider": 0.5,
  "Exploring High Growth Tech Stocks In The US Market September 2025": 0.5,
  "NTSK Netscope IPO and future growth - What is everyone's thoughts on this company? Just IPO a day ago and I think it has great potential, hyperfocused on cloud security and with the need of advanced hardware for AI, cloud computing will continue to growth and with it so came the need to safe guard your data and protection services.": 0.8,
  "Marvell Technology, Inc. (MRVL): A Bull Case Theory": 0.5,
  "Byte-Sized AI: Uber Freight Upgrades TMS; Ralph Lauren Launches Chatbot With OpenAI and Microsoft": 0.5,
  "PayPal, Google and Mastercard are all in on agentic AI": 0.5,
  "Could Intel Be the Comeback Story of the Decade After Nvidia's Multibillion-Dollar Endorsement?": 0.8,
  "Wipro Limited (WIT) Partners CrowdStrike on AI-Powered Security Solution": 0.5,
  "Strategic Deals Bolster VIAVI’s (VIAV) Growth Outlook, Backed by Analyst Confidence": 0.8,
  "The 4 industries worst hit by tariffs so far": -0.5,
  "Inside the sport drawing Tom Brady out of retirement": 0.2,
  "Is the Kansas City Chiefs’ NFL dynasty officially over?": -0.6,
  "Reddit Reportedly In Talks With Google On Next AI Content Deal - [https://finance.yahoo.com/m/383b2e91-48ee-382f-9f30-9e95ed8793a9/reddit-reportedly-in-talks.html](https://finance.yahoo.com/m/383b2e91-48ee-382f-9f30-9e95ed8793a9/reddit-reportedly-in-talks.html) They made a deal in 2024, but they look to already be negotiating a new deal with Google and Microsoft. Do you think we see some of these AI hyper-scalers transition from spending money on hardware to LLMs/Data partnerships in the near future? I don't know how many GPUs they ultimately need, but I assume getting valuable human data is just as": 0.2,
  "Pantera Capital Says Solana at a ‘Major Inflection Point’ as Third-Largest Crypto Play — Is $300 $SOL Realistic?": 0.5,
  "Dow, S&P 500, Nasdaq close at record highs for second day as tech, trade headlines lift markets": 0.8,
  "Oil Rig Count Rises by 2; Crude Prices Fall for Third Straight Session": -0.6,
  "US Equity Indexes Higher on Easing US-China Trade Standoff": 0.8,
  "CoreWeave, nuclear energy stocks, Fiverr: Trending Tickers": 0.0,
  "Amer Sports, Inc. (AS): A Bull Case Theory": 0.5,
  "Atlassian Corporation (TEAM): A Bull Case Theory": 0.5,
  "Copart, Inc. (CPRT): A Bull Case Theory": 0.5,
  "Sector Update: Health Care Stocks Mixed Late Afternoon": 0.0,
  "Marvell Technology, Inc. Declares Quarterly Dividend Payment": 0.0,
  "Why Amgen (AMGN) Stock Is Trading Up Today": 0.5,
  "Snowflake (SNOW) Stock Trades Up, Here Is Why": 0.5,
  "US Equity Indexes Hit Record Highs This Week After Fed Rate Cut, Warmer US-China Trade Relations": 0.8,
  "Beware This ‘Bull Trap’ as Stocks Keep Hitting New Highs": -0.7,
  "Regarding Investing in Stocks - Scalping/Swings. How often to check companies financials? - Investing in stocks, using company (valuations, financials, ownership, performance and technical) analysis. How often should I be checking up on the overall performance of the stock? For example, Invested in a quantum stock 2 days ago, was already up 7% and sold for profit. I'm not afraid of taxes as long as I'm making profit and reinvesting in other companies that are": 0.2,
  "SPT Sprout Social - Big upside move ahead, AI and Social Media - Hi everyone, with this post I want to introduce the company Sprout Social (Nasdaq: SPT) and explain why, in my view, buying the stock could pay off over the mid to long term. **1) About Sprout Social:** Sprout Social, Inc. is a U.S.-based provider of cloud software for social media management. From one central platform you can schedule and publish posts, handle": 0.6,
  "2 Stocks That Are Crushing the Market This Year But Have More Room to Run": 0.8,
  "S&P 500 Gains and Losses Today: Paramount Surges Amid Deal Buzz, Apple Rises as iPhone 17 Goes on Sale": 0.6,
  "Perpetua gets US approval to begin construction on Idaho antimony and gold mine - [https://www.reuters.com/markets/commodities/perpetua-gets-us-approval-begin-construction-idaho-antimony-gold-mine-2025-09-19/](https://www.reuters.com/markets/commodities/perpetua-gets-us-approval-begin-construction-idaho-antimony-gold-mine-2025-09-19/) * US Forest Service issues conditional notice for development * Construction of Stibnite project expected to begin by October * Reclamation bond finalization expected within weeks * US Export-Import Bank reviews $1.8-billion loan The green light for the mine, backed by billionaire investor John Paulson, comes after Beijing last year blocked exports to the United States of [antimony](https://www.reuters.com/markets/commodities/rattled-by-china-west-scrambles-rejig-critical-minerals-supply-chains-2024-12-06/), a metal": 0.2,
  "Whats the best platform to trade on in Canada? - Ive begun trading with a TSFA on Wealth Simple but it seems there are a few fees everytime i buy/sell anything. My strategy was to do short term daily/weekly trades yielding 5-15% each and build my funds that way. But the fees are eating a chunk of the small profits. Im hoping there is a platform i can trade on that has fewer/no fees involved.": -0.6,
  "Why Constellation Energy Corporation (CEG) Outpaced the Stock Market Today": 0.5,
  "ON Semiconductor Corp. (ON) Stock Dips While Market Gains: Key Facts": 0.1,
  "Trump unveils gold, platinum visas to cost up to $5 million": -0.5,
  "ABNB Stock Price Prediction: Where Airbnb Could Be by 2025, 2026, and 2030": 0.5,
  "Astrazeneca (AZN) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.2,
  "Exclusive-Comcast plans to cut jobs at its biggest unit, housing broadband and pay TV, to centralize operations, source says": -0.6,
  "PYPL Stock Price Prediction: Where PayPal Could Be by 2025, 2026, 2030": 0.5,
  "Adding Texas Instruments Incorporated (TXN) to Your Dividend Stock Portfolio for Long-Term Income": 0.5,
  "Building a Dividend Stock Portfolio: PepsiCo’s (PEP) Stability and Growth Potential": 0.6,
  "Quantumscape Discussion? - Is anyone buying up Quantumscape stock? I feel like this could blow up. I have 131 shares, and wanted to hear everyones opinions on it. I know its kind of disregarded because they're still prototyping their product. But I feel good about it generally. I bought in a month(?) ago at 9$. It's hit 13.42$ today. Wondering if it'll keep climbing or to sell. Also just curious about public opinion on the": 0.6,
  "Why QUALCOMM (QCOM) Belongs in a Dividend Stock Portfolio for Steady Income": 0.5,
  "Has Your Starbucks Barista Been Acting Especially Friendly Lately? Here’s Why.": 0.5,
  "NNE & SMR Nuclear - 30% Short Interest - Short Squeeze Potential? - As a disclaimer, I have early positions in both. That being said, Im questioning whether their comparable high short interests, which sit around 30% of float shares, offers the potential for a short squeeze. Both companies are in the nuclear sector and have been benefactors of policy changes under the current administration offering a backdrop of consistent support from the USA. On": 0.2,
  "Over - The - Counter - What over-the-counter stocks do you have in your portfolio that you think are great? I made some decent cash with Rolls Royce, for that I had to get on the phone with Charles Schwab to purchase. I recently bought SolarFoods stock from the Helsinki Nasdaq, it’s a risk/reward play, dont worry I didn’t bet the house on it. Anyways I think over-the-counter can be looked as a way of": 0.5,
  "Mondelez International (MDLZ): A Sweet Spot in Dividend Stocks to Buy Under $100": 0.8,
  "Loaded 70% of my portfolio into BMNR how scary could dilution get? - Just went pretty heavy on BMNR , about $7k, which is 70% of my portfolio. I know they have that $24.5B ATM shelf open, which means they can issue more shares basically any time. Based on some modeling I did, here’s what another raise might look like: • If they raise $2B at $60/share, that’s roughly 33M new shares → about 15%": -0.6,
  "The Amex Platinum Card's $200 annual fee increase is steep — but not as divisive as Chase Sapphire Reserve's": 0.1,
  "Thoughts on SFM's future? Persistently dropping the past 3 months - SFM has been doing great for the past few years, except the last 3 months. In the last 3 months the stock decreased slowly and consistently, down \\~30%. However, quarterly results have beaten expectations, and the broader stock market overall has been up, so it's a little baffling to me why it performed so poorly the last 3 months. Curious what are your thoughts": -0.2,
  "Zuckerberg’s AI glasses live demo fails spectacularly at major tech event - Meta’s invested 100’s of billions of dollars in AI and can’t even create a product to give proper instructions for a recipe. Yet we’re told to expect massive returns in the short term. I’m not buying it. AI will be great and dramatically affect our lives but we’re clearly still in the beginning stages. Source: https://www.foxbusiness.com/technology/zuckerbergs-ai-glasses-live-demo-spectacularly-fails-major-tech-event.amp": -0.8,
  "Jim Cramer Calls Workday an Enterprise Software Powerhouse": 0.8,
  "Jim Cramer Says He Stopped Liking lululemon When They Sued Costco": -0.5,
  "Jim Cramer Says “Marriott Was Crushed” But it “Makes No Sense at All”": 0.2,
  "2 Stocks That Could Create Lasting Generational Wealth": 0.8,
  "Bears only hope remaining to maul the bulls - I am not a bear or a bull I am bullish but alot more cautious than most and wont fomo into some of the stocks I have been watching as I know its a dangerous time when people think the market is easy. Anyway bears have been slaughtered recently and perma bulls are making money and most people are in the delusional stage of the rally": 0.2,
  "3 Top Tech Stocks to Buy in September": 0.5,
  "Investment Strategy - Hello everyone. Ive been investing in stocks since 2021, always had little idea what I’m doing but with this incredible bull run lately & with more hands on research & thinking from myself I’ve started to make some very good gains. The issue is, I’ve never had much of a strategy, I’ve just bought arbitrary amounts of certain companies if I thought they were going to do well. Recently I’ve decided that": 0.5,
  "Prediction: These Could Be the Best-Performing Value Stocks Through 2030": 0.5,
  "Indian Market Data Shows ESG Scores Flip Normal Price Discovery Rules - Market mechanics just got weird. A recent analysis of Indian stocks shows that companies split into two trading patterns purely based on their ESG ratings: * High ESG companies → spot market leads futures (completely backwards from normal). * Low ESG companies → futures market leads spot (as expected). Futures are supposed to lead because they’re cheaper and more efficient. Yet somehow, ESG": 0.2,
  "/r/Stocks Weekend Discussion Saturday - Sep 20, 2025 - This is the weekend edition of our stickied discussion thread. Discuss your trades / moves from last week and what you're planning on doing for the week ahead. Some helpful links: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips *": 0.2,
  "Starbucks CEO says the company is doubling down on protein and gluten-free options: ‘I believe our food needs to match the craft of our coffee’": 0.6,
  "Is Constellation Energy Stock a Buy Now?": 0.2,
  "Buy the Dip in These 2 Underperforming Cloud Software Stocks, Say Analysts": 0.5,
  "These 5 Side Hustles Are On Their Way Out In the Trump Economy": -0.5,
  "Evaluating Atlassian (TEAM) Valuation After Unusual Share Price Swings This Week": 0.1,
  "What Does the $1.69B UK Investment Mean for PayPal’s Share Price in 2025?": 0.1,
  "The Bull Case For DoorDash (DASH) Could Change Following New Partnerships in Hardware, Beauty, and Business": 0.5,
  "Is There Now an Opportunity in Paramount Skydance After Potential Warner Bros. Bid?": 0.5,
  "3 Red-Hot Stocks to Buy Right Now": 0.5,
  "Salesforce CEO Marc Benioff Just Delivered Fantastic News for Palantir Investors": 0.8,
  "Exelon Corporation (NASDAQ:EXC) is a favorite amongst institutional investors who own 87%": 0.5,
  "A Fresh Look at Intuitive Surgical (ISRG) Valuation Following New da Vinci 5 Software Innovations": 0.5,
  "GE HealthCare Technologies (GEHC): Valuation Insights Following New AI Ultrasound Launches and Flyrcado Imaging Agent Deal": 0.5,
  "1 Dominant Enterprise AI Stock to Keep on Your Radar": 0.5,
  "Will Airbnb’s (ABNB) AI-Powered ‘Everything App’ Ambition Redefine Its Diversification Narrative?": 0.5,
  "Is There Now an Opportunity in Lululemon After Shares Drop Over 50% in 2025?": 0.2,
  "AstraZeneca (LSE:AZN): Exploring Current Valuation Signals and Analyst Narratives": 0.2,
  "Does Fortinet's (FTNT) Cautious Guidance Reveal Shifting Enterprise Security Priorities?": 0.1,
  "How the Narrative Surrounding CrowdStrike Has Shifted After AI Innovations and New Guidance": 0.5,
  "How the Narrative for Regeneron Has Shifted with Pipeline Wins and Analyst Optimism": 0.6,
  "Is Starbucks Stock Worth Another Look After Record-Breaking Fall Sales Surge?": 0.5,
  "The Payments Giant That's Quietly Winning the Crypto War": 0.5,
  "Stock Market Rally Risks Losing Steam as Economic Bounce Fades": -0.6,
  "ETFs that benefit from the likely multiple interest rate cuts and a probable strong Q4. - **SPDR S&P 500 ETF (SPY)**: It has a clean 10% run from late May that holds into September, which breaks the historical trend that is known for low volume and choppy price action. This deviation could be a setup for an October treat that leads to a strong fourth quarter. **iShares 20+ Year Treasury Bond ETF** **(TLT)**: This long-term": 0.8,
  "What Is One of the Best Consumer Goods Stocks to Buy Right Now?": 0.2,
  "Healthcare Stocks Are at an Historic Low and a Turnaround Is on the Horizon": 0.8,
  "Why is using maximum margin to buy and hold long term a bad idea when the numbers say otherwise? - Everyone always says using margin is a terrible idea, it’s super risky etc. right now I have a $100,000 trading account, let’s say 5 years ago I used my full maximum margin to simply invest $300,000 to buy GOOGL ($200,000 of which would be from margin). Even after all the interest you would pay on": -0.5,
  "My 2 Favorite Stocks to Buy Right Now": 0.5,
  "Insiders At Analog Devices Sold US$15m In Stock, Alluding To Potential Weakness": -0.7,
  "3 Dirt Cheap Stocks to Buy With $500 Right Now": 0.5,
  "Trump to impose $100,000 fee per year for H-1B visas, in blow to tech - https://www.reuters.com/business/media-telecom/trump-mulls-adding-new-100000-fee-h-1b-visas-bloomberg-news-reports-2025-09-19/ > SAN FRANCISCO/WASHINGTON, Sept 19 (Reuters) - The Trump administration said on Friday it would ask companies to pay $100,000 per year for H-1B worker visas, prompting some big tech companies to warn visa holders to stay in the U.S. or quickly return. > The change could deal a big blow to the technology sector that relies heavily on": -0.8,
  "Anatoly Yakovenko Net Worth: Solana CEO's Wealth In Spotlight As ETF Deadline Nears": 0.5,
  "Views on $RELY stock - With Trump government now adding H1B fees, how will it affect stock like $RELY At first there may be more money transfers because many people might leave the US and send money back home quickly Later the company may lose regular customers as fewer H1B workers stay in the US Also because of higher costs fewer people may apply for study and reduce extra income in the system from those": -0.6,
  "Why Applied Materials (AMAT) Deserves a Spot Among Cheap Dividend Stocks": 0.5,
  "American Express Reveals New Platinum Card Retail and Wellness Benefits, Revamps Amex App": 0.5,
  "r/Stocks Weekly Thread on Meme Stocks Saturday - Sep 20, 2025 - The meme stock scheduled posts will now run weekly and post Saturday afternoon and won't be a sticky; you're probably seeing this because automod sent you here! [Full list of meme stocks here.](https://www.reddit.com/r/stocks/wiki/meme-stocks) This will be updated every once in a while. ------ Welcome traders who just can't help them selves discuss the same exact stock that's been discussed 100s of times a": 0.1,
  "Am I missing something, or is nebius free money right now - It seems like at this price, you can’t lose money. Their quarterly revenue a year from now will likely be above corweaves current quarterly revenue. But with less debt and better margins. Coreweave is currently valued at 60 billion, roughly 3x nebius. I think it’s even possible that nebius q3 revenue next year is 50% higher than coreweaves last quarter revenue. And the": 0.5,
  "CrowdStrike Talked a Big Game at Its Investor Day, and Investors Love It": 0.8,
  "I'm predicting that Trump's $100k H1b nuclear bomb is just a market manipulation ploy - We've seen this before. Trump drops a figurative nuclear bomb on Friday afternoon, the media panics about it over the weekend, markets plummet on Monday, and then he reverses course on Wednesday and everything is back to normal. Trump and his insiders make millions while everyone else gets screwed. This H1b policy is so ludicrous, there's no way it can": -0.8,
  "Why Lululemon's Battle With Costco Could Make or Break Its Stock": 0.2,
  "These 2 Growth Stocks Have Been Hammered. Time to Buy?": 0.5,
  "Cheap Dividend Stocks With Defensive Characteristics: Spotlight on The Kraft Heinz Company (KHC)": 0.5,
  "You May Have Never Heard of This Company, But Its Stock Is Up Over 320% Year to Date": 0.8,
  "The Future of RDDT Stock - Hi everyone, I wanted to open up some discussion on RDDT stock. I think a lot of people are investing for the wrong reasons, have it wrong, or are misguided about the company. I do have stock in RDDT so please take what I say with a grain of salt, but I will try to be fair. Also, I am not saying that I am all knowing. If anything,": 0.1,
  "Prediction: These AI Chip Stocks Could Soar (Hint: It's Not Nvidia or Broadcom)": 0.8,
  "Honeywell International Inc. (HON): “The Breakup Is Extraordinarily Good,” Says Jim Cramer": 0.8,
  "CrowdStrike (CRWD) Poised for Growth: Analysts Project 20%+ ARR Growth by 2027": 0.8,
  "Disney+ and Hulu face mass cancellations after Jimmy Kimmel suspension sparks coordinated boycott across social media - No paywall: [https://www.usatoday.com/story/entertainment/tv/2025/09/19/disney-plus-cancellations/86249954007/](https://www.usatoday.com/story/entertainment/tv/2025/09/19/disney-plus-cancellations/86249954007/) >Celebrities have also weighed in on the controversy, which include notable Disney actors and public figures such as David Letterman and former Vice President Mike Pence. >Former \"Supernatural\" actor Misha Collins posted on X to his more than 2.6 million followers he would cancel his DisneyPlus subscription \"indefinitely.\" Edit: “Surge in cancellations” would be more": -0.8,
  "AAPL: Strong iPhone 17 demand - **Apple has asked suppliers to boost production of iPhone 17 model, the Information reports** https://www.reuters.com/business/apple-has-asked-suppliers-boost-production-iphone-17-model-information-reports-2025-09-19/ \"Apple this week asked Luxshare Precision, one of its two main iPhone assemblers in China, alongside Foxconn, to boost daily output of the standard iPhone 17 by about 40%\" **Apple’s iPhone 17 Sales Open to Strong Demand for Pro Models** https://www.bloomberg.com/news/articles/2025-09-19/apple-s-iphone-17-air-go-on-sale-to-years-of-demand-for-new-look \"The new phones, which bring a fresh look in addition to battery life": 0.8,
  "Needham Raises Arista (ANET) Price Target to $160 After Analyst Day": 0.8,
  "BofA Sees Stronger Demand for ASML’s Chipmaking Tools Amid AI Boom": 0.8,
  "Dividend Paying Stocks With Consistency: What Sets Cisco Systems (CSCO) Apart": 0.5,
  "Analog Devices’ (ADI) Dividend History and its Impact on Dividend Paying Stocks Portfolios": 0.1,
  "Why Income Investors Look to Comcast Corporation (CMCSA) When Choosing Dividend Paying Stocks": 0.5,
  "Is BigBear.ai (BBAI) Stock a Buy?": 0.0,
  "Atlassian Appoints AI Entrepreneur Jason Warner to Board": 0.5,
  "KeyBanc Reaffirms Overweight Rating for Netflix (NFLX), Sees Strong Ad Revenue Growth": 0.8,
  "Comcast (CMCSA) Faces Broadband Competition Despite Strong Performance, Says RBC Capital": 0.5,
  "T-Mobile (TMUS) Completes UScellular Merger, Eyes $1.2 Billion Annual Cost Savings": 0.8,
  "Wells Fargo Raises Warner Bros. Discovery (WBD) Price Target, Sees M&A Potential": 0.8,
  "Piper Sandler Lowers Adobe (ADBE) PT to $470 on AI Uncertainty Despite Record $5.99B Q3 Revenue": -0.5,
  "The Trade Desk (TTD) Draws Overweight Rating Despite Competitive Concerns": 0.5,
  "Charter Communications (CHTR) Highlights Broadband Growth and Synergies After Cox Acquisition": 0.6,
  "Stifel Maintains Buy on Lam Research (LAM) Amid Growing eSSD and NAND Market Demand": 0.6,
  "Bernstein Maintains Outperform Rating for Netflix (NFLX) Amid Content Licensing Concerns": 0.5,
  "BTIG Raises AppLovin (APP) Price Target Amid Strong Non-Gaming Revenue Forecasts": 0.8,
  "Costco’s (COST) Best-in-Class Merchandising Supports Long-Term Growth, Says UBS": 0.8,
  "Autodesk (ADSK) Partners With New England Patriots as Official Design and Make Platform": 0.5,
  "My 3 Favorite Dividend Stocks to Buy Right Now": 0.5,
  "3 Tech Stocks Poised to Benefit From a Rate Cut": 0.5,
  "Innovative Solutions and Support (ISSC) Down 41.5% Since Q3 2025 Release": -0.7,
  "QUALCOMM Incorporated (QCOM) Partners With HARMAN": 0.5,
  "Cognizant Technology Solutions (CTSH) Partners With the North Carolina Turnpike Authority": 0.5,
  "Why I Think Domino's Pizza (DPZ) Is a Warren Buffett-Worthy Investment": 0.8,
  "Over diversification - How many stocks are you invested in? - Been thinking about this lately as there are a handful of stocks that I'm looking at investing but wondering if I am over doing it rather than sticking with what I have. So, how many stocks do you have a position in currently? Is there a general rule of thumb? Ones i'm specifically monitoring KSS, UPS, OKLO, SMR, LULU": -0.2,
  "There's a New Way to Play Quarterly Earnings With Polymarket's Latest Rollout": 0.5,
  "1 Genius Artificial Intelligence (AI) Stock That Will Be Worth More Than Palantir 3 Years From Now": 0.8,
  "What to Expect in Markets This Week: Inflation Data; Fed Speakers; Earnings from Micron, Costco": 0.0,
  "Late cycle consumer spending shift = downside CMG, SG, etc? - TL;DR: bearish Chipotle, Cava, Sweetgreen. Looking for suggestions on similar situations. The devaluation of fast casuals, lululemon feels like a symptom of shifting culture and consumer behaviour. Inflation, portion size shrinking, declining economic activity, consumer fatigue, non existent brand loyalty, and limited scope to rebrand, reinvent, optimize. Late-cycle cultural and consumer-spending shift, where former aspirational brands (fast casual, athleisure, boutique fitness, “accessible luxury”) have": -0.8,
  "Better Stablecoin Buy: Ripple USD vs. PayPal USD": 0.2,
  "Prediction: This Will Be AMD's Stock Price by 2030": 0.5,
  "Could DoorDash Partnership Reveal a New Strategy for Sally Beauty’s (SBH) Urban Consumer Reach?": 0.5,
  "Costco (COST): A Fresh Look at Valuation During a Quiet Period for Shares": 0.2,
  "Is Palo Alto Networks, Inc. (NASDAQ:PANW) Potentially Undervalued?": 0.5,
  "Shopify (SHOP) forges AI Commerce Partnership with LTIMindtree—Is Its Enterprise Strategy Gaining Momentum?": 0.5,
  "A Fresh Look at Broadcom (AVGO) Valuation as Momentum Continues Without Major News": 0.5,
  "Lam Research (LRCX): Valuation Update Following Major JSR Deal and Next-Gen Chip Packaging Launch": 0.5,
  "Confluent (CFLT): Valuation Insight After CTO Appointment and Bold Enterprise AI Platform Moves": 0.5,
  "Fed's Powell, Miran set to speak: What to watch this week": 0.2,
  "This couple says they’re $12M in debt after buying 12 Airbnbs — but the risky move gave them financial freedom": 0.5,
  "The Motley Fool Has 3 Key Insights for Investors on TSMC's Revenue": 0.5,
  "PayPal Expands Peer-to-Peer Payments With Bitcoin, Ethereum Integration – Exec Says It's the 'Next Major Step' in Global Money Movement": 0.8,
  "Gilead Sciences, Inc. (GILD) Expands U.S. Manufacturing Capacity With $32B Investment Through 2030": 0.5,
  "Analysts Push Cisco's Target Price Higher - Shorting CSCO Puts Works Here": 0.6,
  "Is Kevin Plank Gearing Up To Take Under Armour (UAA) Private - UAA stock is down 40% ytd. It’s down 90% the past 10 years. UAA market cap is down to just over $2 billion! Kevin Plank, founder & CEO, is focused on rebuilding the brand. This takes a longer term vision that can be at odds with Wall Street’s focus on quarterly results. It’s definitely easier to do as a private company. Plank currently": 0.2,
  "Nuclear energy could be a $10T market as OKLO (+500% YTD) and SMR (+150% YTD) soar on rising AI data center power demand - No paywall: [https://finance.yahoo.com/news/nuclear-power-could-be-a-10-trillion-industry-that-holds-the-answer-to-the-worlds-power-shortages-090015624.html](https://finance.yahoo.com/news/nuclear-power-could-be-a-10-trillion-industry-that-holds-the-answer-to-the-worlds-power-shortages-090015624.html) >To meet the growing demand for global electrification stoked by energy-intensive projects like the data centers underpinning the AI arms race, global nuclear capacity will have to triple by 2050, the firm estimated. Investment is expected to reach more than $3 trillion in the next 25 years. >NuScale": 0.6,
  "$MTDR Boring Insider Trading by C-suite outperforms stock by 9x - This is really interesting to me - for the stock $MTDR, insider traders have been buying for years, and it just seems that they average down on every dip. . I call it \"boring\" because they just simply keep averaging in on the lows, it's not a flashy trade. To evaluate their effectiveness, I ran a backtest where I took a 1000 dollar investment,": 0.6,
  "Bank of America shocks with AMD stock verdict post Nvidia-Intel deal": 0.2,
  "Powell, Parabolic Moves and Other Key Things to Watch this Week": 0.2,
  "4 Ways TSMC Makes Its Money": 0.0,
  "Big Tech's $4 Trillion Artificial Intelligence (AI) Spending Spree Could Make These 2 Chip Stocks Huge Winners": 0.8,
  "1 Reason to Buy PepsiCo (PEP) Stock That's Been a Good Reason for More Than 50 Years": 0.8,
  "Here Comes an Inflation Update. Plus Micron, Costco, AutoZone, Firefly, and More Stocks to Watch This Week.": 0.0,
  "Elon Musk Refutes Claims Of xAI's $10 Billion Funding Round, Says 'xAI Is Not Raising Any Capital Right Now'": 0.2,
  "If You'd Invested $10,000 in Advanced Micro Devices Stock 5 Years Ago, Here's How Much You'd Have Today": 0.5,
  "Salesforce CEO sends message on Palantir after $950M deal": 0.5,
  "Bad news for coffee drinkers: The record-high prices you’re paying will go even higher when tariffs take their toll": -0.8,
  "If You Buy Starbucks With $10,000 in 2025, Will You Become a Millionaire in 10 Years?": 0.2,
  "How often do you guys skim off the top - The last few weeks have posted strong returns, maybe too strong and nothing goes up forever. Obviously no one has a crystal ball, but I am feeling I should maybe cash in on some of my gains, but trying to time the market has screwed me in the past, what rules do you guys follow when you guys cash in?": -0.2,
  "HPE Now Powers New AI-Ready Supercomputer Set to Transform Environmental Forecasting in New Zealand": 0.8,
  "(Item 8.01) Other Events Attached as Exhibit 99.1 and incorporated by reference herein is a press release dated September 22, 2025, issued by Comcast Corporation.": 0.0,
  "MIPS Appoints Alan Li as Head of Business Development to Accelerate China Growth": 0.6,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On September 19, 2025, the Board of Directors (the “Board”) of T-Mobile US, Inc. (“T-Mobile,” the “Company,” or “us”) appointed Srinivasan Gopalan as President and Chief Executive Officer (“CEO”) of T-Mobile and as a member of the Board, effective November 1, 2025 (the “Effective Date”). Following the Effective Date, G. Michael Sievert, our current President and CEO,": 0.2,
  "(Item 8.01) Other Events. ATM Updates On September 22, 2025, Strategy Inc (“Strategy” or the “Company”) announced updates with respect to its at-the-market offering programs: ATM Program Summary During Period September 15, 2025 to September 21, 2025 As of September 21, 2025 Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) STRF ATM 173,834 STRF Shares $17.4 $19.4 $1,730.1 $2.1 billion of 10.00% series A perpetual strife": 0.1,
  "The reason I’m shorting Harley-Davidson (HOG) - I decided to buy the $23, 1/15/27 puts for Harley-Davidson. I’ve been doing some research and have come to the conclusion that this would make a good short: 1. As a whole, they have failed to market to a younger demographic for the past decade or longer. The only people who I ever see on Harley’s are all older and have had their bikes for 10+ years. As": -0.6,
  "Dow Jones Futures Fall With Apple, Nvidia At Key Levels; Take In These Red-Hot Stocks?": 0.2,
  "Micron (MU) To Report Earnings Tomorrow: Here Is What To Expect": 0.5,
  "Reflecting On Online Marketplace Stocks’ Q2 Earnings: MercadoLibre (NASDAQ:MELI)": 0.5,
  "A Look Back at Consumer Subscription Stocks’ Q2 Earnings: Netflix (NASDAQ:NFLX) Vs The Rest Of The Pack": 0.2,
  "5 Reasons the New Tech Bubble Is Only Getting Started": -0.8,
  "Dupixent® (dupilumab) to Treat Chronic Spontaneous Urticaria (CSU) Advances in EU with Positive CHMP Opinion": 0.6,
  "1 Unpopular Stock That Deserves Some Love and 2 That Underwhelm": 0.2,
  "1 Mooning  Stock Worth Your Attention and 2 Facing Headwinds": 0.2,
  "VOO or other index funds? - This thread says stocks but everybody talks about Voo. Nothing magical here, no offense but who cares, it’s just the index. If all you do is index investing then why are you here? I want to hear about the great stocks you’re discovering and making money on. Are AI stocks working for you? What’s your strategy? What keeps you up at night? What are the contrarian views out there?": 0.2,
  "2 Large-Cap Stocks to Target This Week and 1 We Brush Off": 0.2,
  "1 Surging  Stock to Own for Decades and 2 We Question": 0.5,
  "Fears for pharma slump as labs stand empty": -0.6,
  "🎧 Markets Weekly Roundup: Intel’s Win, Darden’s Struggles, FedEx on Tariffs": 0.2,
  "Powell Speech, Inflation Data, Costco Earnings: What to Watch This Week": 0.5,
  "Prediction: Alphabet Just Became the 4th Member of the $3 Trillion Club -- but the First $5 Trillion Stock Will Be an Outlier (No, Not Palantir or Oracle!)": 0.5,
  "Cerence Integrates Audio AI Suite into DSP Concepts’ Audio Weaver to Transform In-Car Sound": 0.5,
  "Which Dividend Stock or ETF - Hi folks , i have separated my portfolio into two sides, one for safer growth and other for aggressive speculative growth. I am already trading with my high risk portfolio and I was looking for some safe investing opportunities for other half. I would like to get your advice on high dividend vs low dividend but promising stock price growth. Also feel free to add your own portfolio under": 0.2,
  "Jim Cramer on Starbucks: “I Think You Buy More”": 0.6,
  "Cramer Says He likes Kroger Right Here": 0.6,
  "Jim Cramer Explains Why Palantir Fits the Speculative Category": 0.1,
  "Palantir and Meta Platforms Just Signaled a $17 Billion Warning for Wall Street -- Is It Time to Worry?": -0.6,
  "Rolls-Royce (RYCEY) is on a Roll ! - So much positive news in the past few weeks alone… - Rolls Royce CEO was with US President Donald Trump and UK Prime Minister Keir Starmer at the Windsor Castle Banquet last week. https://www.reddit.com/r/RYCEY/comments/1nk92wl/was_tufan_erginbilgic_at_the_uk_state_dinner/ - Nuclear energy stocks are roaring upwards, sending nuclear energy speculative stocks soaring despite being loss-making, and despite no revenues in some cases (OKLO!), so it’s only a matter of time before attention": 0.8,
  "Meet the Monster Stock that Continues to Crush the Market": 0.8,
  "Full-Color AR Glasses Reach an Inflection Point! JBD Teams Up with Applied Materials and RayNeo to Break Through AR Display Quality Bottlenecks": 0.6,
  "The Nvidia tax has Silicon Valley hunting for more AI chips": 0.1,
  "How SS Innovations is expanding robotic surgery’s reach": 0.5,
  "5 Growth Stocks to Invest $1,000 in Right Now": 0.5,
  "Stock Market News for Sep 22, 2025": 0.0,
  "Trending tickers: Snap, Pfizer, Tata Consultancy Services, Samsung Electronics and Oklo": 0.0,
  "Could This Be the Next Stock the U.S. Government Takes a Stake In?": 0.2,
  "Marriott bets on independent hotels with collection brand expansion": 0.5,
  "Meet The Company Challenging Nvidia's AI Dominance. (Hint: It's Not AMD)": 0.5,
  "Starbucks strengthens presence in Peru with two new outlets": 0.6,
  "India’s Pine Labs eyes up to $700m in IPO – report": 0.5,
  "1 Reason I Can't Stop Thinking About Chevron Stock in 2025": 0.5,
  "Shopify wants court to toss Sezzle lawsuit": -0.5,
  "Robinhood, AppLovin, EMCOR joining S&P 500. What does EMCOR do?": 0.2,
  "ASML rises after Morgan Stanley upgrade on positive growth inflection": 0.8,
  "Supermicro Unveils New AI Servers In Madrid As Nvidia Partnership Deepens": 0.6,
  "IBM (IBM): Evaluating Valuation as Quantum Progress and AI Initiatives Spark Renewed Investor Interest": 0.6,
  "Did Gilead's (GILD) $32 Billion AI Bet Just Transform Its Innovation and Global Health Narrative?": 0.6,
  "Palantir Technologies (PLTR) Is Up 6.5% After Securing £750M UK Defence AI Contract": 0.8,
  "Intel vs. Nvidia: Which Stock Wins More From This $5 Billion Investment?": 0.2,
  "Assessing Mondelez (MDLZ) Valuation After Recent Momentum Shift in 2024": 0.2,
  "Trump, TikTok, Immigration Visas Are a Distraction for Markets. What Really Matters for Stocks.": 0.1,
  "AB InBev and Netflix Announce Global Brand Partnership": 0.5,
  "Srini Gopalan to Succeed Mike Sievert as T-Mobile CEO on November 1, 2025": 0.5,
  "T-Mobile Names Telecom Veteran as Next CEO": 0.5,
  "Ensoma Announces $53 Million Financing to Support Key Clinical Milestones for EN-374 and Continued Development of In Vivo Hematopoietic Stem Cell Engineering Pipeline": 0.5,
  "Great week for Adobe Inc. (NASDAQ:ADBE) institutional investors after losing 31% over the previous year": 0.2,
  "Texas Instruments (NASDAQ:TXN) Could Be Struggling To Allocate Capital": -0.5,
  "Costco, Micron: A lot riding on earnings this week": 0.2,
  "T-Mobile names veteran Srini Gopalan as CEO to steer strategy amid fierce competition": 0.5,
  "US Equity Investors to Focus on Fed's Preferred Inflation Gauge, Fed Speeches This Week": 0.5,
  "Stocks Decline Pre-Bell as Investors Prepare for Key Inflation Report": -0.5,
  "Crypto Stocks Tumble in Pre-Market Trading as Bitcoin Dives to $112K": -0.8,
  "This Week In AI Chips - Vikk AI Joins Elite AWS Startup Program With Meta's Llama": 0.5,
  "Discover 3 Stocks That Might Be Trading Below Their Estimated Fair Value": 0.5,
  "Why Japanese Real Estate Small Caps Might Be the Best Value in Global Markets Right Now - The Japanese stock market has finally climbed back to the highs it set during one of the largest financial bubbles in history (the 1980s). After three decades of deflation, several big shifts have changed the investment landscape in Japan: • Urban land prices have finally recovered and are now growing again. • Inflation has returned (modest, but enough": 0.8,
  "Morgan Stanley revisits semicap calls: AMAT, LAM lifted; KLAC downgraded": 0.2,
  "Microchip Technology Incorporated (MCHP) Benefited from the Improved Semiconductor Cycle": 0.8,
  "CrowdStrike Powers Cyber Services, Accelerates SOC Transformation with KPMG": 0.5,
  "As the VMware vSphere 7 Support Deadline Nears, Spinnaker Announces Alternative Option to Keep VMware Customers Supported Indefinitely": 0.5,
  "SOPHiA GENETICS Expands Collaboration with AstraZeneca to Enhance Detection of Breast and Prostate Cancer": 0.8,
  "Synergy CHC (NASDAQ: SNYR) Taps Former Coca-Cola Executive to Lead Strategic Partnerships; Appoints Veteran Costco Buyer to Board of Directors": 0.5,
  "Comcast Announces Debt Exchange Offers and Tender Offers": 0.0,
  "Buy and Hold: 2 Artificial Intelligence (AI) Stocks Built for the Long Haul": 0.5,
  "Micron Q4 Earnings Preview: What to Expect From Upcoming Report": 0.5,
  "Strategy Added 850 Bitcoin for Nearly $100M Last Week": 0.5,
  "Lululemon’s ‘downward spiral’ — and how the brand plans to break out of it": 0.2,
  "Ralph Lauren and GIII Apparel have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Costco, Accenture are part of Zacks Earnings Preview": 0.0,
  "IREN Shares Jump 11% in Pre-Market Trading as Bitcoin Miner Doubles AI Cloud Fleet": 0.8,
  "Latest News In Digital Payment - Driving Growth With Real-Time And Recurring Payment Innovations": 0.6,
  "TikTok’s Algorithm to Be Secured by Oracle in Trump-Backed Deal - No paywall: [https://finance.yahoo.com/news/tiktok-algorithm-secured-oracle-trump-100000512.html](https://finance.yahoo.com/news/tiktok-algorithm-secured-oracle-trump-100000512.html) >Oracle Corp. (ORCL) would recreate and provide security for a new US version of TikTok’s algorithm under a deal taking shape to sell the popular Chinese-owned app to a consortium of American investors, a White House official said, addressing a key concern raised by lawmakers in Washington. >Data from US users would be stored in a secure cloud managed by Oracle": 0.2,
  "The Best Stocks to Invest $1,000 in Right Now": 0.5,
  "Billionaire Michael Saylor Purchases 850 BTC at $117K, Total Holdings at 639K BTC": 0.8,
  "Netflix signs co-marketing deal with AB InBev to promote TV shows and beer": 0.5,
  "Boomi Appoints Keyur Ajmera as Chief Information Officer": 0.5,
  "Cellares Appoints Former Kite Global Ops Leader, Christopher McDonald, to Board of Advisors": 0.5,
  "Monster Beverage (NASDAQ:MNST) shareholders have earned a 9.8% CAGR over the last five years": 0.8,
  "Here’s What Lifted Intuit (INTU) in Q2": 0.5,
  "$1.5 Billion Gone Overnight: Crypto Bulls Just Got Obliterated": -0.8,
  "Costco (COST) Q4 Earnings Preview: What You Should Know Beyond the Headline Estimates": 0.5,
  "Comcast Corporation (CMCSA) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Shopify Inc. (SHOP) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Is Trending Stock PayPal Holdings, Inc. (PYPL) a Buy Now?": 0.2,
  "Cadence Design Systems, Inc. (CDNS) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Broadcom Inc. (AVGO) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "QUALCOMM Incorporated (QCOM) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Investors Heavily Search PDD Holdings Inc. Sponsored ADR (PDD): Here is What You Need to Know": 0.5,
  "The Zacks Analyst Blog Highlights Micron Technology, NVIDIA, TSMC and Western Digital": 0.5,
  "Circuit & Chisel Secures $19.2 Million and Launches ATXP, a Web-Wide Protocol for Agentic Payments": 0.6,
  "Why Lam Research (LRCX) is a Top Stock for the Long-Term": 0.8,
  "Is Lam Research (LRCX) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Former Security Lead for Tesla’s Gigafactory Network Joins The Nuclear Company": 0.1,
  "Humana initiated, Paycom upgraded: Wall Street's top analyst calls": 0.5,
  "Intel Needs Chip Factory Win to Sustain $50 Billion Stock Rally": 0.5,
  "This Top Computer and Technology Stock is a #1 (Strong Buy): Why It Should Be on Your Radar": 1.0,
  "Cintas Set to Report Q1 Earnings: Here's What to Expect": 0.0,
  "The Zacks Analyst Blog Highlights Costco Wholesale, Morgan Stanley and Caterpillar": 0.5,
  "r/Stocks Daily Discussion Monday - Sep 22, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.2,
  "T-Mobile Stock Drops as New CEO Announced. What It Means for Investors.": -0.5,
  "Strategy logs its 80th Bitcoin purchase, adds 850 BTC after tapping STRF and MSTR ATM": 0.5,
  "TSLA bulls are celebrating rn. - ATHs of 488 to be hit this week. Absolute no reason for this pump but it is how it is. The more people hate him, the higher it will just go. Likely to see another repeat of last year where the stock shot up in the last quarter of the year. Stock is just insane. Classic example of irrational behaviour.": 0.2,
  "Strive Buys Bitcoin Hoarder Semler as Treasury Wave Shows Cracks": 0.1,
  "Strength in Network Software Drives Roper: Can the Momentum Sustain?": 0.5,
  "First Solana Treasury is Live in South Korea: Will SOL USD Reclaim $250?": 0.5,
  "How Trump alarmed (and tried to calm) CEOs with his new $100,000 H-1B visa fee": -0.6,
  "Ramaswamy-backed Strive to buy Semler in $1.3 billion deal all stock deal, boosting Bitcoin holdings": 0.5,
  "Amgen (AMGN) Moves 3.5% Higher: Will This Strength Last?": 0.5,
  "Plant-Based Dairy Products Market to Reach USD 34 Billion by 2030 | Insights on Milk, Cheese, Yogurt, and Emerging Alternatives: MarkNtel Advisors": 0.5,
  "Brinker, Apple, Keurig Dr Pepper: Top Analyst Calls": 0.0,
  "Costco vs. TJX Companies: Which Discount Retail Stock Is a Buy?": 0.5,
  "Strategy Shares Fall After Bitcoin Giant Reveals $100 Million BTC Buy": 0.5,
  "New rout in bitcoin ripples through crypto world": -0.6,
  "Netflix Strikes Global Deal With AB InBev to Pair Hit Shows With Beer Brands": 0.5,
  "Elizabeth Stone on what’s next for Netflix — and streaming itself — at TechCrunch Disrupt 2025": 0.5,
  "A Headquarters Ahead of the Curve": 0.5,
  "7 AI Startups Backed by Jeff Bezos — Should You Invest?": 0.5,
  "Golden Triangle Ventures, Inc. Signs LOI to Acquire Leading Texas Electrical Contractor in Expansion of GoldenEra Development": 0.6,
  "Intel Skyrockets on Nvidia Deal--But a $13 Billion Problem Still Lurks Beneath": 0.5,
  "Tesla stock up on Elon Musk and President Trump handshake": 0.5,
  "Strong Momentum in DRAM and NAND to Propel MU's Q4 Earnings": 0.8,
  "Can Google Avoid a Breakup Twice? - In a landmark decision this month, a federal judge spared Google from a breakup proposed by the government to rein in the company’s monopoly in search. Now, the company wants a second win. Starting on Monday, Judge Leonie M. Brinkema will hear arguments in the U.S. District Court for the Eastern District of Virginia on how to fix Google’s monopoly over some online advertising technology. The judge ruled": 0.2,
  "Advanced Connectivity Landscape Research Report 2025: 5G-Advanced Sets the Stage for the 6G Revolution": 0.8,
  "South Korea's President Lee says US investment demands would spark financial crisis - https://www.reuters.com/world/china/south-koreas-president-lee-says-us-investment-demands-would-spark-financial-2025-09-21/ >SEOUL, Sept 22 (Reuters) - South Korea's economy could fall into crisis rivalling its 1997 meltdown if the government accepts current U.S. demands in stalled trade talks without safeguards, President Lee Jae Myung told Reuters. > >Seoul and Washington verbally agreed to a trade deal in July in which the U.S. would lower President Donald Trump's tariffs on South Korean goods": -0.6,
  "Tom Lee’s BitMine Sells Stock at $70 to Raise Additional $365M for ETH Treasury": 0.5,
  "Top Midday Stories: Pfizer to Acquire Metsera for $4.9 Billion; Oracle to Secure TikTok Algorithm in Proposed Deal": 0.5,
  "Markets And Gold Are Both Hitting ATHs. Last Time That Happened Was... - COVID, which as a rare global event driven by a pandemic. Then, before that, in 2007. Right before it hit the fan in 2008 with the financial crisis. Historically, gold and the markets have been divergent. When people are optimistic, they pile into the markets. When they get worried, they move into gold. It's pretty rare to see them both hitting ATHs": 0.2,
  "AMAT Trades 54% Above Its 52-Week Low: Time to Hold or Fold the Stock?": 0.2,
  "$LULU and $UNH seem to be my biggest value plays - I bought shares in both of these a few months ago after Buffet and Burry filed their 13-Fs. Looking at both, I'm up 25% on United Health and down 16% on Lululemon and i bought calls on both again this morning. They're great value plays, will only improve in the future. Rate cuts inevitably help UNH along with the new 4 stra rating, and": 0.8,
  "Smart Money Can’t Get Enough of Intel Stock. Should You Buy a Piece of the INTC Pie Too?": 0.8,
  "Metaplanet Stuns With Record Purchase Of 5,419 Bitcoin For $632 Million: Strategy Joins With 850 BTC": 0.8,
  "Disney vs. Netflix: Which Streaming Giant Has an Edge Right Now?": 0.5,
  "Cintas Named One of the World’s Most Trustworthy Companies by Newsweek": 0.8,
  "Should You Buy the 3 Highest-Paying Dividend Stocks in the Nasdaq?": 0.2,
  "Apple, Teradayne, Netflix & AB InBev deal: Trending Tickers": 0.2,
  "Vantiva’s Cobra 5G Router Earns T-Mobile Certification, Expanding 5G Access for MVNO Ecosystems": 0.6,
  "Baker Hughes Extends Stimulation Vessels Deal with Petrobras": 0.5,
  "SNY & REGN's Dupixent Receives CHMP Backing for Urticaria in EU": 0.5,
  "Apple stock turns positive for 2025, gold's new record high": 0.5,
  "ODFL Stock Down 26.2% Y/Y: Will the Plunge Continue Throughout 2025?": -0.6,
  "Will Paychex (PAYX) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Cocoa Prices Sink as Ivory Coast Cocoa Crop Prospects Improve": -0.8,
  "Magnum ice cream company to use NotCo AI for new products": 0.5,
  "Nvidia will Invest up to $100 Billion in OpenAI - https://www.cnbc.com/2025/09/22/nvidia-openai-data-center.html >\"Nvidia will invest $100 billion in OpenAI as the artificial intelligence lab sets out to build hundreds of billions of dollars in data centers based around Nvidia’s AI chips, the companies said on Monday. >OpenAI plans to operate Nvidia systems that require 10 gigawatts of power, the companies said on Monday. A gigawatt is a measure of power that is increasingly being used to": 0.6,
  "T-Mobile Is Moving Gopalan to CEO, Replacing Sievert": 0.1,
  "Palantir Has ‘Main Character Energy,’ Analysts Say. That Doesn’t Mean Stock Is a Buy.": 0.2,
  "Coca-Cola Builds on Away-From-Home Recovery: How Durable Is It?": 0.2,
  "lululemon Trades Near 52-Week Low: Buy Opportunity or Time to Sell?": 0.2,
  "Tom Lee's BitMine Buys $1.1 Billion in Ethereum and Sells Stock, Shares Fall 10%": -0.6,
  "Is PepsiCo's Gatorade Strategy Enough to Fend Off Its Rivals?": 0.2,
  "A comprehensive list of 2025 tech layoffs": -0.5,
  "Palantir Stock Has Done This For Five Straight Months. Trump's UK Visit Could Extend That.": 0.2,
  "T-Mobile's new CEO Srini Gopalan faces pressure to fend off rivals": -0.5,
  "The Only Mag 7 to not hit all time highs this year: Apple and Tesla - Looks like Tesla is about 40 points off its all time high and Apple about $4-5 as of this post. Heard Joe Teranova say that money managers will be chasing these two names until years end to get performance as they other 5 have already outperformed. What do you think? Buy Apple and Tesla into years end and play": 0.5,
  "Coca-Cola vs. Keurig Dr Pepper: Which Beverage Stock Has the Edge?": 0.2,
  "ASML Invests 1.3B Euro in Mistral AI: Will it Deliver Growth?": 0.5,
  "Better Home & Finance stock soars after investor behind Opendoor rally calls it the 'Shopify of mortgages'": 0.8,
  "Meta Rolls Out Facebook Dating Assistant to Help You Find Romance": 0.6,
  "MercadoLibre launches new B2B unit to tap corporate market": 0.5,
  "3 oncology stocks I’m watching right now! - Barclays recently highlighted several opportunities in the Oncology and I&I sector, which made me take a closer look at healthcare stocks. After digging, I narrowed it down to 3 that caught my attention: 1. Eli Lilly (LLY) – With its advanced immuno-oncology pipeline and existing blockbusters, it feels almost unavoidable. What stands out is their ability to diversify revenue while staying a leader in such a competitive": 0.8,
  "Nvidia Stock Climbs as Chipmaker Unveils Plans to Invest Up to $100B in OpenAI": 0.8,
  "Adobe vs. Figma: Which Creative Software Stock Holds an Edge?": 0.2,
  "2 Top Artificial Intelligence (AI) Stocks Ready for a Bull Run": 0.8,
  "Why Is Plug Power (PLUG) Stock Soaring Today": 0.5,
  "Why Applied Materials (AMAT) Stock Is Up Today": 0.5,
  "Why Is Applied Digital (APLD) Stock Rocketing Higher Today": 0.6,
  "Why Is Teradyne (TER) Stock Soaring Today": 0.5,
  "Compass (COMP) Stock Trades Down, Here Is Why": -0.5,
  "Where does the massive Nvidia-OpenAI deal leave Microsoft? - With the news that Nvidia is investing up to $100 billion into OpenAI, primarily for infrastructure, I'm trying to understand the strategic implications for Microsoft. For years, Microsoft has been seen as OpenAI's exclusive partner, providing the Azure cloud infrastructure and integrating OpenAI's models deeply into its ecosystem. They had a deal for a huge chunk of OpenAI's profits and seemed to be in the driver's": 0.2,
  "Nvidia & OpenAI announce partnership, Oracle appoints 2 co-CEOs": 0.2,
  "Nvidia stock jumps on $100 billion OpenAI investment as Huang touts 'biggest AI infrastructure project in history'": 0.8,
  "Top Stock Movers Now: Nvidia, Apple, Kenvue, and More": 0.5,
  "Better Home & Finance stock soars after Eric Jackson’s bullish call": 0.8,
  "Chip Equipment Sales Are Booming. These Two Stocks Just Got an Upgrade.": 0.8,
  "Amazon's Whole Foods Brings Store Brands to Asia, Starting in Singapore": 0.5,
  "TikTok Deal Details Begin to Emerge. Oracle Stock Surges.": 0.5,
  "TSLA: Tesla Stock Soars As Piper Sandler Hikes Target To $500 On AI Dominance": 0.8,
  "The billion-dollar infrastructure deals powering the AI boom": 0.5,
  "Netflix signs co-marketing deal with AB InBev": 0.2,
  "IREN Expands AI Cloud Capacity: Is the Growth Thesis Strengthening?": 0.5,
  "Why Snap Stock Popped Today": 0.5,
  "Sector Update: Consumer Stocks Decline in Afternoon Trading": -0.5,
  "Tesla Stock Jumps On Musk's Political Reunion And Robotaxi Breakthrough": 0.8,
  "Profit questions - This might be a dumb question but bear with me please. When should you take out profits? Is there a % like once you have 10% gains sell and then buy back when it dips again? Or if it’s something you plan on holding do you just ignore profits? I have different stocks where I only have 4 or 5 shares so my profit is $10-50. Seems kinda silly to cash out": -0.2,
  "In a low rates environment, nearly all equities are winners. Why stocks only go up. (For now). - It feels like, no matter the bad news, equities just keep climbing. Here’s the(my) reasoning as to why this is happening and why it'll likely continue. First, let’s state the obvious: we’re not in a low-rate environment right now. However there are some things happening that are leading to one. Regardless of your views of the current": 0.6,
  "What's to stop AI companies from just continuing to invest in each other? Do we think profit will eventually matter? - A lot of people were dubious about how OpenAI would be able to afford the (up to) $300 billion contract they signed with Oracle.. well now we know part of the answer is Nvidia investing (up to) $100 billion into OpenAI And both companies (OpenAI and Oracle) will spend the majority of their compute": 0.2,
  "Bitcoin, Ethereum, and XRP Tumble. Why Cryptos Are Slumping Today.": -0.8,
  "Why Plug Power Stock Shot Higher Today": 0.5,
  "Is Workday Stock Underperforming the S&P 500?": -0.5,
  "Have extra cash, NBIS or HOOD? - Hey fam, have some extra cash gonna trim from high yield savings. I’ve been long on Robinhood and Nbis, but both have been running lately. I am still bullish on both, but wondering where I can put this cash to use. Hold length is anywhere from 1-3 years.": 0.5,
  "Can Strategy's Expanding Bitcoin Balance Push the Stock Higher?": 0.5,
  "What to Know in Tech: iPhone Sales Deliver, AI Dominates": 0.5,
  "Nvidia and Palantir Approach Record Highs: Too Late to Buy?": 0.2,
  "Cocoa Prices Fall Sharply on Beneficial Rains in the Ivory Coast": -0.8,
  "Intel Shares Surge on Nvidia Investment. Is It Too Late to Buy the Stock?": 0.5,
  "Budweiser Maker Is Teaming Up With Netflix. It Needs a Wider Audience to Boost Slumping Sales.": 0.2,
  "Nvidia pours $100 billion into OpenAI just days after pledging $5 billion to Intel": 0.5,
  "What are you looking for when options trading? - Ive been dicking around on the stock market for several years now and am starting to give options trading a try. I think i understand the fundamentals of it now im just curious to see what people look for in companies when deciding whether to buy calls or puts? All ears over here.": 0.2,
  "Alphabet Stock Is on Fire. Microsoft’s Is Ice Cold. That Could Change—Very Soon.": 0.6,
  "Stock suggestion for a 12 year girl as birthday present - Perhaps a bit weird question but I’m thinking of giving away a stock, or stocks, depending on price, as a birthday present for a 12 year old girl as a sort of “investment” starter kit. I think in time she will appreciate it and actually see the benefits of it as she is pretty “economical” in her thinking already and she is asking me": 0.2,
  "Apple Stock Is Surging. The Phone 17 Has Sparked a Rebound.": 0.8,
  "Micron to Report Q4 Earnings: Buy, Hold, or Take Profits Now?": 0.2,
  "Inside the mind of Elad Gil: Early-stage investing and next-gen innovation at TechCrunch Disrupt 2025": 0.5,
  "T-Mobile US (NASDAQ:TMUS) Is Paying Out A Larger Dividend Than Last Year": 0.5,
  "Netflix Stock Is Up 40% in 2025 But Wall Street Isn’t Backing Down. Should You Buy NFLX Now?": 0.2,
  "Why do you buy the top or sell the bottom? - Why do you buy the top or sell the bottom? Genuine question to those who do that. Why are you doing this? Why is anyone doing this? For example, I see SPY now at $667. It already went up 0.5% this day. It is at pure ATH and it's still going up. Why on earth are you buying it here? Why on earth is": -0.8,
  "Nvidia Plans to Invest Up to $100 Billion in OpenAI to Support New Partnership": 0.8,
  "In Google Antitrust Case, More Questions Are Raised Than Solved": -0.5,
  "Wall Street Thinks You Should Buy This Tech Stock Before September 23": 0.5,
  "'Weddings Are Once In A Lifetime' — Mom Sides With 26-Year-Old Bride Who Wants $15K From Sister's Inheritance For Big Day": -0.8,
  "Tesla's Robotaxi Rollout in San Francisco Sparks Regulator Pushback": -0.5,
  "Explainer-H-1B visa - what is it and who are its beneficiaries?": 0.0,
  "Nvidia-OpenAI Deal Hits Broadcom Stock": -0.5,
  "Buying TEVA on Autism Announcement? - Looks like this major announcement is already moving some stocks. Kenvue (Tylenol) stock is taking a beating. I'm reading that the Administration will be stating Leucovorin as a benefit/way to reduce risk. Thoughts on how companies like Teva Pharmaceutical will benefit from this news, since they are a major player on this treatment? By no means am I advocating one way or another as I'm no scientist/doctor, nor asking": 0.2,
  "US Equity Indexes Rise Lifted by Tech Stocks, Gold Hits New High": 0.6,
  "Indian firms could take advantage of Trump’s H-1B fee, says analyst": 0.5,
  "Sector Update: Consumer Stocks Decline Late Afternoon": -0.5,
  "Sector Update: Health Care Stocks Advance Late Afternoon": 0.5,
  "NVDA: Nvidia Stock Soars on $100 Billion OpenAI Deal": 0.8,
  "Tres Health Launches Streamlined Digital Implementation Platform": 0.5,
  "Stock market today: Dow, S&P 500, Nasdaq hit 3rd record in a row as Nvidia soars on OpenAI deal": 0.8,
  "This Nuclear Stock Isn't Expected To Report Revenue Until 2027 But Has Surged 560% This Year": 0.5,
  "Amazon’s famed ‘Customer Obsession’ credo is on trial this month": 0.1,
  "These Stocks Moved the Most Today: Oracle, Nvidia, Metsera, Pfizer, Kenvue, Tesla, Anywhere Real Estate, and More": 0.0,
  "Remember Luckin Coffee Stock? China’s Viral Coffee Company Is Now in the U.S., and LKNCY Shares Are Up 46% This Year.": 0.6,
  "Tesla Stock Has Soared 30% This Month. Here's Why This Analyst Sees Shares Hitting Record Highs": 0.8,
  "Nvidia Stock Jumps On $100 Billion OpenAI Strategic Partnership": 0.8,
  "U.S. Stocks Rise to Records as Nvidia, OpenAI Link Up": 0.8,
  "Stock Market Today: Dow Up As Nvidia Pops; EV Play Skids On Warren Buffett Move (Live Coverage)": 0.5,
  "AppLovin's Ad Product Growing Fast, Taking Market Share": 0.8,
  "Berkshire’s Equity Portfolio Is Up Sharply this Quarter. Its Own Stock is Lagging.": 0.2,
  "US Equity Markets Extend Rallies to Records on Tech Sector Strength": 0.8,
  "Apple Positive for 2025 as Rebounding Stock Nears Record": 0.8,
  "Semrush Unveils AI Visibility Index, Rewrites the Rules of Enterprise Brand Discovery in the AI Era": 0.5,
  "A Deal Between AI Powers Lifts Stock Market to a Record": 0.8,
  "Facebook is getting an AI dating assistant": 0.5,
  "US Equity Indexes Higher as Tech Stocks Rally, Gold Sets New Record": 0.8,
  "Iren Bucks Bitcoin Sell-Off On AI Expansion. Gold, Silver Rally.": 0.5,
  "Charter to Hold Webcast to Discuss Third Quarter 2025 Financial and Operating Results": 0.0,
  "Nvidia Plans to Invest Up to $100 Billion in OpenAI. It May Be Why Broadcom Stock Is Falling.": 0.2,
  "Michael Saylor Says This Is The Reason Why Bitcoin Is Stuck Sideways And Not Breaking Out": 0.1,
  "Tesla Stock Rises on Another Price Target Hike. Record Highs Are in Sight.": 0.8,
  "Tesla stock closes at new 2025 high: Top takeaways": 0.8,
  "Heard on the Street Recap: Even Tylenol Can’t Cool This AI Fever": 0.2,
  "Why Lam Research (LRCX) Stock Is Trading Up Today": 0.5,
  "Apple (AAPL) Stock Is Up, What You Need To Know": 0.5,
  "Why The Trade Desk (TTD) Stock Is Up Today": 0.5,
  "Why Keurig Dr Pepper (KDP) Stock Is Down Today": -0.5,
  "Why MicroStrategy (MSTR) Stock Is Down Today": -0.5,
  "This Analyst Said AMD Will Give Nvidia ‘Run For Its Money’ – Was He Right?": 0.5,
  "Mizuho Raises CrowdStrike (CRWD) Price Target to $475, Maintains Neutral": 0.5,
  "Long Term AI Strategy - AI has been developing rapidly for the last few years and it's becoming clear that it is not going away anymore. Let's zoom out a bit. What is a good strategy to capitalize on a still very young industry with new players joining every day? I'm currently seeing three main segments that drive revenue with a TAM that's rapidly expanding across all three segments: **Infrastructure** Companies like Nvidia, AMD, Microsoft": 0.6,
  "This Humanoid Robot Is Cheaper Than Rivals—And Full of Security Flaws, Researchers Say": -0.6,
  "Equity Benchmarks Reach Fresh Peaks as Nvidia Shares Jump": 0.8,
  "Twilio Stock (TWLO) Faces Pressure Even as Growth Story Builds": -0.5,
  "Heineken to buy FIFCO businesses for $3.2 billion in Central America push": 0.5,
  "Piper Sandler Turns Less Bearish on Workday (WDAY) Following Workday Rising": 0.5,
  "Do you think the stock market is in a euphoric stage right now? I'm slightly scared now.. - I’ve been following some recent data and commentary, and it looks like a lot of indicators are flashing “froth” or even outright euphoria. Like the openAI, oracle, nvidia deals. And the everything AI boom with no earnings to back it yet stocks keep going to the moon. It's crazy. Retail traders are very active, margin debt is": -0.6,
  "Susquehanna Raises Micron (MU) PT to $200, Sees Strong Earnings Ahead": 0.8,
  "Meta Expands Teen Protections, Tests Updated Age Detection Process": 0.5,
  "Pro-Palestinian protesters’ retaliation lawsuit against Google may proceed": 0.1,
  "Starbucks workers take legal action after company refuses to reimburse them for items purchased after dress code changes": -0.8,
  "Morgan Stanley Sees Positive Signs in Apple’s (AAPL) iPhone 17 Launch, Maintains Buy": 0.8,
  "American Express Platinum Refresh Seen Offering Growth Potential Despite Customer Fatigue: Analyst": 0.5,
  "Alphabet Stock (GOOGL) Gains as DOJ Ruling Removes Overhang, Analyst Says": 0.6,
  "Google’s Ad Monopoly Under Microscope as Judge Weighs Remedies": 0.1,
  "Strength in Nvidia, Apple helps lift US equities to new records": 0.8,
  "Amazon (AMZN) Outlook Brightens With Strong Demand, No Tariff Impact Yet": 0.8,
  "Microsoft (MSFT) Partners With Curated for You to Bring Fashion Discovery to Copilot": 0.5,
  "Meta (META) Backed by $900 Target as Analyst Highlights Creative Edge": 0.6,
  "How to trade the AI boom beyond chips": 0.2,
  "QUALCOMM Incorporated (QCOM) Collaborates with HARMAN to Reshape the Automotive Cockpit": 0.5,
  "UBS Reiterates Neutral on Apple (AAPL), Sees Mixed iPhone 17 Preorder Demand": 0.1,
  "Wolfe Raises Micron (MU) Price Target to $180, Citing AI Memory Tailwinds": 0.8,
  "BofA Reaffirms Buy on Workday (WDAY), Maintains $265 Price Target After Analyst Day": 0.6,
  "Amazon (AMZN) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Advanced Micro Devices (AMD) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Tesla (TSLA) Laps the Stock Market: Here's Why": 0.5,
  "Intel (INTC) Stock Sinks As Market Gains: Here's Why": -0.5,
  "ASML (ASML) Rises Higher Than Market: Key Facts": 0.5,
  "Meta Platforms (META) Stock Declines While Market Improves: Some Information for Investors": -0.2,
  "Can anyone explain why comfort systems USA (FIX) is doing so well? - I got into investing around the GME fiasco and nowadays I invest into index funds (got burned from most things) but I’m up ~900% on FIX. Honestly, it was luck. I had a very basic caveman level idea of ok, global warming, air conditioning, durrrr. I bought FIX because I knew the name. But anyway, these returns are crazy and outlooks are": 0.6,
  "Oracle’s new Gen X and Millennial CEOs get stock options worth $350 million—but they’ll have to keep the stock soaring to collect": 0.2,
  "CrowdStrike (CRWD) Gains Momentum as Jefferies Raises Target After Fal.Con": 0.6,
  "Airbnb, Inc. (ABNB) Stock Falls Amid Market Uptick: What Investors Need to Know": 0.1,
  "Warner Bros. Discovery (WBD) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "Intuitive Surgical, Inc. (ISRG) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Strategy (MSTR) Stock Declines While Market Improves: Some Information for Investors": -0.5,
  "5 Passive Income Streams for Retirees To Build Wealth": 0.5,
  "Amazon.com, Inc. (AMZN) Experiences a Legal Setback": -0.5,
  "Tigress Financial Partners Raises Its Price Target on Apple Inc. (AAPL) to $305": 0.6,
  "Alphabet Inc. (GOOGL) and PayPal announced a Multiyear Strategic Partnership to Advance Commerce Solutions Across Google’s Platforms and Devices": 0.8,
  "Oklo Breaks Ground on First Aurora Powerhouse - https://www.foxbusiness.com/video/6379935505112 *Oklo Inc today holds a groundbreaking ceremony at Idaho National Laboratory (INL) for its first Aurora powerhouse, the Aurora-INL. The event will feature opening remarks from Oklo co-founder and CEO Jacob DeWitte and INL Director John Wagner, keynote remarks from U.S. Environmental Protections Agency Administrator Lee Zeldin, and brief remarks from officials including Idaho Governor Bradley Little, Utah Governor Spencer Cox, U.S. Senators Mike Crapo and": 0.6,
  "Review & Preview: An Everything Rally Rolls On": 0.5,
  "Bank of America Reiterates Its ‘Buy’ rating on Meta Platforms, Inc. (META)": 0.6,
  "Microsoft Corporation (MSFT) Announces Its Plans to Invest $30 billion Over Four Years to Expand Its Artificial Intelligence Infrastructure and Operations Across the U.K.": 0.8,
  "QUALCOMM Incorporated (QCOM)’s SVP & CAO Patricia Y. Grech Sells Roughly $44,067 Worth of Shares Under a Pre-Arranged Rule 10b5-1 Plan": -0.5,
  "Axon Enterprise, Inc. (AXON)’s CEO Patrick W. Smith Sells Roughly $7.4 Million Worth of Shares Under a Pre-Arranged Rule 10b5-1 Trading Plan": -0.5,
  "KLA (KLAC) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "T-Mobile Names Srini Gopalan Next CEO In Succession Plan": 0.5,
  "Amazon Pushes Whole Foods Brands Into Singapore": 0.2,
  "Trump's $100,000 H-1B Fee Jolts Tech Giants": -0.6,
  "O.N.E. Amazon Will Work With the Inter-American Development Bank (IDB) Group to Create Innovative Mechanisms for Sustainable Development in the Amazon Region": 0.6,
  "Huge AI Deals Keep Markets at Record Highs": 0.8,
  "TradFi Dump MSTR Stock on Saylor’s Head After 100M Bid": -0.6,
  "JMP Securities Reaffirms ‘Market Perform’ Rating on Snap Inc. (SNAP)": 0.2,
  "Amazon.com, Inc. (AMZN)’s Amazon Web Services (AWS), Sony Honda Mobility (SHM), and Qualcomm Announces Major Progress on SHM’s Next-Generation AFEELA Smart EV": 0.6,
  "Microsoft Corporation (MSFT) Showcases Its AI-Driven Strategy at the Goldman Sachs Communicopia + Technology Conference": 0.6,
  "Meta Platforms, Inc. (META) Announces Quarterly Dividend of $0.525 per Share": 0.5,
  "Super Micro Computer Inc. Began Shipping Systems Powered by NVIDIA Corporation (NVDA)": 0.5,
  "Alphabet Inc. (GOOGL) Hits Record $241.13, Lifts Its Market Cap to $2.92 Trillion": 0.8,
  "Mirror founder Brynn Putnam to unveil her gaming hardware startup at TechCrunch Disrupt 2025": 0.5,
  "The Boeing Company (BA) and Honeywell Sued by Air India Crash Victim Families": -0.8,
  "Axon Enterprise, Inc. (AXON) In Advanced Talks to Buy Emergency Response Startup, Prepared: Report": 0.5,
  "Nvidia Commits $100 Billion to OpenAI in Historic AI Infrastructure Deal—Stock Pops": 0.8,
  "Stock market today: Dow, S&P 500, Nasdaq futures hover around baseline after another record-setting day on Wall Street": 0.5,
  "Chinese Coffee Chain Wants To De-Throne Starbucks, But Experts Say Its Business Model Will Never Work": -0.6,
  "Shaquille O'Neal Accidentally Backed This Company With $250K — And It's Paying Off Big: ' I Wish I Would Have Bought More'": 0.8,
  "Gold hit a record and silver’s at a 14-year high, analyst says two other commodities will join the party - https://www.marketwatch.com/story/gold-hit-a-record-and-silvers-at-a-14-year-high-this-wall-street-bank-says-two-other-commodities-will-join-the-party-76453ced “We see the gold and silver bull market broadening and eventually shifting into copper and aluminum during 2026, driven by the prospect of new dovish Fed leadership (by May/June 2026) and related lower U.S. real interest rates and downward pressure on the dollar,” wrote a team led by Maximilian Layton, global head of commodities.": 0.8,
  "Why Earnings Season is Critical": 0.0,
  "Nvidia Says All Customers Will Be ‘Priority’ Despite OpenAI Deal": 0.5,
  "These AI Stocks are Spiking and OpenAI could be the first Trillion Dollar IPO": 0.6,
  "How major US stock indexes fared Monday, 9/22/2025": 0.0,
  "Dow Jones Futures: Nvidia, Tesla, Apple Are Big Winners; Fed Inflation Data Looms": 0.5,
  "An $800 Billion Revenue Shortfall Threatens AI Future, Bain Says": -0.6,
  "Is BigBear.ai Stock a Buy For $5?": 0.2,
  "3 Top Dividend Stocks I Wouldn't Hesitate to Buy With $1,000 Right Now": 0.5,
  "This Ridiculously Cheap Warren Buffett Stock Could Make You Richer": 0.8,
  "Was ORCL jump on Sept 9 just insider trading? - Oracle is up 87% in just a few months. Its biggest surge was on Sept 9 when it jumped from 240 to 345. Now the media on that day had about a million explanations for the outsized jump including Ai, backlogs and the projected outlook. I just cant help but think the TikTok deal was built into that outlook. Oracle said they signed 3 multi": 0.2,
  "Bill Gurley -- One of Uber's Earliest Investors -- Just Delivered Fantastic News for Tesla Investors": 0.8,
  "Will Elon Musk Join Trump Administration This Year? Here's What Betting Markets Are Predicting": 0.2,
  "CFPB ends monitoring of Apple, U.S. Bank years ahead of schedule": 0.5,
  "Heineken Buys Central American Assets in $3.2 Billion Deal": 0.5,
  "Market Movers: Metsera and Apple surge, Kenvue falters on Tylenol troubles": 0.5,
  "Is Costco a Buy, Sell, or Hold in 2025?": 0.0,
  "Asia stocks ride the AI rush, gold hits another peak": 0.5,
  "All Aboard: Agoda Unveils Asia's Most Scenic Train Journeys": 0.8,
  "How Nvidia Is Backstopping America’s AI Boom": 0.5,
  "Using documentaries to find opportunities - So I just today watched this documentary about the rising space industry that aired last year https://www.rottentomatoes.com/m/wild_wild_space And can’t help but notice of the 3 companies mentioned, 2 (RocketLab and Planet Labs) have been 10-baggers since with room to grow. Is there any source for such documentaries/films which allows us to learn about potential investments before the hype wave catches them? Does anyone have a watchlist of production companies/series": 0.6,
  "Intel has a $13 billion headache": -0.6,
  "Cintas Earnings: What To Look For From CTAS": 0.0,
  "Build-A-Bear (BBW) is on a bull run! - BBW is up 66% YTD, up 119% over the last year, and up 2,481% over the last 5 years. All of your wives, girlfriends, and kids are buying Labubu's, but you should be buying some BBW. Why isn't BBW getting coverage here yet? Is this just the start, or time to buy some puts?": 0.6,
  "ASML Stock Upgraded: Morgan Stanley Sees Big Upside Ahead": 0.8,
  "Applied Materials (AMAT) in Focus: Morgan Stanley Hikes Price Target to $209": 0.6,
  "Meta Platforms (META) in Focus After AI Glasses Showcase at Meta Connect 2025": 0.5,
  "Alphabet (GOOGL) Stock in Focus After Truist Boosts Price Target on Search Dominance": 0.5,
  "Unstoppable Africa 2025: Africa's AI Ambitions and Digital Future Go Global": 0.8,
  "Bernstein Sees Upside in NVIDIA (NVDA) With Datacenter Growth Potential": 0.8,
  "I Believe it’s Possible For Kenvue ($KNVU) To Sue The Administration And Win Sending The Stock Price - let’s dive into the latest drama surrounding Kenvue (KVUE), the consumer goods giant that spun off from Johnson & Johnson. The stock has taken a beating recently due to President Trump and RFK Jr’s comments linking Tylenol use during pregnancy to autism. Here’s a breakdown of the situation and what it might mean for investors. The Controversy:": 0.2,
  "Intel (INTC) in Focus: Citi Downgrades Shares Despite Nvidia Partnership": -0.5,
  "Micron (MU) Stock in Focus Ahead of Earnings as Barclays Lifts Price Target": 0.5,
  "Tesla (TSLA) Stock Target Raised to $500 as Analyst Stays Bullish on AI Edge": 0.8,
  "Apple (AAPL) Stock Target Raised to $310 on Surging iPhone 17 Demand": 0.8,
  "Dan Ives Compares Sam Altman's World Network To Tesla, Nvidia, Palantir In Their Infancy: 'An AI Meets Crypto Intersection'": 0.5,
  "What to Know About Nvidia, OpenAI's $100 Billion Deal": 0.5,
  "Eaton and Westcon-Comstor Malaysia partner to enhance power quality for customers": 0.5,
  "Morning Bid: New highs in Asia, Powell gets to say his piece": 0.5,
  "How the $100K H1-B Visa Fee Will Hurt U.S.-India Ties—and Companies": -0.5,
  "London transport lines with the highest and lowest average house prices": 0.0,
  "State pension set to rise — here's how much it could go up next April": 0.5,
  "Presight CEO: NVIDIA's Investment in OpenAI Exciting": 0.8,
  "Why Nvidia (NVDA) Stock Is Up Today": 0.5,
  "Nvidia invests $100 billion in OpenAI to fuel its computing power": 0.8,
  "Disney Classic: Friday Trump Dump, Tuesday Terrific Bump. - The soundtrack to this? The Weeknd: I feel it coming! I really do! After Trump and Disney dumping Kimmel on Friday, stocks dropped. But it's poised for a big bounce today with news of Disney's reinstatement of the Kimmel show! Classic stock cycle in this administration.": 0.6,
  "Logitech Introduces New Zone Headsets to Help Workers Escape the Distraction Trap": 0.5
}