{
  "Kraft Heinz pilots AI agent to streamline ketchup production": 0.5,
  "Tax Management Market Global Forecast Report 2025-2030 | Indirect Tax Segment to Grow Fastest Amid Digital Compliance Shifts": 0.5,
  "Taste Modulators Market Research Report 2022-2032: North America's 37.1% Market Share Driven by Health Trends, USFDA Sodium Targets and Investments from Coca-Cola and PepsiCo": 0.6,
  "My 3 Favorite Stocks to Buy Right Now": 0.0,
  "Higher Electricity Prices Aren’t All Good for Utilities": -0.5,
  "These 2 Stocks Could Be Prime Takeover Targets, According to Analysts": 0.5,
  "Market Chatter: US Lawmakers Seek Answers From Major Companies on H-1B Visa Use": 0.1,
  "For the First Time in 133 Years, Maxwell House Rebrands as \"Maxwell Apartment\"": 0.2,
  "Palo Alto Networks' (NASDAQ:PANW) Returns On Capital Are Heading Higher": 0.6,
  "3 AI Stocks to Buy Hand Over Fist": 0.6,
  "The Ultimate High Yield Healthcare Stock to Buy With $10,000 Right Now": 0.5,
  "Taiwan Semiconductor Unveils Ultra-Advanced Chip Tech": 0.8,
  "This Week In Energy Transition - Malaysia's Renewable Energy Surge Spurs Economic Growth": 0.8,
  "Vertex Announces Key Advancements Across Kidney Portfolio": 0.5,
  "Is IDEXX Laboratories, Inc. (NASDAQ:IDXX) Worth US$627 Based On Its Intrinsic Value?": 0.2,
  "Xcel (XEL) Moves 6.7% Higher: Will This Strength Last?": 0.6,
  "Gilead Foundation Grants $6.5 Million in Commitment to STEM Education": 0.8,
  "HONEYWELL TO RELEASE THIRD QUARTER FINANCIAL RESULTS AND HOLD ITS INVESTOR CONFERENCE CALL ON THURSDAY, OCTOBER 23": 0.0,
  "Fastenal Company (NASDAQ:FAST) is favoured by institutional owners who hold 85% of the company": 0.5,
  "Regenerative Medicine Industry Trends and Growth Strategies, 2025-2030 Featuring Novartis, Biogen, GlaxoSmithKline, Baxter International, and Boehringer Ingelheim": 0.5,
  "Game On: T-Mobile Unveils Top 25 High Schools in Friday Night 5G Lights Competition": 0.6,
  "Marvell to Showcase Interconnect Portfolio for Accelerated Infrastructure at ECOC 2025": 0.5,
  "GE HealthCare debuts AI-supported solution, designed to improve and shorten the radiation therapy workflow, at ASTRO 2025": 0.6,
  "Cadence Unveils AI-Driven ROCS X AI-Enabled Molecular Search, Unlocking Multi-trillion Molecule Virtual Screening": 0.8,
  "ServiceTitan and Verisk Team Up to Bring Xactimate® to New Roofing and Exterior Contractors": 0.5,
  "The Trade Desk (TTD) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Texas Instruments Incorporated (TXN) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Vertex Pharmaceuticals Incorporated (VRTX) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Why This Auto Parts Stock Is Worth Its Premium Price": 0.5,
  "What Makes CoStar Group (CSGP) an Investment Bet?": 0.2,
  "Is Synopsys (SNPS) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Digi International’s Z45 device now certified on T-Mobile network": 0.5,
  "Is MasTec's Communications Boom a Long-Term Catalyst for MTZ Stock?": 0.5,
  "Oracle initiated, Ulta Beauty upgraded: Wall Street's top analyst calls": 0.5,
  "Amazon upgraded, Adobe downgraded: Wall Street’s top analyst calls": 0.2,
  "CTAS Q1 Deep Dive: Broad-Based Growth and Technology Investments": 0.6,
  "Zip Forward 2025: \"Agents of Change\" to Unite 500+ Finance and Procurement Leaders in San Francisco": 0.5,
  "Metro by T-Mobile Reinforces Wireless Value With \"The Metro Drop\" — A Streetwear Collab That Puts Savings Back in Style": 0.5,
  "Investing in Exelon (NASDAQ:EXC) five years ago would have delivered you a 107% gain": 0.8,
  "Zacks Industry Outlook Highlights Vertiv, Roper Technologies and CoStar Group": 0.5,
  "ADI vs. NXPI: Which Stock Has an Edge in Analog Signal Processing?": 0.2,
  "Bloom Energy, Oklo Stocks Slide as Analysts Question Gains": -0.6,
  "Lam Research Teams Up With JSR: Can it Lead in High-NA EUV?": 0.5,
  "New Speakers Announced: 5th Palm Beach CorpGov Forum | Preview Panelists & Topics": 0.2,
  "Cross Ocean Partners and OakPoint Real Estate Acquire Encino Trace, a 324,342 SF Class A Office Campus in Austin, TX": 0.5,
  "From Compassion to Connection - Inside T-Mobile's Disaster Response": 0.5,
  "Okta (OKTA) Down 3.4% Since Last Earnings Report: Can It Rebound?": 0.2,
  "Why Gilead Sciences (GILD) Deserves Attention in the Cheap Quarterly Dividend Stocks Category": 0.5,
  "ComEd Names Ajit Apte as SVP of Customer Operations": 0.0,
  "Cocoa Prices Under Pressure on Improved Weather in West Africa": -0.6,
  "Update: Market Chatter: US Lawmakers Seek Corporate Feedback on H-1B Visa Use": 0.1,
  "Four-Channel Thermocouple Measurement with Integrated Conditioning Now Possible with ±1.5°C System Accuracy": 0.2,
  "Axon to Expand Public Safety Platform With Prepared Acquisition": 0.5,
  "Marvell Technology stock rises after executives buy shares worth over $2M": 0.8,
  "US Plans to Use Emergency Powers to Save More Coal Plants": -0.5,
  "Why Is Marvell Technology Stock Climbing Thursday?": 0.5,
  "Jim Cramer Notes T-Mobile’s Valuation Alongside Earnings Growth Forecast": 0.5,
  "Jim Cramer on Expedia: “It’s Much Cheaper Than Key Competitor”": 0.6,
  "Why GE HealthCare (GEHC) Shares Are Trading Lower Today": -0.5,
  "CrowdStrike's Scale And Profits Make It Rare Asset In Software: Analyst": 0.6,
  "Exploring High Growth Tech Stocks in the US Market": 0.5,
  "CrowdStrike Named a Frost Radar™ Leader in Cloud Workload Protection": 0.6,
  "Axon Therapies Raises $32M in Oversubscribed Series A to Transform Heart Failure Treatment": 0.8,
  "Morgan Stanley Is Pounding the Table on this Chip Stock": 0.6,
  "Cocoa Prices Retreat as West African Cocoa Crop Prospects Improve": 0.5,
  "Valence Raises $50M Series B to Give Every Employee an AI Coach at Work": 0.6,
  "Sector Update: Consumer Stocks Slide Late Afternoon": -0.5,
  "Marvell Stock Rallies After CEO Gives Reassuring Outlook": 0.8,
  "Exclusive-Swedish Fish maker Mondelez will switch food dyes to natural, not synthetic": 0.5,
  "Axon (AXON) Stock Trades Up, Here Is Why": 0.5,
  "Why Regeneron (REGN) Shares Are Falling Today": -0.5,
  "Why Is Marvell Technology (MRVL) Stock Rocketing Higher Today": 0.6,
  "Constellation Energy Corporation (CEG) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "PepsiCo (PEP) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "Gilead Sciences (GILD) Declines More Than Market: Some Information for Investors": -0.5,
  "Here's Why ON Semiconductor Corp. (ON) Fell More Than Broader Market": -0.5,
  "Vertex Pharmaceuticals (VRTX) Ascends While Market Falls: Some Facts to Note": 0.5,
  "Paccar (PCAR) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Why Kraft Heinz (KHC) Dipped More Than Broader Market Today": -0.5,
  "Ross Stores’ (ROST) Dividend Growth: A Key Highlight in Retail Dividend Stocks": 0.6,
  "(Item 8.01) Other Events Attached as Exhibit 99.1 and incorporated by reference herein is a press release dated September 26, 2025, issued by Comcast Corporation.": 0.0,
  "(Item 1.01) Entry into a Material Definitive Agreement. On September 25, 2025, Applied Materials, Inc. (“Applied”) entered into a credit agreement (the “Credit Agreement”) for a 364-day $2.0 billion revolving credit facility with Bank of America, N.A., as administrative agent (the “Administrative Agent”), and the lenders party thereto (collectively, the “Lenders”). The Credit Agreement provides for unsecured borrowings in an initial amount not to exceed $2.0 billion outstanding at any one time. The Credit Agreement includes a\n\n(Item 1.01) above, on September 25, 2025, Applied entered into the Credit Agreement. The information set forth in\n\n(Item 1.01) is incorporated herein by reference. Applied has not made any borrowings under the Credit Agreement as of this date.": 0.2,
  "BofA Initiates Coverage on Atlassian (TEAM) With Neutral Rating, $200 Price Target": 0.5,
  "CyberArk (CYBR) Stock Downgraded Amid Pending Palo Alto Networks Acquisition": -0.5,
  "Agoda Highlights Rise of Secondary Destinations in Travel Ahead of World Tourism Day": 0.5,
  "Stifel Maintains Buy Rating on Intuit (INTU) After Investor Day": 0.6,
  "3 Nasdaq 100 Stocks for Long-Term Investors": 0.0,
  "1 Consumer Stock to Target This Week and 2 We Find Risky": -0.5,
  "1 S&P 500 Stock with Impressive Fundamentals and 2 We Question": 0.2,
  "2 Large-Cap Stocks to Keep an Eye On and 1 We Question": 0.2,
  "BILL- An Attractive Turnaround Play in the Fintech Space": 0.8,
  "Nvidia’s AI Deals Might Be ‘Circular.’ They’re Also Smart Business.": 0.5,
  "Earnings Preview: What To Expect From Fastenal's Report": 0.5,
  "Is It Time to Buy Datadog Stock?": 0.2,
  "5 Brilliant Growth Stocks to Buy Now and Hold for the Long Term": 0.8,
  "MercadoLibre's Most Formidable Competitor Is Not Amazon. It's This Company.": 0.5,
  "FTSE and Wall Street rise as Fed's preferred measure of inflation stays in line with forecasts": 0.8,
  "KSL Capital Partners acquires Westin Hilton Head resort": 0.5,
  "The Power Lunch: UK workers ditch desk sandwiches as lunchtime dining increases": 0.5,
  "Evkeeza® (evinacumab-dgnb) ANGPTL3 Antibody Approved in the U.S. for Children as Young as 1 Year Old with Ultra-Rare Form of High Cholesterol": 0.8,
  "Tim O'Reilly on DesignRush Podcast: Why Generosity Is the Ultimate Growth Strategy in AI and Open Source": 0.6,
  "Is Now An Opportune Moment To Examine Texas Instruments Incorporated (NASDAQ:TXN)?": 0.2,
  "Is O'Reilly Auto Parts Stock a Buy?": 0.2,
  "Wall Street Futures Little Changed Ahead of Inflation Report; Asia Off, Europe Up": 0.0,
  "High Growth Tech Stocks To Watch In The US September 2025": 0.5,
  "MercadoLibre Is the Amazon of Latin America ... or Is It?": 0.5,
  "Intel, Wayfair, Eli Lilly, Oracle: Trending tickers": 0.0,
  "Green Rain Energy Holdings (OTCID:$GREH) Announces New EV Sites With Driftwood Hospitality": 0.5,
  "PACCAR stock jumps after Trump’s tariff announcement on heavy trucks": 0.6,
  "The Baltics: a region punching above its weight on the global life sciences stage": 0.8,
  "The Stock Market Is Suffering an AI Hangover. What to Do Now.": -0.5,
  "Here’s How Marvell Technology (MRVL) Rebounded from Q1 Lows": 0.5,
  "Is MercadoLibre's Rapid Loan Growth Becoming a Profitability Headwind?": -0.5,
  "Does MercadoLibre (MELI) have a Long Runway for Growth?": 0.2,
  "Jim Cramer Explains Morgan Stanley’s Coverage Of Applied Materials (AMAT)": 0.2,
  "Jim Cramer Explains Morgan Stanley’s Coverage Of ASML Holding N.V. (ASML)": 0.2,
  "Multiple Growth Drivers Lifted Axon (AXON) in Q2": 0.8,
  "For Mistral, the Future of AI Development Will Happen Inside the Enterprise": 0.5,
  "Why Investors Need to Take Advantage of These 2 Consumer Staples Stocks Now": 0.5,
  "Palo Alto Networks, Inc. (PANW) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Exchange-Traded Funds, Equity Futures Higher Pre-Bell Friday Amid New Tariffs": 0.5,
  "This Beaten-Down AI Stock Could Stage a Monster Comeback by 2028": 0.8,
  "Here’s How Zscaler (ZS) Affected Fidelity Growth Strategies Fund’s Performance": 0.1,
  "Constellation Energy vs. Ameren: Which Power Stock Has More Upside?": 0.5,
  "GEHC Inks License Agreement With Lantheus for Prostate Imaging Agent": 0.5,
  "Heartland Opportunistic Value Equity Strategy Initiated a Position in Applied Materials (AMAT) in Q2": 0.5,
  "Vertex (VRTX) Is Considered a Good Investment by Brokers: Is That True?": 0.5,
  "ADI's Communications Segment Improves: Is the Momentum Sustainable?": 0.5,
  "Trump's new tariffs on pharma, furniture, & trucks: What to know": -0.5,
  "ComEd Announces $175,000 in Scholarships Available for College and Trades Students": 0.8,
  "Here’s What Boosted MercadoLibre (MELI) in Q2": 0.5,
  "Why Apple’s New iPhone Could Be a Smashing Success—and Why Its Stock Could Hit $290": 0.8,
  "Honeywell International Inc. (HON) Raises $600M for Quantum Arm Quantinuum at $10B Valuation": 0.8,
  "PACCAR Inc. (PCAR) Declares $0.33 Dividend Amid Strong Financials": 0.8,
  "Intel chips, Tesla price target, Boeing 737: Trending Tickers": 0.0,
  "JPMorgan Lifts Gilead Sciences, Inc. (GILD)’s Price Target To $145, Maintains Overweight Rating": 0.8,
  "Palo Alto Networks Positioned as 'Premium Security Play' for Investors, Tigress Financial Says": 0.8,
  "CSX Reopens Expanded Howard Street Tunnel Ahead of Schedule, Strengthening East Coast Freight Growth": 0.8,
  "Top Stocks From the Staffing Services Industry to Buy Now": 0.5,
  "Atlassian Corporation (TEAM) Enters Into Definitive Agreement to Acquire DX": 0.5,
  "Jim Cramer Says Honeywell is “Part of a Whole Cohort of Industrials That Just Keeps Going Down”": -0.6,
  "Jim Cramer on lululemon: “I Think it has Fallen Too Far”": 0.6,
  "Podcast: Trump Weighs Plan to Reduce U.S. Reliance on Foreign Chips": 0.5,
  "Why Is CrowdStrike (CRWD) Up 7% Since Last Earnings Report?": 0.5,
  "Nike’s Skims Line Launches Today. Will It Be Enough for the Struggling Stock?": -0.5,
  "GlobalFoundries Stock Climbs. What’s Behind the Chip Manufacturer’s Momentum.": 0.6,
  "Did the AI Bubble Just Pop for This Legacy Tech Stock?": -0.6,
  "Intel Shares Rise on U.S. Plan to Cut Chip Import Reliance": 0.8,
  "Why PACCAR (PCAR) Stock Is Trading Up Today": 0.5,
  "Biolinq gets FDA de novo nod for intradermal glucose sensor": 0.5,
  "All You Need to Know About Roper Technologies (ROP) Rating Upgrade to Buy": 0.6,
  "Cocoa Prices Pressured as Rains Improve Ivory Coast Cocoa Crop Prospects": -0.5,
  "Don't Miss These Once-in-a-Decade Opportunities: 2 Unstoppable Stocks to Buy and Hold Forever": 0.8,
  "US plans 1:1 chip production rule to curb overseas reliance, WSJ reports": 0.5,
  "Strength in Software & Services Unit Drives Axon: Can the Momentum Sustain?": 0.5,
  "More than 150 firms have ties to Israeli settlements, UN finds": -0.5,
  "Here's Why You Should Retain Verisk Stock in Your Portfolio Now": 0.6,
  "US oil and gas rig count rises to highest since June, Baker Hughes says": 0.5,
  "US Oil Drillers Add More Oil Rigs as Prices Climb": 0.5,
  "SHOP Gains From Strong Partner Base: Will This Fuel Revenue Growth?": 0.6,
  "Roblox vs. Take-Two: Which Gaming Stock Has More Room to Run?": 0.2,
  "Celsius vs. Monster Beverage: Which Beverage Stock is Placed Better?": 0.2,
  "Why Paccar Stock Popped on Friday": 0.5,
  "The Winners and Losers From Trump’s 25% Truck Tariffs": 0.1,
  "Improved Ivory Coast Cocoa Crop Prospects Undercut Cocoa Prices": -0.7,
  "Electronic Arts stock jumps 17% after report company nearing $50B deal to be taken private - Shares of Electronic Arts jumped 15% on Friday following a report that the video game company is nearing a roughly $50 billion deal to go private. The deal would likely be the largest leverage buyout of all time, according to the Wall Street Journal. Investors including Saudi Arabia’s Public Investment Fund and Silver Lake could announce the deal as": 0.8,
  "Paramount, Ellisons might not have the cash for a WBD bid: Analyst": -0.2,
  "Alight, Iridium, CDW, First Advantage, and Xerox Shares Are Soaring, What You Need To Know": 0.5,
  "Why GlobalFoundries Rallied on Friday": 0.5,
  "Confluent, Flywire, Alarm.com, and Zscaler Shares Are Soaring, What You Need To Know": 0.5,
  "Oil Rig Count Rises by 6; Crude Prices Headed for Sharp Weekly Gains": 0.8,
  "Paccar, Boeing, Electronic Arts: Trending Tickers": 0.0,
  "HONEYWELL TO INCREASE DIVIDEND EFFECTIVE FOURTH QUARTER 2025": 0.5,
  "Fastenal Company Announces Conference Call to Review 2025 Third Quarter Earnings": 0.0,
  "Chegg, Teladoc, Skillz, Take-Two, and Expedia Shares Skyrocket, What You Need To Know": 0.8,
  "Electronic Arts Stock Jumps On Reported Go-Private Deal": 0.8,
  "These Stocks Moved the Most Today: Eli Lilly, Electronic Arts, Intel, GlobalFoundries, Boeing, AppLovin, Costco, and More": 0.5,
  "New Trump Tariffs Set For Oct. 1, This S&P 500 Stock Soars": 0.5,
  "Trump’s Truck Tariffs Are Coming. Here’s Who Wins and Loses.": 0.1,
  "Electronic Arts Stock Pops on Report Videogame Maker Is Close to Going Private": 0.8,
  "Intel Stock Rises As Trump Steps Up Efforts To Reshore Chip Manufacturing": 0.8,
  "Oracle, Caterpillar, and 10 Other Winners from the ‘New Global Trade Order’": 0.6,
  "Stocks to Watch Recap: GlobalFoundries, Oracle, Intel, Paccar": 0.0,
  "Podcast: U.S. Stocks Break Three-Day Losing Streak": 0.8,
  "Delta Fixes 300+ Airbus Jets Over Cabin Fume Fears": 0.1,
  "Datadog (DDOG) Outperforms Broader Market: What You Need to Know": 0.5,
  "Fortinet (FTNT) Laps the Stock Market: Here's Why": 0.5,
  "Airbnb, Inc. (ABNB) Laps the Stock Market: Here's Why": 0.2,
  "Applied Materials (AMAT) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Trump’s Latest Tariffs Raise More Questions. Investors Need to Stay Alert.": 0.1,
  "Texas Instruments (TXN) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Vertex Pharmaceuticals (VRTX) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Ross Stores (ROST) Outperforms Broader Market: What You Need to Know": 0.5,
  "Adobe (ADBE) Stock Downgraded at Morgan Stanley on Slower AI Monetization": -0.5,
  "Foreign investors allocate 30% of US assets to stocks despite Trump tariffs, up from 19% previously - No paywall: [https://finance.yahoo.com/news/foreign-investors-are-sticking-with-us-stocks-amid-trump-tariff-turmoil-164043537.html](https://finance.yahoo.com/news/foreign-investors-are-sticking-with-us-stocks-amid-trump-tariff-turmoil-164043537.html) >In April, talk of a “Sell America” trade picked up steam on Wall Street following the unveiling of President Trump's \"Liberation Day\" tariffs. US stocks, Treasurys, and the dollar all tumbled at once - an unusual dislocation that shook confidence in America’s safe-haven status. >But recent data indicates that investors abroad have actually stuck with": 0.5,
  "Making Sense of Current Earnings Expectations": 0.0,
  "Why Bernstein Is Bullish on Atlassian (TEAM) After Browser Co & DX Deals": 0.5,
  "Will Nike Stock Keep Rebounding as Its Q1 Results Approach?": 0.5,
  "Melius Initiates Coverage on Diamondback Energy (FANG), Assigns Buy Rating": 0.8,
  "Electronic Arts Nears Takeover by Silver Lake, PIF": 0.2,
  "What to Expect From PepsiCo's Next Quarterly Earnings Report": 0.0,
  "Gilead Sciences (GILD) Stock Sees Positive Outlook Amid HIV, Liver, and Cancer Drug Momentum": 0.8,
  "Biogen (BIIB) Expands Neurology Pipeline With Alcyone Buyout, Stock Seen Undervalued": 0.8,
  "Piper Sandler Sees Strong Momentum in Keurig Dr Pepper (KDP) Stock": 0.8,
  "Tariffs Aren’t Hitting Earnings—Yet. Why That Might Not Last.": 0.1,
  "Is It Finally Time to Buy Copart Stock?": 0.5,
  "3 Dirt Cheap Stocks to Buy With $1,000 Right Now": 0.5,
  "3 Dividend Stocks Perfect for Gen Z Investors": 0.5,
  "1 Artificial Intelligence (AI) Stock to Buy Before It Soars By 50%, According to Wall Street": 0.8,
  "High Electricity Demand Could Boost These 2 Power Producer Stocks, Says Scotiabank": 0.6,
  "Marvell Technology (NASDAQ:MRVL) Seems To Use Debt Quite Sensibly": 0.5,
  "Positive earnings growth hasn't been enough to get Charter Communications (NASDAQ:CHTR) shareholders a favorable return over the last five years": -0.5,
  "Honeywell International Inc. (NASDAQ:HON) is favoured by institutional owners who hold 78% of the company": 0.5,
  "What is setting Plex apart from the streaming competition?": 0.2,
  "Many Would Be Envious Of Cadence Design Systems' (NASDAQ:CDNS) Excellent Returns On Capital": 0.8,
  "We Think Keurig Dr Pepper (NASDAQ:KDP) Is Taking Some Risk With Its Debt": -0.5,
  "Is Arm Holdings One of the Best Artificial Intelligence (AI) Stocks for Long-Term Investors?": 0.6,
  "Starbucks To Shutter Stores Amid Restructuring, Tariffs, Boycotts, And Policy Backlash": -0.7,
  "Assessing O'Reilly Automotive (ORLY) Valuation as Shares Quietly Log Strong Gains Without Major News": 0.6,
  "Should Improved West African Cocoa Harvest Prospects Prompt a Rethink for Mondelez (MDLZ) Investors?": 0.2,
  "Biogen (BIIB): Reevaluating Valuation Following FDA’s Supplemental Spinraza Dose Setback": 0.1,
  "How Luckin Coffee's U.S. Launch and Market Leadership Will Impact LKNC.Y Investors": 0.5,
  "What Recent Price Swings Mean for CrowdStrike’s Valuation in 2025": 0.2,
  "How Investors May Respond To Synopsys (SNPS) Expanding AI Design Collaboration With TSMC": 0.5,
  "Assessing Marvell Technology (MRVL): Is the Stock’s Valuation Outpacing Recent Investor Interest?": 0.1,
  "Will T-Mobile US' (TMUS) CEO Succession Drive the Next Phase of Digital Transformation?": 0.2,
  "Did the Howard Street Tunnel Expansion Just Shift CSX's (CSX) Investment Narrative?": 0.2,
  "PACCAR (PCAR) Valuation Spotlight After Truck Tariff News and Share Price Surge": 0.5,
  "Could US Semiconductor Mandates Reshape GlobalFoundries (GFS) Strategy Amid New Photonics Partnerships?": 0.5,
  "A Fresh Look at Honeywell (HON) Valuation After Recent Share Price Cooling": 0.5,
  "What Vertex Pharmaceuticals (VRTX)'s FDA Breakthrough for Povetacicept Means for Kidney Disease Pipeline": 0.2,
  "Qualcomm’s New AI Chips Might Change the Case for Investing in QCOM": 0.5,
  "Assessing Kraft Heinz (KHC) Valuation After Recent Shifts in Investor Sentiment": 0.5,
  "Will Lawmakers' H-1B Visa Scrutiny Shift Cognizant Technology Solutions' (CTSH) Global Workforce Narrative?": 0.2,
  "A Fresh Look at Verisk Analytics (VRSK) Valuation Following New AI Launch and ServiceTitan Partnership": 0.6,
  "Adobe (ADBE) Valuation in Focus as Share Price Lags Despite Steady Earnings Growth": 0.2,
  "A Fresh Look at Intuit (INTU) Valuation Without Major News Driving the Stock": 0.1,
  "Did Strong Q1 Results and Upgraded Guidance Just Shift Cintas' (CTAS) Investment Narrative?": 0.5,
  "What Starbucks (SBUX)'s $1 Billion Store Restructuring Means for Shareholders": 0.2,
  "Take-Two (TTWO): Is the Recent Borderlands 4 Delay Changing the Company's Valuation Outlook?": 0.2,
  "Dedrone by Axon Enterprise, Inc. (AXON) Partners with Mobile Camera Security (MCS)": 0.2,
  "UBS Reiterates Its ‘Buy’ Rating on Honeywell International Inc. (HON) with a $268 Price Target": 0.8,
  "Palo Alto Networks Stock Has Surged Since August. Can This Momentum Continue?": 0.5,
  "Autodesk Gains Q2 Momentum as Partnerships and Price Target Upgrades Strengthen Growth Outlook": 0.8,
  "Fal.Con Event Boosts CrowdStrike (CRWD) as Investors Cheer AI Strategy": 0.8,
  "Investors of PLTR, are you concerned with Theil being on Epstein liste? - PLTR seems promising with all of its government contracts it's secured. It's a stock I've been watching and has seem to be a good long term hold Are you concerned that the CEO is on ghe Epstein list? If so, would you prefer if Theil stepped down, and someone else took his place? I'm curious what long term holders think, and if": -0.5,
  "These 3 Dividend-Paying Dow Jones Stocks Can't Catch a Break. Here's Why They Are All Top Buys in October.": 0.5,
  "1 Growth Stock Down 65% to Buy Right Now": -0.5,
  "The Ultimate Growth Stock to Buy With $1,000 Right Now": 0.5,
  "5 Top Stocks to Buy in October": 0.0,
  "Is U.S. Sales Weakness and Analyst Downgrades Altering the Investment Case for lululemon (LULU)?": -0.5,
  "Has Axon's Recent Growth Outpaced Its Fundamentals Amid Broader Tech Stock Volatility in 2025?": -0.5,
  "Calculating The Fair Value Of Analog Devices, Inc. (NASDAQ:ADI)": 0.1,
  "ON Semiconductor (ON): Assessing Valuation as Analysts Forecast Declining Earnings and Revenue Ahead of Quarterly Report": -0.5,
  "Arm Holdings (NasdaqGS:ARM): Revisiting Valuation as Investor Interest Builds on Core Business Strengths and Data Center Expansion": 0.6,
  "Tracking the Narrative for PepsiCo as Strategic Shifts Reshape Its Growth Story": 0.5,
  "Does Luckin Coffee’s New York Debut Signal Room for More Growth in 2025?": 0.5,
  "Should You Grab This Growth Stock Before It Surges 46%?": 0.5,
  "Shale oil execs say Trump policies are hurting investment, 'business is broken' - https://www-cnbc-com.cdn.ampproject.org/v/s/www.cnbc.com/amp/2025/09/25/shale-oil-execs-say-trump-policies-are-hurting-investment-business-is-broken.html?amp_js_v=0.1&amp_gsa=1#webview=1&cap=swipe Trump has championed fossil fuels while attacking the renewable energy industry since taking office in January. His One Big Beautiful Bill Act, passed by Congress in July, delivered virtually everything the oil lobby wanted. But Trump's push for lower crude prices, higher tariffs, and the resulting uncertainty caused by his \"stroke of pen\" policies are hurting investment, executives at independent oil": -0.6,
  "3 Things to Know About Lululemon Athletica Stock Before You Buy": 0.2,
  "Workday (NASDAQ:WDAY) shareholder returns have been respectable, earning 62% in 3 years": 0.6,
  "We Ran A Stock Scan For Earnings Growth And Baker Hughes (NASDAQ:BKR) Passed With Ease": 0.6,
  "Insiders At Atlassian Sold US$19m In Stock, Alluding To Potential Weakness": -0.6,
  "Xcel Energy (NASDAQ:XEL) stock performs better than its underlying earnings growth over last three years": 0.5,
  "Sports is the only thing keeping linear TV 'alive' right now": 0.2,
  "Constellation Energy Corporation (CEG): A Bull Case Theory": 0.5,
  "How will Microsoft stock react to this news on Monday Morning - “Trump demands Microsoft immediately fire Lisa Monaco …” - Lisa Monaco is an executive at Microsoft who served as deputy attorney general during the Biden administration. “Monaco has been shockingly hired as the President of Global Affairs for Microsoft, in a very senior role with access to Highly Sensitive Information. Monaco’s having that kind of access is unacceptable, and cannot be allowed to": -0.8,
  "Energy Infrastructure and Data Centers: Can supply meet demand? - U.S. Datacenter power demand is set to double by 2028. OpenAI expects its energy use to grow 125x over the next 8 years. Source: https://www.cnbc.com/2025/09/26/openai-big-week-ai-arms-race.html Particularly thought this section was interesting: “Building out 17 gigawatts of capacity would require the equivalent of about 17 nuclear power plants, each of which takes at least a decade to build. The OpenAI team says talks are underway with": 0.2,
  "What Is One of the Smartest Artificial Intelligence (AI) Stocks to Buy Today?": 0.5,
  "September is the worst month, yet... - It is said that September is historically the worst month on stock market, yet we are only two days away ending this month and that slight decline in stock market didn't happen, quite the contrary: it has been a good month for stocks. Do you think that won't happen in these two days? That could happen in the first two weeks of October or that from now we": 0.2,
  "Cogent Communications Holdings, Inc. (CCOI): A Bull Case Theory": 0.5,
  "Arm Holdings plc (ARM): A Bull Case Theory": 0.5,
  "Biogen Inc. (BIIB): A Bull Case Theory": 0.5,
  "Airbnb, Inc. (ABNB): A Bull Case Theory": 0.5,
  "Warner Bros. Notches Another Box Office Win. ‘One Battle After Another’ Tops Sales.": 0.6,
  "Is Axon Enterprise Stock's Valuation Justified?": 0.1,
  "Honeywell International Inc. (HON) Posts Strong Q2 Earnings, Advances Aerospace and Quantum Tech": 0.8,
  "The Coca-Cola Company (KO) Leverages AI and Digital Tech to Boost Global Growth": 0.8,
  "Verizon Communications Inc. (VZ) Expands 5G Ultra Wideband and AI Wearable Partnerships with Meta": 0.5,
  "Monster Beverage Corporation (MNST) Tops $2B in Q2 Sales, Driven by Energy Drink Demand": 0.8,
  "Highest conviction Data Center Stock pick - There are so many stocks relating to data centers (nbis, crwv, glxy, iren, etc). I have been doing research and looking to slowly increase my exposure to this sector. What is your DD on the stock you believe in the most, time horizion and and price target for the stock?": 0.6,
  "Why does the market close on weekends? - I’m looking to soon get into stocks, for something that seems to be very “important” why do they close on the weekends? Also what would be some friendly investments to look into? I looking at Amazon and Amex.": 0.2,
  "“LEQEMBI®” (lecanemab) IV Maintenance Dosing for the Treatment of Early Alzheimer’s Disease Approved in China": 0.5,
  "Lam Research Corporation (LRCX): A Bull Case Theory": 0.5,
  "(Item 1.01) Entry into a Material Definitive Agreement. Agreement and Plan of Merger On September 28, 2025, Electronic Arts Inc. (“ Electronic Arts ” or the “ Company ”) entered into an Agreement and Plan of Merger (the “ Merger Agreement ”) by and among the Company, Oak-Eagle AcquireCo, Inc., a Delaware corporation (“ Parent ”), and Oak-Eagle MergerCo, Inc., a Delaware corporation and wholly owned subsidiary of Parent (“ Merger Sub ”) pursuant to which the": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On September 29, 2025, Comcast Corporation announced that Michael J. Cavanagh will be appointed Co-Chief Executive Officer of the Company, effective in January 2026. At that time, he also will be appointed as a director of Comcast. As Co-CEO, he will serve alongside Brian L. Roberts, who will continue as the Company’s Chairman of the Board and": 0.2,
  "(Item 8.01) Other Events Attached as Exhibit 99.1 and incorporated by reference herein is a press release dated September 29, 2025, issued by Comcast Corporation.": 0.0,
  "(Item 8.01) Other Events. ATM Updates On September 29, 2025, Strategy Inc (“Strategy” or the “Company”) announced updates with respect to its at-the-market offering programs: ATM Program Summary During Period September 22, 2025 to September 28, 2025 As of September 28, 2025 Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) STRF ATM 101,713 STRF Shares $10.2 $11.3 $1,718.8 $2.1 billion of 10.00% series A perpetual strife": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers Chief Executive Officer Transition On September 28, 2025, the Board of Directors (the “Board”) of CSX Corporation (the “Company”) appointed Stephen Angel as President and Chief Executive Officer of the Company and a member of the Board, effective immediately. Mr. Angel succeeds Joseph R. Hinrichs, who separated from his employment as President and Chief Executive Officer of": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On September 23, 2025, the Board increased the size of the Board to thirteen members and elected Alan Armstrong as a director, effective as of January 1, 2026, to serve until Constellation’s 2026 annual meeting of shareholders. The Constellation board of directors has not yet determined the committee(s) on which Mr. Armstrong will be appointed to": 0.1,
  "(Item 8.01) Other Events. On September 22, 2025, Broadcom Inc. (the “Company”) entered into an underwriting agreement (the “Underwriting Agreement”) with J.P. Morgan Securities LLC, BofA Securities, Inc. and BNP Paribas Securities Corp., acting for themselves and as representatives of the several underwriters named therein (collectively, the “Underwriters”), pursuant to which the Company agreed to issue and sell to the Underwriters $5,000,000,000 aggregate principal amount of its senior notes, consisting of $1,000,000,000 aggregate principal amount of its": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (b) On September 29, 2025, Stephen F. Angel, Chairman of the Board of Linde plc (“Linde”), announced that he will retire from Linde’s Board of Directors effective January 31, 2026. In connection with Mr. Angel’s retirement, Linde’s Board of Directors appointed Sanjiv Lamba, Linde’s CEO, to the additional position of Chairman of the Board effective upon": -0.2,
  "Dividend and Growth Opportunities in Telephone and Data Systems (TDS)": 0.5,
  "Building a Telecom Dividend Portfolio Around T-Mobile US (TMUS)": 0.2,
  "NDAQ buy time? - Idk why I'm posting, maybe to be told wrong or to come back and use it as a told you so but NDAQ is at the the perfect place for calls in the next 2-3 trading days. They expire next month at 10/17 so plenty of time and its about $75 for the premium for the next OTM call option at $90 strike price while NDAQ is at $87.51. Have not": 0.2,
  "Retail Therapy: Agoda's Top Picks for Asia's Shopping Destinations": 0.5,
  "I am shorting UNH - Very High Quality Analysis - I wrote everything myself and did not use AI. Images are not allowed here so please refer to the same post on other subs for attached screenshots of my analysis. Alright guys, this is me going against the entire reddit world as you’ve probably seen everyone on reddit going long on UNH (including myself earlier this year where I made some really good profits on": -0.6,
  "BYD cuts 2025 sales target by 16% to 4.6M units, but forecasts exports to surge to 20% of sales (800K–1M vehicles) - No paywall: [https://finance.yahoo.com/news/chinas-byd-forecasts-exports-top-023732388.html](https://finance.yahoo.com/news/chinas-byd-forecasts-exports-top-023732388.html) >Chinese electric vehicle maker BYD Co forecast exports will make up about 20% of its global sales this year helped by new model launches, the South China Morning Post reported on Monday. >BYD forecasts 800,000 to 1 million deliveries outside mainland China in 2025, compared with projected total sales of": 0.1,
  "Dow Jones Futures Rise With Tesla Deliveries, Jobs Report Due; 5 Stocks Eye Buy Points": 0.5,
  "Finra is asking the sec to change the PDT rule - Finra wants to change the pattern day trading rule to lower the margin account to $2000 for traders to avoid the current 3 day pattern day trading rule. I personally never cared about trading on margins. I just think they need to allow everyone to get a chance at day trading. I guess they will allow more people to blow their accounts.": 0.2,
  "ASML Builds Machines that Make AI Chips. Why It’s Missing Out on the Boom.": -0.5,
  "1 Stock Under $50 with Exciting Potential and 2 We Brush Off": 0.5,
  "3 Unpopular Stocks We Approach with Caution": -0.5,
  "1 S&P 500 Stock for Long-Term Investors and 2 We Avoid": 0.2,
  "1 Healthcare Stock with Exciting Potential and 2 We Ignore": 0.6,
  "2 S&P 500 Stocks to Research Further and 1 We Avoid": 0.0,
  "1 Services Stock for Long-Term Investors and 2 Facing Challenges": 0.2,
  "3 S&P 500 Stocks with Competitive Advantages": 0.0,
  "3 Momentum  Stocks with Promising Prospects": 0.5,
  "Netflix, Inc. (NASDAQ:NFLX) Partners Anheuser-Busch InBev to Bolster Advertising Business": 0.5,
  "ASML Holding N.V. (ASML) Upgraded to Buy Amid Strategic Moves and Industry Tailwinds": 0.8,
  "UBS Downplays G7 CGM Sensor Concerns, Affirms DexCom’s Inc. (DXCM) ‘Buy’ Rating": 0.5,
  "Jim Cramer on Starbucks: “I Remain Very Bullish”": 0.8,
  "Jim Cramer Says “Marvell is Really an Excellent Company”": 0.8,
  "Wall Street Bullish on Diamondback Energy (FANG), Here’s Why": 0.8,
  "QUALCOMM Incorporated (QCOM) Announces New Chips for PC’s and Phones": 0.5,
  "Morgan Stanley Maintains Buy on Gilead Sciences (GILD)": 0.5,
  "Cognizant Technology Solutions (CTSH) Announces a New Partnership with Venbrook Group": 0.5,
  "Here's What to Expect From CSX's Next Earnings Report": 0.1,
  "Malaysia Aviation Group announces digital partnership with Adobe, Google, Skyscanner and Visa": 0.5,
  "Richtech Robotics and Lululemon have been highlighted as Zacks Bull and Bear of the Day": 0.2,
  "Nike and Carnival are part of Zacks Earnings Preview": 0.0,
  "Cisco Quantum Labs announces Quantum Compiler prototype": 0.5,
  "Amgen to invest $650m in US manufacturing network expansion": 0.5,
  "4 Brilliant Growth Stocks to Buy Now and Hold for the Long Term -- Including Fluor (FLR) Stock and Opendoor Technologies (OPEN) Stock": 0.8,
  "What You Need To Know Ahead of Intuitive Surgical's Earnings Release": 0.2,
  "Zacks.com featured highlights include Wolverine World Wide, Interface, BuildABear Workshop and Analog Devices": 0.2,
  "GlobalFoundries (GFS) Surges 8.4%: Is This an Indication of Further Gains?": 0.6,
  "Starbucks CTO steps down amid wider restructuring": -0.5,
  "Hanmi's Oral Delivery Platform Compound Licensed to Gilead": 0.5,
  "Bridge to Life Appoints David Castiglioni as Chief Commercial Officer to Head Global Commercial Operations and Lead the U.S. Commercialization of VitaSmart™": 0.6,
  "Regeneron’s Evkeeza gains FDA approval for young HoFH patients": 0.5,
  "Take-Two (TTWO) Soars 4.5%: Is Further Upside Left in the Stock?": 0.5,
  "Stocks Are Typically Immune to Government Shutdowns. Why It’s Different This Time.": 0.2,
  "Baker Hughes to Supply Subsea Tree Systems and Associated Services for Petrobras": 0.5,
  "Bear Of The Day: Lululemon Athletica (LULU)": 0.0,
  "Want to be CEO? These 5 employers give you the best shot": 0.5,
  "The evolution of cognitive banking": 0.5,
  "Datadog's (DDOG) Zip Forward 2025 Spotlight Might Change the Case for Investing": 0.5,
  "Insider Confidence In Leading Growth Stocks September 2025": 0.5,
  "ASML (ENXTAM:ASML): Assessing Valuation After Recent Share Price Surge": 0.5,
  "Linde Appoints Sanjiv Lamba as Chairman & CEO": 0.5,
  "This Week In AI Chips - Revolutionizing AI Data Centers With Optical Solutions": 0.6,
  "High Growth Tech Stocks In The US Market With Promising Potential": 0.8,
  "Does Ross Stores' (ROST) Community-Focused Expansion Reveal a Shift in Its Growth Priorities?": 0.2,
  "Should American Electric Power's (AEP) $2 Billion Debt Issuance Reshape Its Long-Term Investment Story?": 0.1,
  "Zyxel Networks Expands Portfolio of WiFi 7 Access Points for Small Businesses": 0.5,
  "CSX Corp. Announces Leadership Transition": 0.0,
  "Constellation Appoints Alan Armstrong to Board of Directors": 0.5,
  "GlobalFoundries and Corning Collaborate To Deliver Detachable Fiber Connector Solutions to Scale Next-Generation Optical Connectivity": 0.5,
  "Member Loyalty Group Names Drew Wolff as Treasurer of the Board": 0.2,
  "Should You Investigate Warner Bros. Discovery, Inc. (NASDAQ:WBD) At US$19.51?": 0.1,
  "A Look At The Fair Value Of CoStar Group, Inc. (NASDAQ:CSGP)": 0.2,
  "Auto Parts Manufacturer Bankruptcy: Impact on the parts retailers? - First Brands filed for bankruptcy this morning and has major customer concentration in retailers like Autozone, O'Reilly, NAPA and similar. The company would continue supplying parts, but what happens in the medium to long term with retailers when a major supplier falls down? I assume that costs can go up as they seek wider sources of supply for their privately branded parts. Any hiccup in": -0.5,
  "Comscore Cuts Dividends, Reshapes Board": -0.5,
  "ISRG vs. ZBH: Which Robotic Surgery Stock Offers Better Upside Now?": 0.5,
  "Investor: CSX can now search out ‘willing partner’ for rail merger": 0.5,
  "PANW Bets on Prisma AIRS: Is it the Key to Future Platform Growth?": 0.5,
  "FDA Approves Label Extension of REGN's Cholesterol Drug Evkeeza": 0.5,
  "CSX appoints new CEO as US railroad operator battles activist pressure": 0.1,
  "CSX appoints Steve Angel as CEO amid activist pressure": 0.2,
  "Home-grown heroes: how Huawei and DeepSeek are helping China break reliance on US chips - https://finance.yahoo.com/news/home-grown-heroes-huawei-deepseek-093000982.html \"As confidence in home-grown technology mounts, Beijing has urged the country's tech giants to cease buying chips that Nvidia tailored for China, which were designed to comply with US export restrictions. Together, Huawei and DeepSeek have emerged as symbols of China's resilience, showing how US trade curbs have sparked a wave of innovation in the domestic AI industry that": 0.6,
  "The questions companies need to ask themselves about H-1B visas": 0.0,
  "ON SALE: TICKETS FOR THE HIGHLY ANTICIPATED 17th ANNUAL RITZ-CARLTON CAYMAN COOKOUT AVAILABLE OCTOBER 1": 0.8,
  "Health Hope Pharma Enters into Exclusive Licensing Agreement with Gilead Sciences": 0.5,
  "Applovin gains ahead of non-gaming self-serve launch": 0.5,
  "IDEXX Laboratories Stock Rallies 52.9% YTD: What's Behind the Drive?": 0.6,
  "Electronic Arts confirms deal to go private in record $55 billion leveraged buyout - [https://www.reuters.com/business/media-telecom/electronic-arts-go-private-55-billion-deal-with-pif-silver-lake-2025-09-29/](https://www.reuters.com/business/media-telecom/electronic-arts-go-private-55-billion-deal-with-pif-silver-lake-2025-09-29/) >Sept 29 (Reuters) - Videogame giant Electronic Arts [(EA)](https://www.reuters.com/markets/companies/EA.O) will be taken private in a record-breaking $55 billion leveraged buyout by a consortium consisting of private equity firm Silver Lake, Saudi Arabia's Public Investment Fund and Jared Kushner's Affinity Partners, the company said Monday. edit: official source [https://news.ea.com/press-releases/press-releases-details/2025/EA-Announces-Agreement-to-be-Acquired-by-PIF-Silver-Lake-and-Affinity-Partners-for-55-Billion/default.aspx](https://news.ea.com/press-releases/press-releases-details/2025/EA-Announces-Agreement-to-be-Acquired-by-PIF-Silver-Lake-and-Affinity-Partners-for-55-Billion/default.aspx) The price accepted by the board is $210 per share.": 0.5,
  "Cannabis stocks jump up to 20% premarket after Trump endorses CBD for senior healthcare, MSOS ETF surges 25% - No paywall: [https://finance.yahoo.com/news/cannabis-stocks-surge-trump-endorses-093037321.html](https://finance.yahoo.com/news/cannabis-stocks-surge-trump-endorses-093037321.html) >Shares of pot companies climbed in premarket trading on Monday after U.S. President Donald Trump shared a video advocating the potential benefits from the use of cannabidiol in senior healthcare. >Trump had said last month his administration was looking to reclassify marijuana, which could also result in potentially easing criminal penalties around its": 0.8,
  "Is T-Mobile Us (TMUS) The Best Telecom Stock to Buy? Analyst Explains Her Bullish Thesis on the Stock": 0.6,
  "Synopsys Introduces Digital Twin Racetrack and NVIDIA Omniverse to STEM Racing": 0.5,
  "Axon Unveils Axon Body Workforce Mini to Protect Frontline Workers and Businesses Amid Rising Violence and Theft": 0.6,
  "The Trade Desk Announces Major Overhaul of Digital Advertising Data Marketplace": 0.5,
  "Empower Semiconductor Expands Board of Directors with Industry Veterans": 0.8,
  "Investors Heavily Search ON Semiconductor Corporation (ON): Here is What You Need to Know": 0.5,
  "Investors Heavily Search ASML Holding N.V. (ASML): Here is What You Need to Know": 0.5,
  "Adobe Inc. (ADBE) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Microchip Technology (NASDAQ:MCHP) Could Be At Risk Of Shrinking As A Company": -0.6,
  "Constellation Energy Insider Lowered Holding By 45% During Last Year": -0.2,
  "Nvidia Has Invested in These 6 Companies. Should You Follow Suit?": 0.5,
  "Deutsche Bank bullish on Lam Research amid memory demand, its foundry exposure": 0.6,
  "CSX Appoints New CEO Following Activist Pressure": 0.5,
  "Is Take-Two (TTWO) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "EA to go private, CSX CEO, cannabis stocks: Trending Tickers": 0.0,
  "Hinrichs out as CSX CEO": -0.5,
  "EA downgraded, AppLovin initiated: Wall Street's top analyst calls": 0.2,
  "r/Stocks Daily Discussion Monday - Sep 29, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.2,
  "Honeywell's Board Approves 5% Increase in Dividend Rate": 0.8,
  "Lam Research Is on a Roll. It Still Has Room to Climb, Analysts Say.": 0.8,
  "Don't be afraid to miss the opportunity. You can't! - We're in a situation where the stock market is inflated with worthless companies valued in billions - all because people want to buy the next Apple, Nvidia, or Google. Here's my point: you can't miss the next big thing. Successful businesses don't appear and disappear overnight. Their success is a story that lasts for decades. Look: In 2005, Google was already a business with world-class": 0.2,
  "Here’s Why Regeneron Pharmaceuticals (REGN) Fell in Q2": -0.5,
  "Movie tariffs, Beyond Meat, Kroger & DoorDash: Trending Tickers": 0.0,
  "Lululemon Drops 54% YTD, Is LULU Stock Too Cheap to Ignore?": 0.2,
  "Elastic Outscores Top Competitors for Threat Prevention in AV-Comparatives Endpoint Security Rankings": 0.8,
  "As Starbucks Cuts Jobs and Closes Stores, Should You Buy, Sell, or Hold SBUX Stock?": 0.1,
  "Why AppLovin Stock Jumped Today": 0.5,
  "Chip Stocks Keep Charging Higher. What the Charts Say About Nvidia, Broadcom, Applied Materials": 0.5,
  "CSX railroad replaces CEO after investor pressure and poor performance as Union Pacific merger looms": -0.6,
  "Top Midday Stories: Electronic Arts Going Private in $55 Billion Deal; Genmab to Acquire Merus for $8 Billion": 0.5,
  "Exelon (EXC) Could Be a Great Choice": 0.8,
  "Trump's latest tariff threats aimed at foreign movies, furniture": -0.5,
  "WeRide (WRD) - Bet on Robotaxis - DD - If you are looking to invest in a pure-play robotaxi/autonomous driving tech stock with blockbuster revenue growth and major global partnerships, you should seriously consider going all in on WRD. The recent quarter’s results and newsflow have been very positive: WRD tripled its Abu Dhabi robotaxi fleet, launched Saudi’s first service, secured permits in Dubai, Singapore, Belgium, and even made Fortune’s Change-the-World list. Some key facts:": 0.8,
  "100% tariffs on movies made outside US due to the movie making business having been “stolen like candy from a baby” - https://www.reuters.com/business/media-telecom/us-impose-100-tariff-movies-made-outside-country-2025-09-29/ Post: Our movie making business has been stolen from the United States of America, by other Countries, just like stealing \"candy from a baby.\" California, with its weak and incompetent Governor, has been particularly hard hit! Therefore, in order to solve this long time, never ending problem, I will be imposing a": -0.8,
  "Labor Department won’t be releasing data, including Friday’s key jobs report, in case of a shutdown - Source: https://www.cnbc.com/2025/09/29/bls-wont-be-releasing-data-including-fridays-key-jobs-report-in-case-of-a-shutdown.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard The Labor Department is preparing for what would amount to a news and data blackout should the U.S. government suspend operations. In a contingency plan released Friday, the department said it was looking “to ensure that DOL agencies can perform an orderly suspension of programs and operations should a lapse occur, while continuing those limited activities": -0.5,
  "How would Trump's foreign-made film tariffs actually work?": 0.1,
  "Can someone help me with DD on KOS? - I seen this post on another sub and it makes sense to me but I’m a moron so can someone actually smart tell me if this is a good play “Think we are headed for or are already in hyper inflationary recession. Gold is priced in already, but oil is massively undervalued. Right now, the U.S. is using its reserves to put pressure on countries like": -0.5,
  "FTSE 100 held back by weak oil after bright start": -0.5,
  "Ancora Issues Statement on the CSX Board’s Decision to Heed Shareholder Feedback and Initiate a CEO Change": 0.5,
  "Mizuho lifts ASML to Buy, sees EUV demand strength": 0.6,
  "Trump floats tariffs on furniture & movies, EA to go private": 0.1,
  "Sector Update: Tech Stocks Mixed Monday Afternoon": 0.0,
  "Is Micron Technology Stock About to Break Out?": 0.5,
  "Medtronic (MDT) and its Role in a Recession-Proof Portfolio": 0.5,
  "Beat the Market: 5 Dividend Stocks Chosen by Investing.com’s Warren AI": 0.5,
  "US Equity Indexes Trade Mixed as Treasury Yields Drop Ahead of Potential Federal Government Shutdown": -0.5,
  "Electronic Arts Stock Is Rising. It’s Being Bought by This Group for $55 Billion.": 0.8,
  "CSX Names New CEO, Continues to Expect Full-Year Volume Growth": 0.5,
  "Warner Bros. Wins Weekend With $48.5 Million Haul": 0.8,
  "Semiconductor Stock Could Stage a Short-Term Breakout": 0.5,
  "Why AppLovin Stock Is Jumping Today?": 0.5,
  "Comcast promotes Michael Cavanagh to co-CEO amid restructuring": 0.2,
  "Warner Bros. Discovery Stock Falls On Doubts Over Friendly Paramount Tie-Up": -0.6,
  "AppLovin Stock Rides Wave of Price-Target Hikes to a Record High": 0.8,
  "Comcast Names Michael Cavanagh as Co-Chief Executive": 0.2,
  "Saudi Plans for Video-Game Hub Grow With $55 Billion EA Deal": 0.6,
  "Comcast (CMCSA) Faces Connectivity Investment Pressure but Shows Third-Quarter Revenue Beats": 0.5,
  "Regeneron (REGN) Gains Attention With Successful Phase 3 Garetosmab Trial for Rare Disease": 0.8,
  "Why Is Shopify (SHOP) Stock Rocketing Higher Today": 0.5,
  "The Trade Desk (TTD) Shares Skyrocket, What You Need To Know": 0.8,
  "Delta, Comcast, and 4 More Stocks to Play the Experience Economy. There’s ‘Surprising Demand.’": 0.5,
  "OpenAI takes on Google, Amazon with new agentic shopping system": 0.5,
  "Sector Update: Tech Stocks Mixed Late Afternoon": 0.0,
  "Sector Update: Consumer Stocks Mixed Late Afternoon": 0.0,
  "Starbucks is closing 434 stores in a single quarter": -0.7,
  "AMZN and GOOGL's Anthropic investment paying off: MSFT adds Anthropic AI models to Copilot // Global Expansion - **Microsoft brings Anthropic AI models to 365 Copilot, diversifies beyond OpenAI** https://www.reuters.com/business/microsoft-brings-anthropic-ai-models-365-copilot-diversifies-beyond-openai-2025-09-24/ \"Microsoft (MSFT.O) said on Wednesday it will integrate artificial intelligence models from Anthropic into its Copilot assistant, signaling the software giant's push to reduce dependence on its high-profile partnership with ChatGPT maker OpenAI.\" \"Anthropic’s AI models are primarily hosted on Amazon Web Services (AMZN.O), a": 0.6,
  "ImmuCell Announces Selection of its Next President and CEO": 0.5,
  "OpenAI Says Users Can Now Shop for Etsy Products on ChatGPT": 0.2,
  "OpenAI Launching Instant Checkout, Working with Etsy(+16%) and Shopify(+6%), threatening Google(-1.2%) Search's core revenue stream. - https://openai.com/index/buy-it-in-chatgpt/ One common argument on here is that Google's business model is not threatened by OpenAI, because the highest value searches (shopping related ones) are still done through Google, whereas OpenAI is capturing lower value queries. So while people turn to LLMs for general questions, they still use Google for online shopping and click on sponsored ads. Most importantly,": 0.2,
  "Newest S&P 500 Stock Is Index's Biggest Winner In 2025": 0.8,
  "Why CSX (CSX) Stock Is Trading Up Today": 0.5,
  "CSX Stock Pops as CEO Loses His Job. This Is Why.": 0.5,
  "GSK Leaps Into Buy Zone On Surprise Departure Of CEO Emma Walmsley": 0.5,
  "CrowdStrike, IBD Stock Of The Day, Aims For Leadership In AI-Driven Cybersecurity": 0.8,
  "Heard on the Street Recap: The Art of the Deal": 0.0,
  "Stock Market Today: Dow Up Despite Shutdown Worries; These Stocks Fall On Trump Tariff Threat": -0.5,
  "Equities Edge Higher in Choppy Trade; Potential Government Shutdown in Focus": 0.1,
  "Jim Cramer Says “It’s Too Early To Buy” lululemon athletica (LULU)": -0.5,
  "Constellation Energy (CEG) Has To “Cool Off,” Says Jim Cramer": 0.1,
  "American Electric Power (AEP)’s Stock Looks Very Much Like Intel’s, Says Jim Cramer": 0.5,
  "Why EA Is Ready to Quit Wall Street’s Game": 0.1,
  "Stocks to Watch Recap: Electronic Arts, Lockheed Martin, Carnival, Alibaba": 0.0,
  "International Business Machines Corporation (IBM)’s Quantum Computing Could “Reinvent Finance,” Says Jim Cramer": 0.6,
  "Micron Technology (MU)’s An Example Of The Good Thrown Out With The Bad, Says Jim Cramer": 0.2,
  "Why Investors Were Piling Into Shopify Stock Today": 0.5,
  "Why Constellation Energy Stock Inched Higher Today": 0.2,
  "Why ASML (ASML) Outpaced the Stock Market Today": 0.5,
  "MercadoLibre (MELI) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "Warner Bros. Discovery (WBD) Stock Falls Amid Market Uptick: What Investors Need to Know": -0.2,
  "Kraft Heinz (KHC) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Booking Holdings (BKNG) Stock Dips While Market Gains: Key Facts": -0.5,
  "Diamondback Energy (FANG) Stock Falls Amid Market Uptick: What Investors Need to Know": 0.1,
  "Robinhood jumps 12% to record high on surge in prediction-market trading - No paywall: [https://finance.yahoo.com/news/robinhood-shares-climb-12-growth-195618911.html](https://finance.yahoo.com/news/robinhood-shares-climb-12-growth-195618911.html) Robinhood Markets Inc. shares rose over 12% after Chief Executive Officer Vladimir Tenev said the online-stock brokerage has made strong inroads into prediction markets, where people wager on elections, sporting matches and other widely followed events. The executive said in a post on X on Monday that Robinhood customers have now transacted more than 4 billion of such event contracts,": 0.8,
  "Why EA's $55B Saudi deal is 'a head-scratcher'": -0.5,
  "OpenAI’s New Sora Video Generator to Require Copyright Holders to Opt Out": -0.2,
  "Why Investors Were Barking for Datadog Stock Today": 0.5,
  "Wolfspeed exits Chapter 11 bankruptcy, slashes debt and interest costs": 0.8,
  "MercadoLibre Launches B2B Unit to Capture Expanding Latin American Market": 0.8,
  "Comcast Spin-Off Versant Heads for Nasdaq Debut": 0.5,
  "Agoda Highlights the Spirit of Hokkaido Ahead of Video Game Release": 0.5,
  "(Item 2.02) Results of Operations and Financial Condition On September 30, 2025, Paychex, Inc. (the \"Company\") issued a press release (the \"Press Release\") reporting its financial results for the three months ended August 31, 2025. A copy of the Press Release is attached as Exhibit 99.1 to this Current Report on Form 8-K. The information provided pursuant to this\n\n(Item 2.02) , including Exhibit 99.1, is being \"furnished\" herewith and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities under such section, nor shall the information be deemed to be incorporated by reference into any filing of the Company under the Securities Act of 1933, as amended, or the Exchange Act, except to the extent specifically provided": 0.1,
  "(Item 8.01) Other Events. Adjustment to Dividend Rate on Variable Rate Series A Perpetual Stretch Preferred Stock On September 30, 2025, Strategy Inc (the “Company”) increased the regular dividend rate per annum on the Company’s Variable Rate Series A Perpetual Stretch Preferred Stock from 10.00% to 10.25% effective for monthly periods commencing on or after October 1, 2025. The Company announced this new rate via its website, www.strategy.com/strc. Cash Dividend Declaration On September 30, 2025, the Company": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (b) On September 24, 2025, Carlos A. Rodriguez, a member of the Board of Directors of Microsoft Corporation (the “Company”), informed the Company of his decision not to stand for re-election at the Company’s 2025 annual shareholder meeting (the “Annual Meeting”). Mr. Rodriguez will continue to serve as a director until the Annual Meeting. His decision": -0.2,
  "Review Preview: What Shutdown? Stocks Rise.": 0.5,
  "3 Growth Stocks to Invest $1,000 Right Now": 0.5,
  "Don’t See This Crypto as a Risk? ‘You’re Dumb,’ According to Dave Ramsey": -0.7,
  "M&A deals top $1tn in third quarter": 0.5,
  "2 Reasons to Like CDNS (and 1 Not So Much)": 0.5,
  "2 Software Stocks with Promising Prospects and 1 We Ignore": 0.5,
  "2 Growth Stocks to Stash and 1 Facing Headwinds": 0.2,
  "1 Cash-Producing Stock Worth Your Attention and 2 We Brush Off": 0.2,
  "2 S&P 500 Stocks with Competitive Advantages and 1 Facing Headwinds": 0.2,
  "1 Large-Cap Stock to Research Further and 2 We Find Risky": 0.2,
  "3 Volatile Stocks to Consider Right Now": 0.2,
  "Citizens JMP Stays Bullish on CrowdStrike (CRWD) as AI Takes Center Stage": 0.6,
  "5 Must-Read Analyst Questions From Micron’s Q3 Earnings Call": 0.2,
  "Big Pharma’s retreat: Is NHS pricing behind investor pullbacks?": 0.1,
  "Amazon, Apple, Meta probed by Senate panel over H-1B visa hiring": -0.5,
  "How could EA's go-private deal impact the video game industry?": 0.0,
  "Omdia: 5G Standalone Networks and RedCap Devices Poised to Transform IoT Landscape in 2025": 0.6,
  "Heard on the Street Monday Recap: The Art of the Deal": 0.2,
  "JPMorgan’s $20 Billion EA Deal Marks Win Over Private Credit": 0.6,
  "Will the first fibromyalgia drug in 15 years deliver a breakthrough in pain?": 0.5,
  "AppLovin Stock: Is the AI-Advertising Stock a Buy, Sell, or Hold?": 0.2,
  "Staying put in Vietnam, furniture exporters bet US consumers will absorb tariff blow": 0.2,
  "3 AI Stocks Perfect for Gen Z Investors to Add to Their Portfolios": 0.5,
  "Cisco Systems Inc. (CSCO) Opens New Austin Office to Showcase Workplace Technologies": 0.5,
  "PepsiCo, Inc. (NASDAQ:PEP) Joins Step Up for Agriculture to Accelerate Regenerative Farming": 0.5,
  "Bank of America Securities Initiates Atlassian Corporation (TEAM) With Hold Rating": 0.2,
  "Arm Holdings (ARM) Announces Arm Lumex Platform": 0.5,
  "Contact Center Software Market Industry Trends and Global Forecasts to 2035: From Cisco to Microsoft - Contact Center Software Market Set for Major Growth Through 2035": 0.8,
  "Why Costco Stock Dropped After Earnings": -0.5,
  "Nike Is Partnering With Kim Kardashian to Take on Lululemon. Can It Make the Stock a Winner?": 0.5,
  "Prediction: Costco Will Be Worth More Than Wall Street Analysts Expect in 10 Years": 0.6,
  "PepsiCo splashes into dirty soda with new Mountain Dew flavor": -0.6,
  "Did Elon Musk Just Say \"Checkmate\" to Amazon?": 0.2,
  "Kroger expands grocery delivery partnership with DoorDash": 0.5,
  "r/Stocks Daily Discussion & Technicals Tuesday - Sep 30, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on technical analysis (TA), but if TA is not your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly": 0.2,
  "These 2 AI stocks stand out as supply chain winners, says KeyBanc": 0.6,
  "The 3 AI ETF Plays That Could Outperform the Market in 5 Years": 0.5,
  "Costco Earnings Are in -- Here's What's Working for the Company": 0.5,
  "CG Developers Global announces signing with Marriott International and the launch of the first JW Marriott Residence in Dubai": 0.8,
  "Zacks.com featured highlights include Micron Technology, StoneCo, PagSeguro Digital and Daktronics": 0.2,
  "Vibe.co Raises $50M Series B to Bring AI-Powered, Hyper-Targeted Advertising to TV": 0.8,
  "3 Reasons to Buy (and 2 Reasons to Sell) the Only \"Ten Titans\" Stock That's Underperforming the S&P 500 Over the Last 5 Years": 0.2,
  "Ore-Ida® Introduces \"CrouTots\" - A Golden, Crispy Twist on the Classic Salad Topping": 0.6,
  "Down 66%, Is Lululemon Stock Finally a Buy?": 0.2,
  "Etsy shares soar 16% after OpenAI partnership on ChatGPT payment": 0.8,
  "EA’s $55 Billion Buyout Sets New ‘Going Private’ High Score": 0.5,
  "Genmab Strikes $8 Billion Deal for Cancer Treatment Maker Merus": 0.5,
  "Never Mind the Shutdown. The Case for Stocks Rallying in the Fourth Quarter.": 0.6,
  "Jim Cramer Discusses Starbucks (SBUX)’s Big Turnaround In Detail": 0.6,
  "Should You Buy Shopify Stock Now or Wait for a Dip?": 0.2,
  "NMPA approves Eisai and Biogen for Leqembi IV maintenance dosing": 0.5,
  "The Resource Management Institute Launches its New Resource Management Academy": 0.5,
  "Texas Instruments' (NASDAQ:TXN) investors will be pleased with their decent 46% return over the last five years": 0.8,
  "Should You Buy Intuitive Surgical Stock Before Oct. 21?": 0.1,
  "Mizuho launches U.S. internet coverage, names Meta a favorite and backs Airbnb": 0.5,
  "2 Beaten-Down Stocks to Buy and Hold for a Decade": 0.5,
  "Stocks Fall Pre-Bell as Potential US Government Shutdown Concerns Rise": -0.8,
  "This Week In Energy Transition - Sarawak's Solar Energy Leap Powers Green Data Transformation": 0.8,
  "3 Stocks That Could Be Trading Below Estimated Fair Value": 0.5,
  "Europe's Largest DAT BTCS Targets $100M Series G To Break Out of MicroStrategy Model": 0.2,
  "SP500 & Company Acquisitions - When a company in the SP500 purchases another company in the SP500, is that good or bad for investors? Likewise, when a private company purchases an SP500 company? Recent examples of both include Microsoft gobbling up Activision and the opposite of the Saudi's purchasing EA. You'd think that combining SP500 companies would be good because another company can enter the SP500.. thoughts?": 0.5,
  "Posthaste: Why the Bank of Canada could cut more than expected — much more": 0.5,
  "Pinnacle Group Wins Innovation Award at Workday Rising": 0.8,
  "Jacob Elordi on Becoming Frankenstein's Creature and More": 0.0,
  "One Inc Expands Life Insurance Payments Ecosystem Through Partnership With Equisoft": 0.5,
  "CrowdStrike Appoints Amjad Hussain as Chief Resilience Officer": 0.5,
  "Is Fastenal Company's (NASDAQ:FAST) Recent Stock Performance Influenced By Its Fundamentals In Any Way?": 0.1,
  "Palantir Nears All-Time High As Three Stocks Hover In Buy Zones": 0.5,
  "Duck Creek Technologies Announces 2025 Partner of the Year Award Winners": 0.5,
  "Analyst Explains Why He Likes ASML (ASML)": 0.5,
  "Is Lam Research (LRCX) The Best AI Semiconductor Stock to Buy Now?": 0.5,
  "Analyst Highlights the Nvidia Link in Micron (MU) Business, Says It’s ‘The Most Important Takeaway’": 0.6,
  "What Makes MercadoLibre (MELI) an Attractive Financial Model?": 0.5,
  "Verisk Introduces New AI Tools to Streamline the Property Claims Experience": 0.5,
  "Amanda Nolen joins Totara as Non-Executive Director": 0.5,
  "Paychex, Inc. Reports First Quarter Results": 0.0,
  "Verisk Names Saurabh Khemka President of Underwriting Solutions": 0.5,
  "If You Invested $1000 in Lam Research a Decade Ago, This is How Much It'd Be Worth Now": 0.5,
  "Amgen to expand US drug production with $650M investment": 0.8,
  "Paychex (NASDAQ:PAYX) Reports Q3 In Line With Expectations But Stock Drops": -0.5,
  "Yelp Names DoorDash its Preferred Partner to Expand Delivery Access Nationwide": 0.6,
  "Bringing Autonomy to Accuracy: DoorDash Launches SmartScale for Smarter Deliveries": 0.6,
  "Supernova raises $9.2 million to bring vibe-coding to professional product teams": 0.6,
  "Comcast Deploys Ciena Technology to Extend Fiber Impact": 0.5,
  "DoorDash unveils Dot, its autonomous robot built to deliver your food": 0.6,
  "DoorDash rolls out creator program for short-form videos, adds AI features and dine-in rewards": 0.5,
  "Zillow’s Ongoing Mass Infringement of CoStar Group’s Intellectual Property": -0.8,
  "PayPal Continues to Shape Agentic Commerce with Instant Product Discovery": 0.6,
  "DoorDash Unveils DashMart Fulfillment Services: A New Model for Retail Growth": 0.6,
  "Adobe Premiere Now Delivers Fast, Pro-Quality Video Editing on Mobile": 0.8,
  "Netflix, Inc. (NFLX) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "I saw a couple of big banks dropped coverage on WRD, anyone here following them? - BOCI put out their first note with a Buy on it with a $20 PT. they're bullish on the whole L2 to L4 tech driving, and think wrd has a first-mover edge since it's literally the only L4 company licensed in 7 countries. their math is basically DCF and fleet expansion, calling it undervalued vs peers. current price $10,": 0.6,
  "Investors Heavily Search Micron Technology, Inc. (MU): Here is What You Need to Know": 0.5,
  "Calculating The Fair Value Of MercadoLibre, Inc. (NASDAQ:MELI)": 0.1,
  "Stocks making big moves yesterday: Beyond Meat, The Trade Desk, Guardant Health, PayPal, and Tilray": 0.5,
  "Lululemon Athletica (LULU) Slid Amid Sales Slowdowns": -0.5,
  "Dash Forward 2025: Delivering The Future of Local Commerce": 0.5,
  "Wurl’s New CTV Study Shows Strong Growth in Free Streaming Channel Audiences and Expanding Opportunities for Advertisers": 0.8,
  "The Alliance for Smart Healthcare Excellence Teaming with Zscaler to Launch Development of Zero Trust Maturation Model (ZTMM) to Safeguard Smart Care": 0.5,
  "Celsius upgraded to Overweight at Morgan Stanley on growth momentum": 0.8,
  "Paychex Ups Earnings Outlook, Shrugging Off Concerns About Stagnant Macro": 0.6,
  "DoorDash Launches Going Out, Adding Reservations and In-Store Rewards to the App": 0.5,
  "Seagate Technology Holdings PLC (STX) Hits Fresh High: Is There Still Room to Run?": 0.5,
  "Kevin O'Leary Says 'I Never Buy a Frappe Latte Blah Blah Blah' – Calls Fancy Coffee A 'Waste of Money For Something That Costs 20 Cents'": -0.8,
  "Company News for Sep 30, 2025": 0.0,
  "DoorDash Unveils Dot, the Delivery Robot Powered by its Autonomous Delivery Platform to Accelerate Local Commerce": 0.5,
  "Instacart downgraded to Neutral at BTIG on negative competitive developments": -0.7,
  "Is Lululemon's Valuation Justified?": 0.0,
  "Earnings Growth & Price Strength Make Shopify (SHOP) a Stock to Watch": 0.8,
  "Is ABCELLERA BIOLG (ABCL) Stock Outpacing Its Medical Peers This Year?": 0.2,
  "Here's Why Micron (MU) is a Strong Value Stock": 0.6,
  "Paychex: Fiscal Q1 Earnings Snapshot": 0.0,
  "CoreWeave initiated, Instacart downgraded: Wall Street's top analyst calls": -0.5,
  "OpenAI partners with $ETSY... Is $STUB StubHub next? - On the heels of OpenAI integrating $ETSY I just picked up shares of $STUB StubHub as I beleive we will see deeper integration into OpenAI. \"Operator⁠ transforms AI from a passive tool to an active participant in the digital ecosystem. It will streamline tasks for users and bring the benefits of agents to companies that want innovative customer experiences and desire higher rates of conversion. We’re": 0.6,
  "Digitally Empowering Communities in India With Cisco and Indus Action": 0.5,
  "Can AI-Driven IoT Unlock a Long-Term Growth Path for Comcast?": 0.5,
  "Why Warner Bros. Discovery (WBD) is a Top Momentum Stock for the Long-Term": 0.6,
  "Paychex edges past profit estimate, revenue inline": 0.5,
  "Deliveroo’s £2.9bn takeover by US firm DoorDash approved at High Court": 0.5,
  "Booking Holdings to Webcast Third Quarter 2025 Financial Results on October 28": 0.0,
  "Paychex's higher first-quarter expenses cloud profit forecast boost": -0.5,
  "Paychex Q1 Earnings & Revenues Surpass Estimates, Increase Y/Y": 0.8,
  "Palantir Gotham Powers Next-Gen Data Intelligence and Operations": 0.5,
  "Tesla plans to mass-produce humanoid robots by 2026, Musk eyes $1M units annually by 2030 + $1T pay package - Tesla announced that its third-generation humanoid robot will launch in late 2025, with mass production beginning in 2026. Elon Musk projects production could scale to 1 million robots annually before 2030. At the same time, Tesla’s board proposed a new compensation package for Musk, valued at up to $1 trillion, tied to achieving 12 ambitious": 0.5,
  "Uber and DoorDash Are the Leaders in Ride-Hailing and Delivery. Buy the Stocks, Says Analyst.": 0.6,
  "Spotify stock drops after Daniel Ek says he’ll step down as CEO in 2026": -0.5,
  "Paychex CEO Confident In Future Growth As Paycor Deal Shows Early Success": 0.8,
  "Microchip Broadens Offerings With Robust Portfolio Expansion": 0.8,
  "Analysis-AstraZeneca's US listing may pull other firms from London in its wake": 0.2,
  "Comparably Announces 2025 Happiest Employees, Best Perks & Benefits, and Work-Life Balance Awards": 0.8,
  "AppLovin Corporation (APP): A Bull Case Theory": 0.5,
  "Global-E Online Ltd. (GLBE): A Bull Case Theory": 0.5,
  "Kushner’s Secret Saudi Talks Paved Way for $55 Billion EA Deal": 0.5,
  "Netflix, Inc. (NFLX): A Bull Case Theory": 0.5,
  "Starbucks Corporation (SBUX): A Bull Case Theory": 0.5,
  "NIKE, Inc. (NKE): A Bull Case Theory": 0.5,
  "Adobe Inc. (ADBE): A Bull Case Theory": 0.5,
  "Micron Technology, Inc. (MU): A Bull Case Theory": 0.5,
  "Paychex (PAYX) Tops Q1 Earnings and Revenue Estimates": 0.8,
  "Electronic Arts' Takeover by Saudi PIF Seen Unlocking Mobile, Ultimate Team Growth, Wedbush Says": 0.5,
  "Silver Lake Finally Sealed a Dream Deal. Jared Kushner Was Key.": 0.5,
  "Paychex Affirms Revenue Outlook, Lifts Earnings View Following Quarterly Results": 0.8,
  "DailyPay Appoints Accomplished Technology and Product Leader Poulomi Damany As Chief Product Officer": 0.8,
  "Paychex (PAYX) Q1 Earnings: Taking a Look at Key Metrics Versus Estimates": 0.5,
  "European Equities Traded in the US as American Depositary Receipts Edge Higher in Tuesday Trading": 0.5,
  "Procare Solutions Appoints Sam Loveland as Chief Customer Officer": 0.5,
  "AI-Fixated Traders Pile Into Teradyne, Other Obscure Chip Stocks": 0.2,
  "Which Uranium company would you invest in? Cameco Corp, NexGen Energy Ltd, Denison Mines Corp - Currently researching onto Uranium stocks and came across these with only Cameco currently being a producer. I had URG on the list but it seemed too volatile. Anyway, if anyone has some thoughts I'd love to hear.": 0.2,
  "Nvidia Stock Is on Pace for a Record High. Can It Keep Its Lead Over AMD?": 0.5,
  "Shopify jumps 6% after it inks OpenAI deal for over one million merchants to sell on ChatGPT": 0.8,
  "Summer Robotics Raises Series A Financing led by Applied Ventures, LLC": 0.5,
  "Unbundling still the most likely path from here for Warner: BofA": 0.2,
  "Apple, Warner Bros. Discovery, Celsius: Top Analyst Calls": 0.5,
  "Impact of news coverage on the market - I am a relatively new Bloomberg TV watcher, and I've noticed that all they concentrate on are the stocks that are going up. Things are constantly \"SOARING\" and I see very little coverage of the things that are struggling. Would you agree? What impact do you think this has on the market, or on investors in general?": -0.4,
  "Venmo and PayPal users will finally be able to send money to each other": 0.8,
  "What’s been up with RDDT lately - Reddit (RDDT) stock went down from 270 to 240 last week and went down another 6.21% to around 226.95 at the time of making this post. I didn’t see any specific news that explains this dip so I’m confused, does anyone see an explanation for this? Or is the stock just retreating from a really expensive point. Where do we think it’s gonna be by earnings on October": -0.5,
  "Billionaire Tim Draper predicts only one asset will rule retail": 0.5,
  "Cisco Unveils Advanced AI-Powered Webex Contact Center Solutions and Industry Integrations": 0.6,
  "Cisco Introduces Agentic Capabilities for Next-Generation Collaboration": 0.5,
  "All You Need to Know About Honeywell International (HON) Rating Upgrade to Buy": 0.6,
  "Lam Research (LRCX) Is Up 1.11% in One Week: What You Should Know": 0.5,
  "Brex to accept stablecoins as payment": 0.5,
  "Reuters: \"US SEC chair fast-tracks Trump push to end quarterly earnings reports\" (SEC Chair Paul Atkins hoping to release proposal in ~3 mo) - Per [Reuters](https://www.reuters.com/business/us-sec-chairman-atkins-vows-fast-track-scrapping-quarterly-corporate-reports-ft-2025-09-29/) on September 30, 2025: > Sept 29 (Reuters) - Paul Atkins, chair of the U.S. markets watchdog, said on Monday the regulator is fast-tracking President Donald Trump's push to scrap quarterly earnings reports, raising transparency concerns around the potentially major shift for U.S. companies. Trump's desired change , opens": 0.1,
  "Israeli high-tech funding and M&A gain in 2025 despite ongoing Gaza war": 0.2,
  "PayPal’s Honey to integrate with ChatGPT and other AIs for shopping assistance": 0.5,
  "Exxon Mobil to cut 2,000 jobs in global consolidation push as oil prices weigh on energy sector - No paywall: [https://finance.yahoo.com/news/exxon-mobil-laying-off-2-155157011.html](https://finance.yahoo.com/news/exxon-mobil-laying-off-2-155157011.html) # Key Takeaways * Exxon Mobil will eliminate 2,000 positions as it consolidates its global operations. * The oil giant said combining smaller locations into regional hubs would improve efficiencies by bringing employees together.": -0.5,
  "CoreWeave jumps 12% after $14B Meta deal fuels AI data center demand - No paywall: [https://finance.yahoo.com/news/coreweave-stock-surges-as-reported-14-billion-meta-deal-signals-limitless-ai-demand-142356584.html](https://finance.yahoo.com/news/coreweave-stock-surges-as-reported-14-billion-meta-deal-signals-limitless-ai-demand-142356584.html) CoreWeave (CRWV) stock jumped more than 14% Tuesday after Bloomberg reported that the company has inked a $14.2 billion deal with Meta (META). CoreWeave, the Nvidia-backed (NVDA) AI data center operator, will provide Meta access to Nvidia's GB300 server racks, which contain 72 of the chipmaker's Blackwell AI GPUs (graphics processing units).": 0.8,
  "Netformx® Officially Launches AssetXpert™, Empowering Cisco Partners with Flexible Network Discovery and Actionable Insights": 0.6,
  "AI coding startup Vercel raises $300 million, valued at $9.3 billion": 0.6,
  "Pfizer Gets Three-Year Grace Period From Trump Pharma Tariffs - Bloomberg) -- Pfizer Inc. Chief Executive Officer Albert Bourla said the company secured a three-year grace period from President Donald Trump’s promised tariffs on pharmaceuticals in a deal that would lower some of its US drug prices. The company will sell some products at a 50% average discount on a direct-to-consumer website called TrumpRx, an initiative intended to allow Americans to pay cash for drugs": 0.5,
  "/C O R R E C T I O N -- Summer Robotics/": 0.0,
  "Cathie Wood Space Fund Buys This Dow Stock, Trims Its Largest Holding": 0.2,
  "Why Instacart (CART) Stock Is Falling Today": -0.5,
  "Why Paychex (PAYX) Stock Is Down Today": -0.5,
  "A comprehensive list of 2025 tech layoffs": -0.5,
  "Cisco Stock Moves Higher As Analysts Raise Target Prices - Short Put Plays Work Here": 0.6,
  "Minimal Shifts in U.S. Small Business Employment in September": 0.0,
  "CSX Replaces CEO Amid Merger Pressure from Activist Investor": -0.5,
  "Stocks of possible M&A targets have been crushing the market. Goldman says these 6 are the most likely to get bought.": 0.8,
  "Why Paychex Stock Fell on Tuesday": -0.5,
  "Q3 wrap-up: Top stock performers & 2 reasons for a bullish Q4": 0.8,
  "Why Copart (CPRT) Could Be an Unusual Options Sleeper to Watch Closely": 0.5,
  "High Growth Tech Stocks In The US For September 2025": 0.5,
  "Electronic Arts Is Going Private. Is Another Big Video-Game Buyout in the Cards?": 0.2,
  "ASML's Mistral investment could augur more European tech collaborations, Le Maire says": 0.5,
  "After A 102% Rip Higher In 2025, Is Micron Technology Stock Delivering A New Buy Point Soon?": 0.2,
  "Jim Cramer Shares Very Important Analysis About Oracle Corporation (ORCL)": 0.5,
  "AI hires or human hustle? Inside the next frontier of startup operations at TechCrunch Disrupt 2025": 0.5,
  "New Social Casinos 2025: High 5 Casino Voted Leading New Casino": 0.6,
  "Jim Cramer Says He Has Been Recommending American Electric For Multiple Years": 0.5,
  "Jim Cramer on Costco: “It’s Time to Start Buying the Best Retailer on Earth”": 0.8,
  "BofA Maintains Cautious Stance on Marvell Technology (MRVL), Cites Growth Challenges": -0.5,
  "GlobalFoundries (GFS) Partners with Egis Technology to Drive Advanced Smart Sensing Innovation": 0.6,
  "Spotify founder steps down from CEO role - \"Spotify said Tuesday that founder Daniel Ek is stepping down as CEO to become the executive chairman, in an announcement that sent its shares sliding in Tuesday trading. The Stockholm-based streaming giant said Ek will be replaced by two lieutenants who will become co-CEOs: Chief Product and Technology Officer Gustav Söderström and Chief Business Officer Alex Norström. The pair, who are also currently copresidents, will transition into": -0.5,
  "Dow Jones Software Giant Microsoft Stock Approaches Latest Buy Point": 0.5,
  "what was the most helpful resource or strategy to learning the market? - hey all, i run a pretty successful ecommerce business, that being said i have a lot of free time throughout the mornings where i’m not doing anything other than watching some graphs. i’d like to learn to trade, no i am NOT buying your course, just looking for what strategies and resources have helped you the most. i do crypto, though not": 0.2,
  "Who Bought EA? The Investors Behind The $55B Takeover": 0.1,
  "Broadcom Inc. (AVGO) Posts $15.95B Q3 Revenue, AI Segment Surges 63%": 0.5,
  "AI’s Winners Aren’t All in Tech. 22 Cheaper Stocks to Consider.": 0.5,
  "What Do Analysts Think About Gilead Sciences (GILD)?": 0.0,
  "Bank of America Securities Maintains a Sell Rating on Amgen (AMGN)": -0.5,
  "Why PayPal (PYPL) Stock Is Falling Today": -0.5,
  "Why Atlassian (TEAM) Stock Is Trading Lower Today": -0.5,
  "Marvell Technology, Inc. (MRVL) Releases Q2 FY2026 Results": 0.0,
  "Lam Research Unveils VECTOR TEOS 3D": 0.2,
  "On Semiconductor Corporation (ON) Announces Revenue For The Second Quarter Of 2025": 0.5,
  "Deca and Silicon Storage Technology Announce Partnership To Enable NVM Chiplet Solutions": 0.5,
  "Applied Materials, Inc. (AMAT) Reports Q3 FY2025": 0.0,
  "NXP Semiconductors Declares Quarterly Dividend": 0.0,
  "QCraft Globalizes With European HQ And Collaborates With Qualcomm": 0.5,
  "Morgan Stanley Reduces Texas Instruments Incorporated (TXN)’s Price Target": -0.5,
  "The athleisure stock investors have 'almost forgotten' about": 0.1,
  "Jared Kushner’s firm and the Saudis are taking video game maker EA private in a massive deal": 0.2,
  "Why Investors Are Watching Marqeta (MQ) After Recent Leadership Changes": 0.5,
  "Starbucks Closed Over 450 Stores This Week—Is Your Favorite Location on the List?": -0.5,
  "Are we ignoring political risk to AI companies that will arise because of rising unemployment of white collar workers? - Right now the only way AI companies can make money is by automating white collar work. There is already a huge rise in unemployment of college grads compared to past 30 years trend. I see everyone saying that AI may be a bubble or not a bubble but nobody is talking about what if populist": -0.6,
  "From Riyadh to Silicon Valley: How EA became the jewel of Saudi Arabia's gaming vision": 0.5,
  "If a big company buys majority shares of another company does it get the revenue/profits from now on? - I'm really confused how stock ownership works in the big scale. Individuals buying shares through a brokerage (Fidelity for example) only gain money when the price of the stock goes up or from dividends. When a company buys let's say 30% of shares of another it has large voting rights but not royalties or revenue yet.": -0.2,
  "CRM Salesforce - What are you guys thoughts on salesforce it looks like it’s getting beat up. Pretty good maybe a good time to get in. I haven’t used the product and that’s usually a big important factor for me especially when buying a software company. I’m really just looking at it from a swing trade perspective. Does anyone have any thoughts? Are there any major risks? Are there new companies coming in that could": 0.2,
  "Wall Street Gets Pumped Up About GE Vernova. Here's Why.": 0.8,
  "Personal Capital Founder Bill Harris Launches AI-Backed RIA": 0.5,
  "Viper Energy, Inc., a Subsidiary of Diamondback Energy, Inc., Schedules Third Quarter 2025 Conference Call for November 4, 2025": 0.0,
  "Diamondback Energy, Inc. Schedules Third Quarter 2025 Conference Call for November 4, 2025": 0.0,
  "Regeneron to Report Third Quarter 2025 Financial and Operating Results and Host Conference Call and Webcast on October 28, 2025": 0.0,
  "Repligen, BrightSpring Health Services, Danaher, Thermo Fisher, and Amgen Shares Skyrocket, What You Need To Know": 0.8,
  "These Were the S&P 500’s Best and Worst Stocks in the Third Quarter": 0.2,
  "Hackers Take Advantage of an Undiscovered Flaw in Cisco Systems Inc. (CSCO)’s Adaptive Security Appliance 5500-X Series Devices": -0.8,
  "Evercore ISI Reaffirms its Outperform Rating on Netflix Inc. (NFLX) with a $1,375 Price Target": 0.8,
  "OpenAI’s 'Infinite Slop' Moment: Backlash Mounts Over AI Shopping Push and Video App": -0.6,
  "Nvidia Stock Manipulation - Edit: if you ever wanted to know when to buy a stock or sell, just look to see if the comments are greedy or fearful. Sentiment changes fast from my post not too long ago where I was also mocked for saying 230 in an AI bubble is unrealistic Recently I made a bold post,I claimed Nvidia would hit 230 by year end…. It’s possible but after today I’m disgusted by": -0.6,
  "Celsius Stock In Buy Zone After Upgrade; PepsiCo Deal Reenergizes Growth": 0.8,
  "Pfizer Stock Soars on Trump’s New Drug Pricing Plan. Here’s Why.": 0.8,
  "Broadcom Inc. (AVGO) CEO Tan Hock E. Sells 100,000 Shares for About $34 Million": -0.5,
  "Cantor Fitzgerald Raises its Price Target on MercadoLibre, Inc. (MELI) to $2,900 with an Overweight Rating": 0.8,
  "Datadog Inc. (DDOG) Director Amit Agarwal Sells 49,208 Shares Worth About $10.6 Million; Stifel Maintains a Hold Rating": -0.2,
  "The real flippening? Ethereum treasuries overtake Bitcoin": 0.5,
  "Paychex Inc (PAYX) Q1 2026 Earnings Call Highlights: Strong Revenue Growth Amidst Rising Expenses": 0.8,
  "Marvell Technology stock falls after TD Cowen downgrade on cloud visibility": -0.5,
  "Drug Manufacturers Help Push US Equity Indexes Higher While Government Shutdown Looms": 0.5,
  "Why MercadoLibre (MELI) Shares Are Sliding Today": -0.5,
  "Warren Buffett is reportedly eyeing Berkshire Hathaway's biggest deal in three years - https://www.cnbc.com/2025/09/30/warren-buffett-is-reportedly-eyeing-berkshire-hathaways-biggest-deal-in-three-years.html >Warren Buffett's Berkshire Hathaway is closing in on a deal to buy Occidental Petroleum's petrochemical unit OxyChem for roughly $10 billion, the Wall Street Journal reported Tuesday. >The potential deal, which could finalize within days per the Journal, could be Berkshire's largest since 2022 when it bought insurer Alleghany for $11.6 billion. That deal was announced in March of that year": 0.8,
  "Uber Technologies, Inc. (UBER) Expecting Non-Restaurant Deliveries To Reach $12.5 Billion in 2025, Bloomberg Report": 0.5,
  "UBS Raises AppLovin Corporation (APP)’s Price Target To $810, Maintains Buy Rating": 0.8,
  "Here Is Why Analysts Are Slashing Adobe Inc. (ADBE)’s Price Targets": -0.5,
  "Stocks end third quarter on high note as Dow clinches record, Big Tech extends gains as AI trade rolls on": 0.8,
  "Zillow drops 4% as FTC sues over alleged $100M deal paying Redfin to quit rental listings - No paywall: [https://finance.yahoo.com/news/ftc-accuses-zillow-paying-redfin-185136776.html](https://finance.yahoo.com/news/ftc-accuses-zillow-paying-redfin-185136776.html) >Zillow allegedly paid Redfin $100 million to stop competing against it in online apartment rental listings, the U.S. Federal Trade Commission said on Tuesday in a lawsuit against the online real estate platforms. >The agency said the alleged deal reduces competition in an already concentrated market and is likely to drive up the cost of": -0.6,
  "Treasury Eases Tax Rule That Threatened Strategy’s Bitcoin Pile": 0.2,
  "NBCUniversal-YouTube TV distribution fight highlights streaming's new power struggle": 0.1,
  "Starbucks store closings: 59 unionized locations on doomed list in company restructuring": -0.6,
  "Palantir, IonQ And More Entering Warren Buffett's 'Sweet Zone'? Expert Cites Patience Amid Pullbacks: 'Stocks Almost Always Retest 200-Day Averages'": 0.5,
  "PDD Holdings Inc. Sponsored ADR (PDD) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "The Trade Desk (TTD) Stock Falls Amid Market Uptick: What Investors Need to Know": 0.1,
  "Palantir Technologies Inc. (PLTR) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Starbucks (SBUX) Stock Dips While Market Gains: Key Facts": -0.5,
  "Cisco Systems (CSCO) Rises Higher Than Market: Key Facts": 0.5,
  "Lam Research (LRCX) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Intuit (INTU) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "Q3 sector performance, chipmakers & metals soar: Market takeaways": 0.5,
  "Intuitive Surgical, Inc. (ISRG) Rises Higher Than Market: Key Facts": 0.5,
  "Strategy (MSTR) Stock Falls Amid Market Uptick: What Investors Need to Know": -0.2,
  "KLA (KLAC) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "US Regulators Probe 200+ Firms Over Unusual Trading Ahead of Crypto-Treasury Deals": -0.5,
  "How to manage a good quality startup stock? - *EDIT: Clearly the word startup is causing confusion :) By startup, I am referring to a company that is in early stages, yet to prove / have a stable 'product' (but has proven its steps to get there), is growing fast, learning fast. This company is pre-revenue, publicly traded.* I'll leave out the stock name to avoid clouding judgement and personal preferences over industry, company, etc.": 0.2,
  "Why the World Is Suddenly Awash With a Wave of Co-CEOs": 0.1,
  "(Item 8.01) Other Events Attached as Exhibit 99.1 and incorporated by reference herein is a press release dated October 1, 2025, issued by Comcast Corporation.": 0.0,
  "(Item 8.01) Other Events On September 30, 2025, Solstice issued 5.625% Senior Notes due 2033 in an aggregate principal amount of $1 billion (the “ Notes ”), issued pursuant to an indenture dated September 30, 2025 among Solstice, the guarantors named therein, and Deutsche Bank Trust Company Americas, as trustee (the “ Indenture ”). The Notes were sold in private placements to qualified institutional buyers in accordance with Rule 144A under the Securities Act, and outside the": 0.1,
  "(Item 8.01) Other Events. Treasury and IRS Publish Interim CAMT Guidance On September 30, 2025, the Department of the Treasury (the “Treasury”) and the Internal Revenue Service (“IRS”) issued interim guidance (the “Interim Guidance”) which, in relevant part, clarifies that a corporation may disregard unrealized gains and losses on its digital asset holdings when computing adjusted financial statement income (“AFSI”) for purposes of determining whether it is subject to the 15% corporate alternative minimum tax (“CAMT”) under": 0.1,
  "Huge News For Lululemon Stock": 0.8,
  "Why Last Week's Costco Earnings Have Me Excited": 0.8,
  "FRMI IPO has been priced at $21/share - Ticker FRMI (Fermi) IPO has been priced at $21 a share on Robinhood. Fermi is an REIT. Fermi is a Texas based energy tech company that is developing a hyper grid campus to integrate nuclear, natural gas, solar, wind, and battery power to deliver gigawatt scale electricity and Al data center infrastructure.": 0.5,
  "3 Surprising Details From Costco's Earnings Release": 0.2,
  "When and how does stock “manipulation” happen, if ever? - You’ve surely seen it on every website and forum you’ve been on, including Reddit, where people will claim a stock’s share price is being “manipulated” in various conspiratorial ways. I tend to assume that this is almost always nonsense, but I’m wondering which actual mechanisms exist for a stock to be “manipulated” by groups with huge amounts of money. Please help shed some educated light": 0.2,
  "I am still bullish on CAVA - I come in here to write up on a nice little stock I like to call CAVA. I just demoralized one of their Mediterranean bowls the other day, and when I was inside, some girl said, \"Why can't they open one up in Parksville?\" I almost said, don't worry shawty, eventually they will. CAVA has just reached its 52-week low and touched 25 on the RSI yesterday. Its": 0.6,
  "Qualcomm Achieves Complete Victory Over Arm in Litigation Challenging Licensing Agreements": 0.8,
  "BofA Reiterates Apple (AAPL) Buy Rating with $270 Target as Carrier Incentives Drive iPhone 17 Demand": 0.6,
  "AMD Expands AI Partnership With Cohere to Power Enterprise and Sovereign AI": 0.6,
  "Why Needham Raised Marvell’s (MRVL) Price Target From $80 to $95": 0.5,
  "How To Put $100 In Your Retirement Fund Each Month With Cintas Stock": 0.5,
  "Agoda Unveils Top Destinations for Traditional Music Lovers this International Music Day": 0.5,
  "Arm plans to appeal final ruling in Qualcomm dispute": 0.1,
  "Why Baker Hughes (BKR) is a Good Option to Invest in LNG": 0.6,
  "Unpacking Q2 Earnings: PayPal (NASDAQ:PYPL) In The Context Of Other Diversified Financial Services Stocks": 0.2,
  "Q2 Rundown: Microchip Technology (NASDAQ:MCHP) Vs Other Analog Semiconductors Stocks": 0.0,
  "3 Reasons NXPI is Risky and 1 Stock to Buy Instead": -0.5,
  "Government shutdown begins and its impact on economy. - * The shutdown could result, at least temporarily, in an estimated 900,000 federal workers being laid off. * Essential services such as Border protection, in-hospital medical care, law enforcement, and air-traffic control would be expected to continue to operate during the stoppage. * Social Security and Medicare cheques would still be sent out, but benefit verification and card issuance could stop. * Government employees deemed non-essential": -0.6,
  "Panic bought at peak levels - hold or minimize potential loss? - Helle investment gurus! So for a few weeks I had been warming up to buy stock in Nebius, and then yesterday it started spiking so what did I the inexperienced træder do do? Bought when it was at the highest, of course, so I didn't miss the train. So it obviously went down several dollars after i bought it which has made me": -0.6,
  "2 Nasdaq 100 Stocks on Our Watchlist and 1 We Brush Off": 0.2,
  "1 Cash-Producing Stock with Competitive Advantages and 2 We Question": 0.2,
  "2 Growth Stocks with All-Star Potential and 1 We Turn Down": 0.5,
  "1 Volatile Stock on Our Watchlist and 2 We Ignore": 0.0,
  "3 Market-Beating Stocks to Target This Week": 0.5,
  "1 Cash-Producing Stock with Competitive Advantages and 2 We Turn Down": 0.5,
  "How the Warehouse Store Won Retail—and How Sam’s Club Is Winning the Warehouse": 0.5,
  "PATH to Orchestration - This morning, ahead of their Fusion conference in Las Vegas, UiPath released some massive press releases. The common theme across all of them - UiPath is partnering with the biggest tech companies to ensure that UiPath's workflow orchestration system, called Maestro, is at the top of its game and able to connect with the best agents and data tools. They announced partnerships with Snowflake so that Snowflake's Cortex AI agent can": 0.8,
  "The 5 Most Interesting Analyst Questions From Cintas’s Q3 Earnings Call": 0.6,
  "PAYX Q3 Deep Dive: Integration Synergies and AI Investment Shape Outlook": 0.5,
  "Form 8.3 - Qualcomm Inc.": 0.0,
  "Intuit Announces Rapid Advancement of Proprietary GenAI Operating System, Custom Financial LLMs": 0.5,
  "DoorDash, Kroger Expand Partnership to Offer Full Grocery Delivery from All 2,700 US Stores": 0.8,
  "PayPal Sells $7B in US BNPL Receivables to Blue Owl Capital in Two-Year Agreement": 0.5,
  "Comcast, Harmonic Partner to Accelerate Fiber Broadband Expansion": 0.5,
  "Applied Materials, GlobalFoundries Partner to Build Photonics Waveguide Fab for AI in Singapore": 0.6,
  "Constellation Energy Elects Williams Executive Chairman Alan S. Armstrong to Board": 0.5,
  "Linde Names CEO Sanjiv Lamba as Chairman, Succeeds Retiring Steve Angel; Appoints Sean Durbin as COO": 0.2,
  "Qualcomm Announces Snapdragon 8 Elite Gen 5 Mobile Platform with Major AI, Performance Upgrades": 0.8,
  "Regeneron’s Evkeeza Receives FDA Approval to Treat HoFH in Children Aged 1 to Less Than 5": 0.8,
  "What’s your take on Oxy? - Especially after the news that Berkshire will acquire Oxy Chemical? Also, oil in 62$ doesn’t help the company nor the stock. Debt is critical. New CEO hasn’t made wonders. Long term bet with carbon-capturing and -storage?": -0.6,
  "Citi Lifts PT on Celsius Holdings (CELH) Stock": 0.5,
  "Qualcomm Achieves Complete Victory Over Arm in Litigation Challenging Licensing Agreements - Finally its over: [https://investor.qualcomm.com/news-events/press-releases/news-details/2025/Qualcomm-Achieves-Complete-Victory-Over-Arm-in-Litigation-Challenging-Licensing-Agreements/default.aspx](https://investor.qualcomm.com/news-events/press-releases/news-details/2025/Qualcomm-Achieves-Complete-Victory-Over-Arm-in-Litigation-Challenging-Licensing-Agreements/default.aspx) * ***U.S. District Court confirms Qualcomm’s December 2024 jury trial victory and rejects Arm’s remaining claims.*** * ***Final judgment entered in favor of Qualcomm and Nuvia.*** * ***Outcome further validates strength of Qualcomm’s architecture license and right to innovate.***": 0.8,
  "r/Stocks Daily Discussion Wednesday - Oct 01, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.2,
  "3 Growth Stocks to Invest $1,000 In Right Now": 0.5,
  "Stock Market Today: Stocks Tumble After Gov't Shutdown, Foreboding Sluggish Start to Q4": -0.8,
  "AstraZeneca’s at-home flu vaccine is a breakthrough that could pave the way for others": 0.8,
  "The Best AI Stock to Buy Right Now, According to a Wall Street Analyst (Hint: Not Nvidia or Palantir)": 0.2,
  "Etsy and Shopify Cozy Up With OpenAI's ChatGPT: What You Need to Know": 0.5,
  "The Zacks Analyst Blog Highlights Comcast, Amazon, Microsoft and Cisco": 0.5,
  "1 Top Tech Stock to Buy in October": 0.5,
  "The Newest Stock in the S&P 500 Is Obliterating Nvidia and Palantir This Year. Is It Too Late to Buy?": 0.2,
  "While the government is closed, jobs and inflation data go unreported": -0.5,
  "Bitcoin Kicks Off 'Uptober' With Break Above $116K as Crypto Equities Surge Pre-Market": 0.8,
  "Pharma Stocks in Europe Jump After White House Unveils Drug-Buying Site": 0.8,
  "AI PC Research Report 2025-2035: Market to Reach $992 Billion by 2035 at a CAGR of 32.16%, Driven by NVIDIA, Apple, AMD, Lenovo, Microsoft, Dell, HP, Fujitsu, ASUSTeK, Intel, and Huawei": 0.6,
  "Convatec to open new R&D hub in Manchester as part of £500m UK investment": 0.6,
  "Better AI Dividend Stock: Apple vs. Broadcom": 0.5,
  "Iron Overload Syndrome Market Report 2025-2035, Profiles of Chiesi Group, Novartis, PHARMACOSMOS, Protagonist Therapeutics, Regeneron Pharmaceuticals": 0.0,
  "Bull of the Day: PDD Holdings (PDD)": 0.2,
  "3 Reasons to Buy Intuitive Surgical Stock Near Its 52-Week Low": 0.5,
  "Kraft Mac & Cheese and PopUp Bagels Team up to Drop a New Limited-Edition Schmear": 0.2,
  "Private economic data is set to take on an even bigger role": 0.5,
  "Adobe's (NASDAQ:ADBE) Solid Earnings Are Supported By Other Strong Factors": 0.8,
  "What Is One of the Best AI Stocks to Own for the Next 5 Years?": 0.5,
  "Japanese Firm Metaplanet Acquires $623M in Bitcoin, Becomes 4th-Largest Corporate Holder": 0.6,
  "My Honest Take on Costco's Latest Earnings Report": 0.1,
  "Immatics Appoints Venkat Ramanan as Chief Financial Officer": 0.5,
  "Baker Hughes to Supply Liquefaction Train Equipment for Sempra Infrastructure’s Port Arthur LNG Phase 2 Project": 0.5,
  "HONEYWELL BOARD OF DIRECTORS SETS RECORD DATE AND ANNOUNCES EXPECTED TIMING FOR SPIN-OFF OF SOLSTICE ADVANCED MATERIALS": 0.5,
  "Plurilock Appoints Cybersecurity Veteran as Chief Technology Officer and General Manager of Critical Services Division": 0.5,
  "Profiting from Volatility: ARM Long Straddle Trade Setup": 0.5,
  "At US$275, Is Charter Communications, Inc. (NASDAQ:CHTR) Worth Looking At Closely?": 0.2,
  "Ford CEO says customers are not interested in $75,000 EVs": -0.5,
  "Honeywell International Insiders Sell US$1.5m Of Stock, Possibly Signalling Caution": -0.5,
  "IBM and AMD Collaborate with Zyphra on Next Generation AI Infrastructure": 0.5,
  "Meet the Monster Chip Stock Crushing Nvidia on the Market (Hint: It's Not Broadcom)": 0.5,
  "Taiwan rejects US proposal for 50-50 chip production split, TSMC to keep bulk of $165B operations in Taiwan despite Arizona expansion - No paywall: [https://finance.yahoo.com/news/taiwan-not-agree-50-50-002030899.html](https://finance.yahoo.com/news/taiwan-not-agree-50-50-002030899.html) >Taiwan will not agree to a deal with the United States for half of all semiconductor production to take place in the country, the island's top tariff negotiator said on Wednesday after returning home. >U.S. Secretary of Commerce Howard Lutnick told U.S. television network News Nation over the weekend that": -0.5,
  "Shorting $TSLA (Leverage) EU - Im planning to short(put) Tesla stock, and I noticed that I can only do it in contract(100 shares) is there a way to work around that as I don’t want to risk 24k like same as leveraged degen trading but with low amount of money?": -0.6,
  "AI Chips Update - Tria Federal Unveils Accessible AI Platform With Tria Forge": 0.5,
  "Exploring 3 High Growth Tech Stocks In The US Market": 0.5,
  "United States Continuous Glucose Monitoring (CGM) Market Forecast 2025-2033: Focus on California, Texas, New York, Florida, Illinois, Pennsylvania, Ohio, Georgia, Washington, New Jersey": 0.5,
  "SWIFT Tests A Blockchain Ledger With 30+ Banks -- What It Means For XRP": 0.5,
  "Will Agentic Shopping Be Good News For Affirm, Buy Now, Pay Later Firms?": 0.5,
  "Strategy Posts Q3 Profit, Keeping it on Radar for S&P 500 inclusion.": 0.5,
  "What Is 1 of the Best Semiconductor Stocks to Buy Now?": 0.5,
  "Dutch Bros and Chick-fil-A Lead in Satisfaction, Taco Bell Dominates Speed, and Raising Cane's Excels in Food Quality in Intouch Insight's 25th Annual Drive-Thru Study": 0.6,
  "The H-1B fee hike will hold back  America’s tech community": -0.6,
  "Comcast Announces Final Results for Pool 1 Debt Exchange Offers and Pool 1 Cash Offers": 0.0,
  "Is Intel Corporation (NASDAQ:INTC) Trading At A 29% Discount?": 0.2,
  "Wells Fargo launches software coverage, highlights AI shift as inflection point": 0.5,
  "European healthcare stocks surge after US deal with Pfizer": 0.8,
  "Dow Jones Futures Fall As Government Shutdown Begins After Nvidia Breaks Out": -0.5,
  "Netflix stock closes lower after Elon Musk urges followers to cancel service": -0.7,
  "GE HealthCare to announce third quarter 2025 results on October 29, 2025": 0.0,
  "Prediction: Costco Stock Will Hit $1,000 in 2026": 0.5,
  "RealSense Appoints Dr. Achin Bhowmik to Board of Directors": 0.5,
  "3 Best Tech Stocks to Buy in October": 0.5,
  "ADP September jobs survey sees decline of 32,000, missing expected 44,000 gain. - https://www.cnbc.com/2025/10/01/private-payrolls-declined-in-september-by-32000-in-key-adp-report-coming-amid-shutdown-data-blackout.html Companies shed a seasonally adjusted 32,000 jobs during the month, the biggest slide since March 2023, payrolls processing firm ADP reported Wednesday. Economists surveyed by Dow Jones had been looking for an increase of 45,000. In addition to the drop in September, the August payrolls number was revised to a loss of 3,000 from an initially reported increase of 54,000. Due": -0.8,
  "Co-Founder and Former CEO of Google-Acquired Nik Software Joins CEO Coaching International as Partner and Coach": 0.5,
  "Strategy raises dividend on STRC to 10.25%": 0.6,
  "I Live Off of Social Security: Why I Don’t Shop at Costco or Sam’s Club": -0.5,
  "Paychex, Inc. (NASDAQ:PAYX) is largely controlled by institutional shareholders who own 79% of the company": 0.1,
  "Is the AI bubble about to burst? Think again, say these analysts": 0.5,
  "Broadcom Showcases Industry-Leading Quality and Reliability of Co-Packaged Optics": 0.8,
  "JAKKS Pacific Unveils Annual Fall Launch of Super Mario™ Toys, Playsets, and Figurines Just in Time for the Holidays": 0.8,
  "The Trade Desk and DIRECTV Announce Plans to Develop Custom Version of Ventura TV OS with DIRECTV’s User Interface": 0.5,
  "Further to Speak Alongside Adobe and PMG on Data Collaboration Panel at Advertising Week 2025": 0.5,
  "T-Satellite is Here: And Now It’s Powering Apps!": 0.6,
  "Synopsys, Inc. (SNPS) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "These 2 Medical Stocks Could Beat Earnings: Why They Should Be on Your Radar": 0.5,
  "These 2 Computer and Technology Stocks Could Beat Earnings: Why They Should Be on Your Radar": 0.6,
  "Axon Enterprise, Inc (AXON) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Exclusive-Qualcomm shifts chips to newer Arm tech as competition with Apple, MediaTek heats up": 0.5,
  "Stocks making big moves yesterday: Cracker Barrel, Atkore, PayPal, GoDaddy, and UiPath": 0.5,
  "ChatGPT Is Moving Away From Reddit as a Source - https://thetradable.com/ai/chatgpt-is-moving-away-from-reddit-as-a-source-ig--a > AI is changing fast, and so are its information sources. ChatGPT may be pulling back from Reddit, once a goldmine for conversational training data. If true, this marks a turning point where verified information beats crowdsourced content. A recent observation from Andrea Bosoni caught attention: ChatGPT seems to be ditching Reddit answers. OpenAI apparently figured out that random forum posts aren't always trustworthy.": 0.5,
  "Fintech Pioneer Bill Harris Launches Evergreen Wealth to Redefine Digital Wealth Management": 0.8,
  "Zyphra Taps IBM, AMD To Build Next-Gen AI Superagent": 0.5,
  "Workday Completes Acquisition of Paradox": 0.0,
  "Will M&A Acceleration Transform BigBear.ai Into a Scaled AI Leader?": 0.5,
  "Lam Research Corporation (LRCX) Hits Fresh High: Is There Still Room to Run?": 0.5,
  "Best Growth Stocks to Buy for October 1st": 0.5,
  "Sector Update: Energy Stocks Lean Lower Premarket Wedneday": -0.5,
  "Lithium Americas Reaches Agreement with GM and U.S. DOE Regarding First Draw on DOE Loan - **VANCOUVER, British Columbia, October 01, 2025**\\--([BUSINESS WIRE](https://www.businesswire.com/))--Lithium Americas Corp. (TSX: LAC) (NYSE: LAC) (\"**Lithium Americas**\" or the \"**Company**\") today announced that together with General Motors Holdings LLC (\"**GM**\"), its joint venture (the \"**JV**\") partner in the Thacker Pass lithium project (\"**Thacker Pass**\" or the \"**Project**\"), the Company has reached a non-binding agreement in principle (the \"**First Draw Terms**\") with": 0.2,
  "Xcel Plans New Gas-Fired Plants as Part of 5-GW Expansion in Texas, New Mexico": 0.2,
  "ODFL Suffering From Weak Revenues Despite Dividend Strength": -0.6,
  "3D Digital Asset Market Surges to $51.8 billion by 2029 - Dominated by Autodesk (US), Siemens (Germany), Adobe (US)": 0.6,
  "Cadence and TSMC Extend Partnership to Drive Next-Generation Innovation": 0.8,
  "Can Cadence's Strong Free Cash Flow Keep Fueling Shareholder Returns?": 0.5,
  "2025 Dermatology Treatment and Care Market Analysis Report with Impact Analysis of US Tariffs Featuring Novartis, Pfizer, Amgen, GSK, F. Hoffmann-La Roche, J&J, AbbVie, Merck, Bayer, Sanofi": 0.0,
  "Kymera Overcomes Sanofi Deal Update, Marches Ahead With Pipeline": 0.6,
  "Is eBay Set to Reignite Growth by Expanding Into Social Commerce?": 0.5,
  "Apple initiated, DraftKings downgraded: Wall Street's top analyst calls": 0.1,
  "1 Super Semiconductor Stock (Besides Nvidia or Broadcom) to Buy Hand Over Fist": 0.8,
  "Micron (MU) is a Top-Ranked Growth Stock: Should You Buy?": 0.6,
  "Why Qualcomm (QCOM) is a Top Growth Stock for the Long-Term": 0.8,
  "Why Adobe Systems (ADBE) is a Top Growth Stock for the Long-Term": 0.6,
  "Reddit stock falls for second day as references to its content in ChatGPT responses plummet": -0.6,
  "Micas Networks Achieves 4 Million Link Flap-Free Hours in Testing of Industry’s First 51.2T Co-Packaged Optics Switch": 0.6,
  "Comcast Business Releases 2025 Cybersecurity Threat Report: 34.6 Billion Reasons Businesses Must Get Threat Ready": 0.5,
  "MIT Sloan CFO Summit Presents \"How CFOs Lead, Structure, and Manage Change\" with CFO keynotes Arm, FedEx, Shopify, and Tapestry": 0.5,
  "Strategy Stock Climbs After IRS Tax Reprieve": 0.6,
  "Nvidia Stock Drops. Meta Is Pushing Ahead with Its Own AI Chips.": -0.5,
  "Third and Grove Acquires Elva, A Shopify Platinum Partner": 0.5,
  "Netflix Stock Slides. Elon Musk Says He’s Canceling His Subscription.": -0.6,
  "DigiKey Sponsoring Works With by Silicon Labs Developer Event Series": 0.5,
  "Semtech Broadens LoRa Gen 4 Lineup to Capture IoT Market Demand": 0.6,
  "AI Stocks Face 'Show Me' Test. Why Oracle Analyst Day Will Be Big Event.": 0.5,
  "ASML Has Fans Ahead of Earnings. 2 Reasons to Believe in the Stock.": 0.5,
  "LoopMe Expands Strategic Advisory Board to Power Agile Innovation": 0.5,
  "Cidara ($CDTX): Why 75% Probability of Success for Cidara’s Universal Flu Prophylaxis CD388 Is a Conservative Anchor for Valuation - **TL;DR:** Many Phase 3 programs are treated like a 50/50 coin toss by investors in terms of probability of success. Here’s why I think CD388 is closer to 75%. **Disclosure:** I hold shares of $CDTX. This is not investment advice. In my original valuation post [CDTX – Is their CD388 “universal flu prophylaxis” the most": 0.6,
  "CoreWeave Is Winning Over Wall Street Amid Flurry of New Deals": 0.8,
  "ISRG Expands SP Indications: A Game Changer in Colorectal Surgery?": 0.6,
  "Fed won't get 'clearest read' of economy without jobs report": 0.1,
  "3 Big Takeaways From Costco's Earnings Report Last Week": 0.5,
  "2 Stocks That Could Be Easy Wealth Builders": 0.5,
  "TD Cowen downgrades Marvell on weaker visibility in custom chip business": -0.5,
  "GEN Boosts Cyber Safety With Norton Deepfake Protection on Intel PCs": 0.6,
  "Ford sales surge 8.2% in Q3, led by trucks and EVs": 0.8,
  "Marvell Stock Is Downgraded. Future Sales to Amazon and Microsoft Are Uncertain.": -0.8,
  "Paychex Weakness Tied to Lagging Core Revenue, Softer Paycor Recurring Growth, Morgan Stanley Says": -0.5,
  "Treasury to Exempt Bitcoin from 15% CAMT Tax on Unrealized Gains, Saving Strategy Billions": 0.8,
  "Thermo Fisher Scientific Announces R&D Partnership with AstraZeneca BioVentureHub": 0.5,
  "Germany Trade & Invest: German Business Initiative to Invest 735 Billion Euros": 0.8,
  "OneCause Launches Integration with DAFpay by Chariot, Unlocking Access to Billions in Donor-Advised Funds": 0.6,
  "TrustWallet Turns Profits, Adds Solana, Targets 1B Users": 0.6,
  "Old Dominion Freight Line to Webcast Third Quarter 2025 Conference Call": 0.0,
  "Thomson Reuters Third-Quarter 2025 Earnings Announcement and Webcast Scheduled for November 4, 2025": 0.0,
  "European Equities Traded in the US as American Depositary Receipts Surge  in Wednesday Trading": 0.2,
  "AI Complaint Management Market Trends and Forecasts Report 2025-2033, with Benchmarking Profiles of Salesforce, Microsoft, Oracle, SAP, Zendesk, Freshworks, Zoho, NICE, Kustomer, and Verint Systems": 0.2,
  "Redis expands partnership with Microsoft, announces integration of Azure Managed Redis into Microsoft Agent Framework": 0.6,
  "Tesla sales rise in parts of Europe amid pressure from rivals": 0.5,
  "Why AST SpaceMobile Stock Popped Today": 0.5,
  "Can KDP's Energy Push & Coffee Revival Drive Sustainable Growth?": 0.5,
  "Warren Buffett's Berkshire Hathaway Could Be Closing in on $10B Deal With Occidental Petroleum": 0.5,
  "Microsoft Uses Microfluidics Tech to Outpace AI Chip Rivals": 0.5,
  "Renewable Energy popping today? - I have watched Renewables for some time and some names have been doing well this year in spite of the politics but they are popping today and I can't seem to find the reason. With credits expiring today I would expected to have a negative effect. RUN, SEDG A ENPH NEE all up. FSLR has been moving up for awhile and is also up today. Sector rotation possible? Or is": 0.2,
  "ComEd Urges Eligible Customers to Apply for Energy Assistance as LIHEAP Application Period Launches Today": 0.5,
  "Amazon launches ‘price-conscious’ grocery brand with most products under $5 - Amazon on Wednesday expanded its private-label grocery lineup with the launch of a new brand aimed at “price-conscious” shoppers, with most products priced under $5. The brand is called Amazon Grocery and includes more than 1,000 items, ranging from dairy, fresh produce, meat and seafood to snacks and baking essentials, the company said in a release. Amazon said the new offering unites its Happy": 0.8,
  "Texas Instruments to webcast Q3 2025 earnings conference call": 0.0,
  "Bitcoin Regains$ 117K Level As Fresh Economic Data Flags Weak Growth": 0.1,
  "Applovin, Delta Air Lines, Coinbase: Top Analyst Calls": 0.0,
  "PRGS vs. INTU: Which Stock Should Value Investors Buy Now?": 0.2,
  "HOLX vs. IDXX: Which Stock Is the Better Value Option?": 0.0,
  "TON Foundation Brings Former Nike, Apple Exec as Marketing Chief": 0.5,
  "What Makes KLA (KLAC) a Strong Momentum Stock: Buy Now?": 0.6,
  "Tesla hikes lease prices as US electric vehicle tax credit expires": -0.5,
  "GM says Q3 sales rose 8% with record EV numbers": 0.8,
  "IRS Is About To Relax Tax Rules For Crypto Giants In the US": 0.5,
  "Lower Mortgage Rates Are Good for Home Buyers. The Reasons for Lower Rates Aren’t.": 0.2,
  "Why Lam Research (LRCX) is Poised to Beat Earnings Estimates Again": 0.8,
  "Will Apple (AAPL) Beat Estimates Again in Its Next Earnings Report?": 0.5,
  "Consolidation??? - Has anyone else noticed that mega corps seem to be acquiring everything lately? With the recent TikTok breakup/acquisition by Oracle+Silver Lake+etc, I took a deeper look into firms like Silver Lake who also own other media companies (they are currently acquiring EA) My mortgage lender was just acquired by rocket mortgage. Silicon Valley mega corps are acquiring startups left and right. This is a somewhat low effort post, but I am wondering what": 0.2,
  "Wall Street Logs Best Q3 Since 2020, Dow Hits Record": 0.8,
  "Why Datadog (DDOG) Stock Is Trading Up Today": 0.5,
  "Why Reddit (RDDT) Shares Are Plunging Today": -0.7,
  "Growth and Investment Opportunities in the AI in Oncology Market 2025-2029: A Global Industry Analysis": 0.6,
  "Detroit Mayor Duggan says tariffs are squeezing Michigan's auto industry": -0.6,
  "FTSE 100 hits another high despite concerns over US government shutdown": 0.1,
  "Taiwan Stuns Washington: Refuses US Demand to Make Half Its Chips": -0.6,
  "Health Care Roundup: Market Talk": 0.0,
  "These S&P 500 Stocks Stood Out in Q3 2025: Western Digital, Warner Bros Discovery, Seagate, Corning, Teradyne": 0.5,
  "Strategy Rises as Saylor Sees Exemption from Corporate Tax": 0.5,
  "Northeast Mississippi Community College Becomes First School to Deploy Mobile Credential on Transact IDX® Platform": 0.5,
  "Meta Reportedly Eyes Rivos AI Chip Startup Deal": 0.5,
  "Microsoft names CEO to run commercial business, Nadella to focus on tech": 0.2,
  "Seismic Welcomes Rob Tarkoff, Former Oracle and Adobe Executive, as Chief Executive Officer": 0.8,
  "Lam Research (LRCX) is an Incredible Growth Stock: 3 Reasons Why": 0.8,
  "Here is Why Growth Investors Should Buy Workday (WDAY) Now": 0.5,
  "What Does the Shutdown Mean for the Jobs Report and Other Economic Data?": 0.0,
  "Why The Kraft Heinz Company (KHC) Appeals to Income Investors Seeking Strong Yields": 0.6,
  "Reddit stock tumbles on concerns over declining user engagement": -0.7,
  "Proofpoint Is a Proud Participant in the Microsoft Security Store Partner Ecosystem": 0.6,
  "Bitcoin Bonanza: Michael Saylor's $74B Bet Just Dodged a Massive Tax Hit": 0.5,
  "Market Chatter: Diamondback Energy CEO Says US Oil Growth Unlikely at $60 a Barrel": -0.5,
  "CanXP AI Launches Canada's First Sovereign AI Ecosystem": 0.5,
  "U.S. Government Invests in Lithium Americas": 0.5,
  "What Is One of the Best Semiconductor Stocks to Own for the Next Decade?": 0.5,
  "AMD Expands AI Partnership With Cohere for Enterprise and Sovereign AI": 0.5,
  "Your Facebook Ads Are About to Get Even More Personalized": 0.6,
  "ReVisionz Launches Executive Advisory Committee to Accelerate Client Outcomes Across Asset-Intensive Industries": 0.5,
  "Walmart US to remove artificial dyes from private-label foods as industry continues ingredient overhauls": 0.5,
  "AppLovin Was the S&P 500’s Top Stock Last Quarter. Wall Street Expects More Gains.": 0.8,
  "Autodesk ’well-placed to monetize AI’ says HSBC": 0.5,
  "How To Ride AMD Stock Higher Through A Long Straddle Option Move": 0.5,
  "Comcast Launches Flagship Lift Zone with THEARC in Washington, D.C. to Advance Digital Skills and Job Training Opportunities": 0.5,
  "Unusual Tesla Call Options Volume Shows Investors Bullish on TSLA": 0.8,
  "Palantir Joins S&P 500 Elite Club After Stunning Multi-Year Stock Surge": 0.8,
  "Dividend Growth and Stability: PepsiCo’s (PEP) Strength in the Consumer Staples Sector": 0.6,
  "Unpopular opinion(s) what RDDT needs to do to survive - I've said it before, and and I'll say it again. RDDT won't scale unless spez makes controversial moves and tough decisions. I'm going to compare them to Meta, as many have said Reddit is a \"baby Meta\". 1.) They need to buy a company like Discord like how FB bought instagram. 2.) They need to FLOOD the feed with ads, like how Instagram does currently.": -0.6,
  "MSFT: Microsoft Stock Slips As Xbox Game Pass Ultimate Price Jumps 50%": -0.5,
  "How Many Times Could You Fully Charge a Tesla for the Price of One Tesla Share?": 0.1,
  "SS Innovations International, Inc. (SSII)’s SSi Mantra System Sees 130% Installation Growth, Pioneers Cardiac Telesurgery": 0.6,
  "Amazon streamlines private label grocery portfolio": 0.5,
  "US Equity Indexes Mixed Amid Healthcare Gains While Treasury Yields Drop as Partial Shutdown Begins": -0.2,
  "Nvidia Stock Falls From Record High as Meta Accelerates Custom AI Chip": -0.5,
  "ADP Data Points to Cooling Jobs Market -- What Investors Should Take Away": -0.5,
  "Comcast Expands Access to Technology and WiFi with Launch of Five New Flagship Lift Zones to Advance Digital Opportunity for More Americans": 0.8,
  "Another Surging Pharma Stock to Watch Right Now": 0.5,
  "DexCom, Inc. (DXCM) Showcases Next-Gen CGM Features at EASD 2025": 0.5,
  "IDEXX Laboratories, Inc. (IDXX) Stock Delivers 97% Return in 3 Years, Outpacing Zoetis and Market": 0.8,
  "Is Apple Stock About to Breakout?": 0.5,
  "Walmart (WMT): A Core Holding for Dividend-Focused Portfolios": 0.5,
  "Intuitive Surgical, Inc. (ISRG) Unveils AI-Powered da Vinci 5 Upgrades": 0.5,
  "Microsoft CEO Relinquishes Some Duties, Names New Commercial Chief": 0.2,
  "Comcast (CMCSA) Deploys AI-Based Network Amplifiers in US Markets": 0.5,
  "Charter Communications (CHTR) PT Slashed to $350 by Bernstein SocGen": -0.5,
  "AI Stocks: Bubble or Boom Ahead?": 0.5,
  "Intel in early talks to add AMD as foundry customer, Semafor reports": 0.5,
  "Now Up 70% in 2025, Is Intel Stock a Buy, Sell, or Hold for Q4?": 0.2,
  "AT&T Stock Gets a Downgrade. Why ‘Free’ iPhones Are Partly to Blame.": -0.6,
  "People destroyed the ‘friend.com’ AI necklace ads with graffiti. The 22-year-old founder loves it: ‘Capitalism is the greatest artistic medium.’": 0.2,
  "KBW Sticks with $371 PT for American Express (AXP)": 0.2,
  "Reminder - Tesla sales trending down, maybe unprofitable 3Q from no emissions credits, and taxi still has safety drivers - stock UP 30% Lol - The absurdity of Tesla knows no bounds. * Publicly available China sales data- which is about 35% of Tesla's sales - is still down 9% year over year, and Europe sales are still falling. American sales expect a bump due to loss of tax credits, but with Elon's alignment with": -0.8,
  "Palantir (PLTR) and Hadean To Deploy AI Simulation Technology For UK Defense": 0.5,
  "Qualcomm (QCOM) and Google Cloud Strengthen Automotive AI Collaboration": 0.6,
  "Xylem (XYL), Amazon Partner To Support Water Sustainability In Mexico": 0.6,
  "ASTS BlueBird 6 has completed final assembly and testing and is ready for flight! On October 12 will head to India aboard cargo plane - BlueBird 6 has completed final assembly and testing and is ready for flight! 2 On October 12, it will head to India aboard an Antonov large cargo plane * officially kicking off next-gen launch campaign: • BlueBird 7 is expected to ship to the Cape Canaveral launch site in October": 0.8,
  "Qualcomm Prevails Over Arm in Court. Next, an Appeal.": 0.2,
  "Daily Roundup of Key US Economic Data for Oct. 1": 0.0,
  "Weak Jobs Numbers Won’t Derail a Hot Economy. 3 ETFs to Buy.": 0.5,
  "Equities Rise Intraday as Markets Look Past Shutdown": 0.5,
  "Peloton Slides After Hiking Prices in Sweeping Product Revamp": -0.5,
  "Intel spikes on reports of potential AMD manufacturing deal": 0.8,
  "iPhone 17 Outsells On Speed, Not AI Hype: Analyst": 0.5,
  "Amazon Stock Could Bounce Back Toward Record Highs": 0.8,
  "Intel Stock Rallies On Report Chip Giant Looking To Add AMD As Foundry Customer": 0.8,
  "European stocks - Hello. I would like to dip my toes into swingtrading, as a total noob. The stock I want to start with is on the Euronext? exchange. Is this dumb? Would exchange fees take any tiny profits I make? Thank you": 0.1,
  "DoorDash offers fulfillment service for retailers": 0.5,
  "EA Is Going Private in the Largest Buyout Ever, But This 1 Other Video Game Stock Is Still a Screaming Buy": 0.6,
  "Amazon Stock Regains Some Ground After Tech Giant Offers New Grocery Line, AI Devices": 0.5,
  "Why Datadog Stock Jumped Today": 0.5,
  "ADP Canada Launches The Small Business Toolkit in Honour of Small Business Month": 0.5,
  "CoreWeave lands mega deal from AI giant": 0.8,
  "Trump Triggered a Rally in Drug Stocks. Why It Might Not Last.": 0.1,
  "Dalfen Industrial Expands Florida Footprint with Acquisition of Prime Infill Property in Miami Lakes": 0.8,
  "Walmart now plans to bring drone deliveries to ‘most areas that we operate in,’ exec says": 0.5,
  "Nvidia On Winning Streak Amid Government Shutdown – But Is The Stock A Buy Now?": 0.2,
  "9 Stocks Turn $10,000 Into $187,543 In 9 Months": 0.5,
  "Sector Update: Energy": 0.0,
  "Corteva plans spin-offs, Reddit reacts to drop in ChatGPT sourcing": 0.1,
  "AI Stocks Have Fueled the Bull Market for 3 Years—Will the Momentum Continue?": 0.5,
  "Sector Update: Tech Stocks Higher Late Afternoon": 0.5,
  "Analyst Says He’s Not ‘Worried At All’ About Nvidia (NVDA)’s Customer Concentration Problem": 0.6,
  "Treasury Yields Fall as Dismal Jobs Data Meet Government Shutdown": -0.5,
  "Sector Update: Financial Stocks Decline Late Afternoon": -0.5,
  "OpenAI Is Breaking New Ground With Sora. Why the AI Video App Is Bad News for Meta.": 0.5,
  "Healthcare Helps Lift US Equity Indexes After Federal Shutdown Begins": 0.5,
  "Sector Update: Energy Stocks Advance Late Afternoon": 0.5,
  "The IT Executive Tasked With Revamping How Tesla Sells Cars": 0.1,
  "A Private-Label Push Is Amazon's Latest Move as It Leans Further Into Groceries": 0.5,
  "Why Are Amgen (AMGN) Shares Soaring Today": 0.5,
  "Why Merck (MRK) Stock Is Up Today": 0.5,
  "Deep Blue Closes Acquisition of Environmental Disposal Systems from Diamondback": 0.5,
  "Why AbbVie (ABBV) Stock Is Trading Up Today": 0.5,
  "Strategy (MSTR) Stock Trades Up, Here Is Why": 0.5,
  "Lithium Americas Spikes As U.S. Confirms Stake After MP Materials, Intel Investments": 0.6,
  "This Top S&P 500 AI Stock Is Even Beating Palantir in 2025. Should You Buy It Here?": 0.5,
  "Tesla Rivals XPeng, Xiaomi, Nio Report Record China EV Sales; BYD, Li Auto Lag": 0.5,
  "Starbucks Announces Increase in Quarterly Cash Dividend": 0.5,
  "Lam Research Corporation Announces September Quarter Financial Conference Call": 0.0,
  "HONEYWELL ANNOUNCES TRANSACTION TO DIVEST LEGACY ASBESTOS LIABILITIES": -0.5,
  "AppLovin to Announce Third Quarter 2025 Results": 0.0,
  "Bitcoin Giant Strategy Dodges Multi-Billion Tax Liability Following IRS, Treasury Guidance: TD": 0.1,
  "Tesla Stock Rockets Higher. Its Cars Just Got More Expensive.": 0.5,
  "PDF Solutions® Announces Next Generation of its Exensio® AI/ML Solution": 0.5,
  "Breakout Stocks Watch: What Looms For October?": 0.2,
  "This Lithium Stock Is Soaring Again. How Government Money Is Giving It a Boost.": 0.6,
  "Why Meta Platforms Stock Was Wilting on Wednesday": -0.5,
  "US Equity Markets Rise Amid Continuous Decline in Government Bond Yields": 0.5,
  "Jim Cramer Was Right About Meta Platforms (META)": 0.5,
  "Fermi IPO Is a Risky Bet on AI Power. The Stock Soared 55% in Its Debut.": 0.5,
  "BYD, NIO, Li Auto, and XPeng Post EV Sales Growth. Tesla Sales in China Haven’t Been Growing.": 0.2,
  "Pfizer Stock, Other Drugmakers Rally Again": 0.5,
  "These Stocks Moved the Most Today: Nike, Netflix, Fermi, Moderna, AES, Lithium Americas, Sunrun, Corteva, and More": 0.2,
  "Was This Analyst Right About Microsoft (MSFT)?": 0.2,
  "U.S. Stocks Climb After Government Shutdown": 0.5,
  "Josh Brown Predicted Amazon.com (AMZN) Will ‘Breakout’ – Was He Right?": 0.2,
  "Reddit stock sinks 12% as ChatGPT references to its content plunge from 10% to 2% in September - No paywall: [https://finance.yahoo.com/news/reddit-stock-falls-for-second-day-as-references-to-its-content-in-chatgpt-responses-plummet-135203534.html](https://finance.yahoo.com/news/reddit-stock-falls-for-second-day-as-references-to-its-content-in-chatgpt-responses-plummet-135203534.html) Reddit (RDDT) stock fell roughly 12% Wednesday, extending a decline from the previous trading session amid new data that showed the use of its content in leading AI chatbot ChatGPT had plummeted in mid-September. Reddit content was cited in just 2% of ChatGPT responses on Tuesday, much lower than the 9.7% of ChatGPT responses": -0.8,
  "Private jobs sink in September, but Morgan Stanley wary of bets on jumbo rate cut": -0.3,
  "The Incredibly Shrinking Pool of Publicly Traded Companies": -0.5,
  "Analyst Highlights Red Flags in Nvidia (NVDA)-OpenAI $100 Billion Deal – ‘Feature of Past Bubbles’": -0.6,
  "Rick Perry’s REIT Fermi Surges 55% After $683 Million IPO": 0.8,
  "Analyst Says You Should Take ‘Big Positions’ in Netflix (NFLX) – Here’s Why": 0.8,
  "O’Reilly Automotive, Inc. Announces Dates for Its Third Quarter 2025 Earnings Release and Conference Call": 0.0,
  "Meta to Announce Third Quarter 2025 Results": 0.0,
  "The rise of the bro co-CEO": 0.1,
  "'I Don't Think It's Lasting,' Cisco Exec Says Entry-Level Hiring Slowdown Is Nothing To Worry About": 0.2,
  "Why Micron Rocketed to All-Time Highs Today": 0.8,
  "Analyst Explains Why He Downgraded Tesla (TSLA) to Sell Ahead of Upcoming Earnings": -0.7,
  "Netflix Shares Fall After Elon Musk Calls for Subscription Cancellations": -0.8,
  "Broadcom (AVGO) Bull Shares His ‘Only Hesitation’ About the Stock": 0.2,
  "Palantir Stock: What Investors Need To Know": 0.0,
  "Nike Punches Past Resistance; Q1 Shows Turnaround Momentum": 0.6,
  "Microsoft to Lean More on Its Own AI Chips as Demand Outpaces Supply": 0.5,
  "2 Great AI Stocks to Buy in October and Hold for 10 Years": 0.8,
  "Analyst Says Micron (MU) Upside Already ‘Baked In’ Despite Strong Guidance": -0.5,
  "Why Drug Stocks Are Celebrating Trump's 100% Pharmaceutical Tariff": 0.6,
  "Why Lam Research Rocketed to All-Time Highs Today": 0.8,
  "Josh Brown Says Baker Hughes (BKR) Is Among the Best Energy Stocks – ‘Stock is Breaking Out’": 0.8,
  "Lyft CEO on the time Bill Gates told him he was making ‘the stupidest decision I’ve ever heard anyone made’": -0.6,
  "Is KLA (KLAC) the Best Under-The-Radar AI Stock to Buy Now?": 0.6,
  "Stocks to Watch Wednesday: Meta, Netflix, Nike, Lithium Americas": 0.5,
  "Why Shares of Alphabet Stock Climbed 14% Last Month": 0.5,
  "Analyst on Intel (INTC): $5 Billion Nvidia Investment ‘No Big Deal’": 0.2,
  "Grindr names veteran executive John North as finance chief": 0.5,
  "US Equity Indexes Rise as Healthcare Jumps, October Rate-Cut Certainty Increases Amid Surprise Fall in Private Payrolls": 0.5,
  "Drug Stock Rally Helps Push Dow and S&P 500 to Records": 0.8,
  "Tech, Media & Telecom Roundup: Market Talk": 0.0,
  "Is GM the Best Automaker to Invest in Now?": 0.5,
  "S&P 500, Dow Reach New Peaks as Traders Look Past Ongoing Shutdown": 0.8,
  "Microsoft Partners with Nvidia as Cloud and AI Drive Strong Performance": 0.8,
  "Alphabet Gains Cloud Momentum and Positive Outlook Following Favorable Court Ruling": 0.8,
  "Amazon Strengthens Growth Outlook with Earnings Beat and Expanded DSP Investment": 0.8,
  "Meta Earns Buy Rating as Strong Earnings Align with Ad-Free Subscription Rollout": 0.8,
  "A Year After Chipotle's Former CEO Was Tapped to Lead Starbucks' Turnaround -- Is SBUX a Buy?": 0.5,
  "Learn the Exact Volatility Levels the Best Options Traders Use to Fine-Tune Their Strategies": 0.5,
  "Why Arm Holdings Stock Popped on Wednesday": 0.5,
  "Amazon.com, Inc. (AMZN) Agrees to Pay $2.5 Billion in Fines and Reimbursements to Resolve Claims Made by the Federal Trade Commission": -0.8,
  "Micron Ends Fiscal Year Strong as Analysts Raise Price Target on Growth": 0.8,
  "Lam Research Delivers Strong Results Amid Mixed Opinions from Analysts": 0.5,
  "POOPH® Cites Quality-Control Issues in Supplier Termination": -0.6,
  "Constellation Energy Strengthens Performance with Meta Deal and Share Repurchase": 0.6,
  "CoreWeave (CRWV) Climbs 11.7% on $14-Billion Meta Deal": 0.8,
  "Apple halts Vision Pro overhaul to focus on AI glasses, Bloomberg News reports": 0.1,
  "CrowdStrike Holdings (CRWD) Outperforms Broader Market: What You Need to Know": 0.5,
  "Netflix (NFLX) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "Palo Alto Networks (PANW) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "AppLovin (APP) Stock Dips While Market Gains: Key Facts": -0.2,
  "PepsiCo (PEP) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Workday (WDAY) Stock Declines While Market Improves: Some Information for Investors": -0.5,
  "Take-Two Interactive (TTWO) Stock Dips While Market Gains: Key Facts": -0.2,
  "Apple pulled off a quiet rebound, but here’s the lever many missed": 0.5,
  "Does anyone else struggle to know if news about their holdings actually matters? - I own NVDA for the AI story, but when it drops 3% on gaming revenue miss, I spend way too much time trying to figure out if that actually matters for why I bought it. Same with every holding - news breaks, stock moves, and I'm googling around trying to understand if this changes my thesis or if it's just noise.": -0.6,
  "Apple shelves Vision Pro revamp in pursuit of AI glasses to rival Meta - Bloomberg": 0.2,
  "Podcast: U.S. Stocks Climb After Government Shuts Down": 0.2,
  "Mizuho Maintains Neutral Rating on Xylem Inc. (XYL), Raises Its Price Target from $125 to $140": 0.5,
  "Tesla deliveries, Fedspeak, mortgage rates: What to Watch": 0.2,
  "Stock market today: Dow, S&P 500, Nasdaq futures mixed despite government shutdown": -0.2,
  "Intel stock jumps 7% as report says company in early talks to manufacture chips for rival AMD - No paywall: [https://www.cnbc.com/2025/10/01/intel-stock-amd-chips.html](https://www.cnbc.com/2025/10/01/intel-stock-amd-chips.html) Key Points * Intel is in early talks with AMD to manufacture chips for it in its foundry business, according to a report from Semafor. * If AMD were to start manufacturing chips with Intel, it would be a significant win for the company’s foundry business, which is currently seeking big customers. * It": 0.8,
  "Constellation Energy Corporation (CEG) Signs $7 Billion Revolving Credit Facility with JPMorgan and Other Banks": 0.5,
  "IBM : the Nvidia of Quantum computing ? - Hi everyone, For a while now, I've been seeing a lot of people betting on quantum computers. I've noticed small companies whose stocks have gone up 10x in just a few months. Some are hoping to find the next gem that will lead this new world, which could be the next technological revolution. Personally, I don't really understand this sector. I've been hearing about quantum computers": 0.2,
  "Marjorie Taylor Greene Loads Up On Six-Figure Treasury Bill— Diversifies Portfolio With Bitcoin ETF, Tech Stocks": 0.5,
  "Deutsche Bank and Mizuho Raise Price Target on ASML Holding N.V. (ASML)": 0.5,
  "Tigress Financial Partners Initiates Coverage on Palo Alto Networks, Inc. (PANW) with Buy Rating and $245 PT": 0.8,
  "TD Cowen Maintains its Buy Rating and $100 PT for DexCom, Inc. (DXCM)": 0.6,
  "Citizens JMP Lowers Price Target on The Trade Desk, Inc. (TTD) to $60, Maintains Market Outperform Rating": 0.2,
  "Morgan Stanley Downgrades Fortinet, Inc. (FTNT) from Equal Weight to Underweight, Reduces Its Price Target to $67": -0.8,
  "Agoda Unveils Top Overseas and Domestic Travel Destinations for South Koreans Ahead of the 10-Day Chuseok Golden Holiday": 0.5,
  "Regeneron Pharmaceuticals Inc. (REGN) Reports Positive Results from Several Late-Stage Trials": 0.8,
  "Barclays Downgrades Keurig Dr Pepper Inc. (KDP) from Overweight to Equal Weight, Reduces PT to $26": -0.5,
  "Needham Downgrades Lululemon Athletica Inc. (LULU) to Hold": -0.5,
  "Jefferies Initiates Coverage on Biogen Inc. (BIIB) with Buy Rating and $190 PT": 0.8,
  "Crypto Stockpiling Craze Cools After Red-Hot Summer": -0.5,
  "Apple tables Vision Pro sequel to pursue smart glasses: report - Apple has tabled its efforts to produce a follow-up to its Vision Pro headset in favor of developing a new line of smart glasses powered by artificial intelligence, according to Bloomberg. The Cupertino company has moved staff from working on its new, lighter and cheaper Vision Pro to focus on its smart glasses, which would be similar to those offered by Meta Platforms, the": 0.1,
  "Faraday Future Successfully Concludes FX Super One Co-Creation and Sales Event in Seattle": 0.8,
  "Asian markets surge on US rate hopes, tech fired by chip deal": 0.6,
  "Dow Jones Futures: Stock Market Hits Highs, Tesla Deliveries Due; Nvidia Partner Breaks Out": 0.5,
  "Elon Musk halfway to becoming world's first trillionaire: report": 0.5,
  "Telegram To Let Users Trade Tokenized US Stocks via Wallet Starting October": 0.5,
  "Universal Music, Warner Music nearing AI licensing deals, FT reports": 0.5,
  "When 'job hugging' is a good idea — and when it holds you back": 0.1,
  "Kyndryl Holdings, Inc. (KD) Focused on Partnerships and Strategic Transformation to Accelerate Growth": 0.8,
  "Ambit Capital Upgrades Cognizant Technology Solutions Corporation (CTSH) on Improving Fundamentals": 0.8,
  "Morgan Stanley Downgrades Adobe Inc. (ADBE) but Confident of GenAI Monetization Abilities": 0.5,
  "OpenAI Valuation Soars to $500 Billion, Topping Musk’s SpaceX": 0.8,
  "Tech leads Asia share rally, gold near record high on Fed rate cut bets": 0.5,
  "Micron Technology (MU) Rated Outperform as Wedbush Sees Multi-Year Growth Ahead": 0.8,
  "QUALCOMM(QCOM) Leverages Adobe GenStudio to Streamline Global Marketing Efforts": 0.6,
  "On Semiconductor (ON) Acquires Vcore Tech to Strengthen AI Power Management Portfolio": 0.6,
  "Tower Semiconductor (TSEM) Draws Attention for High-Growth Tech Exposure": 0.6,
  "Jim Cramer on Amazon: “An Underrated AI Story”": 0.5,
  "Jim Cramer Says Apple “Has 1.5 billion Users Who Want a Chatbot Built In”": 0.6,
  "Jim Cramer Highlights Shopify’s Deal with OpenAI": 0.5,
  "Jim Cramer Commented That the “Fundamentals Seem Very Strong at Palantir”": 0.8,
  "Jim Cramer Highlights Goldman’s Low Valuation Despite Significant Gains": 0.5,
  "How do you see the whole AI bubble playing out? - OpenAI, Anthropic, etc. are entrenched in Google Cloud, AWS, Azure, Oracle, Dell, whatever. They are significantly driving up the cloud revenue of these companies, which in turn buy from Nvidia. Investors keep pouring billions into the AI companies, which keep engaging in price wars with each other and spend whatever little they have left on R&D and paying absurdly high salaries in the name": 0.1,
  "Starbucks (SBUX) Launches $1B Restructuring, Retains Buy Rating at Stifel": 0.5,
  "Amgen (AMGN) Announces $650M Puerto Rico Facility Expansion": 0.5,
  "Evercore Lowers Mondelez (MDLZ) Price Target Amid Rising Price Sensitivity": -0.5,
  "Goldman Sachs Maintains Buy on CoStar Group (CSGP) Momentum with Homes.com Traffic Surge": 0.6,
  "Learning on how to pick a stock with small amount - What is stock Is it a thing online, app, website, local How do I pick a stock to put $ 20 towards And do I just watch it for years to come for children graduation? I am not knowledgeable with this. Any nice information would be appreciated Anything mean I personally couldn’t take it right now So a beginner guidance or is it a": 0.1,
  "UBS Confident in Costco’s (COST) Holiday Sales Momentum and Growth": 0.8,
  "Adobe Inc (ADBE) Announces Adobe Premiere Mobile App for iPhone": 0.5,
  "Here’s What Analyst Think About Costco Wholesale (COST)": 0.2,
  "UBS Maintains a Buy on PepsiCo (PEP)": 0.5,
  "Amgen Inc (AMGN) Ramps Up Manufacturing Capacity in US, Amidst Hefty Tariffs": -0.6,
  "Amazon to Hire More than 7,000 Employees in Canada in Seasonal Roles while Increasing Pay and Introducing the New Employee Prime Benefit": 0.8,
  "It’s Time To Buy Costco (COST), Says Jim Cramer": 0.5
}