{
  "Where Will Constellation Energy Be in 5 Years?": 0.0,
  "Warren Buffett Sold 6 Stocks in Q2. Here's Why 1 of Them Could Still Be a No-Brainer Buy.": 0.5,
  "onsemi to Acquire Vcore Power Technology from Aura Semiconductor to Strengthen AI Data Center Leadership": 0.5,
  "Stock Index Futures Muted Ahead of U.S. PMI Data and Powell’s Speech": 0.1,
  "Some PepsiCo investors are still cautious about Elliott's plan to spin out bottling": 0.1,
  "Some PepsiCo investors cautious of Elliott's plan to spin out bottling": -0.5,
  "Bear of the Day: Synopsys (SNPS)": 0.0,
  "Exclusive-Accenture proposes new campus in India's Andhra Pradesh, eyes adding 12,000 jobs": 0.8,
  "Keurig Dr Pepper (NASDAQ:KDP) Has Affirmed Its Dividend Of $0.23": 0.5,
  "Marvell Technology (NASDAQ:MRVL) delivers shareholders favorable 14% CAGR over 5 years, surging 12% in the last week alone": 0.8,
  "MercadoLibre (NasdaqGS:MELI) Valuation: Exploring Impact of New B2B Launch and Strong Growth Momentum": 0.6,
  "Could Rising Intel Investment Spur a New Demand Cycle for KLA (KLAC) Equipment?": 0.5,
  "PepsiCo (PEP): Assessing Valuation After Recent Share Price Fluctuations": 0.1,
  "Reviewing PDD Holdings (NasdaqGS:PDD): Is There More Value Ahead After Recent Share Price Movement?": 0.5,
  "Is Applied Materials’ Surge Justified After US Chip Investment News in 2025?": 0.2,
  "US FDA declines to approve Scholar Rock's muscle weakness drug; shares fall": -0.8,
  "Best Stock to Buy Right Now: Amazon vs. MercadoLibre": 0.5,
  "Down 42%, Should You Buy This Top Growth Stock With $10,000 Right Now?": 0.2,
  "This Week In Energy Transition - Battery Storage Powers Forward With Project Alamo City": 0.5,
  "3 Stocks That May Be Undervalued By Up To 49%": 0.5,
  "Innovation Beverage Group Announces Reverse Stock Split": 0.1,
  "ON Semiconductor To Acquire Aura's Vcore Power Tech": 0.2,
  "Medallia Expands Strategic Partnership with Adobe, Integrating with New AI Agents for Enhanced Customer Experiences": 0.8,
  "One Year Later: Crane Clean Energy Center Still in the Spotlight and Ahead of Schedule": 0.8,
  "Estimating The Fair Value Of Baker Hughes Company (NASDAQ:BKR)": 0.1,
  "ISRG SP Platform's Expansion in Korea and Europe Gains Traction": 0.6,
  "Chicago Fed releases interim unemployment estimate, with September at 4.3%": 0.2,
  "Analyst Says You Should Buy This Non-AI Stock With ‘Huge’ Market Share": 0.8,
  "Aurigo Software Expands Autodesk Integration to Offer Integrated Capital Planning to Facility Owner-Operators": 0.5,
  "AHEAD Achieves Zscaler Data Security Delivery Specialization": 0.6,
  "Intuit Rapidly Advances GenOS to Accelerate Development of Agentic AI Experiences at Scale": 0.6,
  "Vertex Partners with Basketball World Champion Jayson Tatum to Raise Awareness of JOURNAVX®, a Non-Opioid Medicine Approved for the Treatment of Moderate-to-Severe-Acute Pain": 0.8,
  "Marriott International and Hawkins Way Capital Announce Five Signed Agreements to Launch Series by Marriott™ in the United States": 0.5,
  "Zscaler, Inc. (ZS) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Investors Heavily Search Datadog, Inc. (DDOG): Here is What You Need to Know": 0.5,
  "These 2 Computer and Technology Stocks Could Beat Earnings: Why They Should Be on Your Radar": 0.6,
  "Here is What to Know Beyond Why Applied Materials, Inc. (AMAT) is a Trending Stock": 0.2,
  "Here is What to Know Beyond Why Constellation Energy Corporation (CEG) is a Trending Stock": 0.2,
  "Costco Q4 Earnings Preview: Is Now the Right Time to Buy the Stock?": 0.5,
  "Keepr.Co Closes $400,000 Crowdfund, surpassing $1.3 Million in Total Funding": 0.8,
  "Quantum Computing Stocks: IonQ Claims Telecom Advance": 0.5,
  "CrowdStrike to Buy Pangea: Will AIDR Unlock a New Growth Engine?": 0.5,
  "Network API Market Surges to $6.13 billion by 2030 - Dominated by Ericsson (Sweden), Nokia (Finland), Cisco (US)": 0.5,
  "Is It Worth Investing in Intuit (INTU) Based on Wall Street's Bullish Views?": 0.5,
  "Wall Street Analysts See Analog Devices (ADI) as a Buy: Should You Invest?": 0.5,
  "CoreWeave upgraded, Lululemon downgraded: Wall Street's top analyst calls": 0.2,
  "1 Growth Stock Down 40% to Buy Hand Over Fist Right Now": 0.6,
  "Sustainability 101 at Cisco: What Is Packaging Sustainability?": 0.0,
  "Here's Why Lam Research (LRCX) is a Strong Momentum Stock": 0.6,
  "Keybanc bearish on Lam Reaserch, positive on Applied Material": 0.5,
  "Update: Market Chatter: European Union to Scrutinize Microsoft, Apple, Google Over Online Financial Scams": -0.5,
  "Paychex (PAYX) Reports Next Week: Wall Street Expects Earnings Growth": 0.5,
  "Accel Entertainment taps Kraft Heinz alum as CFO": 0.2,
  "Baidu or Alibaba? Why This Is the Stock to Play China’s AI Boom.": 0.5,
  "Pre-markets Flat Following AI Tech Boost": 0.2,
  "Fortinet's Geographic Mix Improves: Can EMEA Drive More Upside?": 0.5,
  "Zoom's Global Expansion Picks Up: A Sign of More Upside?": 0.6,
  "Pre-Markets Flat After Record-High Level": 0.0,
  "AutoZone Stock Falls After 5th Straight Earnings Miss. Why It’s Still Up 29% This Year.": -0.5,
  "Axon to acquire AI-powered 911 communications company Prepared, strengthening the public safety ecosystem from call to closure": 0.6,
  "Honeywell's Industrial Automation Weakness Persists: What's the Road Ahead?": -0.5,
  "Implied Volatility Surging for Automatic Data Processing Stock Options": 0.5,
  "Media companies have 'moral obligation' to uphold free speech": 0.5,
  "CoStar Group Named Among CRE’s Best Places to Work by GlobeSt.": 0.6,
  "Mid-Market Growth: Will Intuit Unlock Its Biggest Lever?": 0.5,
  "Jim Cramer Wonders Whether There’s More To Warner Bros. Discovery (WBD) Reported Deal Than Meets The Eye": 0.2,
  "CRSP & Sirius Begin Dosing in Thromboembolic Disorder Study in EU": 0.5,
  "NY Cocoa Prices Rebound as Nigerian Cocoa Exports Fall": 0.5,
  "Even if the AI bubble bursts its value will remain": 0.5,
  "BofA starts Atlassian at Neutral; growth story clouded by transition and deals": -0.5,
  "Y Combinator, Base and Coinbase Ventures Launch ‘Fintech 3.0’ as Finance Goes On-Chain": 0.5,
  "EU targets Apple, Google and Microsoft over online financial scams": -0.5,
  "Atlassian (TEAM) Stock Trades Down, Here Is Why": -0.5,
  "Update: Market Chatter: EU Set to Examine Microsoft, Apple, Google on Financial Scam Risks": -0.5,
  "Exelon to intensify push to own Mid-Atlantic power plants, CEO says": 0.2,
  "NY Cocoa Prices Climb as Supplies Tighten": 0.5,
  "Poppi soda’s $8.9 million settlement: Customers can claim payouts—but the deadline is this week. Here’s how to file": 0.1,
  "Why Regeneron (REGN) Stock Is Down Today": -0.5,
  "EU seeks fresh delay to deforestation rules amid IT headaches": -0.5,
  "Sector Update: Energy Stocks Rise Late Afternoon": 0.5,
  "This Nuclear Stock Isn't Expected To Report Revenue Until 2027 But Has Surged 570% This Year": 0.5,
  "Biogen Provides Regulatory Update on High Dose Regimen of Nusinersen": 0.2,
  "S&P 500 Gains & Losses Today: Vistra Stock Falls; Halliburton Shares Climb as Oil Rises": 0.2,
  "The Trade Desk (TTD) Gains As Market Dips: What You Should Know": 0.5,
  "GlobalFoundries and Egis Partner to Develop Next-Generation Smart Sensing Technology for Mobile and IoT Applications": 0.6,
  "Texas Instruments (TXN) Gains As Market Dips: What You Should Know": 0.5,
  "Cadence Design Systems (CDNS) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "Diamondback Energy (FANG) Gains As Market Dips: What You Should Know": 0.5,
  "US FDA declines to approve higher dose of Biogen's genetic disorder drug": -0.8,
  "Keurig Dr Pepper Moves to Acquire JDE Peet’s While Planning Company Split and Sustaining Dividend": 0.5,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On September 19, 2025, Abdurazak Mudesir was elected to the Board of Directors (the “Board”) of T-Mobile US, Inc. (the “Company”), effective immediately. Mr. Mudesir was selected as a designee of Deutsche Telekom AG (“Deutsche Telekom”) pursuant to that certain Second Amended and Restated Stockholders’ Agreement, dated June 22, 2020, by and among the Company, Deutsche Telekom": 0.1,
  "(Item 8.01) Other Events. On September 24, 2025, Marvell Technology, Inc. (the “Company”) announced that its Board of Directors authorized a $5 billion addition to the balance of its existing stock repurchase program. In addition to this stock repurchase authorization, the Company announced that it is entering into confirmations, including a supplemental confirmation (collectively, the “ASR Agreement”), of an accelerated share repurchase transaction with a counterparty financial institution (the “Dealer”). Under the ASR Agreement, the Company will": 0.2,
  "(Item 2.02) . Results of Operations and Financial Condition. On September 24, 2025, Cintas Corporation issued a press release announcing its financial results for the quarter ended August 31, 2025. A copy of the press release is furnished as Exhibit 99 to this Current Report on Form 8-K and is incorporated herein by reference.": 0.0,
  "(Item 8.01) . Other Events Marshall Wildfire Litigation As previously disclosed, multiple complaints were filed against Public Service Company of Colorado (PSCo) and Xcel Energy Services Inc. (both wholly owned subsidiaries of Xcel Energy Inc. and, together, Xcel Energy) related to the Marshall Fire, which ignited in Boulder County, Colorado in December 2021. On September 23, 2025, Xcel Energy, Qwest Corporation and Teleport Communications America, LLC reached settlement agreements in principle that resolve all claims asserted by": 0.1,
  "VeriSilicon Introduces FD-SOI Wireless IP Platform for Diverse IoT and Consumer Electronics Applications": 0.5,
  "Mondelez International Posts Solid Results, Raises Dividend, and Expands Product Line": 0.8,
  "Texas Instruments Delivers Dividend Boost Amid Strong Quarter and Confident Analyst Outlook": 0.8,
  "Why Honeywell International (HON) Earns a Spot Among the Best S&P 500 Dividend Stocks": 0.6,
  "Analog Devices (ADI) Combines Innovation and Income in the Best S&P 500 Dividend Stocks": 0.8,
  "Applied Materials and GlobalFoundries Partner to Accelerate AI-Powered Photonics": 0.5,
  "Spotting Winners: Datadog (NASDAQ:DDOG) And Software Development Stocks In Q2": 0.5,
  "Q2 Earnings Highlights: Intuit (NASDAQ:INTU) Vs The Rest Of The Finance and HR Software Stocks": 0.2,
  "Atlassian (TEAM): Buy, Sell, or Hold Post Q2 Earnings?": 0.0,
  "3 Reasons ADSK is Risky and 1 Stock to Buy Instead": -0.5,
  "1 Nasdaq 100 Stock on Our Buy List and 2 We Avoid": 0.2,
  "1 Safe-and-Steady Stock with Solid Fundamentals and 2 That Underwhelm": 0.2,
  "3 Unpopular Stocks We Keep Off Our Radar": -0.7,
  "Mizuho Reduces PT on Diamondback Energy (FANG) Stock to $176": -0.5,
  "Cisco, Tata Communications Partner to Integrate Global eSIM Orchestration into IoT Control Center": 0.5,
  "Workday Unveils Data Cloud with Zero-Copy Integration to Databricks, Salesforce, Snowflake for Real-Time Insights": 0.6,
  "Regeneron’s Phase 2 COURAGE Trial Shows Trevogrumab Combination Preserves Lean Mass in Obesity Patients on Semaglutide": 0.5,
  "Datadog Appoints Former WhatsApp, Meta Product Leader Ami Vora to Board of Directors": 0.5,
  "Paramount Skydance Corporation Considering a Bid to Acquire Warner Bros. Discovery (WBD)": 0.5,
  "Wall Street Has a Mixed Opinion About ​Copart, Inc (CPRT), Here’s Why": 0.1,
  "A Once-in-a-Decade Opportunity: 10 Billion Reasons to Pay Attention to This Monster Quantum Computing Company (Hint: Not IonQ)": 0.6,
  "Mizuho Securities Downgrades Applied Materials (AMAT) to Neutral, Reduces PT": -0.5,
  "Bank of America Securities Maintains Buy on Intuit Inc (INTU)": 0.5,
  "Lam Research Corporation (LRCX) Collaborates With JSR Corporation": 0.5,
  "3 Dividend Stocks Perfect for Millennial Investors": 0.5,
  "RF Power Dividers Market Trends, Competitive Strategies and Forecasts Report 2025-2033: Analog Devices, MACOM, Rohde & Schwarz and Marki Microwave Lead Innovation Across Telecom, Aerospace and Defense": 0.5,
  "Jim Cramer on Pepsi: “You Own That Stock, Do Not Trade It”": 0.6,
  "Jim Cramer Recommends DoorDash for Young Investors": 0.5,
  "Jim Cramer Says He Like Okta Because He Likes Identity Management": 0.6,
  "Why ASML, Applied Materials, and Lam Research Are Soaring on Nvidia's Deal With Intel": 0.5,
  "The Zacks Analyst Blog Highlights Costco Wholesale, Ross Stores, Target and Dollar General": 0.5,
  "Coming soon: Mars, ABF, Greencore to feature at Next Generation Ingredients conference": 0.5,
  "Series by Marriott enters US amid demand for upscale collection brands": 0.5,
  "Kevin O'Leary Says Trump's $100,000 H1B Visa Will Push Innovation Abroad, Points Out Apple, Google Started In A Garage Once": 0.5,
  "Could a $50,000 Investment in This Vanguard AI ETF Turn Into a Million?": 0.5,
  "Applied Materials Partners With GlobalFoundries To Accelerate Photonics": 0.5,
  "Software sector is a 'great place to make money': How to play": 0.6,
  "Cintas Earnings Preview: What to Expect": 0.0,
  "Baker Hughes Announces Dates for Third-quarter Earnings Release and Webcast": 0.0,
  "Analog Devices (NASDAQ:ADI) Seems To Use Debt Rather Sparingly": 0.5,
  "Shareholders in Atlassian (NASDAQ:TEAM) have lost 23%, as stock drops 3.7% this past week": -0.6,
  "FIS Acquires Goldman Sachs-Backed Start-Up Amount": 0.2,
  "Indian drugmakers Dr Reddy's, Hetero to sell generic HIV prevention drug for $40 a year": 0.5,
  "Stocks Mostly Up Pre-Bell as Investors Digest Fed Chair Powell's Latest Comments on Monetary Policy": 0.5,
  "Best Stock to Buy Right Now: Coca-Cola vs. Monster Beverage": 0.5,
  "LEQEMBI® (Lecanemab) Approved for the Treatment of Alzheimer’s Disease in Australia": 0.8,
  "How the Narrative Around Lam Research Is Shifting With Emerging AI and Semiconductor Trends": 0.5,
  "AI Chips Update - Patmos Transforms Kansas City With AI Datacenter Expansion": 0.8,
  "Will Weaker Freight Volumes Shift the Efficiency Edge at Old Dominion (ODFL)?": 0.1,
  "Marriott signs agreements to launch Series hotel brand in US": 0.5,
  "The Bull Case For Marriott (MAR) Could Change Following Launch of Series Brand in Five Key US Cities": 0.6,
  "Fastenal Company (FAST) is Growing Amid End Market Weakness": 0.5,
  "Does Diamondback Energy’s Share Price Drop Signal Opportunity After Q1 2025 Earnings?": 0.2,
  "James Moore Technology Services to Expand Regional Footprint Through New Partnership Initiative": 0.5,
  "Sunrun and BGE Operate Nation’s First Residential Vehicle-To-Grid Distributed Power Plant Using Ford F-150 Lightning Trucks": 0.5,
  "Apica Addresses Enterprise Observability Cost Crisis with Anti-Vendor-Lock-In Telemetry Pipeline Solution": 0.5,
  "VoIP-Pal Has Filed and Served Amended Antitrust Complaints Against Apple, Google, and Samsung": -0.5,
  "A Look at Constellation Energy’s Valuation After Accelerated Nuclear Restart and Microsoft Power Deal": 0.5,
  "How Investors Are Reacting To Booking Holdings (BKNG) Facing EU Scrutiny Under Digital Services Act": 0.1,
  "Posthaste: Toronto's condo 'deep freeze' could reshape the housing landscape for years to come, warns RBC": -0.5,
  "Buy 5 Financial Technology Giants Amid Fed's Low-Interest-Rate Regime": 0.5,
  "nVent Electric and MarineMax have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Better Artificial Intelligence Stock: ASML vs. Nvidia": 0.5,
  "Cintas Corporation Announces Fiscal 2026 First Quarter Results": 0.0,
  "Here's How Much a $1000 Investment in Autodesk Made 10 Years Ago Would Be Worth Today": 0.5,
  "Here's How Much a $1000 Investment in KLA Made 10 Years Ago Would Be Worth Today": 0.5,
  "PepsiCo pressured by Elliott to weigh bottling spin-off": 0.1,
  "Cintas: Fiscal Q1 Earnings Snapshot": 0.0,
  "Wedbush Adds Palo Alto Networks (PANW) to Best Ideas List, Reaffirms Outperform Rating": 0.8,
  "Cintas’s (NASDAQ:CTAS) Q3 Sales Beat Estimates But Full-Year Sales Guidance Misses Expectations Significantly": -0.5,
  "Cintas Raises Full-Year Guidance. The Stock Sinks Anyway.": -0.5,
  "Voxpopme Expands AI Moderator With Smart Probing and Stimulus Testing": 0.5,
  "Digi Z45 Industrial Controller Now Certified on T-Mobile": 0.2,
  "AI Adoption Sees Rapid YoY Growth in Canadian Workplaces": 0.8,
  "Is Most-Watched Stock Intuitive Surgical, Inc. (ISRG) Worth Betting on Now?": 0.2,
  "Marvell Announces Additional $5 Billion Stock Repurchase Authorization and $1 Billion Accelerated Share Repurchase Program": 0.8,
  "The Trade Desk vs. Magnite: Which Ad-Tech Stock is the Better Buy Now?": 0.5,
  "Cintas beats Q1 expectations, raises full-year guidance": 0.8,
  "Lam Research Soars 71% in Six Months: Book Profit or Hold LRCX Stock?": 0.5,
  "TTD's JBP Momentum Hits Record High: Unlocking Durable Growth Ahead?": 0.8,
  "Micron beats on earnings as company sales rise 46% on AI boom - https://www-cnbc-com.cdn.ampproject.org/v/s/www.cnbc.com/amp/2025/09/23/micron-mu-q4-2025-earnings-report.html?amp_js_v=0.1&amp_gsa=1#webview=1&cap=swipe Micron shares have nearly doubled so far in 2025. The company makes memory and storage, which are important components for computers. Micron has been one of the winners of the artificial intelligence boom. That's because high-end AI chips such as those made by Nvidia require increasing amounts of high-tech memory called high-bandwidth memory, which Micron makes.": 0.8,
  "Brokers Suggest Investing in CrowdStrike (CRWD): Read This Before Placing a Bet": 0.5,
  "Why Coinbase Could Be the Netflix of Crypto": 0.6,
  "Cintas (CTAS) Q1 Earnings and Revenues Top Estimates": 0.8,
  "Why This 1 Growth Stock Could Be a Great Addition to Your Portfolio": 0.8,
  "HSBC Downgrades lululemon athletica (LULU) Stock to Hold": -0.5,
  "Uniform retailer Cintas raises annual forecasts on resilient demand": 0.6,
  "SOUR PATCH KIDS Glow Ups Are Coming to Canada: An Experiential Gummy Candy That Glows Under Blacklight": 0.6,
  "Cintas (CTAS) Q1 Earnings: How Key Metrics Compare to Wall Street Estimates": 0.5,
  "'They Want Their Own DoorDash, They're Gonna Be the Ones That Are Paying for It.' Influencer Defends Teaching Money by Making Her Tweens Cover Extras": 0.2,
  "Is an AI bubble forming? We could be pouring gas 'on the fire.'": -0.6,
  "Gilead Sciences Surges 26.5% YTD: Buy, Sell or Hold the Stock?": 0.2,
  "Cintas Lifts Fiscal 2026 Outlook Following First-Quarter Beat": 0.6,
  "Alibaba Stock Jumps After Chinese Tech Titan Boosts AI Bet": 0.8,
  "Barclays downgrades Keurig Dr Pepper: Sees elevated noise and uncertainty": -0.6,
  "MRVL's Carrier Infrastructure Segment Recovering: What Lies Ahead?": 0.5,
  "CRDO vs. MRVL: Which Connectivity Stock Has More Upside in the AI Era?": 0.5,
  "Marvell Tech To Buyback Almost 10% Of Outstanding Stock": 0.5,
  "1 Reason Wall Street Is Obsessed With Synopsys Stock": 0.5,
  "AVGO's Infrastructure Software Sales Rise: A Sign of More Upside?": 0.6,
  "Must-Watch Robotics Stocks That Could Drive Future Growth Trends": 0.5,
  "Are Nvidia, Oracle mega-deals signs of an AI bubble forming?": -0.5,
  "Marvell Stock Has Been Hot. Now the AI Chip Maker Is Buying Back Shares.": 0.6,
  "The Power of Reverse Logistics": 0.5,
  "Cintas' Q1 Earnings Surpass Estimates, Revenues Increase Y/Y": 0.8,
  "Cintas Raises Outlook As CEO Points To Strong Cash Flow": 0.8,
  "Top Stock Movers Now: Lithium Americas, Alibaba, Freeport-McMoRan, Adobe, and More": 0.5,
  "Will Rising User Base Continue to Drive Axon's Software & Services Unit?": 0.5,
  "Bloom Energy's Fundamentals Fail to Justify Huge Stock Rally on AI Hype, BofA Says": -0.6,
  "MARUY or HON: Which Is the Better Value Stock Right Now?": 0.2,
  "EXC or OGE: Which Is the Better Value Stock Right Now?": 0.2,
  "Keurig Dr Pepper Inc. (KDP) Rated ‘Overweight’ at Piper Sandler, Price Target Cut": 0.1,
  "Why Marvell Technology (MRVL) Stock Is Up Today": 0.5,
  "Why Take-Two (TTWO) Shares Are Trading Lower Today": -0.5,
  "Alibaba jumps on AI spending, Tesla, Marvell share buybacks": 0.5,
  "Cocoa Prices Rebound as Low Prices Spur Demand": 0.6,
  "BIIB's sNDA for Higher Dose of SMA Drug Spinraza Gets FDA's CRL": -0.5,
  "Biogen’s high-dose Spinraza turned down by FDA due to CMC troubles": -0.6,
  "Intuit Boosts Agentic AI Development With Rapid GenOS Growth": 0.6,
  "COHR vs. ARM: Which Tech Growth Stock Offers More Upside Now?": 0.5,
  "ALAB Rides on Strong Demand for PCIe Solution: A Sign of More Upside?": 0.6,
  "Instagram hits 3B users, Intel rises, Keurig Dr Pepper downgrade": 0.2,
  "Market Chatter: Paramount Skydance Has Yet to Make Formal Bid for Warner Bros. Discovery": 0.2,
  "Xcel Energy Reaches Agreements in Principle to Resolve All Litigation Related to 2021 Marshall Fire": 0.5,
  "Bloom Energy Stock Is an AI Darling. Why Investors Should Sell Anyway.": -0.5,
  "Trump threatens ABC: Why telecom sector faces a 'bigger threat'": -0.6,
  "Cocoa Prices Close Higher on Tighter Inventories": 0.6,
  "Cardlytics Shares Rise After Citron Research Says Company Has Multiple Opportunities to Rebuild": 0.8,
  "FINRA has approved amendments that would replace the long-standing minimum equity rule for pattern day trading - https://www.cnbc.com/2025/09/24/day-trading-is-about-to-get-easier-for-smaller-retail-investors.html > Regulators are moving to dismantle one of the most controversial barriers for active retail traders the $25,000 minimum equity rule for pattern day trading. The Financial Industry Regulatory Authority on Tuesday approved amendments that would replace the long-standing threshold, making active day trading more accessible to smaller accounts. The change is pending approval by the Securities": 0.6,
  "Marvell Rolls Out $5 Billion Buyback Amidst Investor Enthusiasm": 0.8,
  "Applied And GlobalFoundries Team Up On AI Photonics": 0.5,
  "Sector Update: Consumer Stocks Rise Late Afternoon": 0.5,
  "Sector Update: Energy Stocks Gain Late Afternoon": 0.5,
  "Sector Update: Tech Stocks Retreat Late Afternoon": -0.5,
  "GOOGL: Waymo for Business - **Waymo launches corporate robotaxi accounts to court business travel** https://www.reuters.com/business/autos-transportation/waymo-launches-corporate-robotaxi-accounts-court-business-travel-2025-09-24/ \"Alphabet-owned (GOOGL.O) Waymo on Wednesday rolled out \"Waymo for Business,\" a corporate program that lets companies set up accounts so employees can hail its robotaxis in Los Angeles, Phoenix, San Francisco, Austin and Atlanta.\" \"Early customers include Phoenix-based online used-car seller Carvana (CVNA.N).\" \"Waymo has been focusing on airport access to woo frequent business travelers. The company already serves Phoenix": 0.6,
  "GE HealthCare announces cash dividend for third quarter of 2025": 0.2,
  "Synopsys Collaborates with TSMC to Drive the Next Wave of AI and Multi-Die Innovation": 0.6,
  "Synopsys Collaborates with TSMC to Enable 2D and 3D Design Solutions": 0.5,
  "Why Lam Research (LRCX) Shares Are Sliding Today": -0.5,
  "Cadence Partners with TSMC to Power Next-Generation Innovations Using AI Flows and IP for TSMC Advanced Nodes and 3DFabric": 0.6,
  "Analysts Lift Workday (WDAY) Price Target But Say Growth Is Already Priced In": 0.2,
  "Palo Alto Networks (PANW) Seen as Market Leader in Expanding Cybersecurity Market": 0.8,
  "Why Axon Enterprise Stock Was Falling Today": -0.5,
  "US Equity Indexes Lower on Rising Treasury Yields, Fed's Cautious Rate-Cut Approach": -0.5,
  "Airbnb Services: What We Know 4 Months After Launch": 0.2,
  "\"5 Reasons Amazon Will Double\" - Joseph Carlson - Disclosure I'm a fan of Joseph Carlson and a holder of Amazon. Posting this so smarter people than myself can poke holes at the thesis and spark productive discussion. I can't post link to the youtube video per subreddit rules. Below is a Claude summary of the video transcripts. ## Amazon Stock Analysis - Main Thesis • **Current underperformance**: Amazon is the worst performing Mag 7": 0.5,
  "Top Research Reports for Broadcom, Oracle & Cisco Systems": 0.0,
  "Netflix (NFLX) Suffers a Larger Drop Than the General Market: Key Insights": -0.5,
  "Fortinet (FTNT) Dips More Than Broader Market: What You Should Know": -0.5,
  "Lam Research (LRCX) Declines More Than Market: Some Information for Investors": -0.5,
  "Take-Two Interactive (TTWO) Declines More Than Market: Some Information for Investors": -0.5,
  "Axon Enterprise (AXON) Suffers a Larger Drop Than the General Market: Key Insights": -0.5,
  "UPS, is this a buy? - UPS has been floating around its 1 year low for a while now. In fact, it is now about $6 lower than its 10 year low. It has great cash flow, a low P/E, is executing a cost cutting effort, and has shed most of its low margin channels, like Amazon packages. So, with a 7.8% dividend yield, why isn't this a fantastic value and income buy? Full disclosure:": 0.8,
  "Cintas Corp (CTAS) Q1 2026 Earnings Call Highlights: Strong Revenue Growth and Strategic ...": 0.8,
  "(Item 8.01) Other Events. As previously disclosed, on July 30, 2025, Palo Alto Networks, Inc., a Delaware corporation (“PANW”), entered into an Agreement and Plan of Merger (the “Merger Agreement”) by and among PANW, Athens Strategies Ltd., a company organized under the laws of the State of Israel and a wholly owned subsidiary of PANW (“Merger Sub”), and CyberArk Software Ltd., a company organized under the laws of the State of Israel (“CyberArk”). Pursuant to the Merger": 0.1,
  "(Item 8.01) .Other Events On September 23, 2025, American Electric Power Company, Inc. (the “Company”) entered into an Underwriting Agreement with BofA Securities, Inc., Goldman Sachs & Co. LLC, Mizuho Securities USA LLC, Morgan Stanley & Co. LLC and Truist Securities, Inc. as representatives of the underwriters named therein, relating to the offering and sale by the Company of $1,100,000,000 of 5.800% Fixed-to-Fixed Reset Rate Junior Subordinated Debentures, Series C, due 2056 (the “Series C Debentures”) and": 0.1,
  "(Item 8.01) Other Events The following executive officers of Marvell Technology, Inc. (the “Company”) purchased shares of common stock of the Company in the open market on September 25, 2025 as follows: Name Title # of shares purchased Weighted average purchase price ($) Matt Murphy Chairman and Chief Executive Officer 13,600 77.09 Sandeep Bharathi President, Data Center Group 3,400 78.03 Chris Koopmans President and Chief Operating Officer 6,800 78.03 Willem Meintjes Chief Financial Officer 3,400 78.03": 0.5,
  "(Item 2.02) . Results of Operations and Financial Condition On September 25, 2025, the Company issued a press release containing its operating results for the 16-week fourth quarter and the 52-week fiscal year, ended August 31, 2025. A copy of the press release is attached as Exhibit 99.1. In addition, a copy of the Company's earnings release supplement for the fourth quarter of fiscal 2025 is attached as Exhibit 99.2.": 0.0,
  "Rooted in Culture: T-Mobile Report Unveils Latino Trends in Work, Entertainment and Connection": 0.5,
  "PINS - buy or hold; I won’t sell. - I love Pinterest (PINS) as a company and bought because it’s a fun story, and I truly feel it’s going to take off again. Today’s close was lower than I bought. So I’m wanting to buy more. But looking for community thoughts on why to buy now or to keep watch. So what’s the consensus? Looking for all the whys and why nots before tomorrows open!!!": 0.6,
  "Jefferies Increases Its Price Target on Constellation Energy Corporation (CEG) to $347, Keeps ‘Hold’ Rating": 0.5,
  "World Rivers Day: Agoda Highlights Asia's Most Captivating Waterways": 0.5,
  "Winners And Losers Of Q2: Paychex (NASDAQ:PAYX) Vs The Rest Of The HR Software Stocks": 0.2,
  "3 of Wall Street’s Favorite Stocks with Questionable Fundamentals": -0.5,
  "3 Low-Volatility Stocks We’re Skeptical Of": -0.5,
  "3 Cash-Producing Stocks That Concern Us": -0.5,
  "3 Industrials Stocks with Open Questions": -0.5,
  "1 of Wall Street’s Favorite Stock on Our Buy List and 2 We Avoid": 0.2,
  "1 Safe-and-Steady Stock on Our Watchlist and 2 We Question": 0.0,
  "3 Nasdaq 100 Stocks with Promising Prospects": 0.5,
  "2 Cash-Producing Stocks to Own for Decades and 1 We Find Risky": 0.2,
  "2 High-Flying Stocks to Consider Right Now and 1 Facing Headwinds": 0.5,
  "HSBC breaks new ground in quantum-enabled algorithmic trading with IBM quantum computers - >Global financial services company HSBC has announced the world’s first-known evidence for the potential of quantum computers to solve valuable problems in the field of algorithmic bond trading. In an ongoing collaboration with IBM®, researchers combined quantum and classical computational resources to analyze its own real-world, production-scale bond trading data. The hybrid quantum-classical methods employed by the HSBC-IBM team yielded up to": 0.8,
  "JDE Peet’s transfers shares and grants awards to participants under its employee incentive plans": 0.2,
  "In this economy!? Maxwell House rebrands as Maxwell Apartment": -0.5,
  "2 Monster Stocks to Hold for the Next 20 Years": 0.5,
  "Which stock would’ve given you financial freedom if you never sold? - When one has been investing for a while, there always comes that moment where one think, “Damn, I really shouldn’t have sold that one which could have made me FIRE.” Of course, I know focusing on the present matters more, but sometimes looking back carries its own meaning. So what’s the one stock you personally regret not holding onto longer? except bitcoin.": 0.2,
  "Kraft Heinz pilots AI agent to streamline ketchup production": 0.5,
  "Tax Management Market Global Forecast Report 2025-2030 | Indirect Tax Segment to Grow Fastest Amid Digital Compliance Shifts": 0.5,
  "Taste Modulators Market Research Report 2022-2032: North America's 37.1% Market Share Driven by Health Trends, USFDA Sodium Targets and Investments from Coca-Cola and PepsiCo": 0.6,
  "My 3 Favorite Stocks to Buy Right Now": 0.5,
  "5 Mind-Boggling Stats From CrowdStrike's Investor Day Presentation": 0.2,
  "Artificial Intelligence in Mobile Apps Global Market Overview 2025-2034: Google, Apple, Microsoft, AWS, Qualcomm and NVIDIA Lead Innovation with Hardware Acceleration and Pre-Trained Models": 0.5,
  "Higher Electricity Prices Aren’t All Good for Utilities": -0.5,
  "r/Stocks Daily Discussion & Options Trading Thursday - Sep 25, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why": 0.2,
  "Stocks Slip Before the Open With Focus on U.S. Economic Data and Fed Speak": 0.1,
  "These 2 Stocks Could Be Prime Takeover Targets, According to Analysts": 0.5,
  "Market Chatter: US Lawmakers Seek Answers From Major Companies on H-1B Visa Use": 0.1,
  "TTTECH’s TTEthernet End System selected by Honeywell Aerospace for its next-generation Flight Management System (nFMS) for Air Transport Platforms": 0.6,
  "For the First Time in 133 Years, Maxwell House Rebrands as \"Maxwell Apartment\"": 0.2,
  "ECARX Delivers Next-Generation AI Cockpit Experience for Launch of Lynk & Co 07 and 08 EM-P": 0.5,
  "Palo Alto Networks' (NASDAQ:PANW) Returns On Capital Are Heading Higher": 0.8,
  "Copper price spikes on Freeport’s Grasberg force majeure - https://www.mining.com/copper-price-spikes-on-freeports-grasberg-force-majeure/#google_vignette Copper prices jumped Wednesday after Freeport-McMoRan (NYSE: FCX) declared force majeure on contracted supplies from its Grasberg Block Cave mine in Indonesia. Three-month futures traded above $10,496 per ton ($4.7710 per lb.) on the CME, up 2.74% for the day. In London, copper for delivery in three months rose as much as 2% to $10,172 a ton on the London Metal Exchange, the highest level": 0.5,
  "3 AI Stocks to Buy Hand Over Fist": 0.5,
  "The Ultimate High Yield Healthcare Stock to Buy With $10,000 Right Now": 0.5,
  "Taiwan Semiconductor Unveils Ultra-Advanced Chip Tech": 0.8,
  "AI trade has 'more room to run': Investment plays beyond Nvidia": 0.5,
  "This Week In Energy Transition - Malaysia's Renewable Energy Surge Spurs Economic Growth": 0.8,
  "Exploring 3 High Growth Tech Stocks in the US Market": 0.5,
  "Vertex Announces Key Advancements Across Kidney Portfolio": 0.5,
  "Is IDEXX Laboratories, Inc. (NASDAQ:IDXX) Worth US$627 Based On Its Intrinsic Value?": 0.2,
  "Xcel (XEL) Moves 6.7% Higher: Will This Strength Last?": 0.6,
  "HONEYWELL TO RELEASE THIRD QUARTER FINANCIAL RESULTS AND HOLD ITS INVESTOR CONFERENCE CALL ON THURSDAY, OCTOBER 23": 0.0,
  "Gilead Foundation Grants $6.5 Million in Commitment to STEM Education": 0.8,
  "Nayya Partners with Paychex to Empower Workforces with AI-Driven Benefits": 0.6,
  "Fastenal Company (NASDAQ:FAST) is favoured by institutional owners who hold 85% of the company": 0.5,
  "Starbucks to close 1% of stores and cut 900 jobs in $1B restructuring under CEO Niccol - No paywall: [https://finance.yahoo.com/news/starbucks-close-stores-part-restructuring-110840232.html](https://finance.yahoo.com/news/starbucks-close-stores-part-restructuring-110840232.html) >Starbucks said on Thursday it would close underperforming coffee shops, mainly in North America, and cut about 900 jobs as part of a restructuring plan under CEO Brian Niccol that would cost about $1 billion. >The company has been revamping its U.S. operations under Niccol's strategy to restore a traditional coffeehouse atmosphere in stores by": -0.2,
  "US support boosts Argentina stocks, bonds and peso - https://www.reuters.com/world/americas/view-us-support-boosts-argentina-stocks-bonds-peso-2025-09-24/ \"U.S. Treasury Secretary Scott Bessent’s renewed pledge to 'do what is needed' to support Argentina in a post on X earlier today, including purchases of Argentinian sovereign U.S. dollar bonds and a potential $20 billion credit line, should give Argentina’s government breathing space ahead of the midterm elections in October. Crucially, though, it doesn’t solve the country’s underlying issues, in particular the misaligned exchange rate.\"": 0.6,
  "Latest News In E-Commerce - Heat-Resistant Packaging Revolutionizes Temperature-Sensitive Product Delivery": 0.5,
  "Regenerative Medicine Industry Trends and Growth Strategies, 2025-2030 Featuring Novartis, Biogen, GlaxoSmithKline, Baxter International, and Boehringer Ingelheim": 0.5,
  "Cadence Unveils AI-Driven ROCS X AI-Enabled Molecular Search, Unlocking Multi-trillion Molecule Virtual Screening": 0.8,
  "GE HealthCare debuts AI-supported solution, designed to improve and shorten the radiation therapy workflow, at ASTRO 2025": 0.6,
  "Game On: T-Mobile Unveils Top 25 High Schools in Friday Night 5G Lights Competition": 0.6,
  "Marvell to Showcase Interconnect Portfolio for Accelerated Infrastructure at ECOC 2025": 0.5,
  "ServiceTitan and Verisk Team Up to Bring Xactimate® to New Roofing and Exterior Contractors": 0.5,
  "The Trade Desk (TTD) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Texas Instruments Incorporated (TXN) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Vertex Pharmaceuticals Incorporated (VRTX) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "lululemon athletica inc. (LULU) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Why This Auto Parts Stock Is Worth Its Premium Price": 0.5,
  "Scotiabank upgrades CrowdStrike on stronger customer traction": 0.6,
  "Seeking Clues to Paychex (PAYX) Q1 Earnings? A Peek Into Wall Street Projections for Key Metrics": 0.5,
  "Why Adobe (ADBE) International Revenue Trends Deserve Your Attention": 0.5,
  "CrowdStrike Stock: Is CRWD Underperforming the Technology Sector?": 0.1,
  "Lululemon: Under Pressure, Overlooked Fundamentals, and Undervalued": 0.2,
  "What Makes CoStar Group (CSGP) an Investment Bet?": 0.2,
  "Can the Snapdragon X2 Elite PC Chip Be a Trump Card for Qualcomm?": 0.2,
  "Intel jumps 8%… while Marvell spends $5B on buybacks - This morning while scrolling through Bitget’s RWA perpetual futures index, I stumbled on something I honestly didn’t expect: **Intel pumping +8%** and Marvell announcing a $5 billion share buyback. I wasn’t expecting to see these two “old guards” of semiconductors shaking the market at the same time. For Intel, the rally came from a mix of catalysts lining up. Micron’s strong earnings gave confidence back": 0.6,
  "Is Synopsys (SNPS) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Digi International’s Z45 device now certified on T-Mobile network": 0.5,
  "Is MasTec's Communications Boom a Long-Term Catalyst for MTZ Stock?": 0.5,
  "Oracle initiated, Ulta Beauty upgraded: Wall Street's top analyst calls": 0.5,
  "Here's Why Warner Bros. Discovery (WBD) is a Strong Value Stock": 0.8,
  "Amazon upgraded, Adobe downgraded: Wall Street’s top analyst calls": 0.2,
  "How Cisco Is Empowering Brazil's Next Generation of Cybersecurity Talent": 0.6,
  "These Overlooked AI Stocks Could Deliver Explosive Returns Over the Next 5 Years": 0.8,
  "CTAS Q1 Deep Dive: Broad-Based Growth and Technology Investments": 0.6,
  "CG Developers Global announces signing with Marriott International and the launch of the first JW Marriott Residence in Dubai": 0.8,
  "Zip Forward 2025: \"Agents of Change\" to Unite 500+ Finance and Procurement Leaders in San Francisco": 0.5,
  "PayPal Taps Spark to Boost PYUSD Liquidity by $1B Through DeFi Lending": 0.6,
  "Metro by T-Mobile Reinforces Wireless Value With \"The Metro Drop\" — A Streetwear Collab That Puts Savings Back in Style": 0.6,
  "Form 8.3 - Qualcomm Incorporated": 0.0,
  "Investing in Exelon (NASDAQ:EXC) five years ago would have delivered you a 107% gain": 0.8,
  "PayPal's Buy Now Pay Later Grows Fast: What Drives This Surge?": 0.5,
  "Zacks Industry Outlook Highlights Vertiv, Roper Technologies and CoStar Group": 0.5,
  "Lululemon downgraded amid US weakness and tougher competition": -0.7,
  "Should You be Excited about the Prospects for Lam Research Corporation (LRCX)?": 0.5,
  "Here’s Columbia Seligman Global Technology Fund’s Comment on Adobe (ADBE)": 0.1,
  "PayPal taps DeFi’s Spark to inject $1B into PYUSD stablecoin": 0.5,
  "The Zacks Analyst Blog Highlights Broadcom Oracle, Cisco Systems and United-Guardian": 0.5,
  "ADI vs. NXPI: Which Stock Has an Edge in Analog Signal Processing?": 0.2,
  "Lam Research Teams Up With JSR: Can it Lead in High-NA EUV?": 0.5,
  "Bloom Energy, Oklo Stocks Slide as Analysts Question Gains": -0.6,
  "Lululemon Bets on China’s Wellness Boom, Releases Report With Top Academy Tsinghua": 0.5,
  "New Speakers Announced: 5th Palm Beach CorpGov Forum | Preview Panelists & Topics": 0.2,
  "Cross Ocean Partners and OakPoint Real Estate Acquire Encino Trace, a 324,342 SF Class A Office Campus in Austin, TX": 0.5,
  "Citi projects $1.9 trillion stablecoin boom by 2030": 0.6,
  "From Compassion to Connection - Inside T-Mobile's Disaster Response": 0.5,
  "Okta (OKTA) Down 3.4% Since Last Earnings Report: Can It Rebound?": 0.2,
  "Amazon to pay $2.5 billion to settle Prime deception allegations - No paywall: [https://finance.yahoo.com/news/amazon-pay-2-5-billion-152456030.html](https://finance.yahoo.com/news/amazon-pay-2-5-billion-152456030.html) [Amazon.com](http://Amazon.com) will pay $2.5 billion in fines and redress to Prime subscribers to settle the U.S. Federal Trade Commission's case alleging the retail juggernaut signed users up for the subscription without their consent and made it difficult to cancel, the FTC said on Thursday. Of that, $1.5 billion will go into a fund to repay eligible Prime subscribers and Amazon will": -0.6,
  "PYPL or MA: Which Is the Better Value Stock Right Now?": 0.2,
  "Why Gilead Sciences (GILD) Deserves Attention in the Cheap Quarterly Dividend Stocks Category": 0.5,
  "ComEd Names Ajit Apte as SVP of Customer Operations": 0.0,
  "Cocoa Prices Under Pressure on Improved Weather in West Africa": -0.6,
  "Update: Market Chatter: US Lawmakers Seek Corporate Feedback on H-1B Visa Use": 0.1,
  "Axon to Expand Public Safety Platform With Prepared Acquisition": 0.5,
  "Four-Channel Thermocouple Measurement with Integrated Conditioning Now Possible with ±1.5°C System Accuracy": 0.2,
  "Marvell Technology stock rises after executives buy shares worth over $2M": 0.8,
  "US Plans to Use Emergency Powers to Save More Coal Plants": -0.5,
  "Why Is Marvell Technology Stock Climbing Thursday?": 0.2,
  "Jim Cramer Notes T-Mobile’s Valuation Alongside Earnings Growth Forecast": 0.5,
  "Jim Cramer on Expedia: “It’s Much Cheaper Than Key Competitor”": 0.6,
  "Why GE HealthCare (GEHC) Shares Are Trading Lower Today": -0.5,
  "McLaren Racing CEO talks F1 growth, Netflix, Big Tech sponsors": 0.5,
  "CrowdStrike's Scale And Profits Make It Rare Asset In Software: Analyst": 0.6,
  "Exploring High Growth Tech Stocks in the US Market": 0.5,
  "CrowdStrike Named a Frost Radar™ Leader in Cloud Workload Protection": 0.6,
  "Morgan Stanley warns AI could sink 42-year-old software giant": -0.6,
  "Axon Therapies Raises $32M in Oversubscribed Series A to Transform Heart Failure Treatment": 0.8,
  "Morgan Stanley Is Pounding the Table on this Chip Stock": 0.6,
  "Cocoa Prices Retreat as West African Cocoa Crop Prospects Improve": 0.5,
  "Valence Raises $50M Series B to Give Every Employee an AI Coach at Work": 0.6,
  "Cisco rolls out software aimed at connecting a quantum computing cloud": 0.5,
  "UPST: AI + Finance with BIG squeeze potential at play! - $UPST (Upstart) is a AI powered lending platform and currently have around a **26%** float short with **3.2** days to cover. In 2021 they hit almost **$400** per share and with the lower interest rate environment their fundamentals are drastically improving again! **Why it’s squeezable** * **Short interest:** **\\~21.1M shares** short = **\\~26.3%** of float; **days to cover \\~3.2**. * **Float:** \\~**84.1M** shares. *": 0.8,
  "Sector Update: Consumer Stocks Slide Late Afternoon": -0.5,
  "ADP Nominates Karen S. Lynch and Robert H. Swan to Board of Directors": 0.5,
  "Google Shakes Up Cryptocurrency, Digital Payments With AI Agents Protocol": 0.5,
  "HUMAIN Horizon Pro: The Future of Agentic AI Personal Computing Unveiled by CEO Tareq Amin at Qualcomm's Snapdragon Summit": 0.8,
  "Qualcomm Unveils Next-Gen Snapdragon Mobile Platform": 0.5,
  "Cloudflare To Issue Stablecoin Amid Expected Rise Of Agentic E-Commerce": 0.5,
  "ASML an 'obvious gem' among international stocks, market expert says": 0.8,
  "Best data center pick and shovel buys - I’m taking some Tesla profit and maybe a couple other things. I’m a little late to the AI pick and shovel stocks just went big on Nividia a while back I’m interested in power supply, hvac and other solid players. Anyone have any good picks to review.": 0.2,
  "September's Fastest-Rising S&P 500 Stock: Not What You Would Expect": 0.2,
  "Marvell Stock Rallies After CEO Gives Reassuring Outlook": 0.8,
  "Exclusive-Swedish Fish maker Mondelez will switch food dyes to natural, not synthetic": 0.5,
  "Excel sheet to mock portfolio??? - I have a Google/Excel sheet that has ticker symbols and an allocation percentage for each ticker (e.g. AAPL -- 2.5%) that adds up to 100%. I want to port this over to a program that will change it into a mock portfolio for me. Please note that this necessitates simulating fractional share purchases, which I have not been able to find an app that does this, paper-wise, yet. Any": 0.2,
  "Why Lululemon (LULU) Shares Are Sliding Today": -0.5,
  "Axon (AXON) Stock Trades Up, Here Is Why": 0.5,
  "Why Regeneron (REGN) Shares Are Falling Today": -0.5,
  "Meta in talks with Google to use Gemini to improve Ad targeting - Google continuing their positive news on the AI front and one of their major rivals in the advertisement space to use their models is positive indication to the competency of their AI models. It seems there are only three major players in the AI model space - Google, OpenAI, Anthropic. Only one of them have their own infrastructure spanning across the globe": 0.6,
  "Why Is Marvell Technology (MRVL) Stock Rocketing Higher Today": 0.6,
  "US sounds alarm over hackers targeting Cisco security devices": -0.6,
  "Paypal (PYPL) Suffers a Larger Drop Than the General Market: Key Insights": -0.5,
  "Constellation Energy Corporation (CEG) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "PepsiCo (PEP) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "Gilead Sciences (GILD) Declines More Than Market: Some Information for Investors": -0.5,
  "Here's Why ON Semiconductor Corp. (ON) Fell More Than Broader Market": -0.5,
  "Vertex Pharmaceuticals (VRTX) Ascends While Market Falls: Some Facts to Note": 0.5,
  "Paccar (PCAR) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Why Kraft Heinz (KHC) Dipped More Than Broader Market Today": -0.5,
  "Why Qualcomm Stock Tumbled on Thursday": -0.5,
  "Ross Stores’ (ROST) Dividend Growth: A Key Highlight in Retail Dividend Stocks": 0.6,
  "Tesla’s continuing sales slump in Europe weighs on stock price - Tesla shares fell more than 4% on Thursday after data out of Europe showed a continuing sales slump for the automaker, despite strong demand for fully electric vehicles in the region. Tesla EV registrations in Europe, a proxy for sales, fell by about 23% year-over-year in August, according to data from the European Automobile Manufacturers’ Association (ACEA) on Thursday. There were 14,831 Tesla EV": -0.6,
  "Trump announces tariffs on kitchen cabinets, bathroom vanities, upholstered furniture, heavy trucks, and pharmaceuticals starting Oct. 1st - Reuters article on all tariffs: https://www.reuters.com/business/trump-says-us-will-impose-25-tariff-heavy-trucks-imports-october-1-2025-09-25/ > WASHINGTON, Sept 25 (Reuters) - President Donald Trump on Thursday announced a new round of punishing tariffs, saying the United States will impose a 100% tariffs on imported branded drugs, 25% tariff on imports of all heavy-duty trucks and 50% tariffs on kitchen cabinets. > > Trump also said he": -0.8,
  "(Item 8.01) Other Events Attached as Exhibit 99.1 and incorporated by reference herein is a press release dated September 26, 2025, issued by Comcast Corporation.": 0.0,
  "(Item 1.01) Entry into a Material Definitive Agreement. On September 25, 2025, Applied Materials, Inc. (“Applied”) entered into a credit agreement (the “Credit Agreement”) for a 364-day $2.0 billion revolving credit facility with Bank of America, N.A., as administrative agent (the “Administrative Agent”), and the lenders party thereto (collectively, the “Lenders”). The Credit Agreement provides for unsecured borrowings in an initial amount not to exceed $2.0 billion outstanding at any one time. The Credit Agreement includes a\n\n(Item 1.01) above, on September 25, 2025, Applied entered into the Credit Agreement. The information set forth in\n\n(Item 1.01) is incorporated herein by reference. Applied has not made any borrowings under the Credit Agreement as of this date.": 0.2,
  "BofA Initiates Coverage on Atlassian (TEAM) With Neutral Rating, $200 Price Target": 0.5,
  "CyberArk (CYBR) Stock Downgraded Amid Pending Palo Alto Networks Acquisition": -0.5,
  "Agoda Highlights Rise of Secondary Destinations in Travel Ahead of World Tourism Day": 0.5,
  "DIGITIMES Asia Tech Forum 2025: Qualcomm and MediaTek take smartphone rivalry to the cloud in AI chips": 0.5,
  "Chinese stocks are holding up, any thoughts? - I’ve been noticing a jump in volume on some Chinese names. BABA, BYD, Xiaomi and a few others have actually outperformed the Nasdaq over the past few days. Sure, the usual risks are still there like regulation and geopolitics. But looking at valuations, these names seem pretty cheap. PEs are low and there might still be some long-term value to dig into. Also saw that China just": 0.6,
  "Massive $OPEN dilution incoming October 1? Seems anyone with a cost basis above $3ish might get royally screwed? - A link to the 8-K filing: https://investor.opendoor.com/node/10771/html. There was talk about this in the comment section of a post but I felt this deserved its own post and a deeper look. It seems if the meme pump of this stock holds steam until October 1, the conditions to allow for conversion of the notes will be": -0.6,
  "CSX (CSX): Buy, Sell, or Hold Post Q2 Earnings?": 0.2,
  "Stifel Maintains Buy Rating on Intuit (INTU) After Investor Day": 0.6,
  "Adobe (ADBE) Sees Strong Growth for its AI Innovations Among Leading Enterprises": 0.8,
  "Seeking Advice on some stocks - I have a bit of money to invest in a stock and I'm torn between a few. I'm considering ONDS, POET and SOUN...all growing with potential but some risk as well. Any advice on which one may be the best investment? I'm also open to other suggestions. Thanks!": 0.5,
  "3 Nasdaq 100 Stocks for Long-Term Investors": 0.0,
  "1 Consumer Stock to Target This Week and 2 We Find Risky": 0.2,
  "1 S&P 500 Stock with Impressive Fundamentals and 2 We Question": 0.2,
  "1 S&P 500 Stock to Own for Decades and 2 Facing Headwinds": 0.2,
  "2 Large-Cap Stocks to Keep an Eye On and 1 We Question": 0.2,
  "3 S&P 500 Stocks for Long-Term Investors": 0.0,
  "Trump Targets Chip Imports With Tariff Threats - Push for More Domestic Semiconductor Production - Trump Takes Aim at Chip Makers With New Plan to Throttle Imports - Administration wants domestic manufacturing to match imports and would impose tariffs on those companies that don’t step up production. The Trump administration is weighing a new plan to reduce dramatically the U.S.’s reliance on semiconductors made overseas, hoping to spur domestic manufacturing and reshape global supply chains.": 0.6,
  "BILL- An Attractive Turnaround Play in the Fintech Space": 0.8,
  "Nvidia’s AI Deals Might Be ‘Circular.’ They’re Also Smart Business.": 0.6,
  "Earnings Preview: What To Expect From Fastenal's Report": 0.5,
  "Lumen Accelerates Multi-Billion-Dollar Network Expansion to Meet Soaring AI Demand - [https://ir.lumen.com/news/news-details/2025/Lumen-Accelerates-Multi-Billion-Dollar-Network-Expansion-to-Meet-Soaring-AI-Demand/default.aspx](https://ir.lumen.com/news/news-details/2025/Lumen-Accelerates-Multi-Billion-Dollar-Network-Expansion-to-Meet-Soaring-AI-Demand/default.aspx) DENVER--(BUSINESS WIRE)-- Lumen Technologies (NYSE: [LUMN](https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fir.lumen.com%2Fhome%2Fdefault.aspx&esheet=54326786&newsitemid=20250922339741&lan=en-US&anchor=LUMN&index=1&md5=3cccd4f941fd982eeac653dfe53373bd)) today announced significant progress in its multi-year effort to build the backbone for the AI economy. With construction underway coast-to-coast, Lumen is moving forward a multi-billion-dollar build with plans to add 34 million new intercity fiber miles by the end of 2028, for a total of 47 million intercity fiber miles. The company has already delivered millions": 0.8,
  "Is It Time to Buy Datadog Stock?": 0.2,
  "5 Brilliant Growth Stocks to Buy Now and Hold for the Long Term": 0.8,
  "Inverse Reddit strikes again: Ubisoft stock on 5 month high - Just few weeks after two popular posts how everyone was agreeing the company is dead Ubisoft stock rise from 8.30€ to now 10:20€. Hasn’t been this high since May. I’m honestly surprised how well timed the Reddit post came before this rise in stock. And they still haven’t even announced anything. Their imminent pipeline includes: - Prince of Persis Remake - AC Black Flag": 0.6,
  "MercadoLibre's Most Formidable Competitor Is Not Amazon. It's This Company.": 0.5,
  "Help understanding Hedged vs Unhedged ETFs - Long term (10Y+) - I am new to the stock market (30M), and I want to try to understand the Hedged vs Unhedged ETFs. I am Europe, but I want to invest into Nasdaq 100 by buying iShares ETFs. iShares NQSE - ISIN [IE00BYVQ9F29](https://www.justetf.com/en/etf-profile.html?isin=IE00BYVQ9F29#overview) \\- TER 0.33% (Hedged) - 1.633m EUR iShares SXRV - ISIN [IE00B53SZB19](https://www.justetf.com/en/etf-profile.html?isin=IE00B53SZB19#overview) \\- TER 0.3% (Unhedged) - 17.745m EUR My understanding is that Hedged": 0.2,
  "FTSE and Wall Street rise as Fed's preferred measure of inflation stays in line with forecasts": 0.8,
  "KSL Capital Partners acquires Westin Hilton Head resort": 0.5,
  "3 Leading Tech Stocks to Buy in 2025": 0.5,
  "r/Stocks Daily Discussion & Fundamentals Friday Sep 26, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is": 0.2,
  "The Power Lunch: UK workers ditch desk sandwiches as lunchtime dining increases": 0.5,
  "Tim O'Reilly on DesignRush Podcast: Why Generosity Is the Ultimate Growth Strategy in AI and Open Source": 0.6,
  "Domaine Worldwide Named Winner of the 2025 Klaviyo Global Agency Partner of the Year": 0.8,
  "Evkeeza® (evinacumab-dgnb) ANGPTL3 Antibody Approved in the U.S. for Children as Young as 1 Year Old with Ultra-Rare Form of High Cholesterol": 0.8,
  "Is Now An Opportune Moment To Examine Texas Instruments Incorporated (NASDAQ:TXN)?": 0.2,
  "Is O'Reilly Auto Parts Stock a Buy?": 0.0,
  "Wall Street Futures Little Changed Ahead of Inflation Report; Asia Off, Europe Up": 0.0,
  "Costco tops earnings, revenue estimates, as warehouse club gains more members - https://www-cnbc-com.cdn.ampproject.org/v/s/www.cnbc.com/amp/2025/09/25/costco-cost-q4-2025-earnings.html?amp_js_v=0.1&amp_gsa=1#webview=1&cap=swipe On the company's earnings call, CFO Gary Millerchip said the retailer has worked hard to offset higher tariff costs. In some cases, it has introduced new items from its Kirkland Signature private-label brand as alternatives to goods hit by tariffs, he said. About a third of Costco's U.S. sales come from imported goods. Costco is also changing its merchandise assortment in some": 0.5,
  "This Week In AI Chips - Revolutionizing Cooling to Boost AI Chip Performance": 0.8,
  "High Growth Tech Stocks To Watch In The US September 2025": 0.5,
  "MercadoLibre Is the Amazon of Latin America ... or Is It?": 0.5,
  "Here's What to Expect From Paychex's Next Earnings Report": 0.2,
  "Robotics Demand Rises: Will Jetson Thor Unlock a New Market for NVDA?": 0.5,
  "Dow Jones Futures Rise: Nvidia, Palantir Near Buy Points With Fed Inflation Due; Trump Sets New Tariffs": 0.2,
  "Intel, Wayfair, Eli Lilly, Oracle: Trending tickers": 0.0,
  "Green Rain Energy Holdings (OTCID:$GREH) Announces New EV Sites With Driftwood Hospitality": 0.5,
  "PACCAR stock jumps after Trump’s tariff announcement on heavy trucks": 0.5,
  "Starbucks continues to cut corporate jobs in turnaround bid: ‘Many are cost centers, not revenue producers,’ says expert": -0.6,
  "The Baltics: a region punching above its weight on the global life sciences stage": 0.8,
  "Technical vs Fundamental analysis - which do u trust more for investing ? - When it comes to making investment decisions, technical analysis and fundamental analysis seem to be the two main schools of thought. Some people swear by charts and patterns while others focus on a company’s financials and growth potential. What’s your go to method and why do you trust it more ? Do you find one to be more reliable than the": 0.1,
  "Which Starbucks stores are closing down? Here's what we know so far": 0.0,
  "The Stock Market Is Suffering an AI Hangover. What to Do Now.": -0.5,
  "Here’s How Marvell Technology (MRVL) Rebounded from Q1 Lows": 0.5,
  "The Core PCE excluding food and energy rose 2.9% YOY for August as expected. The PCE price index rose 2.7% YOY, as expected. - **Excluding food and energy, the PCE price index** rose 2.9 percent over the past year. The **PCE price index** for August increased 2.7 percent YOY. From the preceding month, the **PCE price index** for August increased 0.3 percent. Excluding food and energy, the PCE price index increased 0.2 percent. This data": 0.1,
  "Is MercadoLibre's Rapid Loan Growth Becoming a Profitability Headwind?": -0.5,
  "Starbucks turnaround is taking longer than initially anticipated: analyst": -0.5,
  "Does MercadoLibre (MELI) have a Long Runway for Growth?": 0.5,
  "Jim Cramer Explains Morgan Stanley’s Coverage Of Applied Materials (AMAT)": 0.2,
  "Jim Cramer Explains Morgan Stanley’s Coverage Of ASML Holding N.V. (ASML)": 0.2,
  "Jim Cramer Recalls When He Told Micron Technology’s (MU) CEO He Loved Him": 0.6,
  "Multiple Growth Drivers Lifted Axon (AXON) in Q2": 0.8,
  "For Mistral, the Future of AI Development Will Happen Inside the Enterprise": 0.5,
  "AMGEN ANNOUNCES $650M EXPANSION OF U.S. MANUFACTURING, CREATING HUNDREDS OF NEW JOBS": 0.8,
  "Why Investors Need to Take Advantage of These 2 Consumer Staples Stocks Now": 0.5,
  "Amgen Inc. (AMGN) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Palo Alto Networks, Inc. (PANW) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Starbucks Corporation (SBUX) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Exchange-Traded Funds, Equity Futures Higher Pre-Bell Friday Amid New Tariffs": 0.5,
  "$IREN just ran from $11 to $48 and I still think it’s cheap - $IREN has jumped from $11 to $48, but I still think it’s undervalued. My target is around $300 per share. The company is set to control 2,910 megawatts of power: more than the Hoover Dam. Power is the bottleneck for AI growth, and IREN has one of the largest low-cost supplies in the market. At roughly $1.5M profit per MW per": 0.8,
  "This Beaten-Down AI Stock Could Stage a Monster Comeback by 2028": 0.8,
  "Why the emphasis on international or small cap like AVUV. What am I missing? - I look at FTIHX from 2018 - $12 a share. It's now $16 a share. AVUV in 2019: $49-54 a share. It's now $100. VOO in 2019 - $260-270. It's now $600. I'd just like to know what I'm missing...am I not looking at the bigger picture? It seems like VOO the most profitable by far.": 0.2,
  "Here’s How Zscaler (ZS) Affected Fidelity Growth Strategies Fund’s Performance": 0.1,
  "Constellation Energy vs. Ameren: Which Power Stock Has More Upside?": 0.5,
  "GEHC Inks License Agreement With Lantheus for Prostate Imaging Agent": 0.5,
  "Heartland Opportunistic Value Equity Strategy Initiated a Position in Applied Materials (AMAT) in Q2": 0.5,
  "Vertex (VRTX) Is Considered a Good Investment by Brokers: Is That True?": 0.5,
  "Here's Why Paypal (PYPL) is a Strong Value Stock": 0.8,
  "ADI's Communications Segment Improves: Is the Momentum Sustainable?": 0.5,
  "CASI Pharmaceuticals Appoints James Huang to Board of Directors": 0.5,
  "CarMax downgraded, Kenvue upgraded: Wall Street's top analyst calls": 0.2,
  "Warner Bros. Stock Gets Downgraded. Why Its Recent Rally Could Fade.": -0.6,
  "Trump's new tariffs on pharma, furniture, & trucks: What to know": -0.5,
  "More Losses, More Liquidity: Who Really Wins Without PDT. - This legislation is just going to be a liquidity injection, more money for the brokers, more money for the Institutions and Market Makers. **Less for Retail.** It’s a short term illusion of benefit to small players which always benefits institutions; a very common pattern in legislation. It’s never for you. Trading influencers will also love it. I’m not being cynical, I’m telling you how it": -0.6,
  "ComEd Announces $175,000 in Scholarships Available for College and Trades Students": 0.8,
  "Here’s What Boosted MercadoLibre (MELI) in Q2": 0.5,
  "ServiceNow Stock and 4 More AI Losers to Consider Buying Now": 0.2,
  "Micron's DRAM Revenues Hit $28.6B: Can the Momentum Continue?": 0.5,
  "Better.com CEO talks growth outlook, AI underwriting, Fed rates": 0.5,
  "Form 8.3 - Aqua Acquisition Sub LLC (an indirect wholly-owned subsidiary of Qualcomm Incorporated)": 0.0,
  "Why Apple’s New iPhone Could Be a Smashing Success—and Why Its Stock Could Hit $290": 0.8,
  "Honeywell International Inc. (HON) Raises $600M for Quantum Arm Quantinuum at $10B Valuation": 0.8,
  "Amgen to Invest $650 Million in U.S. Production Expansion as Trump Hikes Tariffs": 0.2,
  "ESPN Unlimited struggles to draw new viewers as Netflix pulls ahead, says KeyBanc": -0.5,
  "SBUX Advances the Back to Starbucks Plan to Strengthen Operations": 0.5,
  "PACCAR Inc. (PCAR) Declares $0.33 Dividend Amid Strong Financials": 0.8,
  "Intel chips, Tesla price target, Boeing 737: Trending Tickers": 0.0,
  "US, European pharma stocks steady after Trump's tariff move, Asia slips": 0.1,
  "Loop Capital Upgrades Netflix, Inc. (NFLX) To Buy, Lifts Price Target": 0.8,
  "JPMorgan Lifts Gilead Sciences, Inc. (GILD)’s Price Target To $145, Maintains Overweight Rating": 0.8,
  "Palo Alto Networks Positioned as 'Premium Security Play' for Investors, Tigress Financial Says": 0.6,
  "Starbucks CTO resigned Monday amid tech revamp": -0.5,
  "CSX Reopens Expanded Howard Street Tunnel Ahead of Schedule, Strengthening East Coast Freight Growth": 0.8,
  "Top Stocks From the Staffing Services Industry to Buy Now": 0.5,
  "BofA Reiterates Buy Rating on NVIDIA Corporation, Keeps PT at $235": 0.6,
  "Is anybody looking at PRGS upcoming earnings after market close on Mon 29th of September? - PRGS Progress software has upcoming earnings on Monday 29th of September after market close, I think the stock has been beaten down. It appears that expectations are very low going into earnings due to huge selloff since last earnings which I dont think were as terrible as market perceived. The stock has sold off even more after earnings and": 0.2,
  "Atlassian Corporation (TEAM) Enters Into Definitive Agreement to Acquire DX": 0.5,
  "Evercore Keeps Buy on Adobe (ADBE) Despite AI Monetization Concerns, Market Skepticism": 0.2,
  "BofA Reaffirms Buy on Cisco (CSCO), Citing Growth Catalysts and Inexpensive valuation": 0.8,
  "Can Qualcomm’s (QCOM) Automotive Bet Deliver the Next Big Growth Wave?": 0.5,
  "Analysts Cite Amgen’s (AMGN) Strong Therapies Pipeline to Reaffirm Bullish Outlook": 0.8,
  "Jim Cramer on Micron Earnings: “The Numbers Were Like Stellar”": 0.8,
  "Jim Cramer on Western Digital: “We Gotta Wait”": 0.2,
  "Jim Cramer Says Honeywell is “Part of a Whole Cohort of Industrials That Just Keeps Going Down”": -0.6,
  "Jim Cramer on lululemon: “I Think it has Fallen Too Far”": 0.6,
  "Top Midday Stories: Amgen to Invest $650 Million to Expand US Manufacturing; Trump Signs TikTok Deal Order": 0.5,
  "Podcast: Trump Weighs Plan to Reduce U.S. Reliance on Foreign Chips": 0.5,
  "Why Is CrowdStrike (CRWD) Up 7% Since Last Earnings Report?": 0.5,
  "Why Take-Two Interactive (TTWO) is a Top Growth Stock for the Long-Term": 0.8,
  "Nike’s Skims Line Launches Today. Will It Be Enough for the Struggling Stock?": -0.5,
  "GlobalFoundries Stock Climbs. What’s Behind the Chip Manufacturer’s Momentum.": 0.5,
  "MU or AMD: Which Is the Better Value Stock Right Now?": 0.5,
  "Did the AI Bubble Just Pop for This Legacy Tech Stock?": -0.6,
  "Intel Shares Rise on U.S. Plan to Cut Chip Import Reliance": 0.8,
  "Why PACCAR (PCAR) Stock Is Trading Up Today": 0.5,
  "Biolinq gets FDA de novo nod for intradermal glucose sensor": 0.5,
  "All You Need to Know About Roper Technologies (ROP) Rating Upgrade to Buy": 0.6,
  "Warner Bros. Discovery Stock Faces Downside Risks if Potential Takeover Fails to Materialize, KeyBanc Says": -0.5,
  "Cocoa Prices Pressured as Rains Improve Ivory Coast Cocoa Crop Prospects": -0.5,
  "Don't Miss These Once-in-a-Decade Opportunities: 2 Unstoppable Stocks to Buy and Hold Forever": 0.8,
  "TSX up 32 Points at Midday; Info Tech The Biggest Decliner": 0.2,
  "US plans 1:1 chip production rule to curb overseas reliance, WSJ reports": 0.5,
  "Strength in Software & Services Unit Drives Axon: Can the Momentum Sustain?": 0.5,
  "Starbucks set to close stores, slash 900 jobs in restructuring plan": -0.8,
  "Bitcoin Is Back Below $110,000. Here's What to Know About the Latest Crypto Sell-Off.": -0.5,
  "US Equity Indexes Rise in Midday Trading": 0.8,
  "Stock Market Retreats From Record Highs Despite Nvidia-OpenAI Deal, Micron Earnings: Weekly Review": -0.5,
  "More than 150 firms have ties to Israeli settlements, UN finds": -0.5,
  "Oil Company IPO preferred stock - There's an oil company that's offering a good return rate dividends on their preferred stock. IPO that's about to hit the market. I'm new to this kind of stuff, so I want to ask if you guys have had experience with this type of stocks. Do you think it's worth it. Under Trump, maybe the old companies don't have too much to worry, but in general isn't oil going": 0.2,
  "Here's Why You Should Retain Verisk Stock in Your Portfolio Now": 0.6,
  "US Equity Indexes Rise as Investors Assess Latest Inflation Data": 0.5,
  "US oil and gas rig count rises to highest since June, Baker Hughes says": 0.5,
  "US Oil Drillers Add More Oil Rigs as Prices Climb": 0.5,
  "SHOP Gains From Strong Partner Base: Will This Fuel Revenue Growth?": 0.6,
  "Roblox vs. Take-Two: Which Gaming Stock Has More Room to Run?": 0.2,
  "Nvidia vs. AMD: Which Artificial Intelligence (AI) Stock Is the Smarter Buy After Groq's $750 Million Equity Raise?": 0.5,
  "Paychex Gears Up to Report Q1 Earnings: What's in the Offing?": 0.2,
  "Sector Update: Health Care Stocks Rise Friday Afternoon": 0.5,
  "The #1 Insider Signal Every Trader Should Know": 0.2,
  "Celsius vs. Monster Beverage: Which Beverage Stock is Placed Better?": 0.2,
  "Why Paccar Stock Popped on Friday": 0.5,
  "The Winners and Losers From Trump’s 25% Truck Tariffs": 0.1,
  "Improved Ivory Coast Cocoa Crop Prospects Undercut Cocoa Prices": -0.7,
  "Peter Schiff Predicts 'Brutal' Bear Market For Bitcoin Treasury Companies, Labels Michael Saylor's Business Strategy 'Harebrained'": -0.8,
  "Jane Street Is Betting Big on Opendoor Stock. Should You?": 0.5,
  "AppLovin (APP) Stock Trades Up, Here Is Why": 0.5,
  "Electronic Arts stock jumps 17% after report company nearing $50B deal to be taken private - Shares of Electronic Arts jumped 15% on Friday following a report that the video game company is nearing a roughly $50 billion deal to go private. The deal would likely be the largest leverage buyout of all time, according to the Wall Street Journal. Investors including Saudi Arabia’s Public Investment Fund and Silver Lake could announce the deal as": 0.8,
  "Paramount, Ellisons might not have the cash for a WBD bid: Analyst": -0.2,
  "Alight, Iridium, CDW, First Advantage, and Xerox Shares Are Soaring, What You Need To Know": 0.5,
  "Why GlobalFoundries Rallied on Friday": 0.5,
  "Confluent, Flywire, Alarm.com, and Zscaler Shares Are Soaring, What You Need To Know": 0.5,
  "Oil Rig Count Rises by 6; Crude Prices Headed for Sharp Weekly Gains": 0.8,
  "HIVE - Underpriced honey - I dislike all mining stocks but HIVE is extremely undervalued compared to the competitors which is why I am holding some of the stock. IREN has been blowing up and is in overvalued territory. Penny stocks are shares of small companies that typically trade for less than $5 per share and are not listed on major stock exchanges. HIVE is not a penny stock. It is listed on the NASDAQ.": 0.5,
  "Sector Update: Health Care Stocks Gain Late Afternoon": 0.5,
  "Treasury Yields Up for The Week Ahead of Key Labor Data": 0.2,
  "Paccar, Boeing, Electronic Arts: Trending Tickers": 0.0,
  "Fastenal Company Announces Conference Call to Review 2025 Third Quarter Earnings": 0.0,
  "HONEYWELL TO INCREASE DIVIDEND EFFECTIVE FOURTH QUARTER 2025": 0.5,
  "Chegg, Teladoc, Skillz, Take-Two, and Expedia Shares Skyrocket, What You Need To Know": 0.8,
  "Electronic Arts Stock Jumps On Reported Go-Private Deal": 0.8,
  "US Equity Indexes Higher as Inflation Data Matches Expectations": 0.8,
  "These Stocks Moved the Most Today: Eli Lilly, Electronic Arts, Intel, GlobalFoundries, Boeing, AppLovin, Costco, and More": 0.2,
  "AppLovin Stock Showered With Affection On Wall Street": 0.8,
  "New Trump Tariffs Set For Oct. 1, This S&P 500 Stock Soars": 0.2,
  "Trump’s Truck Tariffs Are Coming. Here’s Who Wins and Loses.": 0.1,
  "Electronic Arts Stock Pops on Report Videogame Maker Is Close to Going Private": 0.8,
  "Intel Stock Rises As Trump Steps Up Efforts To Reshore Chip Manufacturing": 0.8,
  "Oracle, Caterpillar, and 10 Other Winners from the ‘New Global Trade Order’": 0.6,
  "All bark, no bite: Trump’s latest trade war turns into another TACO salad for Wall Street": -0.6,
  "Eli Lilly, Pfizer, Amgen Stocks Rise After Trump’s 100% Pharma Tariff Threat. Here’s Why.": 0.5,
  "Trump moves toward deal to give US an equity stake in company developing Nevada lithium mine": 0.5,
  "Stocks to Watch Recap: GlobalFoundries, Oracle, Intel, Paccar": 0.0,
  "Podcast: U.S. Stocks Break Three-Day Losing Streak": 0.8,
  "GLP-1 race evolves as Amgen & weight-loss pills enter the scene": 0.2,
  "DoorDash, IBD Stock Of The Day, Battles For Grocery Market With Amazon, Uber, Instacart": 0.2,
  "Delta Fixes 300+ Airbus Jets Over Cabin Fume Fears": 0.1,
  "Fortinet (FTNT) Laps the Stock Market: Here's Why": 0.5,
  "Datadog (DDOG) Outperforms Broader Market: What You Need to Know": 0.5,
  "Airbnb, Inc. (ABNB) Laps the Stock Market: Here's Why": 0.2,
  "Applied Materials (AMAT) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Trump’s Latest Tariffs Raise More Questions. Investors Need to Stay Alert.": 0.1,
  "Texas Instruments (TXN) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Vertex Pharmaceuticals (VRTX) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Ross Stores (ROST) Outperforms Broader Market: What You Need to Know": 0.5,
  "Micron (MU): Analyst Sees AI Tailwinds, Limited Upside": -0.5,
  "Adobe (ADBE) Stock Downgraded at Morgan Stanley on Slower AI Monetization": -0.5,
  "Foreign investors allocate 30% of US assets to stocks despite Trump tariffs, up from 19% previously - No paywall: [https://finance.yahoo.com/news/foreign-investors-are-sticking-with-us-stocks-amid-trump-tariff-turmoil-164043537.html](https://finance.yahoo.com/news/foreign-investors-are-sticking-with-us-stocks-amid-trump-tariff-turmoil-164043537.html) >In April, talk of a “Sell America” trade picked up steam on Wall Street following the unveiling of President Trump's \"Liberation Day\" tariffs. US stocks, Treasurys, and the dollar all tumbled at once - an unusual dislocation that shook confidence in America’s safe-haven status. >But recent data indicates that investors abroad have actually stuck with": 0.5,
  "Making Sense of Current Earnings Expectations": 0.0,
  "Why Bernstein Is Bullish on Atlassian (TEAM) After Browser Co & DX Deals": 0.6,
  "Worthington, Micron Get Analyst Attention": 0.5,
  "Will Nike Stock Keep Rebounding as Its Q1 Results Approach?": 0.5,
  "Melius Initiates Coverage on Diamondback Energy (FANG), Assigns Buy Rating": 0.8,
  "Electronic Arts Nears Takeover by Silver Lake, PIF": 0.2,
  "What to Expect From PepsiCo's Next Quarterly Earnings Report": 0.2,
  "Where should i start...? ( which book should i read first ) - Hello everyone, I am a total beginner in the game, and I’m very enthusiastic about finance and economics. I would like to start learning about stock trading (buying and selling, without leverage), with a weeks to months holding style, you know, the kind of swings people usually do on the Robinhood app. Could you please suggest a good first book for me": 0.6,
  "is it possible to say something bad about a stock on twitter and make it's stock drop, and what are the legal implications? - If I were to say something bad about a very small company traded on the stock market on twitter could that end up dropping the stock price of that company, even if just for a single tick? Then if I were to go buy that company up at that lower stock": -0.6,
  "4 Reasons You Should Invest in Costco Stock": 0.5,
  "Gilead Sciences (GILD) Stock Sees Positive Outlook Amid HIV, Liver, and Cancer Drug Momentum": 0.8,
  "Biogen (BIIB) Expands Neurology Pipeline With Alcyone Buyout, Stock Seen Undervalued": 0.8,
  "Piper Sandler Sees Strong Momentum in Keurig Dr Pepper (KDP) Stock": 0.8,
  "Tariffs Aren’t Hitting Earnings—Yet. Why That Might Not Last.": 0.1,
  "Is It Finally Time to Buy Copart Stock?": 0.5,
  "3 Dirt Cheap Stocks to Buy With $1,000 Right Now": 0.5,
  "3 Dividend Stocks Perfect for Gen Z Investors": 0.5,
  "1 Artificial Intelligence (AI) Stock to Buy Before It Soars By 50%, According to Wall Street": 0.8,
  "Railroads magnates, what do you think of the 85bln $ merger between UNP and NSC merger? - TLDR: Railroad haven’t performed very well in the past years but may still be a solid investment. Do you think the UNP/NSC merger will be value accretive, or are you worried about the price (as a UNP shareholder) and the additional debt of the combined entity? Railroads have been by far my worse performing investment. I predicted more": -0.2,
  "1 Reason Shopify Stock Is Approaching All-Time Highs": 0.8,
  "Prediction: These Supercharged Growth Stocks Will Soar by 2028": 0.8,
  "/r/Stocks Weekend Discussion Saturday - Sep 27, 2025 - This is the weekend edition of our stickied discussion thread. Discuss your trades / moves from last week and what you're planning on doing for the week ahead. Some helpful links: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips *": 0.2,
  "Starbucks Is Closing Stores and Cutting Jobs. Will It Save the Stock?": -0.5,
  "Prediction: This Artificial Intelligence (AI) Stock Will Be The Next Household Name": 0.8,
  "Europe must build better public markets for fintechs and not chase the bubble": 0.2,
  "High Electricity Demand Could Boost These 2 Power Producer Stocks, Says Scotiabank": 0.6,
  "Where do I find the constituents of S&P500 and Nasdaq100 dating back 5-10 years or even more? - Basically I'm asking for the list of stocks that were in these indices during the month year let's say march of 2020 or 2010. For some reason I'm not finding it just searching on Google. I needed it for research. I know there's the wikipedia option but that's too tiresome and will still have errors. If you": -0.5,
  "Ready to Retire Rich? 2 Growth Stocks That Could Soar 100% by 2030": 0.8,
  "3 Magnificent Stocks Under $100 to Buy Right Now": 0.8,
  "Marvell Technology (NASDAQ:MRVL) Seems To Use Debt Quite Sensibly": 0.5,
  "Positive earnings growth hasn't been enough to get Charter Communications (NASDAQ:CHTR) shareholders a favorable return over the last five years": -0.5,
  "Honeywell International Inc. (NASDAQ:HON) is favoured by institutional owners who hold 78% of the company": 0.5,
  "Many crypto-treasury companies are trading for less than what their digital assets are worth. Is this a bargain or a big red flag?": 0.2,
  "Corporate Clients Hold Up to 15% of Assets on Mercado Bitcoin, Exchange Exec Says": 0.2,
  "3 Top Stocks to Buy in October": 0.5,
  "What is setting Plex apart from the streaming competition?": 0.2,
  "Nvidia, These Other AI Plays Lead 5 Stocks Near Buy Points": 0.5,
  "Many Would Be Envious Of Cadence Design Systems' (NASDAQ:CDNS) Excellent Returns On Capital": 0.8,
  "We Think Keurig Dr Pepper (NASDAQ:KDP) Is Taking Some Risk With Its Debt": -0.5,
  "Is Arm Holdings One of the Best Artificial Intelligence (AI) Stocks for Long-Term Investors?": 0.5,
  "McLaren CEO: Teams are 'writing checks' to get into F1": 0.2,
  "Starbucks To Shutter Stores Amid Restructuring, Tariffs, Boycotts, And Policy Backlash": -0.6,
  "Assessing O'Reilly Automotive (ORLY) Valuation as Shares Quietly Log Strong Gains Without Major News": 0.6,
  "Should Improved West African Cocoa Harvest Prospects Prompt a Rethink for Mondelez (MDLZ) Investors?": 0.2,
  "Biogen (BIIB): Reevaluating Valuation Following FDA’s Supplemental Spinraza Dose Setback": 0.1,
  "Will Global Digital Expansion Reshape Domino's Pizza's (DPZ) Competitive Edge in the Pizza Market?": 0.2,
  "How Luckin Coffee's U.S. Launch and Market Leadership Will Impact LKNC.Y Investors": 0.5,
  "What Recent Price Swings Mean for CrowdStrike’s Valuation in 2025": 0.2,
  "How Investors May Respond To Synopsys (SNPS) Expanding AI Design Collaboration With TSMC": 0.5,
  "Assessing Marvell Technology (MRVL): Is the Stock’s Valuation Outpacing Recent Investor Interest?": 0.1,
  "Expansion of U.S. Manufacturing and Tezspire Approval Might Change the Case for Investing in Amgen (AMGN)": 0.5,
  "Will T-Mobile US' (TMUS) CEO Succession Drive the Next Phase of Digital Transformation?": 0.2,
  "Cisco Systems (CSCO): Examining Valuation After Cybersecurity Warning and Quantum Software Launch": 0.2,
  "Did the Howard Street Tunnel Expansion Just Shift CSX's (CSX) Investment Narrative?": 0.2,
  "PACCAR (PCAR) Valuation Spotlight After Truck Tariff News and Share Price Surge": 0.5,
  "Could US Semiconductor Mandates Reshape GlobalFoundries (GFS) Strategy Amid New Photonics Partnerships?": 0.2,
  "A Fresh Look at Honeywell (HON) Valuation After Recent Share Price Cooling": 0.5,
  "What Vertex Pharmaceuticals (VRTX)'s FDA Breakthrough for Povetacicept Means for Kidney Disease Pipeline": 0.2,
  "Qualcomm’s New AI Chips Might Change the Case for Investing in QCOM": 0.5,
  "Assessing Kraft Heinz (KHC) Valuation After Recent Shifts in Investor Sentiment": 0.5,
  "Will Lawmakers' H-1B Visa Scrutiny Shift Cognizant Technology Solutions' (CTSH) Global Workforce Narrative?": 0.1,
  "A Fresh Look at Verisk Analytics (VRSK) Valuation Following New AI Launch and ServiceTitan Partnership": 0.6,
  "Adobe (ADBE) Valuation in Focus as Share Price Lags Despite Steady Earnings Growth": 0.2,
  "A Fresh Look at Intuit (INTU) Valuation Without Major News Driving the Stock": 0.1,
  "Did Strong Q1 Results and Upgraded Guidance Just Shift Cintas' (CTAS) Investment Narrative?": 0.5,
  "What Starbucks (SBUX)'s $1 Billion Store Restructuring Means for Shareholders": 0.2,
  "Lloyds Banking Group plc (LYG) Expands its Multi-Year Partnership with Broadcom Inc. to Accelerate the Bank’s Technology Transformation Initiatives": 0.5,
  "Take-Two (TTWO): Is the Recent Borderlands 4 Delay Changing the Company's Valuation Outlook?": 0.2,
  "Dedrone by Axon Enterprise, Inc. (AXON) Partners with Mobile Camera Security (MCS)": 0.2,
  "UBS Reiterates Its ‘Buy’ Rating on Honeywell International Inc. (HON) with a $268 Price Target": 0.8,
  "Did Samsung Just Say \"Checkmate\" to Taiwan Semiconductor?": 0.2,
  "r/Stocks Weekly Thread on Meme Stocks Saturday - Sep 27, 2025 - The meme stock scheduled posts will now run weekly and post Saturday afternoon and won't be a sticky; you're probably seeing this because automod sent you here! [Full list of meme stocks here.](https://www.reddit.com/r/stocks/wiki/meme-stocks) This will be updated every once in a while. ------ Welcome traders who just can't help them selves discuss the same exact stock that's been discussed 100s of times a": 0.1,
  "The Stock Market Is Historically Pricey: Here's Why You Can Trust Netflix to Deliver": 0.6,
  "Palo Alto Networks Stock Has Surged Since August. Can This Momentum Continue?": 0.5,
  "Meet the Secret Ingredient That Makes American Express and Costco Recession-Resistant Stocks to Buy Even If the S&P Sells Off in 2026.": 0.6,
  "Netflix Lifts Revenue Guidance While Raising Concern Margin Pressure from Higher Content Spend": 0.1,
  "Autodesk Gains Q2 Momentum as Partnerships and Price Target Upgrades Strengthen Growth Outlook": 0.8,
  "CoreWeave (CRWV) Stock Upgrade: Riding the Wave of Soaring Cloud Demand": 0.8,
  "Fal.Con Event Boosts CrowdStrike (CRWD) as Investors Cheer AI Strategy": 0.8,
  "Micron (MU) Delivers Earnings Beat and Strong Forecast, Stock Outlook Brightens": 0.8,
  "I would like to invest in Gold, Cooper and maybe Oil. - Hi everyone, I'm french and watched some economic/financial tv shows. They are talking more and mora about metals and oil. Yesterday, a financial analyst says 6 millions ton of cooper will miss in the next years. The main reason is typically the industrial sector need more and more, and the reserve are emptier and emptier. So maybe I wonder it's the best time": 0.6,
  "Investors of PLTR, are you concerned with Theil being on Epstein liste? - PLTR seems promising with all of its government contracts it's secured. It's a stock I've been watching and has seem to be a good long term hold Are you concerned that the CEO is on ghe Epstein list? If so, would you prefer if Theil stepped down, and someone else took his place? I'm curious what long term holders think, and if": -0.5,
  "When the Boss Buys: $1B Musk Bet Propels Tesla 19% in 2 Weeks (Will the rally further extend?) - On 12th September, Elon made a purchase of 1B$ worth of Tesla shares at a price ranging from around $372 to $397 a share. Now the CMP of Tesla's share is 440$ , thats 19-20% return in jusk a week that too on a big money. WIll the rally further extend Comment your opinions": 0.6,
  "Prediction: Wall Street's Most Valuable Public Company by 2030 Will Be This Dual-Industry Leader (No, Not Nvidia)": 0.2,
  "These 3 Dividend-Paying Dow Jones Stocks Can't Catch a Break. Here's Why They Are All Top Buys in October.": 0.5,
  "What Is One of the Best Chip Stocks to Own for the Next 5 Years?": 0.5,
  "This Washington-Based Company Just Shared Earnings, and Things Are Better Than Expected": 0.8,
  "1 Growth Stock Down 65% to Buy Right Now": -0.5,
  "Did Nvidia Just Repeat Cisco's Mistake and Build a House of Cards With OpenAI Investment?": -0.6,
  "The Ultimate Growth Stock to Buy With $1,000 Right Now": 0.5,
  "Is the Party Over for Shopify Stock?": -0.5,
  "Prediction: 1 Stock That Will Be Worth More Than Palantir 5 Years From Now": 0.8,
  "5 Things Investors Need to Know About Costco This Week": 0.5,
  "Memory ‘hunger game’ begins. Here’s what you need to know": 0.1,
  "5 Top Stocks to Buy in October": 0.5,
  "What's Next for These 3 Artificial Intelligence (AI) Stocks?": 0.2,
  "How penetrated is U.S. club membership?": 0.1,
  "Is U.S. Sales Weakness and Analyst Downgrades Altering the Investment Case for lululemon (LULU)?": -0.5,
  "Has Axon's Recent Growth Outpaced Its Fundamentals Amid Broader Tech Stock Volatility in 2025?": -0.5,
  "Is Now the Right Time to Revisit Netflix After Yankees Streaming Deal?": 0.5,
  "Should You Invest $10,000 In Palantir Right Now?": 0.2,
  "Trump abruptly axes obscure trade law — and it could cost consumers $10.9B. How to adjust to this new reality": -0.7,
  "Calculating The Fair Value Of Analog Devices, Inc. (NASDAQ:ADI)": 0.1,
  "ON Semiconductor (ON): Assessing Valuation as Analysts Forecast Declining Earnings and Revenue Ahead of Quarterly Report": -0.5,
  "Arm Holdings (NasdaqGS:ARM): Revisiting Valuation as Investor Interest Builds on Core Business Strengths and Data Center Expansion": 0.6,
  "Did Costco’s (COST) Strong Quarter and New Club Plans Just Shift Its Investment Narrative?": 0.5,
  "Palantir Technologies (PLTR): Revisiting Valuation as Investor Interest Grows Quietly": 0.5,
  "Is Shopify’s Price Justified After ChatGPT Shopping Integration Buzz and Recent Pullback?": 0.2,
  "Tracking the Narrative for PepsiCo as Strategic Shifts Reshape Its Growth Story": 0.5,
  "Could Costco Wholesale Become a Trillion-Dollar Company?": 0.5,
  "Does Luckin Coffee’s New York Debut Signal Room for More Growth in 2025?": 0.5,
  "Shutdown looms as September jobs data, third quarter finale await investors: What to watch this week": 0.1,
  "Should You Grab This Growth Stock Before It Surges 46%?": 0.5,
  "Costco Earnings Look Great. But Is the Stock Overvalued?": 0.2,
  "Shale oil execs say Trump policies are hurting investment, 'business is broken' - https://www-cnbc-com.cdn.ampproject.org/v/s/www.cnbc.com/amp/2025/09/25/shale-oil-execs-say-trump-policies-are-hurting-investment-business-is-broken.html?amp_js_v=0.1&amp_gsa=1#webview=1&cap=swipe Trump has championed fossil fuels while attacking the renewable energy industry since taking office in January. His One Big Beautiful Bill Act, passed by Congress in July, delivered virtually everything the oil lobby wanted. But Trump's push for lower crude prices, higher tariffs, and the resulting uncertainty caused by his \"stroke of pen\" policies are hurting investment, executives at independent oil": -0.6,
  "Is Palantir Technologies Stock a Buy Now?": 0.0,
  "Could Nvidia's $100 Billion Data Center Gamble Make It the Market's First $10 Trillion Stock?": 0.6,
  "Is AMD Stock Your Ticket to Becoming a Millionaire?": 0.5,
  "AI stock pickers just got an important reminder": 0.1,
  "3 Things to Know About Lululemon Athletica Stock Before You Buy": 0.2,
  "Why Investors Are Excited About Palantir Stock Again": 0.8,
  "Workday (NASDAQ:WDAY) shareholder returns have been respectable, earning 62% in 3 years": 0.6,
  "We Ran A Stock Scan For Earnings Growth And Baker Hughes (NASDAQ:BKR) Passed With Ease": 0.6,
  "Wash Sales are Confusing - Wash sales are a conundrum. Wash sales are an oxymoron. Wash sales are a black hole. Wash sales are damnable. Let me explain. I’m considered the pattern day trader by my broker, interactive brokers. I am not one of those day traders that has five screens constantly trading five stocks at a time. I am a day trader that quite often just trade off my cell phone and I usually": -0.6,
  "5 Dividend Powerhouses to Buy and Never Sell": 0.5,
  "Insiders At Atlassian Sold US$19m In Stock, Alluding To Potential Weakness": -0.6,
  "PayPal Could Still Be 20% Too Cheap - Use Options to Play PYPL": 0.5,
  "Xcel Energy (NASDAQ:XEL) stock performs better than its underlying earnings growth over last three years": 0.5,
  "Sports is the only thing keeping linear TV 'alive' right now": 0.5,
  "MSTR Stock Crash Pattern to Repeat Again? Schiff Advises Saylor": -0.5,
  "Bitcoin Price Analysis: Double Top Pattern Hints $100K Reversal as Saylor Reacts": 0.5,
  "Constellation Energy Corporation (CEG): A Bull Case Theory": 0.5,
  "How will Microsoft stock react to this news on Monday Morning - “Trump demands Microsoft immediately fire Lisa Monaco …” - Lisa Monaco is an executive at Microsoft who served as deputy attorney general during the Biden administration. “Monaco has been shockingly hired as the President of Global Affairs for Microsoft, in a very senior role with access to Highly Sensitive Information. Monaco’s having that kind of access is unacceptable, and cannot be allowed to": -0.8,
  "Energy Infrastructure and Data Centers: Can supply meet demand? - U.S. Datacenter power demand is set to double by 2028. OpenAI expects its energy use to grow 125x over the next 8 years. Source: https://www.cnbc.com/2025/09/26/openai-big-week-ai-arms-race.html Particularly thought this section was interesting: “Building out 17 gigawatts of capacity would require the equivalent of about 17 nuclear power plants, each of which takes at least a decade to build. The OpenAI team says talks are underway with": 0.2,
  "What Is One of the Smartest Artificial Intelligence (AI) Stocks to Buy Today?": 0.5,
  "September is the worst month, yet... - It is said that September is historically the worst month on stock market, yet we are only two days away ending this month and that slight decline in stock market didn't happen, quite the contrary: it has been a good month for stocks. Do you think that won't happen in these two days? That could happen in the first two weeks of October or that from now we": 0.2,
  "2 Monster Stocks That Could Create Generational Wealth": 0.5,
  "Intel quietly makes aggressive move to repair recent failures": 0.6,
  "Meet the Monster Quantum Computing Stock That Continues to Crush Nvidia, Oracle, and Palantir": 0.8,
  "Will a Government Shutdown Nix the Jobs Report? Plus, Nike, Carnival, Paychex, and More Stocks to Watch.": 0.1,
  "Bond traders say rally hinges on jobs data at risk from shutdown": 0.1,
  "Trick-Or-Treating Is Becoming A Luxury For Households. Halloween Candy Bags Are So Expensive, Many Don't Want To Hand Them Out Anymore": -0.8,
  "Cogent Communications Holdings, Inc. (CCOI): A Bull Case Theory": 0.5,
  "Arm Holdings plc (ARM): A Bull Case Theory": 0.5,
  "Biogen Inc. (BIIB): A Bull Case Theory": 0.5,
  "Airbnb, Inc. (ABNB): A Bull Case Theory": 0.5,
  "Warner Bros. Notches Another Box Office Win. ‘One Battle After Another’ Tops Sales.": 0.6,
  "Palantir Technologies Announces Two-Day Pop-Up Experience in Seoul": 0.5,
  "The 5 Best S&P 500 Stocks of the Last 10 Years": 0.5,
  "Is Axon Enterprise Stock's Valuation Justified?": 0.1,
  "Nvidia Hits an All-Time High After Striking a Deal with OpenAI. Is the \"Ten Titans\" Growth Stock a Buy?": 0.6,
  "Prediction: 1 Artificial Intelligence (AI) Stock Will Be Worth More Than Nvidia and Palantir Combined by 2030": 0.8,
  "Honeywell International Inc. (HON) Posts Strong Q2 Earnings, Advances Aerospace and Quantum Tech": 0.8,
  "Amgen Inc. (AMGN) Invests $650M to Expand Puerto Rico Biologics Facility, Adds 750 Jobs": 0.8,
  "The Coca-Cola Company (KO) Leverages AI and Digital Tech to Boost Global Growth": 0.6,
  "Verizon Communications Inc. (VZ) Expands 5G Ultra Wideband and AI Wearable Partnerships with Meta": 0.5,
  "Monster Beverage Corporation (MNST) Tops $2B in Q2 Sales, Driven by Energy Drink Demand": 0.8,
  "Highest conviction Data Center Stock pick - There are so many stocks relating to data centers (nbis, crwv, glxy, iren, etc). I have been doing research and looking to slowly increase my exposure to this sector. What is your DD on the stock you believe in the most, time horizion and and price target for the stock?": 0.2,
  "Why does the market close on weekends? - I’m looking to soon get into stocks, for something that seems to be very “important” why do they close on the weekends? Also what would be some friendly investments to look into? I looking at Amazon and Amex.": 0.2,
  "“LEQEMBI®” (lecanemab) IV Maintenance Dosing for the Treatment of Early Alzheimer’s Disease Approved in China": 0.5,
  "Advanced Micro Devices, Inc. (AMD): A Bull Case Theory": 0.5,
  "Lam Research Corporation (LRCX): A Bull Case Theory": 0.5,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On September 23, 2025, the Board increased the size of the Board to thirteen members and elected Alan Armstrong as a director, effective as of January 1, 2026, to serve until Constellation’s 2026 annual meeting of shareholders. The Constellation board of directors has not yet determined the committee(s) on which Mr. Armstrong will be appointed to": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (b) On September 29, 2025, Stephen F. Angel, Chairman of the Board of Linde plc (“Linde”), announced that he will retire from Linde’s Board of Directors effective January 31, 2026. In connection with Mr. Angel’s retirement, Linde’s Board of Directors appointed Sanjiv Lamba, Linde’s CEO, to the additional position of Chairman of the Board effective upon": -0.2,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers Chief Executive Officer Transition On September 28, 2025, the Board of Directors (the “Board”) of CSX Corporation (the “Company”) appointed Stephen Angel as President and Chief Executive Officer of the Company and a member of the Board, effective immediately. Mr. Angel succeeds Joseph R. Hinrichs, who separated from his employment as President and Chief Executive Officer of": 0.1,
  "(Item 8.01) Other Events. On September 22, 2025, Broadcom Inc. (the “Company”) entered into an underwriting agreement (the “Underwriting Agreement”) with J.P. Morgan Securities LLC, BofA Securities, Inc. and BNP Paribas Securities Corp., acting for themselves and as representatives of the several underwriters named therein (collectively, the “Underwriters”), pursuant to which the Company agreed to issue and sell to the Underwriters $5,000,000,000 aggregate principal amount of its senior notes, consisting of $1,000,000,000 aggregate principal amount of its": 0.1,
  "(Item 1.01) Entry into a Material Definitive Agreement. Agreement and Plan of Merger On September 28, 2025, Electronic Arts Inc. (“ Electronic Arts ” or the “ Company ”) entered into an Agreement and Plan of Merger (the “ Merger Agreement ”) by and among the Company, Oak-Eagle AcquireCo, Inc., a Delaware corporation (“ Parent ”), and Oak-Eagle MergerCo, Inc., a Delaware corporation and wholly owned subsidiary of Parent (“ Merger Sub ”) pursuant to which the": 0.1,
  "(Item 8.01) Other Events Attached as Exhibit 99.1 and incorporated by reference herein is a press release dated September 29, 2025, issued by Comcast Corporation.": 0.0,
  "(Item 8.01) Other Events. ATM Updates On September 29, 2025, Strategy Inc (“Strategy” or the “Company”) announced updates with respect to its at-the-market offering programs: ATM Program Summary During Period September 22, 2025 to September 28, 2025 As of September 28, 2025 Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) STRF ATM 101,713 STRF Shares $10.2 $11.3 $1,718.8 $2.1 billion of 10.00% series A perpetual strife": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On September 29, 2025, Comcast Corporation announced that Michael J. Cavanagh will be appointed Co-Chief Executive Officer of the Company, effective in January 2026. At that time, he also will be appointed as a director of Comcast. As Co-CEO, he will serve alongside Brian L. Roberts, who will continue as the Company’s Chairman of the Board and": 0.2,
  "Solana Co-Founder Says '50/50' Chance Quantum Computing Breaks Bitcoin By 2030, Calls For Quick Action": 0.2,
  "Dividend and Growth Opportunities in Telephone and Data Systems (TDS)": 0.5,
  "Building a Telecom Dividend Portfolio Around T-Mobile US (TMUS)": 0.2,
  "NDAQ buy time? - Idk why I'm posting, maybe to be told wrong or to come back and use it as a told you so but NDAQ is at the the perfect place for calls in the next 2-3 trading days. They expire next month at 10/17 so plenty of time and its about $75 for the premium for the next OTM call option at $90 strike price while NDAQ is at $87.51. Have not": 0.2,
  "How Cisco Systems (CSCO) Supports Shareholder Returns Through Innovation and Networking Solutions": 0.5,
  "Is Comcast (CMCSA) One of the Best Telecom Dividend Stocks to Buy in 2025?": 0.5,
  "Retail Therapy: Agoda's Top Picks for Asia's Shopping Destinations": 0.5,
  "I am shorting UNH - Very High Quality Analysis - I wrote everything myself and did not use AI. Images are not allowed here so please refer to the same post on other subs for attached screenshots of my analysis. Alright guys, this is me going against the entire reddit world as you’ve probably seen everyone on reddit going long on UNH (including myself earlier this year where I made some really good profits on": -0.6,
  "BYD cuts 2025 sales target by 16% to 4.6M units, but forecasts exports to surge to 20% of sales (800K–1M vehicles) - No paywall: [https://finance.yahoo.com/news/chinas-byd-forecasts-exports-top-023732388.html](https://finance.yahoo.com/news/chinas-byd-forecasts-exports-top-023732388.html) >Chinese electric vehicle maker BYD Co forecast exports will make up about 20% of its global sales this year helped by new model launches, the South China Morning Post reported on Monday. >BYD forecasts 800,000 to 1 million deliveries outside mainland China in 2025, compared with projected total sales of": 0.1,
  "Paychex (PAYX) Reports Earnings Tomorrow: What To Expect": 0.5,
  "Dow Jones Futures Rise With Tesla Deliveries, Jobs Report Due; 5 Stocks Eye Buy Points": 0.5,
  "Finra is asking the sec to change the PDT rule - Finra wants to change the pattern day trading rule to lower the margin account to $2000 for traders to avoid the current 3 day pattern day trading rule. I personally never cared about trading on margins. I just think they need to allow everyone to get a chance at day trading. I guess they will allow more people to blow their accounts.": 0.1,
  "ASML Builds Machines that Make AI Chips. Why It’s Missing Out on the Boom.": -0.5,
  "1 Stock Under $50 with Exciting Potential and 2 We Brush Off": 0.5,
  "3 Unpopular Stocks We Approach with Caution": -0.5,
  "1 S&P 500 Stock for Long-Term Investors and 2 We Avoid": 0.2,
  "1 Healthcare Stock with Exciting Potential and 2 We Ignore": 0.6,
  "2 S&P 500 Stocks to Research Further and 1 We Avoid": 0.0,
  "1 Services Stock for Long-Term Investors and 2 Facing Challenges": 0.2,
  "3 S&P 500 Stocks with Competitive Advantages": 0.0,
  "3 Momentum  Stocks with Promising Prospects": 0.5,
  "Fitch Ratings Upgrades Broadcom Inc. (AVGO) to BBB+ on AI Semiconductors Opportunities": 0.8,
  "Netflix, Inc. (NASDAQ:NFLX) Partners Anheuser-Busch InBev to Bolster Advertising Business": 0.5,
  "Oppenheimer Lifts Applovin Corp (APP) Price Target on Booming Non-Gaming Advertising": 0.8,
  "ASML Holding N.V. (ASML) Upgraded to Buy Amid Strategic Moves and Industry Tailwinds": 0.8,
  "UBS Downplays G7 CGM Sensor Concerns, Affirms DexCom’s Inc. (DXCM) ‘Buy’ Rating": 0.5,
  "COST and KMX- Two Consumer Stocks on Divergent Paths": 0.2,
  "Jim Cramer on Starbucks: “I Remain Very Bullish”": 0.8,
  "Jim Cramer Highlights Walmart’s Strength Compared to Peers": 0.5,
  "Jim Cramer Says “Marvell is Really an Excellent Company”": 0.8,
  "Wall Street Bullish on Diamondback Energy (FANG), Here’s Why": 0.8,
  "QUALCOMM Incorporated (QCOM) Announces New Chips for PC’s and Phones": 0.5,
  "Morgan Stanley Maintains Buy on Gilead Sciences (GILD)": 0.5,
  "Amgen Inc.’s (AMGN) and AstraZeneca’s (AZN) Tezspire Receives Positive Recommendation from the EU Medicines Agency": 0.8,
  "Cognizant Technology Solutions (CTSH) Announces a New Partnership with Venbrook Group": 0.5,
  "Here's What to Expect From CSX's Next Earnings Report": 0.0,
  "AstraZeneca plans full US listing while defusing fears of UK exit": 0.5,
  "Heard on the Street Friday Recap: Another Dose of Tariffs": -0.5,
  "Jobs Data, Nike Earnings, PMIs: What to Watch This Week": 0.5,
  "Malaysia Aviation Group announces digital partnership with Adobe, Google, Skyscanner and Visa": 0.5,
  "VMware customers face crossroads as Broadcom ends vSphere 7 support": -0.5,
  "Richtech Robotics and Lululemon have been highlighted as Zacks Bull and Bear of the Day": 0.2,
  "Nike and Carnival are part of Zacks Earnings Preview": 0.0,
  "AstraZeneca to list directly on NYSE while keeping U.K. listing; shares up": 0.6,
  "Cisco Quantum Labs announces Quantum Compiler prototype": 0.5,
  "Amgen to invest $650m in US manufacturing network expansion": 0.5,
  "4 Brilliant Growth Stocks to Buy Now and Hold for the Long Term -- Including Fluor (FLR) Stock and Opendoor Technologies (OPEN) Stock": 0.8,
  "2 Stocks Down 14% and 21% to Buy and Hold": -0.5,
  "What You Need To Know Ahead of Intuitive Surgical's Earnings Release": 0.0,
  "Zacks.com featured highlights include Wolverine World Wide, Interface, BuildABear Workshop and Analog Devices": 0.2,
  "Trending tickers: Alibaba, AstraZeneca, GSK, Stellantis and Genmab": 0.0,
  "3 Top Artificial Intelligence (AI) Stocks to Buy Right Now": 0.5,
  "GlobalFoundries (GFS) Surges 8.4%: Is This an Indication of Further Gains?": 0.6,
  "Starbucks CTO steps down amid wider restructuring": -0.5,
  "Hanmi's Oral Delivery Platform Compound Licensed to Gilead": 0.5,
  "AstraZeneca will list shares directly in New York, but isn't leaving the UK": 0.2,
  "Bridge to Life Appoints David Castiglioni as Chief Commercial Officer to Head Global Commercial Operations and Lead the U.S. Commercialization of VitaSmart™": 0.5,
  "Regeneron’s Evkeeza gains FDA approval for young HoFH patients": 0.5,
  "AstraZeneca switches to direct US listing, keeps UK listing": 0.1,
  "US Equity Investors to Focus on Federal Government Shutdown, Slew of Labor Market Data This Week": 0.2,
  "2 Top Stocks I Wouldn't Hesitate to Invest $1,000 In Right Now": 0.8,
  "Take-Two (TTWO) Soars 4.5%: Is Further Upside Left in the Stock?": 0.5,
  "Stocks Are Typically Immune to Government Shutdowns. Why It’s Different This Time.": 0.2,
  "AstraZeneca to overhaul US listing but remain on London market and keep UK HQ": 0.5,
  "Got $5,000? 5 Tech Stocks to Buy and Hold for the Long Term": 0.5,
  "Baker Hughes to Supply Subsea Tree Systems and Associated Services for Petrobras": 0.5,
  "ENHERTU® (fam-trastuzumab deruxtecan-nxki) demonstrated highly statistically significant and clinically meaningful improvement in invasive disease-free survival vs. T-DM1 in DESTINY-Breast05 Phase III trial": 0.8,
  "CommScope and Comcast Accelerate Rollout of DOCSIS 4.0 Amplifiers": 0.5,
  "We Think Broadcom (NASDAQ:AVGO) Can Manage Its Debt With Ease": 0.8,
  "What does Uncle Sam's new stake in Intel mean for 'free markets'? | Retire on Track": 0.1,
  "Bear Of The Day: Lululemon Athletica (LULU)": -0.5,
  "Want to be CEO? These 5 employers give you the best shot": 0.5,
  "Have $5,000? These 2 Stocks Could Be Bargain Buys for 2025 and Beyond.": 0.5,
  "Kroger expands DoorDash relationship amid push toward store-based fulfillment": 0.5,
  "X says it will fight Indian court ruling on content takedown system": -0.5,
  "The evolution of cognitive banking": 0.5,
  "Why Strategy (MSTR) Is Down 8.0% After Bitcoin Drop, Equity Sales and Regulatory Scrutiny": -0.6,
  "Datadog's (DDOG) Zip Forward 2025 Spotlight Might Change the Case for Investing": 0.5,
  "Insider Confidence In Leading Growth Stocks September 2025": 0.5,
  "ASML (ENXTAM:ASML): Assessing Valuation After Recent Share Price Surge": 0.5,
  "AstraZeneca to List Shares Directly on New York Stock Exchange": 0.5,
  "Linde Appoints Sanjiv Lamba as Chairman & CEO": 0.5,
  "This Week In AI Chips - Revolutionizing AI Data Centers With Optical Solutions": 0.5,
  "High Growth Tech Stocks In The US Market With Promising Potential": 0.8,
  "Uber spruces up its grocery delivery service": 0.6,
  "How Regulatory Approval for Amazon Data Center Powerlines at PPL (PPL) Has Changed Its Investment Story": 0.2,
  "SoftBank (TSE:9434): Evaluating Valuation as It Advances AI-Driven Connectivity With New Submarine Cable Project": 0.5,
  "Does Ross Stores' (ROST) Community-Focused Expansion Reveal a Shift in Its Growth Priorities?": 0.2,
  "Should American Electric Power's (AEP) $2 Billion Debt Issuance Reshape Its Long-Term Investment Story?": 0.1,
  "ADP to Announce First Quarter Fiscal 2026 Financial Results on October 29, 2025": 0.0,
  "Harmonic and Comcast Work Together to Expand Fiber Broadband Access": 0.5,
  "Zyxel Networks Expands Portfolio of WiFi 7 Access Points for Small Businesses": 0.5,
  "Constellation Appoints Alan Armstrong to Board of Directors": 0.5,
  "GlobalFoundries and Corning Collaborate To Deliver Detachable Fiber Connector Solutions to Scale Next-Generation Optical Connectivity": 0.5,
  "Comcast Announces Expiration Date Results for Debt Exchange Offers and Cash Offers; Amends Exchange Offers and Cash Offers for 4.150% Notes Due 2028 and 4.550% Notes Due 2029": 0.0,
  "CSX Corp. Announces Leadership Transition": 0.0,
  "Palantir's Golden Dome Dreams Face Lockheed Competition": 0.1,
  "Member Loyalty Group Names Drew Wolff as Treasurer of the Board": 0.2,
  "Should You Investigate Warner Bros. Discovery, Inc. (NASDAQ:WBD) At US$19.51?": 0.1,
  "A Look At The Fair Value Of CoStar Group, Inc. (NASDAQ:CSGP)": 0.1,
  "AstraZeneca stokes fears of London exit with New York listing": -0.6,
  "Auto Parts Manufacturer Bankruptcy: Impact on the parts retailers? - First Brands filed for bankruptcy this morning and has major customer concentration in retailers like Autozone, O'Reilly, NAPA and similar. The company would continue supplying parts, but what happens in the medium to long term with retailers when a major supplier falls down? I assume that costs can go up as they seek wider sources of supply for their privately branded parts. Any hiccup in": -0.5,
  "Strategy Buys 196 Bitcoin for $22.1M": 0.5,
  "CoreWeave, AstraZeneca, GSK, BYD, Tesla: Trending Stocks": 0.0,
  "Comscore Cuts Dividends, Reshapes Board": -0.5,
  "AppLovin Is Suddenly Surging. Is It Sustainable?": 0.5,
  "ISRG vs. ZBH: Which Robotic Surgery Stock Offers Better Upside Now?": 0.5,
  "Investor: CSX can now search out ‘willing partner’ for rail merger": 0.5,
  "AstraZeneca Moves From ADRs To NYSE Listing": 0.2,
  "PANW Bets on Prisma AIRS: Is it the Key to Future Platform Growth?": 0.5,
  "FDA Approves Label Extension of REGN's Cholesterol Drug Evkeeza": 0.5,
  "Will SMCI's Next-Generation Products Fuel Long-Term Growth?": 0.5,
  "Comcast Corporation’s Mike Cavanagh to Join Brian Roberts as Co-Chief Executive Officer": 0.5,
  "CSX appoints Steve Angel as CEO amid activist pressure": 0.2,
  "CSX appoints new CEO as US railroad operator battles activist pressure": 0.1,
  "Home-grown heroes: how Huawei and DeepSeek are helping China break reliance on US chips - https://finance.yahoo.com/news/home-grown-heroes-huawei-deepseek-093000982.html \"As confidence in home-grown technology mounts, Beijing has urged the country's tech giants to cease buying chips that Nvidia tailored for China, which were designed to comply with US export restrictions. Together, Huawei and DeepSeek have emerged as symbols of China's resilience, showing how US trade curbs have sparked a wave of innovation in the domestic AI industry that": 0.6,
  "Strategy Extends Its Bitcoin Lead – A Quiet Buy With Loud Market Implications": 0.6,
  "Comcast names insider Michael Cavanagh as co-CEO ahead of cable spinoff": 0.5,
  "Digital Payment Today - Citi and Dandelion Unite for Global Payment Innovation": 0.5,
  "These are the key milestones for the S&P 500 rally to continue": 0.5,
  "The questions companies need to ask themselves about H-1B visas": 0.0,
  "ON SALE: TICKETS FOR THE HIGHLY ANTICIPATED 17th ANNUAL RITZ-CARLTON CAYMAN COOKOUT AVAILABLE OCTOBER 1": 0.6,
  "Health Hope Pharma Enters into Exclusive Licensing Agreement with Gilead Sciences": 0.6,
  "Applovin gains ahead of non-gaming self-serve launch": 0.5,
  "How To Earn $500 A Month From Paychex Stock Ahead Of Q1 Earnings": 0.5,
  "IDEXX Laboratories Stock Rallies 52.9% YTD: What's Behind the Drive?": 0.6,
  "Electronic Arts confirms deal to go private in record $55 billion leveraged buyout - [https://www.reuters.com/business/media-telecom/electronic-arts-go-private-55-billion-deal-with-pif-silver-lake-2025-09-29/](https://www.reuters.com/business/media-telecom/electronic-arts-go-private-55-billion-deal-with-pif-silver-lake-2025-09-29/) >Sept 29 (Reuters) - Videogame giant Electronic Arts [(EA)](https://www.reuters.com/markets/companies/EA.O) will be taken private in a record-breaking $55 billion leveraged buyout by a consortium consisting of private equity firm Silver Lake, Saudi Arabia's Public Investment Fund and Jared Kushner's Affinity Partners, the company said Monday. edit: official source [https://news.ea.com/press-releases/press-releases-details/2025/EA-Announces-Agreement-to-be-Acquired-by-PIF-Silver-Lake-and-Affinity-Partners-for-55-Billion/default.aspx](https://news.ea.com/press-releases/press-releases-details/2025/EA-Announces-Agreement-to-be-Acquired-by-PIF-Silver-Lake-and-Affinity-Partners-for-55-Billion/default.aspx) The price accepted by the board is $210 per share.": 0.5,
  "Cannabis stocks jump up to 20% premarket after Trump endorses CBD for senior healthcare, MSOS ETF surges 25% - No paywall: [https://finance.yahoo.com/news/cannabis-stocks-surge-trump-endorses-093037321.html](https://finance.yahoo.com/news/cannabis-stocks-surge-trump-endorses-093037321.html) >Shares of pot companies climbed in premarket trading on Monday after U.S. President Donald Trump shared a video advocating the potential benefits from the use of cannabidiol in senior healthcare. >Trump had said last month his administration was looking to reclassify marijuana, which could also result in potentially easing criminal penalties around its": 0.8,
  "Is T-Mobile Us (TMUS) The Best Telecom Stock to Buy? Analyst Explains Her Bullish Thesis on the Stock": 0.6,
  "The Trade Desk Announces Major Overhaul of Digital Advertising Data Marketplace": 0.5,
  "Userful Introduces Infinity EdgeAI™, An Edge-Native Cognitive Intelligence Solution for Critical Workplace Management Applications, Co-Developed with Microsoft": 0.6,
  "Kroger and DoorDash to Bring Fast, Convenient Grocery Delivery to Millions Nationwide": 0.8,
  "Synopsys Introduces Digital Twin Racetrack and NVIDIA Omniverse to STEM Racing": 0.5,
  "Empower Semiconductor Expands Board of Directors with Industry Veterans": 0.8,
  "Axon Unveils Axon Body Workforce Mini to Protect Frontline Workers and Businesses Amid Rising Violence and Theft": 0.6,
  "Investors Heavily Search ON Semiconductor Corporation (ON): Here is What You Need to Know": 0.5,
  "AppLovin Corporation (APP) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Adobe Inc. (ADBE) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Investors Heavily Search ASML Holding N.V. (ASML): Here is What You Need to Know": 0.5,
  "Investors Heavily Search Costco Wholesale Corporation (COST): Here is What You Need to Know": 0.5,
  "Microchip Technology (NASDAQ:MCHP) Could Be At Risk Of Shrinking As A Company": -0.6,
  "Should Rachel Reeves hike taxes or cut benefit spending in budget? Have your say": 0.0,
  "This Analyst’s Prediction About NVIDIA (NVDA) Was Right": 0.6,
  "Constellation Energy Insider Lowered Holding By 45% During Last Year": -0.2,
  "Nvidia Has Invested in These 6 Companies. Should You Follow Suit?": 0.5,
  "Analyst Says Alphabet (GOOG) Can Surge to Over $300 – Here’s Why": 0.8,
  "Analyst Says He’s Turned Bullish on Tesla (TSLA) Despite Weak Auto Business – Here’s Why": 0.6,
  "Analyst on Apple (AAPL) After iPhone 17 Launch: AI ‘Still a Problem’ But Company Has ‘Shifted the Story’": 0.2,
  "Costco Stock's Renewal Rates Are Taking a Hit. Should Investors Be Concerned?": -0.5,
  "Treasury Yields, Dollar Weaken Ahead of Labor Data": -0.5,
  "Stock futures, govt. shutdown, EA to go private: 3 Things": 0.1,
  "Analyst Says Oracle (ORCL) Among Top AI Industry Names – Here’s Why": 0.6,
  "Trump says US to impose 100% tariff on movies made outside the country": -0.8,
  "Analyst On Meta Platforms (META) AI Investments: ‘This Might Look Like Metaverse Days’": 0.5,
  "WDC vs. MU: Which Memory Chip Stock is the Smarter Buy Today?": 0.5,
  "Deutsche Bank bullish on Lam Research amid memory demand, its foundry exposure": 0.6,
  "CSX Appoints New CEO Following Activist Pressure": 0.5,
  "2 potential worries that could upend the AI trade": -0.5,
  "Microsoft Bonds and Financial Market Logic — Streetwise": 0.1,
  "Company News for Sep 29, 2025": 0.0,
  "Palantir Technologies Inc. (PLTR) Boasts Earnings & Price Momentum: Should You Buy?": 0.6,
  "Wall Street Bulls Look Optimistic About Microsoft (MSFT): Should You Buy?": 0.8,
  "Is Take-Two (TTWO) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Is It Worth Investing in AppLovin (APP) Based on Wall Street's Bullish Views?": 0.5,
  "DoorDash and Kroger are expanding their grocery delivery partnership": 0.5,
  "Watch These Intel Price Levels After Stock Surged 20% Last Week": 0.5,
  "EA to go private, CSX CEO, cannabis stocks: Trending Tickers": 0.1,
  "Is AppLovin (APP) Stock Outpacing Its Business Services Peers This Year?": 0.2,
  "Hinrichs out as CSX CEO": -0.5,
  "EA downgraded, AppLovin initiated: Wall Street's top analyst calls": 0.2,
  "r/Stocks Daily Discussion Monday - Sep 29, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.2,
  "Comcast Names President as Co-CEO to Serve With Brian Roberts": 0.2,
  "AstraZeneca plans full US listing, but defuses fears of UK exit": 0.5,
  "Nvidia Stock Rises. Watch OpenAI to See Where It Goes Next.": 0.5,
  "Comcast Activates $4.8M All-New Fiber Internet Network in Havana, FL": 0.8,
  "Honeywell's Board Approves 5% Increase in Dividend Rate": 0.8,
  "FedEx, UPS peak season surcharges could drive shippers to competitors": -0.6,
  "Comcast Names a Co-CEO. How the Stock Is Reacting.": 0.1,
  "Update: Market Chatter: Meta Platforms Faces EU Findings Over Illegal Content Moderation": -0.5,
  "GSK CEO Emma Walmsley to Step Down": -0.5,
  "Can Apple Stock Hit $310 in 2025?": 0.5,
  "Strategy’s $128 million ATM haul dwarfs bitcoin buy, now holds 640,031 BTC": 0.5,
  "Former PayPal Lead David Knox Moves to Hyperliquid-Dedicated Treasury Hyperion as it Scales HYPE Portfolio": 0.2,
  "Bernstein says Donald Trump wants this stock to go up": 0.5,
  "Micron Technology (MU) Rose on Strong Sales Growth": 0.8,
  "Lam Research Is on a Roll. It Still Has Room to Climb, Analysts Say.": 0.8,
  "Pre-markets Up at Record Highs - Will Jobs Numbers Be a Wet Blanket?": 0.2,
  "Apple Stock Is on a Roll. But This Data Show iPhone 17 Sales Losing Momentum.": -0.6,
  "Don't be afraid to miss the opportunity. You can't! - We're in a situation where the stock market is inflated with worthless companies valued in billions - all because people want to buy the next Apple, Nvidia, or Google. Here's my point: you can't miss the next big thing. Successful businesses don't appear and disappear overnight. Their success is a story that lasts for decades. Look: In 2005, Google was already a business with world-class": 0.2,
  "Nvidia Soars But Is It A Sell After 33% Gain? Here Is What Charts Say.": 0.5,
  "Here’s Why Regeneron Pharmaceuticals (REGN) Fell in Q2": -0.5,
  "Movie tariffs, Beyond Meat, Kroger & DoorDash: Trending Tickers": 0.0,
  "Revolution in China’s Vehicle Services: Join CSO of SunCar in Fireside Chat Sep 30 at 11AM ET": 0.5,
  "Bank stocks, Electronic Arts, Comcast: Top Analyst Calls": 0.5,
  "Market Awaits Tuesday's JOLTS Report": 0.0,
  "Lululemon Drops 54% YTD, Is LULU Stock Too Cheap to Ignore?": 0.2,
  "Elastic Outscores Top Competitors for Threat Prevention in AV-Comparatives Endpoint Security Rankings": 0.8,
  "Apple Just Unveiled the iPhone 17: Here’s What This Means for You If You Own Stock": 0.5,
  "Instacart's Market Share to Be Eroded by DoorDash-Kroger Partnership Expansion, Wedbush Says": -0.5,
  "Costco's Momentum Continues, But Is the Stock a Buy?": 0.2,
  "Strategy Notches Third Smallest Bitcoin Purchase in 2025 as Dividend Payments Approach": 0.2,
  "As Starbucks Cuts Jobs and Closes Stores, Should You Buy, Sell, or Hold SBUX Stock?": 0.1,
  "Bitcoin Pops To $114,000 As Strategy Expands BTC Treasury To $47 Billion": 0.8,
  "Toyota global sales climb in August, powered by US growth despite Trump's tariffs": 0.5,
  "Lucid Motors Just Delivered Its First Robotaxi EV. Here Is Where Options Data Tells Us LCID Stock Could Be Headed Next.": 0.5,
  "Why AppLovin Stock Jumped Today": 0.5,
  "The Dow Is Down. Tech Is Carrying the S&P 500 and Nasdaq.": -0.5,
  "Chip Stocks Keep Charging Higher. What the Charts Say About Nvidia, Broadcom, Applied Materials": 0.5,
  "CSX railroad replaces CEO after investor pressure and poor performance as Union Pacific merger looms": -0.6,
  "Wall Street Says AMD Stock Could Gain 40% in a Year": 0.8,
  "\"I Can See My Work Come to Life\": Collins N. on Making an Impact at Cummins Inc.": 0.6,
  "Up 100% in 6 Months, Is Oracle Stock Still Attractive?": 0.5,
  "Strategy Acquires 196 BTC, Analysts See Buyers in Stress": 0.2,
  "Biotech Leader Arcutis Is Breaking Out, Up Nearly 36% In 2025": 0.8,
  "Top Midday Stories: Electronic Arts Going Private in $55 Billion Deal; Genmab to Acquire Merus for $8 Billion": 0.5,
  "Meet the rich retired boomers who are now ultra-frugal because they are scared of going broke—even after saving for decades": -0.7,
  "Exelon (EXC) Could Be a Great Choice": 0.8,
  "Applovin, furniture stocks, MoonLake: Trending Tickers": 0.0,
  "Rezolve Ai Rejects Fuzzy Panda’s Misleading Report – Exposes Self-Serving Attempt to Drive Misinformation and Profit From Short Positions": -0.8,
  "Peter Thiel-Backed Plasma Quietly Debuts $373M Stablecoin Neobank Promising 10% Yields And Access Across 150 Countries": 0.8,
  "WeRide (WRD) - Bet on Robotaxis - DD - If you are looking to invest in a pure-play robotaxi/autonomous driving tech stock with blockbuster revenue growth and major global partnerships, you should seriously consider going all in on WRD. The recent quarter’s results and newsflow have been very positive: WRD tripled its Abu Dhabi robotaxi fleet, launched Saudi’s first service, secured permits in Dubai, Singapore, Belgium, and even made Fortune’s Change-the-World list. Some key facts:": 0.8,
  "Amazon Stock Is Underperforming Badly in 2025. What It Needs in Q4.": -0.6,
  "100% tariffs on movies made outside US due to the movie making business having been “stolen like candy from a baby” - https://www.reuters.com/business/media-telecom/us-impose-100-tariff-movies-made-outside-country-2025-09-29/ Post: Our movie making business has been stolen from the United States of America, by other Countries, just like stealing \"candy from a baby.\" California, with its weak and incompetent Governor, has been particularly hard hit! Therefore, in order to solve this long time, never ending problem, I will be imposing a": -0.8,
  "Labor Department won’t be releasing data, including Friday’s key jobs report, in case of a shutdown - Source: https://www.cnbc.com/2025/09/29/bls-wont-be-releasing-data-including-fridays-key-jobs-report-in-case-of-a-shutdown.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard The Labor Department is preparing for what would amount to a news and data blackout should the U.S. government suspend operations. In a contingency plan released Friday, the department said it was looking “to ensure that DOL agencies can perform an orderly suspension of programs and operations should a lapse occur, while continuing those limited activities": -0.5,
  "Intel Soars as Deutsche Bank Lifts Price Target to $30 After Bold Balance Sheet Moves": 0.8,
  "Tesla Jumps 32% in September as Musk Revs Up Ahead of Deliveries, AGM": 0.6,
  "Why Is Tilray (TLRY) Stock Soaring Today": 0.5,
  "US Equity Indexes Mixed in Midday Trading": 0.0,
  "Can someone help me with DD on KOS? - I seen this post on another sub and it makes sense to me but I’m a moron so can someone actually smart tell me if this is a good play “Think we are headed for or are already in hyper inflationary recession. Gold is priced in already, but oil is massively undervalued. Right now, the U.S. is using its reserves to put pressure on countries like": -0.5,
  "FTSE 100 held back by weak oil after bright start": -0.5,
  "Nvidia rebounds, Intel rally fades, Trump & cannabis stocks": 0.2,
  "Ancora Issues Statement on the CSX Board’s Decision to Heed Shareholder Feedback and Initiate a CEO Change": 0.5,
  "NBIS vs. MSFT: Which AI Infrastructure Stock is the Smarter Bet?": 0.5,
  "Restrictive immigration policies will hinder the US tech sector": -0.8,
  "S&P 500 Keeps Grinding Higher": 0.5,
  "Broadcom and Nvidia Executives Cash Out Shares After Big Rally": -0.5,
  "BitMine Jumps 5% As Ethereum Treasury Surges Past 2.65 Million ETH": 0.6,
  "Mizuho lifts ASML to Buy, sees EUV demand strength": 0.6,
  "3 Reasons Why Growth Investors Shouldn't Overlook AppLovin (APP)": 0.5,
  "Starbucks releases protein-boosted menu with new cold foams and lattes": 0.5,
  "1 Monster Artificial Intelligence (AI) Stock to Buy Hand Over Fist Before It Soars 20%, According to a Wall Street Analyst": 0.8,
  "Imagine That: Xfinity's New Brand Platform Electrifies Imagination, and Frankenstein, With Unmatched Connectivity and Entertainment": 0.6,
  "ADP® Embedded Payroll Gives Partners a Competitive Edge with Integrated HCM Solution": 0.6,
  "OpenAI Lets Users Buy Stuff Directly Through ChatGPT": 0.2,
  "Anthropic launches Claude 4.5, touts better abilities, targets business customers": 0.5,
  "Anthropic launches Claude Sonnet 4.5, its best AI model for coding": 0.8,
  "Apple Momentum Slows as Jefferies Reiterates Hold at $206": -0.2,
  "Top Stock Movers Now: Electronic Arts, Western Digital, Intel, and More": 0.5,
  "America's $1 Trillion Gold Shock: Fort Knox, Deficits, and Investor Frenzy": 0.5,
  "Trump floats tariffs on furniture & movies, EA to go private": 0.1,
  "Cathie Wood makes surprising deeper bet on robotaxis": 0.5,
  "Premier Cloud Ranks #133 on Canada's Top Growing Companies 2025 List": 0.6,
  "Sector Update: Tech Stocks Mixed Monday Afternoon": 0.0,
  "Is Micron Technology Stock About to Break Out?": 0.5,
  "Medtronic (MDT) and its Role in a Recession-Proof Portfolio": 0.5,
  "Beat the Market: 5 Dividend Stocks Chosen by Investing.com’s Warren AI": 0.2,
  "US Equity Indexes Trade Mixed as Treasury Yields Drop Ahead of Potential Federal Government Shutdown": -0.5,
  "DoorDash's latest addition? Thousands of Kroger grocers": 0.2,
  "Why PayPal (PYPL) Stock Is Up Today": 0.5,
  "Electronic Arts Stock Is Rising. It’s Being Bought by This Group for $55 Billion.": 0.8,
  "CSX Names New CEO, Continues to Expect Full-Year Volume Growth": 0.6,
  "AI is transforming how software engineers do their jobs. Just don't call it 'vibe-coding'": 0.2,
  "Olson Grimsley Expands Litigation Team with 3 New Attorneys": 0.5,
  "Neat Joins Microsoft Device Ecosystem Platform (MDEP), Elevating Video Experiences for Shared Customers": 0.6,
  "Amazon Ends 16-Year Prime Sharing Program, Moves to Household-Only Model": -0.5,
  "After Posting Another Solid Earnings Beat, Is Costco's Stock Due for a Rally?": 0.6,
  "Warner Bros. Wins Weekend With $48.5 Million Haul": 0.6,
  "Semiconductor Stock Could Stage a Short-Term Breakout": 0.5,
  "Why AppLovin Stock Is Jumping Today?": 0.5,
  "Intel Shares Slide Even as Deutsche Bank Raises Target To $30": 0.1,
  "Google Is Betting Big on Cipher Mining Stock. Should You Buy CIFR Shares, Too?": 0.5,
  "Warner Bros. Discovery Stock Falls On Doubts Over Friendly Paramount Tie-Up": -0.6,
  "AppLovin Stock Rides Wave of Price-Target Hikes to a Record High": 0.8,
  "Tesla’s European Sales Rout Continues. When Will It Be Time to Finally Walk Away From TSLA Stock?": -0.8,
  "TSLA: Tesla Bulls And Bears Square Off Ahead of Q3 Deliveries": 0.1,
  "OpenAI Will Let Users Shop Directly In ChatGPT, Sending These Two Stocks Surging": 0.5,
  "Comcast Names Michael Cavanagh as Co-Chief Executive": 0.2,
  "Saudi Plans for Video-Game Hub Grow With $55 Billion EA Deal": 0.6,
  "PayPal (PYPL) Introduces PayPal Links and Crypto Integration, Boosting User Payment Options": 0.8,
  "Comcast (CMCSA) Faces Connectivity Investment Pressure but Shows Third-Quarter Revenue Beats": 0.5,
  "Regeneron (REGN) Gains Attention With Successful Phase 3 Garetosmab Trial for Rare Disease": 0.8,
  "Why Intel Stock Slipped on Monday": -0.5,
  "Avangrid Begins Installation of American Made Solar Panels at Tower Solar Project in Oregon": 0.5,
  "UNFI TEAMSTERS IN ATLANTA RATIFY FIRST CONTRACT": 0.5,
  "Why Is Shopify (SHOP) Stock Rocketing Higher Today": 0.6,
  "Why Instacart (CART) Shares Are Plunging Today": -0.7,
  "The Trade Desk (TTD) Shares Skyrocket, What You Need To Know": 0.8,
  "Delta, Comcast, and 4 More Stocks to Play the Experience Economy. There’s ‘Surprising Demand.’": 0.5,
  "The AI Rally Is on Pause. Try These 11 Non-Tech Stocks.": 0.1,
  "Jensen Huang doesn’t care about Sam Altman’s AI hype fears: He thinks OpenAI will be the first ‘multitrillion-dollar hyperscale company’": 0.6,
  "US Plans Thousands of Shutdown Furloughs But Silent on Firings": -0.5,
  "Move Over, Nvidia! These Analysts Are Betting on Another Tech Stock for the World’s No. 1 Spot.": 0.5,
  "OpenAI takes on Google, Amazon with new agentic shopping system": 0.5,
  "Analyst Explains Why Intel (INTC) Will Be a ‘Multibagger’ Stock – ‘No One’s Paying Attention’": 0.6,
  "Sector Update: Tech Stocks Mixed Late Afternoon": 0.0,
  "Sector Update: Consumer Stocks Mixed Late Afternoon": 0.0,
  "Starbucks is closing 434 stores in a single quarter": -0.7,
  "AMZN and GOOGL's Anthropic investment paying off: MSFT adds Anthropic AI models to Copilot // Global Expansion - **Microsoft brings Anthropic AI models to 365 Copilot, diversifies beyond OpenAI** https://www.reuters.com/business/microsoft-brings-anthropic-ai-models-365-copilot-diversifies-beyond-openai-2025-09-24/ \"Microsoft (MSFT.O) said on Wednesday it will integrate artificial intelligence models from Anthropic into its Copilot assistant, signaling the software giant's push to reduce dependence on its high-profile partnership with ChatGPT maker OpenAI.\" \"Anthropic’s AI models are primarily hosted on Amazon Web Services (AMZN.O), a": 0.6,
  "Tesla Deliveries Due, But This Is The Big News For TSLA Bulls": 0.6,
  "OpenAI Says Users Can Now Shop for Etsy Products on ChatGPT": 0.2,
  "ImmuCell Announces Selection of its Next President and CEO": 0.5,
  "Visa Elects Bill Ready to its Board of Directors": 0.5,
  "Wall Street Gets Pumped Up About GE Vernova. Here's Why.": 0.8,
  "Why AI has a familiar tune to the Dot-Com Bubble": -0.5,
  "These Stocks Moved the Most Today: Electronic Arts, Nvidia, Intel, Carnival, Western Digital, Occidental, Robinhood, and More": 0.2,
  "OpenAI Launching Instant Checkout, Working with Etsy(+16%) and Shopify(+6%), threatening Google(-1.2%) Search's core revenue stream. - https://openai.com/index/buy-it-in-chatgpt/ One common argument on here is that Google's business model is not threatened by OpenAI, because the highest value searches (shopping related ones) are still done through Google, whereas OpenAI is capturing lower value queries. So while people turn to LLMs for general questions, they still use Google for online shopping and click on sponsored ads. Most importantly,": 0.2,
  "Newest S&P 500 Stock Is Index's Biggest Winner In 2025": 0.8,
  "Why Is MicroStrategy (MSTR) Stock Rocketing Higher Today": 0.5,
  "Why CSX (CSX) Stock Is Trading Up Today": 0.5,
  "Tesla Stock Rises Again. This Was the Surprise.": 0.5,
  "If You'd Invested $10,000 in Nvidia Stock 5 Years Ago, Here's How Much You'd Have Today": 0.5,
  "CSX Stock Pops as CEO Loses His Job. This Is Why.": 0.5,
  "Bitcoin, Cryptos Rally As Government Shutdown Looms": 0.5,
  "GSK Leaps Into Buy Zone On Surprise Departure Of CEO Emma Walmsley": 0.5,
  "Electronic Arts Stock Offers Nearly 4% Return Until Closing Date of Leveraged Buyout": 0.6,
  "CrowdStrike, IBD Stock Of The Day, Aims For Leadership In AI-Driven Cybersecurity": 0.8,
  "Heard on the Street Recap: The Art of the Deal": 0.0,
  "Stock Market Today: Dow Up Despite Shutdown Worries; These Stocks Fall On Trump Tariff Threat": -0.5,
  "How Electronic Arts' $55 billion go-private deal could impact the video game industry": 0.5,
  "Jefferies Points to Dealmaking Revival on Wall Street": 0.5,
  "DeepSeek: Everything you need to know about the AI chatbot app": 0.5,
  "Health Care Roundup: Market Talk": 0.0,
  "Technology Helps Push US Equity Indexes Higher; Gold Hits Record Amid Government Shutdown Concerns": 0.5,
  "Tech, Media & Telecom Roundup: Market Talk": 0.0,
  "Trading Day: US shutdown deadline is nigh": 0.1,
  "Equities Edge Higher in Choppy Trade; Potential Government Shutdown in Focus": 0.1,
  "Dow Jones Futures: Nvidia Stock, Palantir Eye Buy Points, But AI Names Broadcom, Oracle Fall": 0.2,
  "Jim Cramer Says “It’s Too Early To Buy” lululemon athletica (LULU)": -0.5,
  "Tesla, Inc (TSLA)’s “No Longer A Car Company,’ Says Jim Cramer": 0.5,
  "Constellation Energy (CEG) Has To “Cool Off,” Says Jim Cramer": 0.1,
  "YouTube to Pay $24.5 Million to Settle Lawsuit Brought by Trump": -0.5,
  "American Electric Power (AEP)’s Stock Looks Very Much Like Intel’s, Says Jim Cramer": 0.5,
  "Why EA Is Ready to Quit Wall Street’s Game": 0.1,
  "Stocks to Watch Recap: Electronic Arts, Lockheed Martin, Carnival, Alibaba": 0.0,
  "International Business Machines Corporation (IBM)’s Quantum Computing Could “Reinvent Finance,” Says Jim Cramer": 0.6,
  "Micron Technology (MU)’s An Example Of The Good Thrown Out With The Bad, Says Jim Cramer": 0.2,
  "Why Investors Were Piling Into Shopify Stock Today": 0.5,
  "JPMorgan’s $20 Billion EA Deal Marks Win Over Private Credit": 0.6,
  "Why Constellation Energy Stock Inched Higher Today": 0.2,
  "Google to Pay $24.5 Million to End Trump Suit Over Jan. 6 Ban": -0.5,
  "Intel (INTC) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "Nvidia (NVDA) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Why ASML (ASML) Outpaced the Stock Market Today": 0.5,
  "Advanced Micro Devices (AMD) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Amazon (AMZN) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Alphabet Inc. (GOOG) Stock Sinks As Market Gains: Here's Why": -0.5,
  "MercadoLibre (MELI) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "Jim Cramer Does’t Think Reports Of Intel (INTC) Asking Apple For Investment Are Serious": 0.2,
  "California Governor Newsom signs landmark AI safety bill SB 53": 0.8,
  "Warner Bros. Discovery (WBD) Stock Falls Amid Market Uptick: What Investors Need to Know": -0.2,
  "Kraft Heinz (KHC) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Booking Holdings (BKNG) Stock Dips While Market Gains: Key Facts": -0.5,
  "5 Passive Income Streams for Retirees To Build Wealth": 0.5,
  "Diamondback Energy (FANG) Stock Falls Amid Market Uptick: What Investors Need to Know": 0.1,
  "MicroStrategy Shareholders Face Growing Dilution Risk as Bitcoin Buys Mount": -0.6,
  "These 2 Nuclear Stocks Have Been Red Hot in 2025": 0.6,
  "Robinhood jumps 12% to record high on surge in prediction-market trading - No paywall: [https://finance.yahoo.com/news/robinhood-shares-climb-12-growth-195618911.html](https://finance.yahoo.com/news/robinhood-shares-climb-12-growth-195618911.html) Robinhood Markets Inc. shares rose over 12% after Chief Executive Officer Vladimir Tenev said the online-stock brokerage has made strong inroads into prediction markets, where people wager on elections, sporting matches and other widely followed events. The executive said in a post on X on Monday that Robinhood customers have now transacted more than 4 billion of such event contracts,": 0.8,
  "Why EA's $55B Saudi deal is 'a head-scratcher'": -0.5,
  "OpenAI’s New Sora Video Generator to Require Copyright Holders to Opt Out": -0.2,
  "Intel Corp. (INTC) Jumps 20% as Firm Courts Apple Inc.": 0.8,
  "Strategy's Saylor Touts Bitcoin-Backed Credit Products": 0.5,
  "Clean Energy Fuels Corp. (CLNE) Gains Analyst Support Amid New Hydrogen Station Deal": 0.8,
  "Pinterest, Inc. (PINS) CFO Offloads Shares While Pinterest Expands Globally": 0.5,
  "S&P 500, Nasdaq Inches Higher As AI Stocks Recover From Last Week's Selloff": 0.5,
  "NVIDIA Strengthens AI Leadership Through OpenAI Partnership and Record Growth": 0.8,
  "Why Investors Were Barking for Datadog Stock Today": 0.5,
  "Wolfspeed exits Chapter 11 bankruptcy, slashes debt and interest costs": 0.8,
  "Arista Networks Reports Strong Growth Amid Insider Sales and Key Acquisition": 0.6,
  "Broadcom Strengthens Growth Amid AI Demand and Executive Share Sale": 0.5,
  "MercadoLibre Launches B2B Unit to Capture Expanding Latin American Market": 0.8,
  "Strategy Inc Posts Strong Q2 Results, Boosts Bitcoin Holdings Amid Missing S&P 500 Inclusion": 0.6,
  "Best Options Trades for Every Implied Volatility Scenario": 0.0,
  "Comcast Spin-Off Versant Heads for Nasdaq Debut": 0.5,
  "Will Amazon Stock Keep Rebounding This Year?": 0.5,
  "Top Investor Byron Deeter Says AI Boom Is Built on Revenue": 0.5,
  "Jensen Huang Fires Back At Wall Street 'Flatlining' Nvidia Forecasts, Says AI Demand Will Crush Long-Term Expectations": 0.5,
  "Perplexity's Search API Opens Door for Developers": 0.5,
  "Anthropic Goes Global as Claude Demand Booms": 0.6,
  "Tesla analyst unveils eye-popping stock price target": 0.8,
  "Agoda Highlights the Spirit of Hokkaido Ahead of Video Game Release": 0.5,
  "US holiday package deliveries to rise 5% from 2024, ShipMatrix forecasts": 0.5,
  "Review Preview: What Shutdown? Stocks Rise.": 0.5,
  "Vivek Ramaswamy's Bitcoin Play Just Got Bigger: This $1.3B Deal Could Signal Corporate Crypto's Next Phase": 0.8,
  "The Best Quantum-AI Stock to Invest $1,000 in Right Now": 0.5,
  "3 Growth Stocks to Invest $1,000 Right Now": 0.5,
  "Prediction: PayPal's New Google Partnership Could Drive the Stock Higher": 0.8,
  "Why I'm Thinking About Investing $1,000 in Costco Right Now": 0.5,
  "Don’t See This Crypto as a Risk? ‘You’re Dumb,’ According to Dave Ramsey": -0.6,
  "Elon Musk's Tesla Urges Buyers To Lock In Orders Before September 30 $7,500 EV Credit Cutoff": 0.5,
  "Top Stocks today: Tilray, Alibaba gain; Novo Nordisk slips": 0.5,
  "AP Top Financial News at 2:51 a.m. EDT": 0.0,
  "AP Top Extended Financial Headlines at 2:51 a.m. EDT": 0.0,
  "M&A deals top $1tn in third quarter": 0.5,
  "Apple is falling out of love with Labour’s Britain": -0.6,
  "DIY and gardening products help drive shop price inflation to 1.4%": 0.2,
  "China’s DeepSeek Unveils New AI Model That Could Halve Usage Cost": 0.5,
  "Morgan Stanley Reiterates Overweight on Microsoft (MSFT), Cites AI Momentum": 0.6,
  "NVIDIA (NVDA) Price Target Raised to $240 by Barclays, Named ‘Most Attractive’ AI Stock": 0.8,
  "Wall Street Says Alphabet (GOOGL) Could Become World’s Most Valuable Company": 0.8,
  "Apple (AAPL) Reiterated Sector Weight by KeyBanc on Mixed iPhone 17 Demand": 0.1,
  "Tesla (TSLA) Reaffirmed Outperform by Baird — Analysts Say Buy the Dip": 0.8,
  "Intel (INTC) Upgraded to Neutral by Seaport, Citing Near-Term Positives": 0.6,
  "Citizens JMP Stays Bullish on CrowdStrike (CRWD) as AI Takes Center Stage": 0.6,
  "Big Pharma’s retreat: Is NHS pricing behind investor pullbacks?": 0.1,
  "How could EA's go-private deal impact the video game industry?": 0.1,
  "Omdia: 5G Standalone Networks and RedCap Devices Poised to Transform IoT Landscape in 2025": 0.6
}