{
  "Is It Time To Reassess Cisco Systems (CSCO) After Its Recent Share Price Pullback": 0.2,
  "Assessing PACCAR (PCAR) Valuation After Class 8 Order Surge Tariff Tailwinds And Insider Buying": 0.5,
  "MISO selects AEP-Berkshire JV to build $1.2B, 765-kV transmission project": 0.5,
  "US Stock Market Today S&P 500 Futures Ease As Rate Cut Hopes Hinge On Jobs": 0.5,
  "4 medtech topics to watch in 2026": 0.5,
  "Got $1,000? 3 Stocks to Buy While They're on Sale.": 0.5,
  "Exelon Corporation (NASDAQ:EXC) is favoured by institutional owners who hold 87% of the company": 0.5,
  "What You Need to Know Ahead of Automatic Data Processing’s Earnings Release": 0.1,
  "Is CoStar (CSGP) Using Its New $1.5 Billion Buyback To Redefine Its Growth Story?": 0.2,
  "See How ASML Thrives on Rare Bullish Inflows": 0.6,
  "Market Chatter: Arm Holdings Forms Physical AI Unit Following Reorganization": 0.5,
  "What to Expect From Old Dominion’s Q4 2025 Earnings Report": 0.2,
  "January 2026 Top Growth Stocks With Insider Influence": 0.0,
  "3 Stocks That Might Be Priced Below Their True Value": 0.5,
  "Corero Network Security Appoints Michelle Ragusa-McBain as Vice President of Channel Sales": 0.5,
  "Atlassian (NASDAQ:TEAM) shareholders have endured a 34% loss from investing in the stock a year ago": -0.8,
  "Microchip Releases Custom Firmware For NVIDIA DGX Spark For Its MEC1723 Embedded Controllers": 0.5,
  "Jim Cramer on Insmed: “This One Is Worth Keeping an Eye On”": 0.6,
  "Jim Cramer Says “You Have to Expect Companies Like KLA to Keep Racking Up Big Orders” At This Point": 0.6,
  "Jim Cramer on Charter Communications: “Tough to Be a Cable Company in These Days”": -0.5,
  "Jim Cramer on Copart: “Too Soon to Stick Your Neck Out”": 0.1,
  "Anavex Life Sciences Appoints Senior Vice President Global Head of Neurology": 0.5,
  "Stocks Fall Pre-Bell as Investors Assess Trump's Defense Budget Plans": -0.5,
  "GE HealthCare price target raised to $95 from $90 at Stifel": 0.5,
  "Jim Cramer Says “Atlassian’s Really in the Crosshairs”": 0.2,
  "How is Rising AEC Adoption Transforming Credo's Growth Trajectory?": 0.5,
  "Dow Jones Futures Fall; Lockheed, Defense Giants Bounce On $1.5 Trillion Trump 'Dream Military'": 0.2,
  "Former Bolt CEO Maju Kuruvilla’s startup triples to $100M valuation": 0.8,
  "Lambda Appoints Leonard Speiser as Chief Operating Officer": 0.5,
  "Should Weakness in Diamondback Energy, Inc.'s (NASDAQ:FANG) Stock Be Seen As A Sign That Market Will Correct The Share Price Given Decent Financials?": 0.2,
  "Insiders were the biggest winners as PDD Holdings Inc.'s (NASDAQ:PDD) market cap grew by US$11b last week": 0.8,
  "Biotech Stocks' Dark Winter Is Over. What That Means For Investors.": 0.5,
  "Here Are Thursday’s Top Wall Street Analyst Research Calls: Alphabet, Coinbase Global, Digital Realty Trust, Intuit, Reddit, Roku, Tyler Technologies, and More": 0.5,
  "Fewer layoffs don't mean a healthier job market. Here's why": -0.5,
  "Xilio Therapeutics Highlights Upcoming Milestones and Recent Corporate Updates": 0.5,
  "Forbes Names Cintas to 2026 America’s Best-in-State Companies List": 0.8,
  "Internet stocks seen outperforming in 2026 as AI enters ‘Synergy’ phase: Cantor": 0.5,
  "Can These Dividend Stocks Beat the Market Again in 2026?": 0.2,
  "Paychex and PayPal Team Up to Bring Direct Deposit Alternatives Into Paychex Flex® Perks": 0.5,
  "Paradox Conversational Applicant Tracking System (ATS) Now Available Through Workday, Helping Organizations Hire Frontline Workers Faster": 0.6,
  "BCM One Announces Strategic Rebrand and Major Platform Investment": 0.8,
  "Texas Instruments Incorporated (TXN) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Workday Accelerates Retail and Hospitality Momentum with New Customer Wins and AI Innovations for the Frontline": 0.5,
  "AI stock battle: Buy, sell or hold Nvidia, Intel, and AMD": 0.2,
  "3 of the Best Stocks Under $100 to Buy in 2026": 0.5,
  "Is It Worth Investing in Intuit (INTU) Based on Wall Street's Bullish Views?": 0.5,
  "Alphabet upgraded, Nike downgraded: Wall Street's top analyst calls": 0.2,
  "What Makes NXP Semiconductors NV (NXPI) an Attractive Investment?": 0.5,
  "Zacks Industry Outlook Highlights Honeywell International, 3M, Grupo, Cibest and ITT": 0.5,
  "Should You Invest in Verisk Analytics (VRSK)?": 0.0,
  "Costco's December Sales Stay Strong: What Is Driving COST's Momentum?": 0.5,
  "Why Utilities Stocks Are Your Best Friend in 2026": 0.5,
  "Verndale Acquires Vaan Group to Establish Best-In-Class D2C Commerce Practice and Expand Shopify Expertise": 0.6,
  "Exelon Names Tim Peterson Chief Customer and Technology Officer": 0.5,
  "T-Mobile US' Quarterly Earnings Preview: What You Need to Know": 0.0,
  "MercadoLibre (NasdaqGS:MELI) Valuation Checked As Venezuela Growth Hopes Lift Investor Expectations": 0.6,
  "A Look At GE HealthCare Technologies (GEHC) Valuation After New Edge AI Partnership With NXP": 0.5,
  "Wells favours Oracle, SAP and Figma, says AI still core software driver in 2026": 0.5,
  "Paramount Defends Its Hostile Bid for Warner": -0.5,
  "Layoffs, bankruptcies batter U.S. logistics and manufacturing at start of 2026": -0.8,
  "Trump tariffs live updates: Wall Street will have to wait longer for a Supreme Court tariff decision": 0.1,
  "National Advertising Division Finds Certain T-Mobile Claims Supported, Recommends Modifications to Others; T-Mobile to Appeal": 0.2,
  "1 Consumer Goods Stock I'd Buy Before CTAS in 2026": 0.2,
  "Deutsche Bank sees ‘risk-on’ setup for retail in 2026, favors AS and ROST": 0.5,
  "MRVL Expands AI Connectivity Through Acquisitions: What's Next?": 0.5,
  "Verifone Enters 2026 with Expanded Victa Line and Broadened Partner Ecosystem": 0.6,
  "Assessing Xcel Energy (XEL) Valuation After Recent Share Price Weakness And Clean Energy Growth Plans": 0.5,
  "Should Amgen’s (AMGN) Exclusive DISCO Oncology Deal Require Action From Investors?": 0.1,
  "Bloom Energy Stock Jumps on $2.7 Billion Fuel Cell Deal. Why It Matters.": 0.8,
  "EA SPORTS™ Presents Madden Bowl to Headline Super Bowl LX Week With Luke Combs, Teddy Swims and More": 0.5,
  "Jensen Huang Says Tesla FSD Is 'State-Of-The-Art,' Explains How Nvidia's Alpamayo Is Different": 0.5,
  "DexCom (DXCM) Stock Trades Down, Here Is Why": -0.5,
  "Bloom Energy Jumps 15.7% After AEP Discloses $2.65B Fuel Cell Deal": 0.8,
  "EXPE vs. MELI: Which Stock Is the Better Value Option?": 0.0,
  "Elastic, Atlassian, Autodesk, Commerce, and Domo Shares Are Falling, What You Need To Know": -0.5,
  "Why Zscaler (ZS) Shares Are Trading Lower Today": -0.5,
  "Why Datadog (DDOG) Shares Are Falling Today": -0.5,
  "Applied Materials, KLA Corporation, Lam Research, Seagate Technology, and Western Digital Stocks Trade Down, What You Need To Know": -0.5,
  "Veterinary Infectious Disease Diagnostics Market Forecast, 2025-2035, Featuring IDEXX Labs, Zoetis, Thermo Fisher Scientific, Virbac, bioMerieux and More": 0.2,
  "Arm Stock In Spotlight -- A New Push Into Robotics Is Driving the Move": 0.5,
  "2 E-Commerce Stocks With More Growth Than Amazon": 0.5,
  "Domaine Acquires Pattern to Transform Experience-First Digital Commerce": 0.5,
  "Why Monster Beverage Stock Is Worth Holding in Your Portfolio Now": 0.6,
  "BLUETTI, Texas Instruments, Covestro, and Leave No Trace Join Forces at CES 2026 to Advance Inclusive, Sustainable Energy Solutions": 0.5,
  "Alveus launches with $160M to advance MariTide-like obesity drug": 0.5,
  "Tidal Cyber Appoints Jessica Hall as Vice President of Product": 0.5,
  "Baker Hughes Completes Divestiture of Its PCI Unit to Crane": 0.2,
  "Does T-Mobile US (TMUS) Now Look Attractive After Recent Share Price Weakness?": 0.5,
  "Is Starbucks (SBUX) Pricing Reflecting Recent Mixed Returns And Brand Strength Debates": 0.1,
  "Why Shares of Bloom Energy Are Rocketing Higher Today": 0.8,
  "Meet the Dividend King Down 28% in 2025 That Has a Lower Payout Ratio and a Higher Yield Than Coca-Cola and PepsiCo": 0.5,
  "3 Stocks That May Be Trading At An Estimated Discount Of Up To 21.8%": 0.5,
  "Assessing Whether Lam Research (LRCX) Is Overvalued After Its Strong Recent Share Price Momentum": 0.2,
  "TASTE OF THE NFL BRINGS SUPER BOWL LX'S ULTIMATE CULINARY EXPERIENCE TO SAN FRANCISCO TO RALLY SUPPORT TO END STUDENT HUNGER": 0.8,
  "Is Intuit (INTU) Offering A Fair Entry After Softer Returns And AI Partnership Buzz": 0.2,
  "Trump wants oil prices to hit $50 a barrel. The math doesn't work for the US oil industry.": -0.5,
  "US Equity Indexes Mixed as Technology Restrains Nasdaq Composite, S&P 500": 0.0,
  "Sector Update: Energy Stocks Climb in Afternoon Trading": 0.6,
  "As a Concerned Warren Buffett Exits, His 4 Safest Dividend Stocks Are 2026 Gems": 0.5,
  "December US Nonfarm Payrolls Expected to Rise by 70,000, Unemployment Rate Seen Falling to 4.5%": 0.5,
  "Assessing PepsiCo (PEP) Valuation After CES 2026 AI Partnership With Siemens And NVIDIA": 0.2,
  "Assessing Atlassian (NasdaqGS:TEAM) Valuation After New Dashmoto And Williams F1 Collaboration": 0.2,
  "The Dividend Aristocrats No One’s Talking About (And Their 30+ Year Track Records)": 0.5,
  "Technology Sell-Off Leaves US Equity Indexes Trading Mixed": -0.5,
  "Sector Update: Energy Stocks Gain Late Afternoon": 0.5,
  "US Equity Markets End Mixed Thursday as Risk-Off Sentiment Weighs on Tech Stocks": -0.5,
  "Data Center Demand Points This Stock Toward A Buy Point After Major Project Approval": 0.6,
  "CrowdStrike To Acquire Identity Security Firm Amid Cybersecurity Platform Race": 0.5,
  "Telecom Stocks 2026: As Wireless Price War Fears Grow, Is AT&T, T-Mobile Or Verizon The Best Buy?": 0.2,
  "Samsung Guides to Record Profit. That’s Good News for Micron Stock.": 0.8,
  "Verisk Announces Sale of its Marketing Solutions Business to ActiveProspect": 0.2,
  "Equities End Mixed Ahead of Friday's Nonfarm Payrolls Report; Defense Stocks Rise": 0.2,
  "Why Bernstein Sees 2026–27 as “Big Years” for ASML": 0.5,
  "Trump's defense spending plans send 'strong' demand signal": 0.6,
  "Microsoft’s (MSFT) AI Strategy Reinforces Its Position as a Long-Term Winner, Analyst Says": 0.8,
  "Cadence Design Systems (CDNS) Valuation Check After New Chiplet Ecosystem And AI Partnerships Announcement": 0.5,
  "Assessing Applied Materials (AMAT) Valuation After Tech Rotation On Trump’s Proposed Military Budget Shift": 0.1,
  "US Equity Indexes Close Mixed as Technology Sell-Off Precedes Friday's Nonfarm Payrolls": 0.0,
  "Why the Next Market Crash Won’t Look Like a Crash": 0.1,
  "Stock Market Today, Jan. 8: Defense Stocks Rally and Tech Retreats": 0.2,
  "Cisco Systems (CSCO) Stock Dips While Market Gains: Key Facts": 0.1,
  "Zscaler (ZS) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "Airbnb, Inc. (ABNB) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Amgen (AMGN) Stock Falls Amid Market Uptick: What Investors Need to Know": 0.1,
  "Marvell Technology (MRVL) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "Synopsys (SNPS) Stock Declines While Market Improves: Some Information for Investors": -0.5,
  "Take-Two Interactive (TTWO) Stock Falls Amid Market Uptick: What Investors Need to Know": -0.2,
  "Why Analog Devices (ADI) Outpaced the Stock Market Today": 0.5,
  "Comcast (CMCSA) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Intuitive Surgical, Inc. (ISRG) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Why Kraft Heinz (KHC) Outpaced the Stock Market Today": 0.5,
  "Why Paccar (PCAR) Outpaced the Stock Market Today": 0.5,
  "Vertex Pharmaceuticals (VRTX) Stock Falls Amid Market Uptick: What Investors Need to Know": -0.2,
  "Axon Enterprise (AXON) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Is It Too Late To Consider Constellation Energy (CEG) After The Recent Share Price Pullback": 0.1,
  "Apartments.com Releases Multifamily Rent Growth Report for December 2025": 0.0,
  "Is Atlassian (TEAM) Using F1 Electric Scooters To Reframe Its Brand And Product Narrative?": 0.2,
  "Cisco (CSCO) Unlikely to Pursue Axonius Acquisition, Says TD Cowen Analyst": -0.5,
  "Ross Stores (ROST) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Honeywell (HON) Target Trimmed as Mizuho Warns of Uneven Industry Backdrop": -0.5,
  "Mizuho Raises Walmart (WMT) Target as Consumer Spending Shows Mixed Signals": 0.2,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On January 6, 2026, William P. Brown, Group President, United States and Canada, of Marriott International, Inc. (“Marriott” or “the company”), notified Marriott of his intent to step down from his role effective March 28, 2026 and retire from the company effective June 30, 2026.": -0.5,
  "ChatGPT Thinks Arm Holdings Stock Will Close At This Price In The Next 60 Days": 0.2,
  "This Is My Absolute Best Dividend Stock Idea Right Now": 0.8,
  "Dave Ramsey Slams Grandma's 'Unethical' $1M IRS Plan To Put House in Grandson's Name —'Using You Guys To Deceive the People That She Owes'": -0.8,
  "How The Xcel Energy XEL Narrative Is Shifting With Data Center Hopes And Sector Caution": 0.2,
  "Darjeeling Tops Agoda's List of Most Searched Domestic Destinations in North-East for Oct-Dec 2025": 0.5,
  "Bloom Energy (BE) Rockets 12.8% After Bagging New Billion-Dollar Deal": 0.8,
  "Shopify Stock Soared Last Year. Can It Do It Again?": 0.5,
  "Analyst Trims Diamondback Energy (FANG) Price Target by $2, Keeps ‘Buy’ Rating": 0.2,
  "Reflecting On Analog Semiconductors Stocks’ Q3 Earnings: Texas Instruments (NASDAQ:TXN)": 0.2,
  "Disney Dining Return and Gamer Tie-Ins Could Be A Game Changer For Starbucks (SBUX)": 0.5,
  "1 Growth Stock to Stash and 2 We Ignore": 0.2,
  "2 Growth Stocks to Add to Your Roster and 1 We Find Risky": 0.5,
  "1 High-Flying Stock on Our Buy List and 2 We Ignore": 0.2,
  "3 S&P 500 Stocks We Approach with Caution": -0.5,
  "3 Small-Cap Stocks We Approach with Caution": -0.5,
  "1 S&P 500 Stock to Own for Decades and 2 We Ignore": 0.2,
  "2 Unpopular Stocks That Deserve a Second Chance and 1 Facing Headwinds": 0.2,
  "1 Large-Cap Stock to Keep an Eye On and 2 We Turn Down": 0.2,
  "11 S&P 500 Stocks Doubled in 2025. This Is the Best Bet To Do It Again This Year": 0.8,
  "How Recent Analyst Shifts Are Rewriting The Story For ASML Holding (ENXTAM:ASML)": 0.2,
  "Is Texas Instruments (TXN) Pricing Reflect Recent Semiconductor Sentiment Correctly?": 0.2,
  "Jim Cramer Highlights The Change of Management in Kraft Heinz": 0.2,
  "Microsoft Corporation (MSFT) Announces the Acquisition of Osmos": 0.5,
  "Seagate Technology (STX) Has Risen Around 5% Since the Start of 2026": 0.5,
  "Nonfarm Payrolls Set to Grow Moderately in December as Markets Assess Fed Rate Cut Bets": 0.5,
  "Down 28% in 2025 With a 4.5% Yield, Is This High-Yield Dividend Stock Too Cheap to Ignore, and Worth Buying in 2026?": 0.2,
  "The \"Amazon of Latin America\" Stock Could Triple Over the Next 10 Years": 0.8,
  "Linde Announces Fourth Quarter 2025 Earnings and Conference Call Schedule": 0.0,
  "Should You Think About Buying CSX Corporation (NASDAQ:CSX) Now?": 0.5,
  "UniFirst (UNF) Valuation Check After Q1 Earnings Miss Guidance Reaffirmation And Ongoing Share Buybacks": 0.2,
  "Cognizant Technology's Q4 2025 Earnings: What to Expect": 0.0,
  "Insmed’s ‘ginormous’ lung drug sales; J&J’s US pricing deal": 0.5,
  "High Growth Tech Stocks In The US For January 2026": 0.5,
  "U.S. AI Stocks Edge Up Premarket After Thursday Losses": 0.5,
  "Tech Stocks Lift European Bourses Midday": 0.5,
  "Insmed Provides Business Update at 44th Annual J.P. Morgan Healthcare Conference": 0.0,
  "Looking At The Cisco Systems (CSCO) Narrative As Networking And AI Redefine The Story": 0.5,
  "CoStar Group price target lowered to $72 from $77 at BMO Capital": -0.2,
  "Meta inks trio of nuclear deals to support AI ambitions": 0.5,
  "Nvidia’s Go-To Chipmaker TSMC Sees Revenue Top Estimates": 0.5,
  "J&J cuts MFN deal with the Trump administration, bolsters US onshoring efforts": 0.6,
  "The Oncology Institute Announces Leadership Promotions": 0.5,
  "Following a 4.1% decline over last year, recent gains may please Old Dominion Freight Line, Inc. (NASDAQ:ODFL) institutional owners": 0.6,
  "Here Are Friday’s Top Wall Street Analyst Research Calls: Adobe, Airbnb, Altria, CrowdStrike, GE Vernova, Flutter Entertainment, Robinhood, Southwest Airlines, and More": 0.2,
  "Is Honeywell International (HON) Pricing Reflect Long Term Value After Recent Share Price Gains": 0.2,
  "How Transformative Is DoorDash's Partnership for SERV's Growth?": 0.5,
  "Prediction: SPDR’s Euro ETF Is Just Heating Up": 0.5,
  "MercadoLibre's Shipping Subsidies Boost GMV: Is Growth Sustainable?": 0.2,
  "Tapasya Fund Sold Airbnb (ABNB) in 2024": 0.0,
  "Marriott International Announces Changes to its Continent Leadership and a Strategic Realignment Across Key Regions": 0.5,
  "Jobs report: US economy adds 50,000 jobs in December to cap worst year of hiring since 2020": 0.1,
  "Verizon Outpaces Its Industry in a Year: How to Play the Stock?": 0.5,
  "CoStar data shows office leasing activity rose 5% in 2025; Boston ranked as top growth market": 0.6,
  "This Blue-Chip Stock Is Betting That Nvidia Can Give It a Pop. Should You Buy Shares Now?": 0.5,
  "Cadence Design Systems, Inc. (CDNS) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Is Trending Stock Axon Enterprise, Inc (AXON) a Buy Now?": 0.2,
  "Is Trending Stock Datadog, Inc. (DDOG) a Buy Now?": 0.2,
  "PDD Holdings Inc. Sponsored ADR (PDD) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Betting on More Rate Cuts, Boomers Are Buying the 2026 Small Dogs of the Dow": 0.2,
  "Can da Vinci 5 Expand Intuitive Surgical's TAM Beyond Core Surgeries?": 0.5,
  "Why Constellation Energy Rallied Nearly 60% in 2025": 0.5,
  "ADI Climbs 35.7% in a Year: Should You Buy, Sell or Hold the Stock?": 0.5,
  "Missed the AI Rally? Jefferies Says CrowdStrike and These 3 Other Cybersecurity Stocks Could Be Next": 0.5,
  "Is Take-Two (TTWO) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Wall Street Analysts Think MercadoLibre (MELI) Is a Good Investment: Is It?": 0.5,
  "Mizuho names 3 core chip stocks and 2 outperformers for 2026": 0.5,
  "Airbnb upgraded, Zillow downgraded: Wall Street's top analyst calls": 0.2,
  "Prediction: 2 Healthcare Stocks That Will Be Worth More Than Pfizer by the End of 2026": 0.5,
  "Are You a Momentum Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "2 Stocks That Don’t Have Enough AI Priced in": 0.1,
  "TSMC Stock Rises After Bumper Sales. What That Says About a Potential AI Bubble.": 0.5,
  "Assessing Vertex Pharmaceuticals (VRTX) Valuation After Wolfe Research Upgrade And Growing Pipeline Optimism": 0.5,
  "CEG Stock Is Trading Above 200-Day SMA: Time to Buy, Hold or Sell?": 0.2,
  "Qualcomm Stock Falls After Mizuho Downgrade Flags Apple Risk": -0.5,
  "December Nonfarm Payrolls Miss Estimates; Unemployment Rate Declines": 0.2,
  "2 Top-Ranked AI-Powered Tech Giants to Enhance Your Portfolio Returns": 0.6,
  "Betting Markets Say Supreme Court Will Scrap Trump Tariffs. How to Play It.": 0.2,
  "Reasons Why You Should Hold Verisk Analytics Stock in Your Portfolio": 0.5,
  "1 Dividend King Stock I'd Buy Before Illinois Tool Works in 2026": 0.2,
  "Delta, Southwest, FedEx, Marriott: Top Analyst Calls": 0.0,
  "J&J Strikes Drug Pricing Deal With Trump, Gets Tariff Reprieve": 0.5,
  "4 Stocks to Boost Your Portfolio on Steady Jump in Semiconductor Sales": 0.8,
  "Western Digital Corporation (WDC) Has Risen More Than 9% Since the Start of 2026": 0.6,
  "Benchmark Co Reiterates a Buy Rating on AppLovin Corporation (APP)": 0.6,
  "3 Strong Dividend Growers for Income Without Rate Risk": 0.5,
  "How to Trade the Next Earnings Season? Goldman Says Try Options": 0.5,
  "Celsius Holdings (CELH) Is Up 12.1% After Pepsi Distribution Gains Spotlight Operational Shift": 0.6,
  "Looking At The Narrative For Booking Holdings BKNG As AI Concerns Meet Higher Targets": 0.2,
  "Meta Signs Multi-Gigawatt Nuclear Deals for AI Data Centers": 0.5,
  "Healthcare dealmakers head to San Francisco hoping for megamergers in 2026": 0.5,
  "JPMorgan Stock, This AI Chip Leader Kick Off Earnings Season": 0.5,
  "Can Qualcomm's Snapdragon Ride Flex for Hyundai Work Wonders?": 0.5,
  "Why Constellation Energy Stock Popped Today": 0.5,
  "Synopsys (SNPS) Up 7.8% Since Last Earnings Report: Can It Continue?": 0.5,
  "KLA Corporation (KLAC) Shares Skyrocket, What You Need To Know": 0.5,
  "Why Is Lam Research (LRCX) Stock Soaring Today": 0.5,
  "Walmart’s CEO Doug McMillon out-earns the average American’s salary in less than 20 hours—during a typical 30-minute commute, he’s already made $1,563": -0.7,
  "Marriott Bonvoy Forges Global Partnership with International Cricket Council, Offering Members Unparalleled Access to Global Cricket Events": 0.8,
  "Regeneron (REGN) Upgraded to Strong Buy: What Does It Mean for the Stock?": 0.6,
  "Jim Cramer Says Insider Buying in Nike Signals “That the Business Is Indeed Turning”": 0.6,
  "Jim Cramer on Starbucks: “I Think This Is the Year It Comes Back”": 0.6,
  "Jim Cramer Says Honeywell Has Been One of the “Hapless Performers”": -0.6,
  "PepsiCo's Stock Valuation Looks Attractive: Buy or Wait for Now?": 0.5,
  "Meta Nuclear Deal Sends Vistra and Oklo Stocks Soaring": 0.8,
  "Is Starbucks' Store Portfolio Reset Enhancing Unit Economics?": 0.2,
  "Intel Rises After Trump Meeting as Markets Await Jobs Data": 0.5,
  "Copart: The Economics Behind a Quietly Dominant Marketplace": 0.5,
  "New Year Starts With Fewer U.S. Oil and Gas Rigs": -0.5,
  "Mizuho Picks Nvidia, Broadcom, Lumentum as Top AI Chip Stocks for 2026": 0.8,
  "IDEXX Laboratories to Release 2025 Fourth Quarter and Full Year Financial Results": 0.0,
  "Why Analysts Are Rethinking The Story Behind Qualcomm (QCOM) After New AI And Android Developments": 0.5,
  "Autodesk (ADSK) Valuation Check After Recent Share Price Weakness": 0.2,
  "3 Stocks That Benefit if Companies Cut Costs in 2026": 0.5,
  "Qualcomm Stock Falls After Downgrade. The Apple Supplier Has an iPhone Problem.": -0.6,
  "Chip Stocks Rise in Afternoon Trading": 0.5,
  "Nvidia and 13 More Tech Stocks to Buy on the Dip": 0.6,
  "Kayak CEO Tried to Take the Company Private: Scoop": 0.1,
  "Does Vertex Pharmaceuticals (VRTX) Share Price Reflect Its Long Term Growth Potential?": 0.2,
  "How Cantor Fitzgerald’s Rating Shift Reshapes the Airbnb (ABNB) Investment Narrative": 0.5,
  "Demand For Google, Palantir Is Mere Peanuts Next To These 3 Stocks": 0.2,
  "Meta Sends These Nuclear Stocks Higher After Inking New Round Of Data Center Deals": 0.6,
  "Is It Too Late To Consider Shopify (SHOP) After Strong 56% One Year Rally?": 0.2,
  "CES 2026 was dominated by these 3 tech themes": 0.2,
  "Si2’s OpenAccess Coalition Announces 2026 Board of Directors": 0.2,
  "Is It Too Late To Consider KLA (KLAC) After Its Strong Multi Year Share Price Run": 0.2,
  "How Recent Deals And Analyst Revisions Are Rewriting The Comcast CMCSA Investment Story": 0.5,
  "IBD Stock Of The Day: Pet-Health Firm Idexx Laboratories Looks To Build On 2025 Rally": 0.6,
  "Synopsys (SNPS) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Vertex Pharmaceuticals (VRTX) Stock Dips While Market Gains: Key Facts": -0.5,
  "Cadence Design Systems (CDNS) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Ross Stores (ROST) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Why a $13 Million MercadoLibre Exit Means for Investors After a 25% Run": 0.2,
  "Will AEP’s (AEP) US$1.20 Billion MISO Transmission Win Reshape Its Long-Term Grid Investment Narrative?": 0.2,
  "NXP Semiconductors (NXPI) Rises Higher Than Market: Key Facts": 0.5,
  "Assessing Analog Devices (ADI) Valuation After AI-Fueled Semiconductor Rally And CES Optimism": 0.5,
  "Lumos CEO to retire": 0.0,
  "Basin rig count down three as prices rise": 0.5,
  "Assessing Baker Hughes (BKR) Valuation After Recent Pullback And 12‑Month 17.98% Total Return": 0.5,
  "Is It Too Late To Reassess MercadoLibre (MELI) After Its Strong Recent Share Price Run": 0.2,
  "Is It Time To Reassess Amgen (AMGN) After Its 28% One Year Share Price Gain?": 0.2,
  "How The Vertex Pharmaceuticals (VRTX) Story Is Shifting With New Analyst Targets And CF Outlook": 0.2,
  "Is It Too Late To Consider Analog Devices (ADI) After A 44% One Year Rally?": 0.2,
  "Is Autodesk (ADSK) Pricing Look Attractive After Recent Share Price Weakness?": 0.5,
  "Could Investing $10,000 in ASML Make You a Millionaire?": 0.5,
  "Is It Too Late To Consider Take Two Interactive (TTWO) After 40% One Year Rally?": 0.1,
  "Axon Enterprise (AXON) Valuation Check After Northcoast Buy Upgrade And Ongoing Revenue Momentum": 0.5,
  "Is Honeywell (HON) Quietly Redefining Its Industrial Mix With LNG Moves Beside Aerospace Strength?": 0.5,
  "Marvell (MRVL) Gets Strong Buy as Raymond James Backs XConn Acquisition": 0.8,
  "Is Coca-Cola Europacific Partners PLC's (AMS:CCEP) 18% ROE Better Than Average?": 0.1,
  "Benchmark Names AppLovin (APP) a 2026 Top Idea, Reiterates Buy": 0.6,
  "Assessing Honeywell International (HON) Valuation After New LNG Partnership And Mixed Analyst Views": 0.2,
  "Investing.com’s stocks of the week": 0.0,
  "Does Monolithic Power Systems (NASDAQ:MPWR) Deserve A Spot On Your Watchlist?": 0.2,
  "Is It Time To Reassess Verisk Analytics (VRSK) After Mixed Returns And DCF Upside Indication": 0.1,
  "Is It Too Late To Consider Buying IDEXX Laboratories (IDXX) After A 71% One Year Rally": 0.2,
  "Gen Z is rebelling against the economy with ‘disillusionomics,’ tackling near 6-figure debt by turning life into a giant list of income streams": 0.5,
  "Cintas-UniFirst Proposed Merger Update: Uniform Bright Launches Independent Expert Review of Antitrust Review Considerations": 0.1,
  "MarketBeat Week in Review – 01/05 - 01/09": 0.0,
  "The past year for Roper Technologies (NASDAQ:ROP) investors has not been profitable": -0.6,
  "How The Narrative Around CoStar Group (CSGP) Is Shifting After Guidance Reset And Buybacks": 0.2,
  "AppLovin (APP) to Benefit from Sustainable Margins & User Acquisition Trends": 0.6,
  "Upcoming Q4 Results Could Trigger a Rally in T-Mobile US (TMUS)": 0.5,
  "DC judge delivers smackdown to Airbnb squatter after ruling she has no tenancy. Homeowner rights finally defended?": 0.6,
  "Google, Shopify Lead Big 2025 Winners Near New Buy Points": 0.5,
  "Did GTA VI Jitters and Short-Interest Shifts Just Reframe Take-Two Interactive's (TTWO) Risk Narrative?": 0.2,
  "The new food pyramid and brands like Starbucks and Chipotle want us to eat more protein. We’re already getting plenty.": -0.5,
  "Fastenal's (NASDAQ:FAST) three-year earnings growth trails the decent shareholder returns": -0.5,
  "Under The Bonnet, Ross Stores' (NASDAQ:ROST) Returns Look Impressive": 0.8,
  "Synopsys (SNPS) Valuation Check After CES 2026 AI Automotive Announcements": 0.2,
  "Gilead price target raised to $154 from $144 at BofA": 0.5,
  "JPMorgan ups Ross Stores target, adds to Analyst Focus List": 0.6,
  "AI is no ‘business killer’: Why Wall Street is buying software stocks in 2026": 0.6,
  "A Look At American Electric Power (AEP) Valuation After Its Expanded Bloom Energy Fuel Cell Rollout": 0.5,
  "Why Bloom Energy (BE) Is Up 35.8% After Landing a 900 MW AI Power Fuel‑Cell Deal": 0.8,
  "The Saturday Spread: Reading the Market’s Signals to Jump Ahead of the Crowd (HPE, SNOW, CRWD)": 0.5,
  "5 Energy Stocks That Could Double in 2026": 0.5,
  "Amazon quietly fixes problems 49% of customers hate": 0.5,
  "T-Mobile makes bold phone plan change after customer losses": 0.5,
  "Paychex–PayPal Early Pay Partnership Might Change The Case For Investing In Paychex (PAYX)": 0.5,
  "Baltimore Daughter Says Squatters Took Over Her Sick Dad's Home, Ripped Out The Toilet, Set It On Fire, Got It Condemned — And Now They're Back Again": -0.8,
  "4 restaurant chains shuttering hundreds of locations in 2026": -0.8,
  "Jim Cramer on Palo Alto: “I Think It Is a Buy”": 0.6,
  "Jim Cramer Discusses CrowdStrike After Jensen Huang’s Endorsement": 0.5,
  "More Bonds Are Teetering on the Brink of Junk: Credit Weekly": -0.5,
  "Is It Too Late To Consider ASML Holding (NasdaqGS:ASML) After Its Strong Share Price Run?": 0.2,
  "Assessing Copart (CPRT) Valuation As Competition Rises And Growth Concerns Drive Investor Exits": -0.5,
  "Assessing Marvell Technology (MRVL) Valuation After Recent Share Price Weakness": 0.2,
  "Philip Erdoes, Entrepreneur and Venture Capitalist, Dies at 62": -0.8,
  "How T-Mobile’s New “Better Value” Plan and Funding Moves Will Impact T-Mobile US (TMUS) Investors": 0.2,
  "Is Synopsys (SNPS) Quietly Redefining Its Moat With Automotive Virtual Prototyping Partnerships?": 0.5,
  "The Bull Case For Insmed (INSM) Could Change Following Bold 2025 Revenue Guidance Hike - Learn Why": 0.5,
  "Is It Too Late To Consider Microchip Technology (MCHP) After A 40% One-Year Rally?": 0.2,
  "GOOGL vs AMZN: Best pick for a 5-7 year horizon? - Hi everyone, I’m currently looking to strengthen my portfolio with a long-term position (5 to 7 years) and I’m torn between Google (GOOGL) and Amazon (AMZN). I already have a solid foundation in my portfolio (about 88- 90% in VEQT ETF), and I want to use my remaining weight to pick one of these two tech giants. I’m an investor who values stability but": 0.2,
  "Is It Time To Revisit Copart (CPRT) After Its 28% One Year Share Price Decline?": 0.1,
  "Is It Too Late To Reassess Insmed (INSM) After Its Huge Share Price Surge?": -0.5,
  "How Recent AI And Business Shifts Are Rewriting The Story For Arm Holdings (ARM)": 0.2,
  "Deutsche Bank Maintains a Buy Rating on EchoStar Corporation (SATS)": 0.6,
  "Job market in relation to the stock market and economy - Okay, so I graduated with a comp sci degree about a year ago and have not gotten a job. My sister is a data analyst who makes about $120k. Her whole team is getting fired (yahoo) and she has been saying how much trouble she's having in trying to get a senior data analyst job. She is super into her career and even hires": -0.5,
  "Why AppLovin Stock Jumped 108% in 2025": 0.5,
  "Is Paychex (PAYX) Pricing Reflect Its Mixed Recent Returns And Cash Flow Outlook?": 0.1,
  "Is ADP’s (ADP) 51-Year Dividend Streak Still Justified by Its Evolving Labor-Market Insights?": 0.1,
  "5 big analyst AI moves: ASML top semis pick for 2026, Adobe downgraded": 0.2,
  "AI Is Causing a Memory Shortage. Why Producers Aren’t Rushing to Make a Lot More.": -0.3,
  "The Best Stocks to Invest $50,000 in Right Now": 0.5,
  "What Analysts Think Gives Datadog (DDOG) An Edge As The Story Starts To Shift": 0.5,
  "Is It Too Late To Consider Marriott International (MAR) After A 22% One-Year Rally?": 0.2,
  "Monster Beverage (NASDAQ:MNST) Knows How To Allocate Capital": 0.6,
  "A Look At Marriott International (MAR) Valuation After Strong Recent Share Price Momentum": 0.5,
  "These Were the S&P 500's Top Performers in 2025. Are They Still Good Buys in 2026?": 0.2,
  "Netflix is it a buy or hold? - I’ve just started buying NFLX bit by bit by the sudden decrease in stock price. I’m just curious to why is the stock keep on going down even though it is buying WB? Also, it seems like NFLX has the monopoly now for movies, series and even anime. Thank you.": 0.2,
  "Keurig Dr Pepper (NASDAQ:KDP) shareholders have endured a 15% loss from investing in the stock three years ago": -0.6,
  "Top AI stock picks: Is it Nvidia or bust?": 0.2,
  "Will Marriott’s New Regional Leadership Structure Subtly Reframe Its Asset-Light Strategy Narrative for MAR?": 0.2,
  "Is Alnylam Pharmaceuticals, Inc.'s (NASDAQ:ALNY) 19% ROE Better Than Average?": 0.2,
  "Workday, Inc.'s (NASDAQ:WDAY) Fundamentals Look Pretty Strong: Could The Market Be Wrong About The Stock?": 0.6,
  "Investors Shouldn't Overlook O'Reilly Automotive's (NASDAQ:ORLY) Impressive Returns On Capital": 0.8,
  "KLA Corporation - Sticky MOAT Is The Best Type": 0.6,
  "Assessing ASML Holding (NasdaqGS:ASML) Valuation After Its Strong Recent Share Price Momentum": 0.5,
  "5 AI Stocks That Could Replicate NVIDIA’s Decade of Dominance": 0.5,
  "Why are Q4 2025 estimates so low for $NFLX? - I saw that the EPS is estimated to be 0.545. This is a significant decrease from the past 2 quarters, which were around 0.7 EPS. Q3 they missed earnings because of the Brazil tax, and EPS was still close to 0.7… So, what’s the deal? Thank you!": -0.5,
  "Honeywell Unveils AI-Enabled Technology to Personalize In-store Shopping with Google Cloud": 0.6,
  "Shopify Stock Rallied on AI Shopping. Now It’s Doubling Down With Gemini and Copilot.": 0.5,
  "Is Gilead Sciences (GILD) Pricing Reflecting Recent 38.5% One Year Share Return?": 0.2,
  "Dutch Bros: Could This Fast-Growing Coffee Chain Be a Long-Term Winner?​": 0.5,
  "Susquehanna Lowers PT on PayPal Holdings (PYPL) Stock": -0.5,
  "Piper Sandler Raises PT on Fortinet (FTNT) Stock": 0.5,
  "Israeli cyber startup Torq raises $140 million at $1.2 billion valuation": 0.8,
  "Thesis on Petco(WOOF) - My two cents on Petco. Petco’s equity is priced for bankruptcy, while its cash flow, liquidity, and credit markets price it as a surviving, self-funding business, creating massive upside if operations merely stabilize. The company is trading at \\~5.5x EBITDA and a \\~11-13% FCF yield on normalized numbers. The balance sheet, while levered, is structured with a long runway (2028) and flexible covenants. The operational pivot under Joel Anderson is already": 0.8,
  "Artificial Intelligence (AI) Is Driving a New Wave of Infrastructure Spending. This Stock Is Key.": 0.5,
  "Mondelez (MDLZ) Target Lowered at TD Cowen as 2026 Staples Outlook Turns Cautious": -0.5,
  "Alnylam Launches \"Alnylam 2030\" Strategy to Drive Next Era of Growth and Patient Impact": 0.6,
  "Vertex Provides Pipeline and Business Updates in Advance of Upcoming Investor Meetings": 0.5,
  "PepsiCo (PEP) Partners with Siemens and NVIDIA to Modernize Plants Using Digital Twins": 0.6,
  "(ITEM 2.02) . RESULTS OF OPERATIONS AND FINANCIAL CONDITION. In connection with remarks to be made at the J.P. Morgan 44th Annual Healthcare Conference on Monday, January 12, 2026, beginning at 10:30 a.m. (Eastern Time), DexCom, Inc. (“Dexcom”) President and Chief Executive Officer, Jake Leach, will report preliminary, unaudited financial results for the fourth quarter of 2025 and fiscal year 2025, initial financial outlook for fiscal year 2026, and certain other information. The fourth quarter and fiscal\n\n(Item 2.02) , including Exhibits 99.1 and 99.2 hereto, is furnished shall not be deemed to be “filed” for purposes of Section 18 of the Securities Exchange Act of 1934 (the “Exchange Act”) or otherwise subject to the liabilities of that section. The information contained herein and in the accompanying exhibit is not incorporated by reference in any filing of Dexcom under the Securities Act of 1933 or the Exchange Act, whether made before or after the": 0.1,
  "(Item 8.01) . Other Events. On January 12, 2026, T-Mobile USA, Inc. (“ T-Mobile USA ”), a direct, wholly-owned subsidiary of T-Mobile US, Inc. (the “ Company ”), closed an underwritten public offering of $1.15 billion in aggregate principal amount of its 5.000% Senior Notes due 2036 (the “ 2036 Notes ”) and $850 million in aggregate principal amount of its 5.850% Senior Notes due 2056 (the “ 2056 Notes ” and, together with the 2036 Notes,": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. Diamondback Energy, Inc. (“Diamondback”) presents in this\n\n(Item 2.02) certain information for the quarter ended December 31, 2025 regarding its realized prices, derivative activity and weighted average basic and diluted shares outstanding. Realized Prices Fourth quarter 2025 average unhedged realized prices were $58.00 per barrel of oil, $0.03 per Mcf of natural gas and $13.51 per barrel of natural gas liquids (“NGLs”). Fourth quarter 2025 average realized hedged prices were $57.07 per barrel of oil, $1.03 per Mcf of natural gas and $13.51 per": 0.2,
  "(ITEM 1.01) ENTRY INTO A MATERIAL DEFINITIVE AGREEMENT. On January 9, 2026, Intuit Inc., a Delaware corporation (the “Company”), entered into a Credit Agreement (the “Credit Agreement”) with the lenders parties thereto (collectively, the “Lenders”), JPMorgan Chase Bank, N.A., as administrative agent (“Agent”). The Credit Agreement replaces the Company’s credit agreement dated as of February 5, 2024. The Credit Agreement is available in addition to the Company’s commercial paper program, which the Company may increase during certain\n\n(Item 1.01) of this Current Report on Form 8-K is incorporated by reference into this": 0.1,
  "(Item 8.01) Other Events. ATM Update On January 12, 2026, Strategy Inc (\"Strategy\") announced an update with respect to sales made under its at-the-market offering program (\"ATM\") of the following securities: During Period January 5, 2026 to January 11, 2026 As of January 11, 2026 Security Shares Sold (1) Notional Value (in millions) (2) Net Proceeds (in millions) (3) Available for Issuance and Sale (in millions) STRF Stock - $ - $ - $ 1,619.3 10.00% Series": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On January 11, 2026, Alnylam Pharmaceuticals, Inc. (the “Company”) announced its new five-year strategy, “ Alnylam 2030, ” as well as its preliminary fourth quarter and full year 2025 global net product revenues of approximately $995 million and $2,987 million, respectively, for AMVUTTRA® (vutrisiran), ONPATTRO® (patisiran), GIVLAARI® (givosiran) and OXLUMO® (lumasiran), and provided the Company’s 2026 product and pipeline goals. The Company also announced full year 2026 combined\n\n(Item 2.02) and Exhibit 99.1 attached hereto is intended to be furnished and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as expressly set forth by specific reference in such\n\n(Item 2.02) shall be deemed to be furnished, and not filed: 99.1 Press Release dated January 11, 2026 . 104 Cover Page Interactive Data File (embedded within the Inline XBRL document).": 0.5,
  "(Item 2.02) . Results of Operations and Financial Condition. On January 12, 2026, at the 44th Annual J.P. Morgan Healthcare Conference, Leonard S. Schleifer, M.D., Ph.D., Board Co-Chair, President and Chief Executive Officer of Regeneron Pharmaceuticals, Inc. (“ Regeneron ” or the “ Company ”), and George D. Yancopoulos, M.D., Ph.D., Board Co-Chair, President and Chief Scientific Officer of Regeneron, are providing a corporate update. The presentation contains certain preliminary (unaudited) financial information for the fourth quarter\n\n(Item 2.02) . Q4 2025 IPR&D Charge . The Company currently expects that its financial results calculated in accordance with U.S. generally accepted accounting principles (“ GAAP ”) and its non-GAAP financial results for the fourth quarter 2025 will include an acquired in-process research and development (“ IPR&D ”) charge of approximately $19 million on a pre-tax basis. This acquired IPR&D charge is expected to negatively impact each of GAAP and non-GAAP net income per diluted share\n\n(Item 2.02) of this Current Report on Form 8-K is incorporated by reference herein. A copy of the presentation referenced in\n\n(Item 2.02) is furnished as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated by reference in this\n\n(Item 2.02) and the information included or incorporated in": 0.1,
  "Is PepsiCo (PEP) Offering Long-Term Value After Recent Share Price Weakness?": 0.2,
  "A big Wall Street flip just changed the Regeneron narrative": 0.5,
  "Agoda Data Shows Vietnam Rising as a Favorite End-of-Year Destination for Families Across Asia and Beyond": 0.6,
  "Q3 Advertising Software Earnings Review: First Prize Goes to AppLovin (NASDAQ:APP)": 0.6,
  "Q3 Rundown: Lam Research (NASDAQ:LRCX) Vs Other Semiconductor Manufacturing Stocks": 0.0,
  "3 Reasons SBUX is Risky and 1 Stock to Buy Instead": -0.5,
  "Airbnb (ABNB): 3 Reasons We Love This Stock": 0.8,
  "The Bull Case For Gilead Sciences (GILD) Could Change Following New OncoNano Drug-Delivery Collaboration": 0.5,
  "Agoda Launches AI-Powered Booking Bot to Help Travelers Book with Confidence": 0.6,
  "1 Cash-Producing Stock to Keep an Eye On and 2 We Turn Down": 0.2,
  "2 Growth Stocks with All-Star Potential and 1 We Question": 0.5,
  "3 Consumer Stocks We Keep Off Our Radar": -0.5,
  "2 Momentum  Stocks with Exciting Potential and 1 That Underwhelm": 0.5,
  "3 Services Stocks We Think Twice About": -0.5,
  "1 S&P 500 Stock on Our Buy List and 2 Facing Challenges": 0.2,
  "3 Large-Cap Stocks Worth Investigating": 0.0,
  "2 Mooning  Stocks to Consider Right Now and 1 We Ignore": 0.2,
  "Lam Research (LRCX) Needs to “Put Up Plants,” Says Jim Cramer": 0.2,
  "Best Stock to Buy Right Now: Costco vs. Home Depot": 0.5,
  "Scotiabank Reduces PT on AT&T (T) to $29.50, Reiterates ‘Sector Perform’ Rating": 0.2,
  "Freedom Finance Raises PT on PDD Holdings (PDD) to $170, Reiterates ‘Buy’ Rating": 0.8,
  "Analysts Positive on PepsiCo (PEP) Amid Multi-Year, Industry-First Collaboration with NVIDIA and Siemens": 0.8,
  "UBS and Citi Go Bullish on Gilead Sciences (GILD)": 0.8,
  "Bond Traders’ Big Bet for 2026 Vindicated by Soft US Job Growth": 0.5,
  "Trending tickers: Walmart, Alibaba, Novo Nordisk, BE Semiconductor and British Land": 0.0,
  "Marriott appoints new executives as leadership shuffle continues": 0.2,
  "What to Expect From Lam Research’s Q2 2025 Earnings Report": 0.2,
  "5 takeaways from Xcel CEO Bob Frenzel’s talk at the Minneapolis Fed": 0.2,
  "KBR Awarded FEED for Coastal Bend LNG Project": 0.5,
  "Institutional investors control 80% of Palo Alto Networks, Inc. (NASDAQ:PANW) and were rewarded last week after stock increased 3.8%": 0.6,
  "Are Strong Financial Prospects The Force That Is Driving The Momentum In Cadence Design Systems, Inc.'s NASDAQ:CDNS) Stock?": 0.5,
  "Seagate 32TB Capacities Now Shipping to Channel and Retail Partners Globally": 0.5,
  "AbbVie buys into PD-1/VEGF sweepstakes; Alnylam and Vertex set expectations": 0.2,
  "Where Will Costco Be in 5 Years?": 0.1,
  "3 Stocks Estimated To Be Undervalued By Up To 36.9%": 0.5,
  "High Growth US Tech Stocks To Watch In January 2026": 0.5,
  "AI Demand Is Tightening Memory Supply. What It Means for Nvidia, Intel, and AMD": 0.1,
  "The One Person Standing Between the Trump and the Fed": 0.0,
  "Loop Capital Remains Bullish on Synopsys Inc. (SNPS) on AI and EDA Tailwinds": 0.8,
  "Analysts Applaud CrowdStrike Holdings’ (CRWD) SGNL Deal, Reiterate Buy Ratings": 0.8,
  "Activist investor Ancora carves out niche in transportation sector": 0.5,
  "Diamondback Energy's (NASDAQ:FANG) investors will be pleased with their stellar 207% return over the last five years": 0.8,
  "NXP Semiconductors Insiders Sell US$4.0m Of Stock, Possibly Signalling Caution": -0.5,
  "What You Need to Know Ahead of Honeywell International's Earnings Release": 0.1,
  "How Google, Shopify Partnership Could Spur Agentic Commerce Boom": 0.6,
  "Dexcom Reports Preliminary, Unaudited Results for the Fourth Quarter and Fiscal Year 2025 and Initial 2026 Outlook": 0.5,
  "My 5 Favorite Stocks to Buy Right Now": 0.5,
  "This Artificial Intelligence (AI) Stock Quietly Outperformed Nvidia in 2025. It Can Continue Soaring in 2026.": 0.8,
  "Tempus AI Stock Rallies 105% in a Year: Should Investors Still Hold?": 0.5,
  "What Makes AppLovin (APP) an AI Winner?": 0.5,
  "Bristlemoon Global Fund’s Thesis on ASML (ASML) is Paying Off": 0.8,
  "Insiders At Western Digital Sold US$6.8m In Stock, Alluding To Potential Weakness": -0.6,
  "Institutional investors have a lot riding on Applied Materials, Inc. (NASDAQ:AMAT) with 82% ownership": 0.5,
  "Here Are Monday’s Top Wall Street Analyst Research Calls: Airbnb, Akamai, Applied Materials, CoreWeave, CrowdStrike, Datadog, NetFlix, Snowflake, and More": 0.5,
  "What to Expect From Xcel Energy's Q4 2025 Earnings Report": 0.2,
  "Global Digital Surgery Technologies Market Set for US$ 6,477.91 Million Surge by 2033 | Astute Analytica": 0.5,
  "5 Once-Sleepy Dividend Utility Companies Are Striking Massive Deals With Big Tech": 0.5,
  "Here’s Why Shopify (SHOP) Rose in Q4": 0.5,
  "What's Next for Seagate Stock After a 241.8% Stellar Run in a Year?": 0.6,
  "ODFL Stock Down 4.2% Y/Y: Will the Plunge Continue Throughout 2026?": -0.6,
  "Quantum Computing Stocks: 'Winner-Take-All Scenario' Possible, Says JPMorgan": 0.5,
  "Upgrades: Analysts are Still Bullish on Nvidia (NVDA), Crowdstrike (CRWD) and Oracle (ORCL) Upside": 0.8,
  "Ampersand Unveils TrueStream Political: The Modern, Premium Streaming Solution for Deterministic Voter Reach": 0.5,
  "Palona AI Appoints Alison Templin as Vice President of Sales to Accelerate Enterprise Growth": 0.6,
  "Amgen Inc. (AMGN) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Palo Alto Networks, Inc. (PANW) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Constellation Energy Corporation (CEG) Is a Trending Stock: Facts to Know Before Betting on It": 0.2,
  "Investors Heavily Search CrowdStrike (CRWD): Here is What You Need to Know": 0.5,
  "Linde (NASDAQ:LIN) Is Doing The Right Things To Multiply Its Share Price": 0.8,
  "2 Tech Stocks That Beat the Mag Seven By a Mile in 2025—Can They Repeat?": 0.5,
  "Here’s What Lifted Vertex Pharmaceuticals (VRTX) in Q4": 0.2,
  "Volkswagen-Qualcomm Deal Strengthens SDV and Autonomous Push": 0.6,
  "3 Oversold Stocks Ready to Rebound in 2026": 0.5,
  "Here’s Why Fundsmith Equity Fund Reestablished Its Stake in Intuit (INTU)": 0.2,
  "Constellation Energy Corporation (CEG) Soars 6.2%: Is Further Upside Left in the Stock?": 0.6,
  "Data Center Momentum Accelerates Seagate's Revenue Growth": 0.8,
  "Here's What to Expect From Microchip Technology's Next Earnings Report": 0.2,
  "Automatic Data Processing (ADP) Fell Due to Weakness in the US Job Market": -0.6,
  "Monolithic Power Systems' Q4 2025 Earnings: What to Expect": 0.0,
  "Why This 1 Medical Stock Could Be a Great Addition to Your Portfolio": 0.8,
  "Why the nickel may vanish just like the penny": -0.5,
  "INSM Stock Jumps on 2025 Preliminary Sales, 2026 Goals Announced": 0.8,
  "Could This New Partnership Help DoorDash Stave Off Concerns About Affordability?": 0.2,
  "How Home Depot, Wayfair executives are preparing for an agentic AI future": 0.5,
  "Earnings Preview: What to Expect From Fortinet's Report": 0.5,
  "Netflix initiated, Palantir upgraded: Wall Street's top analyst calls": 0.5,
  "CRWD to Acquire SGNL: Is Identity Security the Next Growth Pillar?": 0.5,
  "CrowdStrike and Nord Security Announce Strategic Partnership to Redefine SMB Cybersecurity": 0.8,
  "BDO Canada and Intuit QuickBooks Partner to Redefine How BDO Serves Small and Mid-sized Businesses with New Integrated Service": 0.5,
  "Ignite Next Welcomes Synopsys to its Scale-up Program for Deep Tech Innovation": 0.5,
  "Global $7 Billion Connected Car Security Market Outlook, 2032: Major Players Expand Portfolios": 0.5,
  "D&H Distributing Unveils Major Expansion of Cybersecurity Portfolio with Strategic U.S. Fortinet Partnership": 0.8,
  "5 U.S. chip stocks to buy in 2026: Bernstein": 0.2,
  "Is This Artificial Intelligence (AI) Stock Finally Entering Its Breakout Phase?": 0.5,
  "SPECTRUM OPENS APPLICATIONS FOR SIXTH CLASS OF SPECTRUM SCHOLARS": 0.5,
  "Top Stocks From the Staffing Services Industry to Buy Now": 0.5,
  "PayPal's Agentic Commerce Expansion: Will it Boost Top-Line Growth?": 0.5,
  "The Best Dividend Stocks to Buy and Hold Forever": 0.5,
  "HSTM vs. SHOP: Which Stock Is the Better Value Option?": 0.2,
  "DG or ROST: Which Is the Better Value Stock Right Now?": 0.2,
  "PepsiCo's PFNA Struggles: Can Permissible Snacks Revive Volumes?": 0.1,
  "Datadog's Core Growth Backed by Digital Transformation, Cloud Migration Projects, Morgan Stanley Says": 0.6,
  "3 U.S. software stocks to buy, 2 to avoid: Goldman Sachs": 0.2,
  "TSMC’s Revenue Outlook ‘May Disappoint,’ Says Analyst. There’s a Silver Lining.": 0.2,
  "Google’s Sergey Brin admits he’s hiring ‘tons’ of workers without degrees: ‘They just figure things out on their own in some weird corner’": 0.2,
  "What DoorDash (DASH)'s Family Dollar Delivery Expansion Means For Shareholders": 0.2,
  "Will AppLovin (APP) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Will Vertex (VRTX) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Some Credit Card Issuers' Revenue May Halve Due to Trump's Rate Cap Proposal, RBC Says": -0.6,
  "$DTREF - anyone else is loading? - Hey everyone, I’ve been digging into Dateline Resources lately, and man, I’m seriously bullish on this one. Ticker is DTR on the ASX, or DTREF over the counter. It’s a gold and rare earths play out in California, right next to that big MP Materials operation, which gives it some real strategic edge in the US market. Their recent drilling at the Colosseum project has been killer, hitting": 0.8,
  "3 Stocks Estimated To Be Trading At A Discount In January 2026": 0.0,
  "Here’s What the Wall Street Thinks About Marvell Technology (MRVL)": 0.2,
  "Arm Holdings (ARM) Expands in the Robotics Industry With Physical AI Unit": 0.5,
  "Jim Cramer Says International Business Machines “Is Still Very Inexpensive”": 0.8,
  "Jim Cramer on Paychex: “People Didn’t Like the Last Quarter, I Thought It Was Okay”": 0.2,
  "Jim Cramer Calls Ralph Lauren a “Terrifically Well-Run” Company": 0.8,
  "Jim Cramer Says Dollar Stores Like Dollar General Are “Wall Street Faves”": 0.5,
  "How Much Monthly Income Does a $2 Million Portfolio Produce at Age 60?": 0.0,
  "Is Walmart a Tech Stock? Its Planned Move to the Nasdaq 100 Is a Vote for 'Yes'": 0.5,
  "$GOOG Just Hit $4 Trillion... 4th Company ever to cross that! - The milestone was reached in early trading on Jan. 12 as GOOGL stock rose $1.93 to trade at $333.50 per share. That gave Alphabet an official market capitalization of just over $4 trillion. However, trading in GOOGL stock was choppy along with the rest of the market, with all the major U.S. indices in the red to start the week. The stock of": 0.5,
  "Qualcomm (QCOM) Stock Trades Down, Here Is Why": -0.5,
  "Why Tempus AI Stock Jumped on Monday?": 0.2,
  "Meta names former Trump adviser Dina Powell McCormick as president and vice chairman - Facebook owner Meta has named Dina Powell McCormick, a former Trump administration adviser and longtime finance executive, as president and vice chairman of the tech giant. Powell McCormick previously served on Meta's board of directors - where, the company notes, she was “deeply engaged” in accelerating its artificial intelligence push across platforms. In her new management role, Meta says Powell McCormick": 0.2,
  "ComEd Offering $515,000 in Grants to Support Community Programs Across Northern Illinois": 0.8,
  "Comcast Assets Are ‘Significantly Undervalued.’ Buy the Stock, Analyst Says.": 0.6,
  "Up 38% From Its Lows in November, is it Too Late to Buy Shares of This Rebounding Stock?": 0.2,
  "Equities Rise Intraday Amid Probe Into Fed Chair Powell": 0.2,
  "Alnylam Pharmaceuticals Unveils “Alnylam 2030” as Amvuttra Drives Breakout Growth at JPMorgan Conf.": 0.5,
  "Adimab Reports Strong Partnering Year for 2025": 0.8,
  "Why This Medical Device Company Is the Top Stock in the S&P 500 Today": 0.6,
  "How Steve Cahillane’s Arrival and Planned Breakup At Kraft Heinz (KHC) Has Changed Its Investment Story": 0.2,
  "2 Stocks That Will Benefit From Trump’s Call to Cap Credit-Card Interest Rates": 0.5,
  "T-Mobile, Samsung Collaborate to Deliver Immersive In-Store Customer Experiences": 0.6,
  "PriceSmart’s Base-Case Calls for $45 in Upside—Bull-Case Is Better": 0.8,
  "Sector Update: Consumer Stocks Rise Late Afternoon": 0.5,
  "With AI-Driven Shopping a 'Major 2026 Theme,' Experts Like This Pair of Stocks": 0.5,
  "Gap, Fortinet, and More Stocks That Usually Outperform After Earnings": 0.5,
  "PagerDuty Appoints Chris Ferro as Chief Legal Officer": 0.5,
  "Zscaler Appoints Dr. Swamy Kocherlakota as Executive Vice President of Agentic AI Security Engineering": 0.5,
  "Why This S&P 500 Nuclear Giant Continues To Advance After Meta Deal": 0.5,
  "Sector Update: Energy Stocks Decline Late Afternoon": -0.5,
  "Top Stock Reports for Microsoft, Eli Lilly & Lam Research": 0.5,
  "US Equity Markets Up Amid Rise in Precious Metals": 0.5,
  "JPM Preannouncements: Why Alnylam And Sarepta Lost, But Day One Won": 0.2,
  "Marriott International Announces Release Date For Fourth Quarter 2025 Earnings": 0.0,
  "Walmart Stock Is Rising. It’s Not Just a Google AI Deal Giving It a Boost.": 0.5,
  "Western Digital to Announce Second Quarter Fiscal Year 2026 Financial Results on January 29, 2026": 0.0,
  "S&P 500, Dow Clinch New Peaks as Traders Shrug Off Fed Independence Concerns": 0.6,
  "Tech, Media & Telecom Roundup: Market Talk": 0.0,
  "Is Intuitive Surgical (ISRG) Still Priced Fairly After Its Strong Multi‑Year Share Price Run?": 0.1,
  "A Look At DoorDash (DASH) Valuation After New Family Dollar Partnership Expansion": 0.5,
  "Acer Takes Legal Action Against AT&T, Verizon, and T-Mobile Over Patents": -0.5,
  "More money, fewer winners: Inside venture capital’s uneven comeback": -0.5,
  "Stock Market Today, Jan. 12: Walmart Jumps on Nasdaq 100 Inclusion": 0.6,
  "Shopify (SHOP) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "AppLovin (APP) Rises Higher Than Market: Key Facts": 0.5,
  "Intuit (INTU) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Intuitive Surgical, Inc. (ISRG) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "PepsiCo (PEP) Outperforms Broader Market: What You Need to Know": 0.5,
  "MercadoLibre (MELI) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Comcast (CMCSA) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Gilead Sciences (GILD) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "KLA (KLAC) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "The Outlook for 3 Non-U.S. Chip Stocks That Soared in 2025": 0.5,
  "What I learned from Tracking My Investment Calls in 2025 - As a long time investor, I realized this year that I often had tens if not hundreds of strong calls or at least \"hunches\" throughout a year. I also realized that I tended to only strongly remember the biggest winners and the occasional loser that I would tend to \"rationalize\" away. So this year, I decided to record and publish every \"buy\" in my": 0.2,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers CEO Transition. On January 11, 2026, Jonathan (Jay) Mazelsky notified IDEXX Laboratories, Inc. (the “Company” or “IDEXX”) of his intent to step down as the Company’s President and Chief Executive Officer effective as of May 12, 2026 (the “Transition Date”) and retire from the Company and the Company’s Board of the Directors (the “Board”) immediately following": -0.5,
  "(Item 8.01) Other Events. On January 6, 2026, Broadcom Inc. (the “Company”) entered into an underwriting agreement (the “Underwriting Agreement”) with BofA Securities, Inc. and J.P. Morgan Securities LLC, acting for themselves and as representatives of the several underwriters named therein (collectively, the “Underwriters”), pursuant to which the Company agreed to issue and sell to the Underwriters $4,500,000,000 aggregate principal amount of its senior notes, consisting of $750,000,000 aggregate principal amount of its 4.300% senior notes due": 0.1,
  "(Item 8.01) . Other Events On January 13, 2026, Constellation Energy Generation, LLC issued a press release announcing the expiration of its previously announced exchange offers and consent solicitations for outstanding notes of Calpine Corporation. A copy of the press release is attached to this Current Report on Form 8-K as Exhibit 99.1 and is incorporated herein by reference. Section 9 - Financial Statements and Exhibits": 0.0,
  "Alnylam Pharmaceuticals CEO on Development Goals, Profitability": 0.5,
  "VOO to SPYM? - SPYM has a lower expense ration and it's trading volume is lower despite having identical holdings. Ive held some shares in VOO but given its cost, I haven't been able to hold much. What do you think about SPYM? Should I switch to that or sell VOO or VOO reigns supreme for long term investment?": 0.2,
  "Casino Welcome Bonuses January 2026: MegaBonanza's New Customer Offer": 0.5,
  "Why I’m pivoting to TechBio $RXRX while everyone is distracted by the Powell investigation and $4600 Gold. - Everyone is worried that the Powell investigation will pose an unprecedented challenge to the Fed's independence, and that a credibility crisis could trigger a systemic downgrade in the United States assets , I wanna say, trading stocks from a macro perspective is no different from throwing darts to pick stocks. This shit didn’t prevent $GOOG from breaking": 0.2,
  "Amgen Calls 2026 a “Springboard Year” as CEO Flags Major Data, MariTide Phase 3 Push at JPM Event": 0.5,
  "How BofA’s Upgrade and New Tech Initiatives Will Impact Comcast (CMCSA) Investors": 0.2,
  "T-Mobile makes harsh change customers will see on their bills": -0.6,
  "5 Unstoppable Stocks to Buy With $5,000 for 2026": 0.5,
  "How Investors May Respond To Cisco (CSCO) Supreme Court Appeal On Alleged Human Rights Abuses": 0.1,
  "Unpacking Q3 Earnings: CrowdStrike (NASDAQ:CRWD) In The Context Of Other Cybersecurity Stocks": 0.5,
  "Social Networking Stocks Q3 Recap: Benchmarking Yelp (NYSE:YELP)": 0.2,
  "3 Reasons MNST Has Explosive Upside Potential": 1.0,
  "2 Reasons to Like PANW and 1 to Stay Skeptical": 0.5,
  "How Investors Are Reacting To Charter Communications (CHTR) $3 Billion High-Coupon Bond Issuance": 0.2,
  "1 Nasdaq 100 Stock with Exciting Potential and 2 That Underwhelm": 0.5,
  "3 S&P 500 Stocks That Concern Us": -0.5,
  "3 Value Stocks We Think Twice About": -0.5,
  "1 S&P 500 Stock to Keep an Eye On and 2 We Question": 0.0,
  "1 Mooning  Stock with Exciting Potential and 2 Facing Headwinds": 0.5,
  "1 Cash-Heavy Stock to Consider Right Now and 2 We Question": 0.0,
  "1 Healthcare Stock to Keep an Eye On and 2 We Ignore": 0.2,
  "AI Has Shopping in Its Sights. Amazon Is Pushing Back.": 0.1,
  "Not Playing Long Ruined My College Hopes - I burned my graduation money for college and my career. I started trading October of 2023, probably the best time to get in the market before our huge rally’s. I was 18, and had the typical “i can beat the market” mindset. My friend helped me get into it, he only had about a year of experience but was a much safer investor. We both started with": -0.6,
  "Google takes agentic retail into chat": 0.2,
  "T-Mobile US (TMUS) Valuation Check After Recent Share Price Swings And Analyst Target Gap": 0.1,
  "Bull of the Day: Sandisk (SNDK)": 0.2,
  "How do I compare to S&P500 - I’m new to investing and decided I wanted to learn that trading stocks individually is not the way to go for most the hard way. I wanted to see how I’ve performed vs the s and p 500. I wanted to check my math and see if there was any flaws. Keep in mind I am Australian and so have converted to and from usd. 1: Calculate amount": 0.0,
  "Crestline Adds to its Executive Management Team with the Appointment of Orcun Turkay as Vice President of Food & Beverage": 0.5,
  "The iPhone moment for Michael Saylor’s preferred stock 'Stretch' at Strategy": 0.2,
  "FRC Appoints Christopher Lynch to Board of Directors, Strengthening Data and AI Leadership": 0.6,
  "From Nvidia to Salesforce: Where money is made in Enterprise AI": 0.5,
  "Exelon (NASDAQ:EXC) Ticks All The Boxes When It Comes To Earnings Growth": 0.8,
  "Uber vs Waymo (Google) - Obviously both stocks have performed well (Uber up almost 300% from its 2022 trough and Google doubling from its low in the last 12 months). But with Waymo hitting over 14 million trips in 2025 and expanding to more urban centres in 2026 there’s clearly a heap of operational momentum there. What I can’t figure out is how Uber maintains its current valuation in an autonomous driving world? Seems like": 0.2,
  "S&P Futures Muted as Investors Weigh JPMorgan Earnings, U.S. Inflation Data in Focus": 0.2,
  "RxSight (RXST) Soars 14.1%: Is Further Upside Left in the Stock?": 0.6,
  "High Growth Tech Stocks To Watch In The US Market January 2026": 0.5,
  "3 Stocks Estimated To Be Trading At Discounts Of Up To 40.7%": 0.5,
  "HEINZ Unveils the First Fry Box with a Built-In Condiment Compartment in Eleven Countries Across the Globe": 0.8,
  "TROPION-Lung17 TROP2 Biomarker Directed Phase 3 Trial of DATROWAY® Initiated in Patients with Previously Treated Advanced Nonsquamous Non-Small Cell Lung Cancer": 0.5,
  "With 83% ownership of the shares, Starbucks Corporation (NASDAQ:SBUX) is heavily dominated by institutional owners": 0.1,
  "What Does Texas Instruments Incorporated's (NASDAQ:TXN) Share Price Indicate?": 0.1,
  "Edgewater Wireless Appoints Wi-Fi Semiconductor Pioneer Rick Bahr as Strategic Advisor": 0.5,
  "M/A-Com (MTSI) Surges 13.0%: Is This an Indication of Further Gains?": 0.6,
  "Walmart Stock Gaining Steam Ahead of Debut on Nasdaq-100": 0.6,
  "Here’s Why Fortinet (FTNT) Slid in 2025": -0.5,
  "PepsiCo (PEP) is in the Crosshairs of Weight Loss Drugs": -0.5,
  "JPMorgan earnings miss forecasts on Apple Card costs, Dimon warns markets 'underappreciate' risks": -0.5,
  "Jim Cramer on Taiwan Semi: “It Should Be a Monster Quarter, But I Think Everyone Knows That”": 0.5,
  "VC firm Superorganism raises over $25M to back biodiversity startups": 0.8,
  "IDEXX Laboratories (IDXX): From a Detractor to a Revivor": 0.6,
  "JPM26: HIV pipeline dosing optionality gives Gilead advantage": 0.6,
  "Tempus AI (TEM) Soars 15% on $1.1-Billion Deal": 0.8,
  "JPM26: Dexcom’s new CEO eyes international CGM markets for 2026 growth": 0.5,
  "Earnings Preview: What to Expect From Take-Two Interactive Software’s Report": 0.2,
  "RO ANNOUNCES RESEARCH COLLABORATION TO BETTER UNDERSTAND AND IMPROVE THE REAL-WORLD PATIENT EXPERIENCE WITH GLP-1S": 0.6,
  "Constellation Announces Expiration and Final Results of Private Exchange Offers and Consent Solicitations": 0.0,
  "Noble Receives Marriott International Serve360 Award": 0.5,
  "Microchip Launches Military-Qualified Plastic Transient Voltage Suppressors for Aerospace and Defense Applications": 0.5,
  "Here Are Tuesday’s Top Wall Street Analyst Research Calls: Adobe, AMD, Disney, Five Below, Intel, Reddit, KLA Corp, PayPal, Super Micro Computer and More": 0.5,
  "OREO Supports Youth Hockey with Second Year of 'OREO Stay Playful For All' Program Delivering Additional Grants Across Canada": 0.5,
  "WeatherPromise Closes Oversubscribed Series A Round, Led by Maveron": 0.5,
  "ADP National Employment Report Preliminary Estimate December 20, 2025": 0.0,
  "Could Costco Help You Become a Millionaire Over the Long Term?​": 0.5,
  "Jim Cramer on Take-Two: “Great Scarcity Value There”": 0.6,
  "[Latest] Global Hybrid Meat Market Size/Share Worth USD 1,212.1 Billion by 2034 at a 9.4% CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trends, Forecast, Segmentation, Growth Rate, Value, SWOT Analysis)": 0.5,
  "IDEXX Announces CEO Succession": 0.0,
  "WDC Skyrockets 87% in 3 Months: Is the Stock Still a Buy in 2026?": 0.5,
  "Flex Stock Surges 55% in the Past Year: Will the Uptrend Continue?": 0.6,
  "SOL Strategies Inc.’s DAT++ Model Drives Q4 Revenue — Quarterly Update Report": 0.5,
  "LIS Technologies Inc. Announces Fourth Consecutive Oversubscribed Funding Round of $17 Million, Totaling $64 Million to Revitalize the Only U.S.-Origin, Patented Laser Uranium Enrichment Technology to Support the Domestic Nuclear Fuel Cycle": 0.8,
  "Cadence Delivers Enterprise-Level Reliability with Next-Gen Low-Power DRAM for AI Applications Featuring Microsoft RAIDDR ECC Technology": 0.5,
  "Trintech Deepens Partnership with Workday by Launching Transaction Matching Insights": 0.5,
  "Reliable, High-Speed Internet from Xfinity Now Available in Northeast Madison County, Mississippi": 0.6,
  "Thomson Reuters Convenes Global AI Leaders to Advance Trust in the Age of Intelligent Systems": 0.6,
  "CrowdStrike to Acquire Seraphic, Turning Any Browser into a Secure Enterprise Browser": 0.6,
  "Origin℠ AI and NXP Team Up to Accelerate Embedded WiFi Sensing for the Smart Home": 0.5,
  "Western Digital Corporation (WDC) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Is Trending Stock Starbucks Corporation (SBUX) a Buy Now?": 0.2,
  "These 2 Medical Stocks Could Beat Earnings: Why They Should Be on Your Radar": 0.5,
  "Investing in CSX (NASDAQ:CSX) five years ago would have delivered you a 22% gain": 0.6,
  "Jim Cramer Says “Costco, I Like It”": 0.6,
  "Jim Cramer on Walmart CEO: “Doug McMillon Made the Stores More Appealing While Keeping Prices Low”": 0.6,
  "Jim Cramer on Constellation Energy: “To Me, It Looks Dangerously Expensive”": -0.7,
  "Park Place Technologies Announced as Official Technology Partner  of Pro Pickleball’s PPA and MLP, Merging Innovation and America’s  Fastest-Growing Sport": 0.6,
  "Seagate's 32TB HDDs Launch Expands Its Reach in AI Video Analytics": 0.6,
  "Illumina introduces Billion Cell Atlas to accelerate AI and drug discovery": 0.5,
  "Lam Research Corporation (LRCX) Hit a 52 Week High, Can the Run Continue?": 0.5,
  "Behind the Pitch: Meet the Students Proposing Bold Ways To Use Cisco Technology for Good": 0.8,
  "Brokers Suggest Investing in CrowdStrike (CRWD): Read This Before Placing a Bet": 0.2,
  "Here's What to Expect From Vertex Pharmaceuticals' Next Earnings Report": 0.2,
  "Could MercadoLibre Stock Set Patient Investors Up for Life?​": 0.5,
  "Allot Rises 21% in 6 Months: Should You Buy the Stock Right Now?": 0.5,
  "AMD upgraded, Arm downgraded: Wall Street's top analyst calls": 0.2,
  "Sandisk and AST SpaceMobile have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Auditoria Accelerates UK and European Momentum with Leadership Appointment and Infrastructure": 0.5,
  "New DDN Report Reveals 65% of Organizations Are Struggling to Achieve AI Success": -0.7,
  "Fastenal (FAST) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "Global Asset Management Market Intelligence Report 2025-2035 Featuring Strategic Profiles of ABB, Adobe, Honeywell International, IBM, WSP, Zebra Technologies and Other Key Players": 0.5,
  "AMAT's Flash Memory Sales Nearly Double in FY25: What's Ahead?": 0.5,
  "$SFTBY is a good play for robotics/Ai right now and no one is paying attention. - Everyone is chasing their tails over Hyundai, Nvidia, and Tesla, but SoftBank ($SFTBY) is sitting in the perfect spot for a massive breakout. Here is the lowdown on why I'm loading up at **$13.85**. # They still own the \"Cool\" part of Boston Dynamics Hyundai gets all the headlines, but SoftBank still holds a **20% stake**. At CES 2026,": 0.6,
  "Best Growth Stocks to Buy in 2026": 0.6,
  "JPM26: Vertex hopes to match cystic fibrosis success in pain and kidney disease": 0.5,
  "Defense tech firm Onebrief valued at over $2 billion in latest funding round": 0.8,
  "The Zacks Analyst Blog Highlights Microsoft, Eli Lilly, Lam Research and Ampco-Pittsburgh": 0.5,
  "Diamondback Energy Braces for Q4 Earnings Hit as Oil Prices Slide": -0.7,
  "BDO Canada, Intuit team up to serve small and mid-sized businesses": 0.5,
  "2 Growth Stocks That Could Double Your Money By 2032": 0.8,
  "'Big Short' Investor Michael Burry Bets Against Oracle—Here's His Advice": 0.2,
  "SNDK Hits a 52-Week High: 3 Reasons Why the Stock is Worth Buying Now": 0.8,
  "Key Trends in Online Travel Markets Report 2025 Featuring Skyscanner, Airbnb, Expedia, Trip.com, TripAdvisor, MakeMyTrip, Hilton, Booking, easyJet, Uber, Carnival, and Next Vacay": 0.5,
  "Energy Stocks Break Their Slump. Which Charts Are Most Bullish?": 0.6,
  "Intel stock rises on analyst upgrade citing data center AI demand, 'significant progress' in manufacturing": 0.8,
  "Jim Cramer Says He Believes in Palantir (PLTR)’s Management": 0.6,
  "Putting r/Stocks to the test by buying all this sub's favourite stock picks - Just dumped £100 into the most mentioned/favourited stocks from [this post](https://old.reddit.com/r/stocks/comments/1qarbo5/alright_reddit_aside_from_asts_and_rklb_whats/) I went through the comments and tried adjusting the weights based on number of mentions / number of upvotes. Don't think about it too much. Depending how my finances are this year I might dump in £100 every month as a DCA so it's at least over £1k across the": 0.2,
  "Billionaire Mark Cuban Says If You Have $100K, Buy Bulk Toothpaste And Soup For The 'Best' ROI—The Rest? Let It Sit In The Bank Earning 'Nothing'": 0.2,
  "Are You Looking for a Top Momentum Pick? Why Analog Devices (ADI) is a Great Choice": 0.8,
  "Ross Stores (ROST) is a Great Momentum Stock: Should You Buy?": 0.6,
  "Modella AI Announces Acquisition by AstraZeneca to Advance AI-Driven Oncology R&D at Global Scale": 0.8,
  "Apple Jumps on the Subscription Software Bandwagon. Why Adobe Stock Is Dropping.": -0.5,
  "AI Startup Sued by Palantir Says Company Wants to ‘Scare Others’ From Leaving": -0.6,
  "Dow Jones Retail Giant Amazon Stock Eyes Latest Buy Point": 0.5,
  "AstraZeneca to acquire Modella AI to speed oncology drug research": 0.5,
  "Will Fortinet (FTNT) Beat Estimates Again in Its Next Earnings Report?": 0.5,
  "ALAB Benefits From Strong UALink Growth: Will the Momentum Continue?": 0.6,
  "Citi Is Betting on Another ‘Supercycle’ in Palantir Stock. Should You Buy PLTR Here?": 0.5,
  "What’s your best dips to buy atm? - As in the title, what’s your best picks for massive dips to buy at the moment, having in mind 2026. Personally i believe these are massively undervalued and will rebound in the following year: $META $NFLX $RBLX What’s yours “must buy” dips atm?": 0.6,
  "Adobe Shares Slide After Oppenheimer Downgrade": -0.7,
  "OnTrac CEO Duffy leaves for UK pest control company": -0.5,
  "Crypto Billionaire Michael Saylor Names Nvidia, Bitcoin Among 'Best Performing Assets' Of The Decade: Here's How They've Performed": 0.8,
  "Nvidia is a 'very boring idea' and could lose its market cap crown, says market veteran - The hottest AI trade on Wall Street has officially become \"boring.\" \"Nvidia would be a very boring idea ... because we all know the story,\" serial entrepreneur Tom Sosnoff told Yahoo Finance's Opening Bid. The former founder of Thinkorswim and Tastytrade argues that despite Nvidia's technological dominance, the stock's story is too well-known and it may be priced": -0.6,
  "Three Stocks That May Be Undervalued In January 2026": 0.5,
  "Paramount  Sues Warner Bros Over Netflix Deal": -0.6,
  "In 2026, Beyond Confronting AI Giants, What Truly Matters? - Current P/E ratios are absurdly high how much longer can the AI faith hold? By 2026, I plan to shift positions to areas with “more meat on the bone.” Any thoughts? INTC & MU: Chip foundry ramp up + memory cycle recovery. INTC has been criticized for years, but the odds seem better at this level. RKLB: Don't just focus on SpaceX 2026 is the": 0.1,
  "AbbVie Signs US Deal to Cut Drug Prices, Secure Tariff Exemptions": 0.5,
  "Ex-Lazard Banker Charged in Insider Trading Case Tied to Health-Care Deals": -0.5,
  "Arm Stock Is Falling. Its Biggest Customer Might Be Masking Larger Problems.": -0.6,
  "How The Story Behind Automatic Data Processing (ADP) Is Shifting With New Analyst Targets": 0.2,
  "MCHP Rises 29% in a Year: How Should You Approach the Stock in 2026?": 0.5,
  "Michael Saylor slams interviewer for questioning Bitcoin treasury model: ‘Ignorant and offensive’": -0.8,
  "Bernstein Loves This 1 Lesser-Known Chip Stock for 2026": 0.6,
  "1 Quantum Computing Stock to Buy that Could Soar in 2026": 0.6,
  "Piper Sandler cuts Synopsys and Bentley Systems on growth risks": -0.5,
  "Ignore the Apple Noise and Consider Buying Qualcomm Stock for 2026": 0.5,
  "D&H Fortinet Security Partnership Expansion Might Change The Case For Investing In Fortinet (FTNT)": 0.2,
  "‘Inflation is aging’: Bryan Johnson’s war against systemic decay": 0.2,
  "Regeneron's Yancopoulos on Hearing Loss Gene Therapy, Weight Loss Drugs": 0.2,
  "VanEck Says Bitcoin Could Hit $53M. Here's What It Would Take": 0.5,
  "Why Salesforce (CRM) Shares Are Plunging Today": -0.8,
  "Domo, Amplitude, and LiveRamp Stocks Trade Down, What You Need To Know": -0.5,
  "Why DocuSign (DOCU) Stock Is Falling Today": -0.5,
  "Why Asana (ASAN) Stock Is Trading Lower Today": -0.5,
  "Qualcomm (QCOM) Downgraded as Handset Drag Limits Upside, Analyst Says": -0.5,
  "A Lawsuit, a Streaming Deal, and a Big Question for Warner Bros. Discovery Investors": 0.1,
  "BMO Reiterates Market Perform on Bloom Energy (BE) After Grid-Scale Fuel Cell Deal": 0.5,
  "Adobe (ADBE) Downgraded as Analysts See Limited Near-Term Catalysts": -0.6,
  "Atlassian Announces Date for Second Quarter of Fiscal Year 2026 Financial Results": 0.0,
  "Seagate Technology to Report Fiscal Second Quarter 2026 Financial Results on January 27, 2026": 0.0,
  "EA to Release Third Quarter Fiscal Year 2026 Results on February 3, 2026": 0.0,
  "Mondelēz International to Report Q4/FY 2025 Financial Results on February 03, 2026": 0.0,
  "Array completes sale of select spectrum assets to AT&T for $1.018 billion": 0.5,
  "Netflix may adjust WBD bid to an all-cash offer: Bloomberg": 0.2,
  "TD Cowen Initiates Coverage on Constellation Energy (CEG) With $440 Price Target": 0.6,
  "Charter Closes $3.0 Billion Senior Unsecured Notes": 0.5,
  "US Equity Markets Fall as Investors Weigh Bank Earnings, December Inflation Data": -0.5,
  "Why Siemens (XTRA:SIE) Is Up 5.9% After Expanding Its NVIDIA AI Digital Twin Alliance": 0.8,
  "How IDEXX’s Diagnostics-Focused CEO Transition At IDEXX Laboratories (IDXX) Has Changed Its Investment Story": 0.2,
  "Analyst sends surprising message on Palantir stock in 2026": 0.5,
  "Billionaire Peter Thiel Made a Big Bet on Two Stocks for 2026 (Hint: It's Not Nvidia)": 0.5,
  "Adobe stock downgraded, Moderna surges on upbeat guidance": 0.5,
  "Netflix May Amend Warner Bros. Bid to Make It All Cash": 0.2,
  "JPMorgan, Delta, Intel, AMD, Adobe, Moderna, Super Micro, and More Stock Market Movers": 0.2,
  "Netflix Preparing to Make Warner Bid All-Cash": 0.2,
  "AstraZeneca CFO on M&A Strategy and Obesity Market": 0.0,
  "Up 32% in the Past Year, Can Microchip Technologies Stock Keep Zooming Higher?": 0.6,
  "Three stocks retail traders have been buying": 0.2,
  "AI Could Spell Trouble for Software. These Experts Say to Avoid One Stock In Particular": -0.5,
  "2 No-Brainer AI Stocks to Buy Hand Over Fist in 2026": 0.6,
  "Netflix Stock Pops on Report of All-Cash Bid for Warner Bros.": 0.8,
  "Palo Alto Networks (PANW) Gains As Market Dips: What You Should Know": 0.5,
  "Paypal (PYPL) Suffers a Larger Drop Than the General Market: Key Insights": -0.5,
  "Qualcomm (QCOM) Falls More Steeply Than Broader Market: What Investors Need to Know": -0.5,
  "Alphabet briefly hits $4T market cap after Apple AI news - Alphabet briefly crossed a $4 trillion market cap following news of its AI partnership with Apple. The deal puts Google’s Gemini models directly into Apple’s ecosystem, which is a pretty significant distribution win given Apple’s user base. From a stock perspective, I’m curious how much of this is already priced in. Alphabet has been on a strong run over the past year, driven by": 0.6,
  "Netflix Weighs Amending Warner Bros. Bid to Make It All Cash": 0.2,
  "Workday (WDAY) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "Lam Research (LRCX) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "Why Adobe (ADBE) Shares Are Falling Today": -0.5,
  "Why Atlassian (TEAM) Shares Are Plunging Today": -0.8,
  "Booking Holdings (BKNG) Dips More Than Broader Market: What You Should Know": -0.2,
  "Up 948%, Should You Buy Sandisk Right Now?": 0.5,
  "Diamondback Energy (FANG) Gains As Market Dips: What You Should Know": 0.5,
  "Tech Wreck or Valuation Reset? Rotating to Value in 2026": 0.2,
  "MicroStrategy director buys MSTR dip after years of selling": 0.5,
  "Alnylam Pharmaceuticals (ALNY) Is Down 9.0% After Ambitious 2026 Guidance And 2030 Plan Reveal": -0.6,
  "Stock Market Today, Jan. 13: Netflix Rises After HSBC Upgrade Sparks Optimism Ahead of Earnings": 0.8,
  "Meet Caria Raises $1M Pre-Seed Round at $3M Valuation Led by ANF Investment": 0.5,
  "TMC - The Metals Company - The simplest binary play of the year. NOAA exploration license granted, unlock value = 700% increase/$56\\~ price. The minerals are there, the technology is there, just waiting for the \"license to drill.\" LEAPS are decent $5-$7 strike go for around $200-$400 premium cost. Either lose a bit or 700% that's it. Current share price $7-$8 range. With the way Trumps is going, he will most likely bypass the UN's": 0.6,
  "(Item 2.02) . Results of Operations and Financial Condition. On January 14, 2026 , Intuitive Surgical, Inc. (“Intuitive”) issued a press release announcing certain unaudited preliminary fourth quarter and full year 2025 financial results. A copy of the press release is furnished hereto as Exhibit 99.1. Additional unaudited preliminary revenue and procedure information is provided in the tables attached hereto as Exhibit 99.2, which has also been posted to the Investor Relations section of the Intuitive website": 0.1,
  "(ITEM 1.01) . ENTRY INTO A MATERIAL DEFINITIVE AGREEMENT. Issuance of 7.000% Senior Notes due 2033 and 7.375% Senior Notes due 2036 On January 13, 2026 (the “Closing Date”), CCO Holdings, LLC (“CCO Holdings”) and CCO Holdings Capital Corp. (together with CCO Holdings, the “CCOH Issuers”), subsidiaries of Charter Communications, Inc. (the “Company”), issued (i) $ 1.75 billion aggregate principal amount of 7.000% Senior Notes due 2033 (the “2033 Notes”) and (ii) $1.25 billion aggregate principal amount\n\n(Item 1.01) above is incorporated herein by reference.": 0.1,
  "Is DexCom (DXCM) Pricing Justified After Recent Multi Year Share Price Weakness": 0.1,
  "Marriott rolls out major deals for loyal members": 0.8,
  "Assessing Booking Holdings (BKNG) Valuation After Recent Share Price Consolidation": 0.1,
  "Palantir Is Poised to Mint 10,000 Millionaires. Will You Be One of Them?": 0.8,
  "Discover Asia's Winter Magic: Agoda Recommends Snowy Escapes for 2026": 0.5,
  "HUTCHMED Highlights Publication of Phase III SACHI Results in The Lancet": 0.5,
  "How Investors May Respond To DexCom (DXCM) Strong 2025 Revenue Beat And 2026 Growth Outlook": 0.5,
  "1 Growth Stock with Explosive Upside and 2 We Avoid": 0.6,
  "1 Mega-Cap Stock with Exciting Potential and 2 Facing Challenges": 0.5,
  "1 Nasdaq 100 Stock to Consider Right Now and 2 Facing Headwinds": 0.2,
  "Proposed billionaires' tax in California rattles Silicon Valley, entangles Gov. Newsom": -0.5,
  "A Look At Alnylam Pharmaceuticals (ALNY) Valuation After Unveiling Its Alnylam 2030 Growth Plan": 0.5,
  "[Latest] Global T-Cell Engagers Market Size/Share Worth USD 18.8 Billion by 2034 at a 21.2% CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trends, Forecast, Segmentation, Growth Rate, Value, SWOT Analysis)": 0.5,
  "Palantir Stock Investors Just Got Great News From Wall Street": 0.8,
  "Is Cognizant (CTSH) Pricing Reflecting Its IT Services Strength And DCF Upside Potential": 0.2,
  "Believing that AI bubble has peaked is going to lose people a lot of money - Will there be an AI bubble peak? Yes. Every breakthrough technology has had over investment. Has AI bubble peaked? If you keep reading mainstream media, r/stocks, and listening to Michael Burry, you'd believe it. You'd be losing a lot of money though. **Real demand is through the roof:** * H100 prices recovering to highest in 8 months. This is": 0.6,
  "Investors Worried About Palantir's Valuation Last Year. Is it a Buy Now in 2026?": 0.1,
  "Read This Before Buying Costco Stock for the Long Term​": 0.1,
  "Exclusive-Beijing tells Chinese firms to stop using US, Israeli cybersecurity software, sources say": -0.6,
  "Trending tickers: Nvidia, Intel, Moderna, BP and Vistry": 0.0,
  "CrowdStrike to acquire Seraphic Security for browser security boost": 0.5,
  "How Grocery Aisles Are Changing in the Age of MAHA and Ozempic": 0.0,
  "The Collapse of a Car-Parts Supplier Puts Spotlight on How Cash Flow Can Lie": 0.1,
  "New Workday Research: Companies Are Leaving AI Gains on the Table": -0.5,
  "Major factory construction projects to watch in 2026": 0.0,
  "Cybersecurity stocks fall after China software crackdown report": -0.6,
  "Market Chatter: Palantir Poaching Lawsuit Labeled Scare Tactic by Former Employees": -0.5,
  "T-Mobile Expands Long-Term Partnership With Netcracker for Cloud Platform to Facilitate Digital-First Services": 0.5,
  "Ore-Ida Brings Its Iconic Fries from the Freezer Aisle to the Frozen Slopes with Limited-Edition Fry-Inspired Skis": 0.6,
  "World’s largest oilfield services company to pounce on Trump’s Venezuela opening": 0.5,
  "The Returns At Analog Devices (NASDAQ:ADI) Aren't Growing": -0.6,
  "Is Marvell Technology, Inc. (NASDAQ:MRVL) Potentially Undervalued?": 0.5,
  "Is Baker Hughes Company (NASDAQ:BKR) Trading At A 23% Discount?": 0.1,
  "Shopify in position to capture earnings upside from AI shopping, Scotia analysts say": 0.6,
  "Meta is a 'hated' name right now, but this analyst is still bullish": 0.5,
  "Bitcoin price up after Strategy buys $1.3bn in biggest haul since July": 0.8,
  "This Week In AI Chips - TCS and AMD Unite to Boost AI Solutions": 0.6,
  "Uncovering Advanced Micro Devices And Two Other Stocks Estimated To Be Trading Below Fair Value": 0.5,
  "The U.S. Economy Looks Strong on Inflation Figures. But 3 Big Risks Remain.": 0.5,
  "Coca Cola Halts Costa Coffee Sale After Offers Fall Short": -0.5,
  "AMD Teams Up with Tata Consultancy Services to Boost Enterprise AI Adoption": 0.6,
  "Thomson Reuters Corporation (TSE:TRI) Shares Could Be 30% Below Their Intrinsic Value Estimate": -0.8,
  "HONEYWELL ANNOUNCES QUANTINUUM'S PLAN TO MAKE CONFIDENTIAL SUBMISSION OF DRAFT REGISTRATION STATEMENT FOR PROPOSED INITIAL PUBLIC OFFERING": 0.5,
  "Honeywell International Insiders Sold US$1.5m Of Shares Suggesting Hesitancy": -0.5,
  "Returns On Capital At Roper Technologies (NASDAQ:ROP) Have Stalled": -0.5,
  "Amgen Inc. (NASDAQ:AMGN) Shares Could Be 49% Below Their Intrinsic Value Estimate": -0.8,
  "See How Bullish Inflows Boost Lam Research": 1.0,
  "AppLovin's Quarterly Earnings Preview: What You Need to Know": 0.5,
  "Honeywell plans to carve out quantum computing unit Quantinuum via IPO": 0.5,
  "Intel Corp. (INTC) Soars to New Record High as Analyst Posts Bullish Outlook": 0.8,
  "Palantir Technologies (NASDAQ: PLTR) Stock Price Prediction for 2026: Where Will It Be in 1 Year": 0.2,
  "What to Expect From DoorDash's Next Quarterly Earnings Report": 0.2,
  "da Vinci 5 Expands Globally: Can ISRG Beat Overseas Cost Hurdles?": 0.2,
  "Stocks Fall Pre-Bell Ahead of More Big Bank Earnings, Potential Supreme Court Decision on Tariffs": -0.5,
  "BofA downgrades Coca-Cola bottler as muted top-line caps valuation upside": -0.5,
  "Kraft Heinz's Q4 2025 Earnings: What to Expect": 0.0,
  "Walmart Stock Hits 52-Week High: Should You Stay Invested?": 0.5,
  "KeyBanc Says Intel Has Made ‘Significant Progress.’ Does That Make INTC Stock a Buy Here?": 0.5,
  "JPM26: GE HealthCare’s CEO maintains disciplined M&A strategy": 0.5,
  "Pine Reveals Its 2025 ‘Consumer Friction’ Index": 0.0,
  "Lynx Analytics Introduces Lumen, an Agentic AI Framework to Improve Decision-Making in Life Sciences": 0.8,
  "Want a real read on the economy? Forget the jobs report, try transportation stocks.": 0.2,
  "Here’s Why Mar Vista’s U.S. Quality Strategy Decided to Sell Roper Technologies (ROP)": 0.1,
  "Airbnb Nabs Former Meta Exec to Lead AI Efforts": 0.5,
  "JPM26: 2025 a “breakout year” for rare disease biotechs": 0.6,
  "Here Are Wednesday’s Top Wall Street Analyst Research Calls: AppLovin, Blackrock, Citigroup, DoorDash, Fabrinet, KLA Corp, Okta, Rivian, Uber and More": 0.5,
  "Do You Believe in the Long-Term Growth Potential of Netflix (NFLX)?": 0.5,
  "Here’s What Dragged Linde plc (LIN) in Q4": -0.5,
  "Will LRCX's China Revenue Drop Below 30% Hurt 2026 Growth Outlook?": -0.5,
  "Warner Bros Discovery (WBD) Surged Following Acquisition Offers from Multiple Parties": 0.8,
  "Here's How Much a $1000 Investment in Micron Made 10 Years Ago Would Be Worth Today": 0.5,
  "Here's How Much You'd Have If You Invested $1000 in Ross Stores a Decade Ago": 0.5,
  "Western Digital Corporation (WDC): A Bull Case Theory": 0.5,
  "Nvidia Stock Slides -- China Approval for AI Chips Remains Uncertain": -0.5,
  "Airbnb Taps Meta GenAI Leader as CTO": 0.5,
  "Quantum Computing Stocks: Honeywell's Quantinuum Plans IPO": 0.5,
  "This Memory Stock Is Up 745% in the Past 6 Months. Is It Unstoppable?": 0.8,
  "Airbnb Appoints Former Meta AI Executive CTO": 0.5,
  "Exchange-Traded Funds, Equity Futures Lower Pre-Bell Wednesday Ahead of Expected Supreme Court Decision on Tariffs": -0.2,
  "Cadence & Microsoft Redefine Data Center Memory With Advanced Solutions": 0.6,
  "Fortinet to Bring Cyber Leadership to World Economic Forum Annual Meeting 2026": 0.5,
  "Exelon Announces Additional $10 Million Contribution to Customer Relief Fund, Supporting Customers as Winter Weather Drives Higher Energy Use": 0.8,
  "Veteran Technology Executive Eric Cox Joins Restaurant365 as Chief Operating Officer": 0.5,
  "GlobalFoundries to Acquire Synopsys’ Processor IP Solutions Business, Expanding Capabilities to Accelerate Physical AI Applications": 0.6,
  "Synopsys Enters Definitive Agreement with GlobalFoundries For Sale of Processor IP Solutions Business": 0.5,
  "A $2.65 Billion Reason to Buy Bloom Energy Stock in January 2026": 0.5,
  "Intuit Inc. (INTU) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Investors Heavily Search Synopsys, Inc. (SNPS): Here is What You Need to Know": 0.5,
  "Gilead Sciences, Inc. (GILD) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Instabase Appoints Omkar Pendse as Chief Product and Technology Officer to Accelerate Next Phase of AI Innovation": 0.8,
  "Are WDC's Deepening Hyperscaler Partnerships Strengthening Its Moat?": 0.5,
  "Intuitive Announces Preliminary Fourth Quarter and Full Year 2025 Results": 0.5,
  "Is It Time To Reassess Alnylam (ALNY) After Recent Share Price Pullback?": 0.1,
  "The Intel Turnaround No One Saw Coming: Sold-Out Server CPUs and Apple Knocking at the Door": 0.8,
  "Here’s What Supports Mondelez International’s (MDLZ) Dominant Growth in the Industry": 0.8,
  "Countdown to Netflix (NFLX) Q4 Earnings: A Look at Estimates Beyond Revenue and EPS": 0.2,
  "Ahead of Fastenal (FAST) Q4 Earnings: Get Ready With Wall Street Estimates for Key Metrics": 0.5,
  "CrowdStrike to acquire Seraphic Security, terms undisclosed": 0.1,
  "Sector Update: Tech Stocks Decline Premarket Wednesday": -0.7,
  "Hazeltree 2025 Year-in-Review Finds Hedge Fund Crowding Diverged Sharply by Region": 0.1,
  "Why AMD's Least Hyped CES Announcement Could Be Its Most Important": 0.5,
  "Wall Street Bulls Look Optimistic About Palo Alto (PANW): Should You Buy?": 0.8,
  "Prediction: This AI Hardware Stock Could Become One of the Next $1 Trillion Companies": 0.8,
  "Gig Economy Stocks Worth Buying Now As the Theme Gains Popularity": 0.8,
  "Netflix Stock Is Rising. Watch This One Thing as the Warner Bidding War Unfolds.": 0.5,
  "China targets US cybersecurity firms, Tesla's FSD subscription": 0.1,
  "Uber initiated, Rivian downgraded: Wall Street's top analyst calls": 0.1,
  "ARM's Self-Reinforcing Ecosystem Cements Its Industry Leadership": 0.8,
  "ChangeUp Releases New Book,The Brand Vortex, by Co-Founder Bill Chidley": 0.5,
  "Strategy Stock Jumps as Cryptos Rally. It Still Has a Long Way to Go.": 0.6,
  "Should You Buy Micron Before 2027?": 0.1,
  "Sales of a powerful Nvidia AI chip to China gets the greenlight, with conditions": 0.2,
  "PayPal - Lasting Cash Cow Model Disconnected From It's Actual Value": -0.6,
  "Can PC Refresh Cycle Drive Edge Segment Growth for SNDK Stock?": 0.2,
  "The Zacks Analyst Blog Highlights Netflix, Toyota Motor, Amphenol, Oil-Dri and Global Self Storage": 0.0,
  "QCOM vs. AMD: Which Semiconductor Stock is the Smarter Buy in 2026?": 0.2,
  "The Zacks Analyst Blog Highlights NVIDIA, Lockheed Martin, IBM, Microsoft and Palantir": 0.5,
  "Nvidia Stock Drops. U.S. Rules on China Chip Sales Might Not Please Beijing.": -0.6,
  "ASML's Installed Base Management Business Picks Up: What's Driving it?": 0.5,
  "Palo Alto, Fortinet Stocks Drop. Why China Is Behind the Move.": -0.5,
  "China bans select US and Israeli cybersecurity tools: sources": -0.5,
  "Comcast Upgrades Broadband Infrastructure in Public and Affordable Housing Units Across Massachusetts": 0.5,
  "BC-Most Active Stocks": 0.0,
  "Cybersecurity Stocks Are Falling. China Is Tightening Software Rules": -0.6,
  "The Zacks Analyst Blog Highlights Micron Technology and NVIDIA": 0.5,
  "Apple and Qualcomm Stocks Falls -- Report Says Companies Facing Potential Supply Issues": -0.6,
  "AMD Stock Climbs on Strong Ryzen AI MAX+ 392 Benchmark Results": 0.8,
  "CrowdStrike CEO on M&A: Identity security is the 'new perimeter'": 0.5,
  "CrowdStrike defeats shareholder lawsuit over huge software outage": 0.5,
  "Sold-Out AI Chips and Growing Foundry Buzz: Is Intel’s Rally Just Getting Started?": 0.5,
  "DexCom (DXCM) Releases Preliminary, Unaudited Results for Q4 2025": 0.2,
  "Bernstein Reduces Firm’s PT Diamondback Energy (FANG) Stock": -0.5,
  "Jim Cramer on Arm Holdings: “I Think I’m a Buyer, Not a Seller”": 0.6,
  "Strategy, Other Stocks to Buy Amid Software Selloff: Technical Analysis": 0.2,
  "President Donald Trump Says, “The United States Government Is Proud to Be a Shareholder of Intel.” Should You?": 0.2,
  "MicroStrategy Just Exponentially Increased Its Bitcoin Purchases. What Does That Mean for MSTR Stock?": 0.5,
  "SKIL's AI-Native Strategy: Is Growth Painted in Its Long-Term Picture?": 0.5,
  "Infosys Stock Spikes After Earnings. Can It Spark a Consulting Comeback?": 0.6,
  "Netflix Ad-Tier Growth Accelerates: Is the Stock Finally Breaking Out?": 0.6,
  "Is Macy's Stock a Buy or Sell at Its Current Valuation?": 0.0,
  "Homebuilder stocks slide, silver miners gain, crypto stocks rise": 0.2,
  "Intel: trading warm fuzzies or the next big chip maker? - Considering they are not even in the top 10 foundries by revenue in the world they strike me as a warm fuzzy play. The news cycle has made a bull case for them causing a price surge on a company that hadnt been profitable in 20 years even with the fact that they have had chips in absolutely every consumer electronics device. Operation of": -0.6,
  "BofA Maintains an Underperform Rating on Hims & Hers Health, Inc. (HIMS)": -0.5,
  "Bitcoin rallies past $97,000 as investors seek haven assets": 0.8,
  "CSX to Report Q4 Earnings: What's in the Offing Amid Cost Pressures?": 0.1,
  "3 Companies Enjoying Snowballing Sales Growth": 0.5,
  "Mizuho Retains an Outperform Rating on Mondelez International, Inc. (MDLZ)": 0.6,
  "The AI Boom Gets Its First Earnings Test of the Year. Watch TSMC Stock.": 0.5,
  "Airbnb Hotel Rollout Limited, Madrid May Boost Stock, RBC Says": 0.5,
  "Why Intuitive Surgical Stock Dropped Today": -0.5,
  "CTSH vs. DT: Which Stock Is the Better Value Option?": 0.0,
  "Palantir Seeks 12-Month Work Ban on Ex-Employee Linked to AI Startup": -0.5,
  "The Worries Deepen for Software Stocks": -0.6,
  "Big banks push back on Trump's credit card cap, warning of 'significant' economic slowdown": -0.7,
  "Apple aims to capture creator market with software bundle": 0.5,
  "Bitcoin Rally Sees $700 Million in Bearish Crypto Bets Wiped Out": 0.2,
  "CrowdStrike CEO says AI agents are unpredictable as company snaps up more cybersecurity startups": 0.2,
  "Cloud Native Computing Foundation Announces Dragonfly's Graduation": 0.5,
  "Retail ETF (RTH) Touches New 52-Week High": 0.8,
  "Will Exelon (EXC) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Clovity Adds Former CoreTrust CEO Mahesh Shah as Operating Advisor to Accelerate AI-Powered Atlassian Growth in Regulated Sectors": 0.6,
  "Why Intuitive Surgical Stock Is Falling Today": -0.5,
  "Warner Bros Investor Backs Netflix Over Paramount Bid": 0.5,
  "‘Sickening and greedy’: California millionaire slams Larry Page and Sergey Brin for cutting ties with the state to avoid wealth tax": -0.8,
  "AppLovin Rises on Evercore Outperform Rating": 0.6,
  "Netflix Stock Falls Amid Warner Bros Acquisition Battle": -0.6,
  "Where Will GE Vernova (GEV) Stock Be in 1 Year?": 0.1,
  "California’s wealth tax doesn’t fix the real problem: Cash-poor billionaires who borrow money, tax-free, to live on": -0.6,
  "3 Stocks Estimated To Be Trading At A Discount Of Up To 28.6%": 0.5,
  "Peter Thiel makes his biggest donation in years to help defeat California’s billionaire wealth tax": -0.8,
  "AppLovin Stock Slides Despite Scoring New Analyst Buy Rating": 0.1,
  "Could Netflix Throw More Cash Into Its Warner Bros. Deal? Investors Are Wondering": 0.2,
  "As Trump Casts Doubt on the Netflix-Warner Bros. Discovery Deal, How Should You Play NFLX Stock?": 0.2,
  "Goldman Sachs Assumes Coverage of Intuit (INTU) Stock": 0.2,
  "BofA Upgrades Comcast (CMCSA) to Buy With $37 PT on Media Consolidation Trends": 0.6,
  "Goldman Sachs Assumes Coverage of Adobe (ADBE) With Sell Rating, $290 PT": -0.5,
  "NYC Says DoorDash, Uber Tip Changes Cut Driver Income by $550 Million": -0.8,
  "Tesla’s Full Self-Driving System Will Only Be Available Via Subscription, Musk Says": 0.1,
  "AMD stock bets shift after analyst drops $15 billon message": 0.1,
  "Nvidia & Broadcom stocks dragged by China's tech bans: Reports": -0.5,
  "Uber Eats, DoorDash Interface Changes Reduced Tips by $554 Million, DCWP Says": -0.6,
  "Meta Lays Off 1,500 People in Metaverse Division": -0.8,
  "JPM26: AstraZeneca bids to accelerate oncology R&D with Modella AI acquisition": 0.5,
  "NFL legend Cam Newton admits he’s not ‘superman,’ can’t provide for his 8 kids like he used to. Here’s his 1 big mistake": -0.6,
  "Sector Update: Tech Stocks Fall Wednesday Afternoon": -0.5,
  "Travel stocks sink: Expedia leads decline following US visa processing freeze": -0.8,
  "Bitcoin Stuck at $90K as $1.1 Billion ETF Outflows Signal “Boring Sideways” Era": -0.5,
  "Why Arm Holdings Stock Lost 11% in 2025": -0.5,
  "2026’s Biggest AI Trends: The Memory Explosion | MU Stock, SNDK Stock, SK Hynix, CAMT Stock": 0.2,
  "2026’s Biggest AI Trends: The Rise of AI Factories | VRT Stock, NVT Stock, MOD Stock": 0.5,
  "Quantinuum to Go Public. Investors Soon to Get Piece of Latest Quantum Pure Play.": 0.5,
  "US Equity Indexes Drop as Big Bank Earnings Disappoint, Inflation Data Mixed Amid Worsening Geopolitics": -0.6,
  "Top Analyst Sees Meta Platforms Stock Surging 77% - **Rosenblatt** analyst **Barton Crockett** maintained Meta with a Buy rating and a [$1117 price forecast](https://www.benzinga.com/quote/META/analyst-ratings) on Wednesday. The analyst said the price forecast implies 77% upside from the January 13 closing price of $631.09. The analyst said Meta has dominated headlines in recent days, and he views the developments as deliberate moves to support the company's data center and AGI ambitions. More here [https://www.benzinga.com/analyst-stock-ratings/reiteration/26/01/49915025/why-this-top-analyst-sees-meta-platforms-stock-surging-77?utm\\_source=snapi](https://www.benzinga.com/analyst-stock-ratings/reiteration/26/01/49915025/why-this-top-analyst-sees-meta-platforms-stock-surging-77?utm_source=snapi) edit...OP is": 0.8,
  "Equity Markets Fall Intraday as Big Tech, Major Banks Slide": -0.7,
  "2026’s Biggest AI Trends: The Return of CPUs | INTC Stock, AMD Stock, NVDA Stock": 0.2,
  "JPMorgan's Q4 Results To Reveal If Dealmaking Will Replace Rate-Driven Profits For Big Banks In 2026— SpaceX's $1.5 Trillion IPO In Focus": 0.2,
  "2026’s Biggest AI Trends: Self-Driving Cars | TSLA Stock, GOOGL Stock, UBER Stock, NVDA Stock": 0.5,
  "JPM26: Regeneron will not overpay in M&A deals amid lead asset patent expiries": 0.2,
  "5 Reasons MSTR is a Buy at the Current Discounted Levels": 0.8,
  "WBD downgraded by Guggenheim, China launches probe into Trip.com": -0.5,
  "Trump's greenlight for Nvidia AI chips to China draws fire from lawmakers, former officials": -0.6,
  "Wall Street Has a Mixed Opinion on PDD Holdings Inc (PDD)": 0.0,
  "Ford Motor Company (F) Plans to Introduce its AV Technology, Here’s What You Need to Know": 0.5,
  "Bitcoin Is on the Rise Again. Why Some Experts Think This Might Last a While": 0.8,
  "Why Strategy (MSTR) Stock Is Trading Up Today": 0.5,
  "After Apple Deal, Is Google — Not OpenAI — Now the Premier AI Stock?": 0.2,
  "Amid the AI boom, Intel is focusing on the basics": 0.5,
  "Meta Hires Former Trump Adviser, Senator's Wife: President Says Zuckerberg Made 'A Great Choice'": 0.2,
  "Why these 5 tech stocks could dominate the market in 2026": 0.5,
  "Elon Musk must deliver on Tesla's Robotaxi promise in 2026, Deutsche Bank says": 0.5,
  "As Mark Zuckerberg Unveils Meta Compute, Should You Buy, Sell, or Hold META Stock?": 0.2,
  "AppLovin Stock Just Got a New Buy Rating. Its Shares Are Tanking.": -0.7,
  "Expect Market Gains From EV New Entries: McNeill": 0.5,
  "Micron vs. Palantir: Which AI Stock Is the Better Buy for 2026?": 0.2,
  "AppLovin, Zeta Global, Oracle, Domo, and PubMatic Shares Plummet, What You Need To Know": -0.6,
  "Guidewire Software, American Express Global Business Travel, Appian, Braze, and Fastly Shares Plummet, What You Need To Know": -0.7,
  "Twilio, Datadog, Box, monday.com, and BlackLine Shares Are Falling, What You Need To Know": -0.5,
  "Bandwidth, Dynatrace, Paylocity, Doximity, and Agilysys Stocks Trade Down, What You Need To Know": -0.5,
  "Atlassian, Wix, Pegasystems, Asana, and Elastic Shares Plummet, What You Need To Know": -0.6,
  "Health Catalyst, Veeva Systems, 8x8, Amplitude, and DocuSign Stocks Trade Down, What You Need To Know": -0.5,
  "Autodesk and Nutanix Shares Are Falling, What You Need To Know": -0.5,
  "MongoDB, DigitalOcean, Cadence Design Systems, HubSpot, and Workday Shares Are Falling, What You Need To Know": -0.5,
  "Does AI-Driven Deals vs Softer Billings Change The Bull Case For Palo Alto Networks (PANW)?": 0.1,
  "Microsoft Stock Ready to Rebound After Recent Slide": 0.8,
  "Costco quietly speeds up checkout with two major changes": 0.5,
  "China Just Banned Broadcom’s Cybersecurity Solutions. What Does That Mean for AVGO Stock?": 0.1,
  "Trump Shares Post Accusing Netflix Of Being 'Woke' — Is President Signaling He Won't Support Warner Bros. Merger?": -0.5,
  "Why is Meta laying off workers again?": -0.6,
  "Costco Execs Have Been Selling Stock on the Heels of a Rough 2025": -0.6,
  "Why the Nasdaq Composite Is Lagging the S&P 500 and Dow": -0.5,
  "Technology, Financials Hit US Equity Indexes in Final Leg of Trading": -0.5,
  "Sector Update: Consumer Stocks Mixed Late Afternoon": 0.0,
  "Update: Market Chatter: Amazon.com Seeks to Trim Payments to Suppliers Ahead of Supreme Court Ruling on Tariffs": -0.6,
  "Sector Update: Tech Stocks Fall Late Afternoon": -0.5,
  "Sector Update: Health Care Stocks Higher Late Afternoon": 0.5,
  "Intel Q4 Outlook Improving on PC, Server Demand, UBS Says": 0.6,
  "Monolithic Power Systems to Report Fourth Quarter and Full Year 2025 Results on February 5, 2026": 0.0,
  "Stock market today: Dow, S&P 500, Nasdaq retreat as tech leads market lower, banks slide after earnings": -0.5,
  "Nasdaq Drops 1%. Small Stocks Take Lead From Big Tech.": -0.5,
  "Why Elon Musk And Tesla Are Going The Subscription Route With FSD": 0.2,
  "PARAMOUNT APPOINTS DENNIS K. CINELLI AS CHIEF FINANCIAL OFFICER AND ADDS ANDREW CAMPION TO ITS BOARD OF DIRECTORS": 0.5,
  "ADP Declares Regular Quarterly Dividend": 0.0,
  "Meta to Announce Fourth Quarter and Full Year 2025 Results": 0.0,
  "Tesla Stock Drops. Elon Musk Makes a Surprise Decision on FSD.": -0.5,
  "Google vs. Apple: Which Magnificent 7 Stock is a Better Buy Right Now?": 0.5,
  "Verizon Outage Hits Nearly 180,000 Users": -0.8,
  "Is Regeneron (REGN) Offering Value After Recent Share Price Swings?": 0.2,
  "Intuitive Surgical slips, Airbnb hires Meta's former GenAI chief": 0.1,
  "Rivian Stock Dives After Second Sell Downgrade. Why Its Gains Have Made Wall Street Wary.": -0.7,
  "Tech Selloff Weighs on Nasdaq; Precious Metals Scale New Peaks": 0.1,
  "Intuitive Surgical Crushed Fourth-Quarter Forecasts. So Why Did Shares Dive?": 0.2,
  "Why Broadcom (AVGO) Shares Are Falling Today": -0.5,
  "These Stocks Are Today’s Movers: Bank of America, Wells Fargo, Citigroup, Tesla, Rivian, Intel, AppLovin, and More": 0.5,
  "Intel Stock Hits Highest Level in Nearly 2 Years. What Has the Market Excited.": 0.8,
  "MonthPulse Tactical: Neutral/Volatile Setups for Jan 2026 [NA Market] - # MonthPulse Tactical: Neutral/Volatile Setups for Jan 2026 [NA Market] **Date:** January 14, 2026 **Strategy:** Long-Only Tactical Momentum **Focus:** NYSE, NASDAQ, TSX Markets are chopping as geopolitical headlines (Iran) and mixed bank earnings weigh on the indices. However, **chaos creates ladders**. We are seeing a historic decoupling where Commodities (Gold/Silver/Uranium) and Crypto are ripping while Big Tech takes a breather. This is a stock picker's": 0.1,
  "Elon Musk Slams Google, Apple Deal: 'Unreasonable Concentration Of Power'": -0.7,
  "Alphabet vs. OpenAI: Which AI Giant Will Drive 100% Gains?": 0.5,
  "ADP AUTHORIZED TO PURCHASE $6 BILLION OF ITS COMMON STOCK": 0.5,
  "Strategy, BitMine Rise While Bitcoin Miners Surge—As BTC Inches Towards $100K": 0.5,
  "Microsoft Stock Hits a 7-Month Low. Why Wall Street Analysts  Are Backing a Recovery.": 0.5,
  "Is Apple's AI partnership with Google a major loss for OpenAI?": -0.6,
  "Technology, Financials Push US Equity Indexes Lower": -0.5,
  "Nasdaq Logs Worst Day in 4 Weeks as Big Tech, Major Banks Slide": -0.8,
  "Tech Slide Drags Nasdaq Composite to Worst Day in a Month": -0.7,
  "Heard on the Street Recap: AI Selloff Resumes": -0.5,
  "Top Research Reports for AbbVie, Intel & Boeing": 0.0,
  "SoundHound Stock In Doghouse As Sales Growth Slows": -0.6,
  "Why Broadcom Stock Sank Today": -0.5,
  "Trump imposes 25% tariff on advanced chip imports": -0.8,
  "Trump Puts 25% Tariffs on Chips. It Only Matters to Nvidia and AMD—for Now.": -0.2,
  "Tech Spending Is Still Strong. There’s 1 Big Winner and Plenty of Losers.": 0.6,
  "Starbucks Announces Q1 Fiscal Year 2026 Results Conference Call": 0.0,
  "Stock Market Today, Jan. 14: Nvidia Leads Tech Losses as Investors Cool on AI": -0.6,
  "This Undervalued Artificial Intelligence (AI) Semiconductor Stock Looks Like a Better Buy Than Nvidia or Broadcom in 2026": 0.8,
  "Micron sends hard-nosed message after controversial decision": -0.5,
  "Here's Why CrowdStrike Holdings (CRWD) Fell More Than Broader Market": -0.5,
  "Why Zscaler (ZS) Dipped More Than Broader Market Today": -0.5,
  "Cisco Systems (CSCO) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Here's Why Datadog (DDOG) Fell More Than Broader Market": -0.5,
  "Here's Why Microsoft (MSFT) Fell More Than Broader Market": -0.5,
  "Tesla (TSLA) Suffers a Larger Drop Than the General Market: Key Insights": -0.5,
  "Why Amazon (AMZN) Dipped More Than Broader Market Today": -0.5,
  "Tech Investors Worry About High Prices, Regulation": -0.6,
  "Paramount Skydance Names Cinelli CFO Amidst Fight for Warner Bros.": 0.1,
  "Amgen (AMGN) Advances While Market Declines: Some Information for Investors": 0.5,
  "Airbnb, Inc. (ABNB) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "Fortinet (FTNT) Declines More Than Market: Some Information for Investors": -0.5,
  "Marvell Technology (MRVL) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Should You Buy the \"Magnificent Seven\" Laggards in 2026?": 0.2,
  "Axon Enterprise (AXON) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "Texas Instruments (TXN) Rises As Market Takes a Dip: Key Facts": 0.5,
  "Trump enacts 25% tariff on chips — with a caveat": -0.5,
  "Netflix's Bid to Acquire Warner Bros. Discovery Just Got a Boost From an Unlikely Source": 0.5,
  "Stock Market Today, Jan. 14: Intel Jumps on Sold Out 2026 Server CPU Capacity": 0.6,
  "Honeywell International Inc. (HON) Gains As Market Dips: What You Should Know": 0.5,
  "Astrazeneca (AZN) Ascends While Market Falls: Some Facts to Note": 0.5,
  "Peter Thiel Donates $3 Million To Fight California Wealth Tax As Gavin Newsom Vows To Block Measure": 0.2,
  "Alphabet and Amazon Just Said Something That May Eliminate Nvidia's Biggest Risk": 0.5,
  "Stock market today: Dow, S&P 500, Nasdaq futures slip after Wall Street's first back-to-back losses in 2026": -0.5,
  "Trump imposes 25% tariff on imports of some AI chips": -0.6,
  "SK Hynix Bets $13 Billion To Lock In AI Memory Dominance": 0.5,
  "Where Will Nvidia Stock Be in 5 Years?": 0.1,
  "Microsoft Hits Lows But Cloud Spending To Boost Stock, Analysts Say; Is Microsoft A Buy Now?": 0.5,
  "RBRK - Worth a position? - Hi all. I’ve had Ruberik on my watch last for the last several months and just today, I finally dipped my toes in to start a position. I am by no means competent in the space (data security/ cloud data management), but am enticed by their growth and great margins. I am providing a link in the comments to their Q3 earnings report and 2 prior RBRK threads from": 0.6,
  "Xi Welcomes Stream of Leaders Shaken by Trump’s New World Order": 0.2,
  "Review & Preview: Not So Magnificent": -0.5,
  "Should You Forget Nvidia and Buy These 2 Artificial Intelligence (AI) Stocks Instead?": 0.5,
  "Trump Says Microsoft, Big Tech Must Bear Data Center Power Bills, So Americans Don't 'Pick Up The Tab'": -0.5,
  "3 AI ETFs Poised for 100% Surge as Tech Revolution Accelerates": 0.8,
  "Condo Owner Says HOA Fining $500 A Month Over 'Loud' Floors Installed Before He Bought Unit—Claims 'Board Tyrant' Tried To Personally Rip Them Up": -0.8,
  "After Failed Hostile Takeover Bid, David Ellison's Paramount Skydance Sues Warner Bros. Over Netflix Deal": -0.6,
  "Nvidia vs. Alphabet: Which Is the Better AI Growth Stock for 2026?": 0.5,
  "Nvidia CEO delivers biblical-scale reality check on AI": 0.5,
  "BTS Kicks Off a 'New Era' in South Korea with World Tour - Agoda Reports 8x Increase in Searches to Goyang": 0.5,
  "TD Cowen Trims Strategy Price Target as Bitcoin Yield Outlook Softens": -0.5,
  "2 EV Stocks That Could Be Heading for $0, and 1 With Multibagger Potential Left": -0.5,
  "China drafting purchase rules for Nvidia H200 chips, Nikkei Asia reports": 0.1,
  "Judge Approves Saks Global DIP Financing Despite Amazon’s Effort to Delay": 0.2,
  "Inside the Mad Dash to Save Saks, America’s Last Luxury Retailer": 0.5,
  "Dow Jones Futures: Market Split With Tesla, Broadcom, AppLovin Key Losers; Nvidia Chipmaker Due": 0.1,
  "Can someone please help understand META? - Ok so I just be missing something obvious here but I don’t get the moat with this stock? 98% of their revenue comes from advertisement on their platforms. Not good. There is revenue growth but there’s only so many ads and so many people you can show ads to. Metaverse failed and they wasted $73B. Cool. Raybans are a bright spot but haven’t moved revenue all THAT much.": -0.7,
  "Apple drops a generous offer for creative users": 0.8,
  "[Latest] Global Body Armor Plates Market Size/Share Worth USD 4.1 Billion by 2034 at a 5.1% CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trends, Forecast, Segmentation, Growth Rate, Value, SWOT Analysis)": 0.5,
  "Indigo to Sell 2.85 Million Tonnes of Carbon Removal to Microsoft, Supporting Soil Health Through Regenerative Agriculture": 0.8,
  "5 Reasons to Buy Alphabet (Google) Stock Like There's No Tomorrow": 0.8,
  "AI Can Unlock $4.5 Trillion in U.S. Labor Productivity Today, Reveals Cognizant's Latest \"New Work, New World 2026\" Report": 0.8,
  "Microsoft in record deal for soil carbon credits as data centres surge": 0.5,
  "TSMC Q4 profit jumps 35% to record, beats expectations": 0.8,
  "Amazon Blasts Saks Funding Deal, Says Equity Is ‘Worthless’": -0.8,
  "TSMC fourth-quarter profit leaps to record driven by AI boom": 0.8,
  "UK rents expected to rise 2% in 2026 amid 'chronic' housing shortage": -0.7,
  "First-time buyers save an average of £22,900 by negotiating prices": 0.8,
  "CapaSystems Unveils CapaOne, a Cloud-Based Unifie Endpoint Management Platform Built to Extend Microsoft Intune": 0.2,
  "TSMC Ends 2025 With a Bang as AI Keeps Boosting Profits": 0.8,
  "TSMC Quarterly Revenue US $33.73 billion (up 25.5% YoY) - **TSMC Q4 2025 Quarterly Results** Revenue = US $33.73 billion (up 25.5% YoY) * *Guidance was US $32.2 to US $33.4 billion* Gross Margin = 62.3% (up 5.6% YoY) * *Guidance was 59% to 61%* Net Income = US $16.29 billion (up 40.6% YoY) * *Net Profit Margin = 48.3% (up 12.1% YoY)* Earnings Per Share = US $0.63 (up 40% YoY) Free Cash Flow": 0.8,
  "AI Bonds Could Devour Credit Markets. Let Stock Investors Take the Risk.": 0.1,
  "Taiwan's TSMC logs net profit jump on AI boom": 0.6,
  "AWS Launches AWS European Sovereign Cloud and Announces Expansion Across Europe": 0.5,
  "Keurig Dr Pepper Launches Offer for JDE Peet's Shares": 0.5,
  "Is Cocoa Inflation Forcing Mondelez (MDLZ) To Rethink Its Pricing Power And Brand Playbook?": 0.1
}