{
  "Cognizant enters five-year IT services agreement with ERIKS": 0.2,
  "Will Leadership Shift and New Perks Strategy Change T-Mobile US' (TMUS) 5G Growth Narrative?": 0.2,
  "FDA ‘proactively’ hands J&J a voucher; Pfizer issues 2026 forecasts": 0.0,
  "Intel Names Trump Economic Adviser to Lead Government Affairs": 0.1,
  "FTC claimed Walmart got unfair pricing advantages from PepsiCo": -0.6,
  "Institutional shareholders may be less affected by Cadence Design Systems, Inc.'s (NASDAQ:CDNS) pullback last week after a year of 2.3% returns": 0.5,
  "Maersk, Hapag-Lloyd drop US East Coast city from trans-Atlantic services": -0.5,
  "Bull of the Day: Marvell Technology (MRVL)": 0.5,
  "3 Stocks Estimated To Be Trading At Discounts Of Up To 21.1%": 0.5,
  "The Kraft Heinz Company Names Steve Cahillane Chief Executive Officer": 0.5,
  "OmniTRAX CEO Dean Piacente Announces Retirement, Shifts Focus to Company's East Region Growth Strategy as OmniTRAX Board Member": 0.5,
  "Pfizer Adds to Its Big Bet on Weight Loss Drugs": 0.5,
  "Assessing Alnylam Pharmaceuticals’ (ALNY) Valuation After Its Inclusion in the Nasdaq 100 Index": 0.2,
  "PepsiCo rejigs exec team to “accelerate growth”": 0.5,
  "Here’s What Boosted ASML Holding N.V. (ASML) in Q3": 0.5,
  "Jefferies maps 2026 software winners and laggards as AI fears ease": 0.5,
  "3 Dividend-Paying Artificial Intelligence Stocks to Buy in 2026": 0.5,
  "Beyond Oil Strengthens Leadership With Appointments of Giora Bardea and Daniel Birnbaum to Advisory Board": 0.6,
  "DataLane Secures $27M to Deliver Identity Graph of 20M Local Businesses": 0.5,
  "Home Screen Ads Boost Advertiser Outcomes According to Xumo Report": 0.5,
  "Tom McCarthy joins Prezent AI to bring AI-powered Communication Coaching Avatars to Enterprise Professionals": 0.5,
  "Baker Hughes, Hunt Oil Sign Framework to Extend Life of Mature Oil Fields": 0.5,
  "G-P Joins Workday Agent Partner Network": 0.5,
  "An Insider At Old Dominion Freight Line Lowered Their Holding Recently": -0.5,
  "Alnylam Announces Health Canada Approval of AMVUTTRA® (vutrisiran), the First and Only RNAi Therapeutic for the Treatment of Cardiomyopathy in Adult Patients with ATTR Amyloidosis": 0.8,
  "Top 6 chip stocks to buy for 2026, according to this semiconductor analyst": 0.5,
  "ADP National Employment Report Preliminary Estimate November 29, 2025": 0.0,
  "Dux Launches from Stealth With $9M Seed Round to Bring Agentic Exposure Management to Modern Cyber Defense": 0.6,
  "Kraft Heinz hires ex-Kellanova chief as new CEO": 0.2,
  "GILD's Bictegravir and Lenacapavir Regimen for HIV Meets Primary Goal": 0.8,
  "Infragistics Makes Ignite UI Open Source": 0.5,
  "Fortinet Delivers Isolated Infrastructure Acceleration for the AI Factory with NVIDIA": 0.5,
  "Charlotte, Tampa Among CoStar’s List of Top-Performing Retail Markets in 2025": 0.8,
  "Eastman, AstraZeneca, Kraft Heinz, and P&G Recognized with OMP Supply Chain Awards": 0.5,
  "Investors Heavily Search Cadence Design Systems, Inc. (CDNS): Here is What You Need to Know": 0.5,
  "Datadog, Inc. (DDOG) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Investors Heavily Search QUALCOMM Incorporated (QCOM): Here is What You Need to Know": 0.5,
  "PDD Holdings Inc. Sponsored ADR (PDD) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Here Are Tuesday’s Top Wall Street Analyst Research Calls: Allstate, Chubb Ltd., Eli Lilly, KLA Corp., Lockheed Martin, MongoDB, Roku, and More": 0.2,
  "3 Healthcare Giants Just Raised Dividends—Here’s Who Pays the Most": 0.5,
  "5 High-Risk, High-Reward Biotech Breakthrough Stocks to Watch in 2026": 0.5,
  "Kraft Heinz taps new CEO, PayPal files for US bank charter": 0.5,
  "Strength in Software & Services Unit Drives Axon: Can It Sustain?": 0.5,
  "Cisco Trades Near 52-Week High: Buy, Sell or Hold the Stock in 2026?": 0.2,
  "Trinity Hills Valley, S.A. Signs Franchise Agreement with Marriott International for Tribute Portfolio Hotel and Residences at Surf Lagoon-Anchored Resort in Panama": 0.5,
  "Is PepsiCo's Innovation Pipeline Strong Enough to Reaccelerate Growth?": 0.2,
  "Is Union Pacific’s Proposed Merger the Best Way to Speed Up Deliveries?": 0.2,
  "Costco downgraded, Dollar General upgraded: Wall Street’s top analyst calls": 0.2,
  "Trump Trade: Infosys to be impacted by Trump’s $100K H-1B worker fee": -0.6,
  "Is ASML Holdings a Buy?": 0.0,
  "MRVL Strengthens AI Connectivity Stack: More Upside Ahead?": 0.6,
  "AI boom seen lifting chipmaking equipment sales 9% to $126 billion in 2026": 0.6,
  "1 Growth Stock I'd Buy Before PDD In 2026": 0.2,
  "Fermi (FRMI) Nosedives 15% as Partner Withdraws from Deal": -0.8,
  "Kraft Heinz Picks New CEO Ahead of Split": 0.5,
  "ATL's hospitality could make millions during World Cup. Want a piece?": 0.5,
  "3 Nuclear Energy Stocks to Buy Before 2026": 0.5,
  "LightHeaded Helmets Debuts First-of-Its-Kind Luxury Memorabilia as Official Sponsor of the 2026 Madden Bowl and EA SPORTS™ College Football 26": 0.8,
  "A year on from ‘drill, baby, drill’, why are there fewer oil rigs in the US?": -0.5,
  "AZN, Daiichi's Enhertu Gets FDA Nod for First-Line Breast Cancer": 0.5,
  "13 Investment Must Reads for This Week (Dec. 16, 2025)": 0.0,
  "How Analysts See the Story Behind Electronic Arts Shifting After the Take Private Offer": 0.2,
  "Should Jefferies’ Downgrade and Earnings Reassessment Require Action From Automatic Data Processing (ADP) Investors?": 0.1,
  "Can Fortinet Stock Sustain Momentum With Strong Unified SIEM Adoption?": 0.5,
  "Can Intel's AI Focus Restore Its Competitive Edge & Boost Shares?": 0.5,
  "Nvidia and Broadcom Are Wall Street's Top Chip Picks for 2026": 0.6,
  "BIC: Evolution of Société BIC’s Board of Directors composition": 0.0,
  "Pepsi Worked to Keep Prices Higher at Retailers to Protect Walmart, FTC Found": -0.6,
  "Top Midday Stories: Pfizer Falls Following 2026 Outlook; Netflix-iHeartMedia Exclusive Deal; Apple's Possible iPhone Lineup Expansion": 0.2,
  "Does ADP’s Recent Share Price Weakness Present a Long Term Opportunity in 2025?": 0.2,
  "Assessing Workday After Recent Pullback and Strong Enterprise Cloud Expansion in 2025": 0.6,
  "Earnings Estimates Moving Higher for Analog Devices (ADI): Time to Buy?": 0.6,
  "Kraft Heinz taps former Kellogg chief as its CEO as it prepares to split into 2 companies": 0.5,
  "Zscaler shares ’now too attractive to ignore’ – Mizuho": 0.8,
  "Kraft Heinz Chooses New CEO for Breakup. Can He Fix a Broken Stock?": -0.5,
  "Discover December 2025's Top Stocks Estimated Below Intrinsic Value": 0.5,
  "ARM Stock Declines 13% in a Year: Should You Buy the Dip?": 0.2,
  "KLA (KLAC): Assessing Valuation After a 2.61% Daily Gain and Strong Year-to-Date Rally": 0.6,
  "Update: Xcel Energy Sued by Texas Attorney General for Allegedly Causing Smokehouse Creek Fire": -0.8,
  "Sector Update: Energy Stocks Decline Tuesday Afternoon": -0.5,
  "NRC Renews Operating Licenses for Clinton & Dresden; Constellation Investing $370 Million in State-of-the-Art Upgrades to Keep These Illinois Nuclear Facilities Online, Meet Rising Power Demand and Support Economic Growth": 0.8,
  "Rolling Out Relief: Operation Homefront and CSX Ease Transportation and Housing Burden for Military Families Across 26 States": 0.8,
  "JPMorgan Lifts AEP Price Target Following Utility Sector Model Update": 0.5,
  "Xcel Energy Uses Oracle Platform for Personalized Customer Service": 0.5,
  "How A Sharp Jump In US H‑1B Visa Fees At Cognizant (CTSH) Has Changed Its Investment Story": 0.2,
  "Amgen (AMGN) Price Target Trimmed at Morgan Stanley as Policy Risks Ease": 0.5,
  "Honeywell (HON): Valuation Check After Indra Nooyi Joins the Board of Directors": 0.5,
  "PepsiCo (PEP) Gets Price Target Lift at Barclays as 2026 Outlook Comes Into Focus": 0.5,
  "AI Runs on Power—And Constellation Energy Controls the Switch": 0.2,
  "UBS Lifts Analog Devices (ADI) Target, Keeps Buy Rating": 0.6,
  "T-Mobile launches free offer for customers after major loss": 0.2,
  "These Are The 5 Best Stocks To Buy Now Or Watch": 0.5,
  "How Investors May Respond To KLA (KLAC) Analyst Upgrades Tied To AI‑Driven Chipmaking Demand": 0.5,
  "75-year-old fast food chain closing 200 restaurants, fights to survive": -0.6,
  "Pfizer outlook, Humana leadership shake-up, Kraft Heinz's new CEO": 0.0,
  "Discount Retailers to Continue Outperforming Department Stores, UBS Says": 0.8,
  "Port Of Los Angeles 'Feeling OK' About 2026 After 'Roller Coaster' First Year Of Trump's Trade War": 0.2,
  "Why Microchip Technology (MCHP) Stock Is Down Today": -0.5,
  "Kraft Heinz gets a new CEO ahead of company split: Can Steve Cahillane turn around the ailing food giant?": 0.2,
  "Broadcom Stock Got Stomped. Why It’s Still J.P. Morgan’s Top Chip Pick.": 0.5,
  "Top Stock Reports for Amazon.com, Toyota Motor & Intuit": 0.5,
  "AI Partnerships Versus Slowing HCM Growth Might Change The Case For Investing In Workday (WDAY)": 0.2,
  "AI-era cyberattacks are 'so dangerous,' CrowdStrike pres. explains": 0.2,
  "Fortinet (FTNT) Gains As Market Dips: What You Should Know": 0.5,
  "Is Constellation Energy Stock a Buy Now?": 0.2,
  "Stock Market Today, Dec. 16: Comcast Jumps on Activist Investor Speculation": 0.5,
  "Tata and Infosys to Bear Brunt of Trump’s $100,000 H-1B Worker Fee": -0.7,
  "Datadog (DDOG) Valuation Check After a 24% One-Month Share Price Slide": -0.5,
  "Tracking the Evolving Narrative for Monolithic Power Systems After Fresh AI Fueled Optimism": 0.6,
  "Has Thomson Reuters Pullback Created an Opportunity for Long Term Investors in 2025?": 0.5,
  "Kraft Heinz names former Kellogg CEO to helm Chicago packaged food giant ahead of planned split next year": 0.5,
  "(Item 8.01) . Other Events On December 17, 2025, Constellation Energy Corporation (the Company) learned the results of the PJM capacity auction for the 2027-2028 planning year. Each of the Company's power plants located in the PJM market cleared in the auction. The cleared volumes for RTO and MAAC include winter-only resources. Capacity revenues for nuclear units are included in the gross receipts calculation for the Production Tax Credit. The auction results take effect June 1, 2027.": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (d) Election of New Director On December 17, 2025, the Board of Directors (the “Board”) of Xcel Energy Inc. (“Xcel Energy”) elected Maria Demaree, 57, to begin serving on the Board effective immediately. Ms. Demaree was appointed to serve on the Board’s Audit Committee and Operations, Nuclear, Environmental and Safety Committee. The Board determined that Ms.": 0.1,
  "(ITEM 8.01) — Other Events. On December 17, 2025 , the Company issued a press release announcing topline efficacy and safety results from the Phase 2b BiRCh study of brensocatib for patients with CRSsNP. The BiRCh study was a randomized, double-blind, parallel-group, placebo-controlled, multicenter study to evaluate the efficacy and safety of brensocatib compared to placebo. The study was conducted at 104 sites globally, and a total of 288 patients were randomized 1:1:1 to receive either brensocatib": 0.5,
  "(Item 2.02) . Results of Operations and Financial Condition. On December 17, 2025 , Micron Technology, Inc. (the \"Company\", \"we\" or \"our\") announced the financial results for our first quarter of fiscal 2026 ended November 27, 2025. The full text of the press release issued in connection with the announcement is attached as Exhibit 99.1 to this Current Report on Form 8-K. The information in\n\n(Item 2.02) and Exhibit 99.1 of this Current Report on Form 8-K shall not be deemed \"filed\" for the purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), or otherwise subject to the liabilities of that section. The information in\n\n(Item 2.02) and Exhibit 99.1 of this Current Report on Form 8-K shall not be incorporated by reference into any filing or other document pursuant to the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such filing or document.": 0.0,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Amendment and Restatement of the Cisco Systems, Inc. 2005 Stock Incentive Plan At the Annual Meeting of Stockholders (the “Meeting”) of Cisco Systems, Inc. (“Cisco”) held on December 16, 2025, Cisco’s stockholders approved the amendment and restatement of the Cisco Systems, Inc. 2005 Stock Incentive Plan (as amended and restated, the “Amended Stock Plan”). The Amended\n\n(Item 5.07) . Submission of Matters to a Vote of Security Holders. At the Meeting, Cisco’s stockholders voted on the following five proposals and cast their votes as follows: Proposal 1: To elect nine members of the Board: Nominee For Against Abstained Broker Non-Votes Michael D. Capellas 2,664,285,240 230,015,669 4,601,262 426,487,003 Mark Garrett 2,823,986,851 70,328,089 4,587,231 426,487,003 John D. Harris II 2,873,216,583 20,988,282 4,697,306 426,487,003 Dr. Kristina M. Johnson 2,808,353,781 86,251,768 4,296,622 426,487,003 Sarah Rae Murphy 2,886,367,216": 0.1,
  "Stock Market Today, Dec. 16: Energy Stocks Slide as Oil Drops to Multi-Year Lows": -0.8,
  "Review & Preview: A Data Washout": -0.5,
  "The list of major companies laying off staff this year includes Verizon, IBM, Amazon, Starbucks, American Airlines, and more": -0.7,
  "Corrections & Amplifications": 0.0,
  "How AI Driven Upgrades Are Rewriting the Story for KLA": 0.5,
  "Reassessing Thomson Reuters (TSX:TRI) Valuation After Its Recent Share Price Slide": 0.2,
  "Stock Market News: New York City gets casinos, Palantir and Databricks": 0.2,
  "Airbnb (ABNB) Is Up 5.3% After Analyst Upgrade Highlights Bookings Rebound Amid Spain Fine": 0.6,
  "Spotting Winners: Keurig Dr Pepper (NASDAQ:KDP) And Beverages, Alcohol, and Tobacco Stocks In Q3": 0.5,
  "Reassessing Workday (WDAY) Valuation After Earnings Beat and Sharp Post-Results Share Price Drop": 0.2,
  "Has Electronic Arts Stock Run Too Far After Its 40% 2025 Rally?": -0.5,
  "1 Large-Cap Stock Worth Your Attention and 2 Facing Challenges": 0.2,
  "2 S&P 500 Stocks with Promising Prospects and 1 We Ignore": 0.5,
  "3 S&P 500 Stocks with Questionable Fundamentals": -0.5,
  "GE HealthCare and Indonesia’s Ministry of Health to expand access to quality care through the provision of 300+ advanced CT scanners": 0.8,
  "Why Analysts Have High Hopes For Booking Holdings Inc. (BKNG)": 0.6,
  "JDE Peet’s transfers shares to participants under its employee incentive plans": 0.2,
  "Is Marriott (MAR) Quietly Repositioning Its Brand With Luxury Experiences And Franchised Expansion?": 0.5,
  "Freedom Capital Reiterates Buy on Zscaler (ZS) After Strong Q1 Results": 0.8,
  "William Blair Reiterates Outperform on ARM, Citing Long-Term AI Tailwinds": 0.8,
  "Hong Kong Disneyland Crowned as Most-Searched Activity on Agoda in 2025": 0.8,
  "Is It Too Late To Consider Monolithic Power After Its Huge AI Powered Share Price Surge": 0.2,
  "The Zacks Analyst Blog Amazon, Toyota, Intuit, Eastman and Armanino": 0.0,
  "Blood Glucose Monitor Market Set to Reach USD 25.4 Billion by 2030 with a CAGR of 9.1%": 0.5,
  "The New Tech Dividend King Poised for Explosive Growth": 0.8,
  "Zacks.com featured highlights include QuantumScape, Adobe and Silicon Laboratories": 0.2,
  "US Stock Market Today: S&P 500 Futures Edge Higher as Global Rate Cut Hopes Build": 0.6,
  "Why Charter Communications, Inc. (NASDAQ:CHTR) Could Be Worth Watching": 0.5,
  "Estimating The Intrinsic Value Of Marvell Technology, Inc. (NASDAQ:MRVL)": 0.2,
  "Blue Bottle Fever? China’s Luckin Coffee Weighs Offer for California Chain": 0.2,
  "3 Stocks Estimated To Be Trading At Discounts Of 23.8% To 35.3%": 0.5,
  "US High Growth Tech Stocks To Watch December 2025": 0.5,
  "Nuvectis Pharma Announces the Initiation of the Phase 1b Study of NXP900 in Combination with Osimertinib in Patients with NSCLC": 0.5,
  "Compugen Monetizes Portion of Rilvegostomig Future Royalties to AstraZeneca for Up to $90 Million": 0.8,
  "Baker Hughes to Supply Advanced Artificial Lift Solutions to Enhance Production in Kuwait Oil Company Fields": 0.8,
  "How to Buy CSCO for a 2.5% Discount, or Achieve a 19% Annual Return": 0.5,
  "AI Chips Can’t Exist Without These 2 Underrated Tech Giants": 0.5,
  "Is CoStar Group Fairly Priced After a 30% Five Year Share Price Slide?": -0.5,
  "Old Dominion price target raised to $173 from $160 at Stifel": 0.5,
  "Renowned AI Expert Xi Chen Joins Compass Lexecon": 0.5,
  "Alnylam to Invest $250 Million to Add Enzymatic Ligation Platform to U.S. Manufacturing Facility to Meet Growing Global Demand for RNAi Therapeutics": 0.8,
  "Is Exelon (NASDAQ:EXC) Using Too Much Debt?": -0.5,
  "Mondelez International, Inc. (MDLZ) Makes Jefferies’ Preferred Picks List in Food Sector": 0.5,
  "Form 8.3 - Qualcomm Incorporated": 0.0,
  "Here’s Why Platinum International Technology Fund Increased Its Stake in Intuitive Surgical (ISRG)": 0.5,
  "Here’s What Hit Intuitive Surgical (ISRG) in Q3": 0.0,
  "What Makes Axon Enterprise (AXON) a Strong Investment?": 0.6,
  "3 Top-Ranked AI-Driven Computer Storage Devices Stocks to Buy for 2026": 0.5,
  "Airbnb is ’an increasingly attractive brand monetization story’ says RBC": 0.6,
  "Fortinet vs. Cisco: Which Cybersecurity Leader Has the Edge Now?": 0.5,
  "Can AI-Driven Foundry Demand Drive LRCX's Systems Revenue Growth?": 0.2,
  "Here Are Wednesday’s Top Wall Street Analyst Research Calls: Ally Financial, CyberArk, Fortinet, Robinhood Markets, Salesforce, ServiceNow, Procter & Gamble, and More": 0.5,
  "From the Boardroom to the Community: Cause Strategy Partners Launches Global Expansion to Fuel the Next Generation of Nonprofit Leaders": 0.5,
  "Marriott International Celebrates 100 Signings for City Express by Marriott in the U.S. and Canada": 0.6,
  "Fortinet and Arista Networks Announce Joint Secure AI Data Center Solution": 0.5,
  "Vaso Corporation Announces Fifth Extension of Sales Representation Agreement with GE HealthCare": 0.5,
  "Athletic Brewing Company Relaunches \"Athletic January\" Campaign, Making Modern Moderation More Accessible": 0.5,
  "Investors Heavily Search Amgen Inc. (AMGN): Here is What You Need to Know": 0.5,
  "Starbucks Corporation (SBUX) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "WDC Bets on Sustained AI Growth With Higher Shareholder Returns": 0.8,
  "Booking Holdings (BKNG): Valuation Check After Strong Q3 2025 Results and New viagogo Partnership": 0.6,
  "How China built its ‘Manhattan Project’ to rival the West in AI chips": 0.5,
  "Do You Believe in the Growth Potential of Adobe (ADBE)?": 0.5,
  "Comparably Announces 2025 Best Compensation, Best CEO’s and Best Company Culture Awards": 0.5,
  "Gas Detection Market Forecast to Reach USD 5.18 Billion by 2030: Market Insights and Growth Drivers": 0.6,
  "Spotify initiated, Airbnb upgraded: Wall Street's top analyst calls": 0.5,
  "Can Falcon Flex Become CrowdStrike's Most Important Growth Engine?": 0.5,
  "Here's Why Take-Two Interactive (TTWO) is a Strong Growth Stock": 0.8,
  "HRSoft Joins the Workday Partner Program, Expanding Compensation Capabilities for Financial-Services Organizations": 0.5,
  "Company News for Dec 17, 2025": 0.0,
  "Western Digital Surges 195% in 6 Months: What Should Investors Do Now?": 0.5,
  "PARAMOUNT AFFIRMS COMMITMENT TO SUPERIOR $30 PER SHARE ALL-CASH OFFER FOR WARNER BROS. DISCOVERY": 0.6,
  "Megadeal wave propels global M&A to near-record high in 2025": 0.8,
  "Sterling Organization Acquires Bristol Plaza, a Premier Grocery-Anchored Shopping Center in Hartford, CT MSA, for $44 Million": 0.5,
  "Tax Provision Software Reimagined: PowerPlan Launches New Cloud Solution": 0.5,
  "Generative AI is supercharging hackers' abilities": 0.6,
  "Fortinet (FTNT): Reassessing Valuation After A Mixed Share Price Performance This Year": 0.1,
  "This Under-the-Radar Stock Is Crushing the Market in 2025 and Is Joining the Nasdaq-100 Next Week. Should You Buy Shares Now?": 0.6,
  "Amazon in Talks Over $10 Billion OpenAI Move: Report. That’s Bad for Nvidia, Broadcom.": -0.6,
  "Visionary Marketing Executive Kristine Kobe Joins S4 Capital's Monks as EVP, Global Client Leader": 0.8,
  "Can Datadog's Strong Enterprise Base Drive the Next Growth Phase?": 0.5,
  "Is Fortinet Fairly Priced After a Choppy Year and Modest DCF Upside?": 0.1,
  "IT Hardware Sector Faces Cyclical Challenges in 2026, Opportunities Remain, Morgan Stanley Says": 0.5,
  "Brawls, Raids, and Layoffs: Inside PDD's Explosive Clash with Regulators": -0.7,
  "Airbnb Seen as 'Attractive' Brand Monetization Story, RBC Says": 0.6,
  "Fortinet Gets J.P. Morgan Downgrade on Rising Competition": -0.5,
  "Here's Why You Should Hold DexCom Stock in Your Portfolio for Now": 0.6,
  "Comcast (CMCSA) Grows 5% on Connecticut Expansion": 0.6,
  "All You Need to Know About Cognizant (CTSH) Rating Upgrade to Buy": 0.6,
  "GEHC Expands Healthcare Access Through Indonesia MoH Partnership Deal": 0.6,
  "A Subpar Year for Software Stocks. 3 Charts Point to a Turnaround.": 0.5,
  "AppLovin Continues to Lead in Mobile Game Advertising, Unity Software Stabilizes, Wedbush Says": 0.5,
  "Assessing American Electric Power After Its Strong 2024 Rally and Dividend Outlook": 0.5,
  "ALAB Benefits From Strong Connectivity Demand: A Sign for More Upside?": 0.6,
  "Oracle, Google CEO Sundar Pichai, Cognizant, and Figma Lead Top Honors as AI Cloud, Model Innovation, and Autonomous Apps Dominate Constellation Research's 2025 Enterprise Awards": 0.6,
  "Nasdaq Slides. Why AI Stocks Are Falling Again.": -0.5,
  "Jim Cramer Says T-Mobile (TMUS) Is “Part of the Musk Radiation Zone”": -0.5,
  "December 2025's Top Stocks Estimated Below Intrinsic Value": 0.2,
  "Exploring Three High Growth Tech Stocks In The US Market": 0.5,
  "The AI Power Trade Is Getting Tricky. Stocks to Consider in 2026.": 0.1,
  "Cognizant Stock Rallies on Strong AI Push, Expanding Clientele": 0.8,
  "How These 2 Stocks Won 2025's AI Race—And What's In Store for 2026": 0.5,
  "Assessing Xcel Energy’s Valuation After Recent Pullback and Grid Modernization Push": 0.5,
  "Conduit Power to Develop 200 MW of Distributed Generation in ERCOT; Secures Diamondback Energy and Granite Ridge Resources as Financial Partners": 0.5,
  "Siemens unveils lineup for CES 2026 keynote": 0.2,
  "Honeywell (HON) Positioned for Earnings Momentum Into FY26, Says Evercore": 0.6,
  "Seagate Stock Is Up 225% in 2025. 1 Reason to Buy Shares Before December 22.": 0.6,
  "Gold Hits Record as Bitcoin, AI Stocks Slide": -0.5,
  "Airbnb Passed, Expedia Pounced: Inside Tiqets’ Long Road to a Sale: Scoop": 0.1,
  "T-Mobile rolls out a free perk for loyal customers": 0.8,
  "Equity Markets Fall Intraday as Tech Sector Slides": -0.7,
  "Does AEP’s US$72 Billion Grid Expansion And Data Center Focus Change The Bull Case For AEP?": 0.2,
  "Has Analog Devices’ 110% Five Year Surge Left Much Upside at $278?": 0.2,
  "HSBC Turns More Bullish on Amgen (AMGN) into 2026": 0.6,
  "Beneficial Weather in West Africa Weighs on Cocoa Prices": -0.7,
  "AI-Development Spending Is Huge. Why Few Organizations Are Using It.": -0.5,
  "ChatGPT Thinks Datadog Stock Will Close At This Price By The End of 2025": 0.2,
  "Comcast to Host Fourth Quarter and Full Year 2025 Earnings Conference Call": 0.0,
  "ChatGPT Thinks CrowdStrike Stock Will Close At This Price In The Next 60 Days": 0.2,
  "NORWEGIAN CRUISE LINE® UNVEILS SUN-SOAKED WINTER 2027/28 DEPLOYMENT AND BRINGS BACK FREE AT SEA PLUS™ BY POPULAR DEMAND DELIVERING PREMIUM OFFERINGS": 0.5,
  "Axon Enterprise (AXON): Revisiting Valuation After Prepared Acquisition and Strong Public-Safety Growth Narrative": 0.6,
  "How Recent Developments Are Reshaping The CSX Investment Story": 0.5,
  "Better AI Stock: ASML vs. Nvidia": 0.5,
  "Xcel Energy Inc. Board Declares Dividend on Common Stock": 0.5,
  "Sector Update: Tech Stocks Fall Late Afternoon": -0.5,
  "T-Mobile to Host Capital Markets Day Update as Part of its Q4 and Full Year 2025 Earnings Call, Now on February 11, 2026": 0.0,
  "Insmed Provides Clinical and Business Update": 0.0,
  "Bank of America sets AI stocks to buy list for 2026": 0.5,
  "Xcel Energy Elects Maria Demaree to Board of Directors": 0.5,
  "Evaluating Qualcomm (QCOM)’s Valuation After Its Recent Multi-Month Share Price Gains": 0.5,
  "Who matters in the battle for Warner Bros?": 0.0,
  "DoorDash Launches Grocery Shopping App Within ChatGPT": 0.2,
  "Nasdaq Composite Logs Worst Day in Nearly 4 Weeks Amid Tech Selloff": -0.7,
  "American Electric Power (AEP): Reassessing Valuation After a Recent Pause in Share Price Momentum": 0.2,
  "Amgen (AMGN) Valuation Check After FDA Expansion of UPLIZNA in Generalized Myasthenia Gravis": 0.5,
  "Electricity Auction Highlights Soaring Prices, Reliability Worries": -0.6,
  "Texas Instruments (TXN) Declines More Than Market: Some Information for Investors": -0.5,
  "Vertex Pharmaceuticals (VRTX) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Gilead Sciences (GILD) Increases Despite Market Slip: Here's What You Need to Know": 0.5,
  "Why the Market Dipped But Comcast (CMCSA) Gained Today": 0.2,
  "KLA (KLAC) Dips More Than Broader Market: What You Should Know": -0.2,
  "The Bull Case For Applied Materials (AMAT) Could Change Following Steady Dividend Amid AI Weakness": 0.5,
  "Here's Why NXP Semiconductors (NXPI) Fell More Than Broader Market": -0.5,
  "Stock Market Today, Dec. 17: Comcast Jumps Again on Activist Investor Buzz and Versant Spinoff": 0.5,
  "DoorDash Teams Up With OpenAI to Offer Grocery Shopping in ChatGPT": 0.5,
  "(Item 2.02) . Results of Operations and Financial Condition. On December 18, 2025, Cintas Corporation issued a press release announcing its financial results for the quarter ended November 30, 2025. A copy of the press release is furnished as Exhibit 99 to this Current Report on Form 8-K and is incorporated herein by reference.": 0.0,
  "(Item 8.01) Other Events On December 18, 2025, Axon Enterprise, Inc. (the “Company”) delivered a notice of redemption in respect of the Company’s 0.50% convertible senior notes due 2027 (the “Notes”). Pursuant to the notice of redemption, the Company has elected to redeem all of the outstanding Notes on February 10, 2026 (the “Redemption Date”), at a redemption price equal to 100% of the principal amount of the Notes to be redeemed, together with accrued and unpaid": -0.2,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Effective January 1, 2026, Brian E. Miller, Ph.D., will transition from his role as Chief Digital Officer of Intuitive Surgical, Inc. (the “Company”) and begin serving as Head of Digital and AI Strategy of the Company. In this role, Dr. Miller will no longer be reporting directly to the Company’s Chief Executive Officer.": 0.1,
  "Bupa Hong Kong has selected Cognizant to deliver an AI-driven BPaaS solution to transform health insurance claims": 0.6,
  "How Indonesia’s SIHREN CT Deal And New Financing At GEHC Have Changed Its Investment Story": 0.5,
  "Fortinet’s AI Data Center Partnerships Versus J.P. Morgan Downgrade Might Change The Case For Investing In Fortinet (FTNT)": 0.2,
  "Does Gilead Still Offer Value After Its 2025 Surge and Pipeline Progress?": 0.2,
  "Looking at the Narrative for GE HealthCare as Margin Execution and Tech Upside Reshape Expectations": 0.5,
  "KIOXIA SSDs Achieve Compatibility with Microchip’s Adaptec® SmartRAID 4300 Series RAID Storage Accelerator": 0.5,
  "Is T-Mobile (TMUS) Undervalued After Recent Share Price Weakness? A Closer Look at Its Valuation": 0.5,
  "Q3 Earnings Outperformers: Kraft Heinz (NASDAQ:KHC) And The Rest Of The Shelf-Stable Food Stocks": 0.5,
  "2 Reasons to Watch VRTX and 1 to Stay Cautious": 0.5,
  "Gilead Sciences (GILD) Valuation After Positive Phase 3 Data for Its Bictegravir–Lenacapavir HIV Regimen": 0.6,
  "3 Software Stocks with Open Questions": -0.5,
  "3 Growth Stocks with Explosive Upside": 0.8,
  "1 Semiconductor Stock on Our Buy List and 2 We Ignore": 0.2,
  "1 Momentum  Stock with Impressive Fundamentals and 2 We Brush Off": 0.5,
  "Benchmark Raises PT on AppLovin (APP) Stock": 0.5,
  "Is Microsoft Corporation (MSFT) One of Billionaire David Tepper’s Top Stock Picks Heading into 2026?": 0.2,
  "PDD Holdings Inc. (PDD) is a Buy on Robust Temu Business and Europe Growth": 0.8,
  "Is Intuit the Best FinTech Stock to Buy in 2026?": 0.5,
  "DATROWAY® Type II Variation Application Validated in the EU as First-Line Treatment for Patients with Metastatic Triple Negative Breast Cancer Who are Not Candidates for Immunotherapy": 0.6,
  "Xcel Energy (XEL) Valuation Check as Texas Wildfire Lawsuit and Bond Tender Reshape Investor Expectations": 0.2,
  "Applied Materials: Engineering the AI Backbone": 0.5,
  "How Investors May Respond To Intuit (INTU) AI Partnership Progress And Softer Margin Guidance": 0.1,
  "Will Arm (ARM) China’s New AI Hub Clarify or Complicate Its Long-Term Monetization Story?": 0.2,
  "Prediction: Wall Street's Most Unique Member of the \"Magnificent Seven\" Will Become the Hottest Stock-Split Stock of 2026": 0.8,
  "Takeda says $4B TYK2 drug succeeds in large psoriasis studies": 0.8,
  "Stablecoin Monthly Adjusted Volume Surpasses Visa and PayPal": 0.8,
  "ESW and Scholl Partner to Accelerate Cross-Border Ecommerce Expansion Across 50+ Markets": 0.6,
  "Marriott reaches 100 signings for City Express brand in US and Canada": 0.5,
  "Alnylam plans $250m investment in Norton manufacturing facility, US": 0.5,
  "How Is CrowdStrike’s Stock Performance Compared to Other Software Stocks?": 0.0,
  "Qualcomm Completes Acquisition of Alphawave Semi": 0.5,
  "Evercore Sticks With Bullish Call on Fermi Inc. (FRMI)": 0.6,
  "Intuit CEO says Gen Z is staving off recession by putting it on plastic: ‘Credit card balances are up 36-37%, but they still have jobs’": 0.1,
  "Solstice Stock: Is SOLS Outperforming the Materials Sector?": 0.5,
  "A Billion-Dollar Question Hangs Over the New AI Search Marketing Industry": 0.2,
  "Insiders At Monster Beverage Sold US$4.3m In Stock, Alluding To Potential Weakness": -0.6,
  "Insmed’s ‘win streak’ ends as top drug fails study in chronic nasal condition": -0.8,
  "Activist investor wants Ralph Lauren veteran to lead Lululemon": 0.5,
  "Stocks Climb Before the Open on Micron Boost Ahead of U.S. Inflation Data": 0.6,
  "Hormel Foods Announces Appointment of Jason Levine to New Enterprise-wide Chief Marketing Officer Position": 0.5,
  "PepsiCo price target raised to $170 from $165 at Citi": 0.5,
  "PayPal dips after analyst downgrades the stock on these 4 factors": -0.6,
  "Paychex price target lowered to $126 from $137 at Stifel": -0.5,
  "3 Stocks Estimated To Be Up To 36.7% Below Intrinsic Value Offering Potential Opportunities": 0.6,
  "High Growth Tech Stocks To Watch In The US December 2025": 0.5,
  "Adobe price target raised to $387 from $366 at Citi": 0.5,
  "Applied Materials price target raised to $245 from $205 at Mizuho": 0.5,
  "Lam Research price target raised to $200 from $170 at Mizuho": 0.5,
  "PeptiDream and Alnylam Announce Achievement of Key Milestone in siRNA Conjugate Discovery Collaboration Demonstrating Peptide-Ligand Mediated Targeted siRNA Delivery to Specific Extrahepatic Tissues": 0.6,
  "Better Buy in 2026: Novo Nordisk or Intuitive Surgical?": 0.5,
  "Lululemon Faces Activist Pressure as Elliott Takes $1 Billion Stake": -0.5,
  "Insmed Stock Plummets 19%. This Is What Sparked the Selloff.": -0.6,
  "5 Dividends That Beat Social Security’s Unpredictable COLA Adjustments": 0.2,
  "CBMJ: The JD Rucker Show Returns to Patriot.TV - \"2026 Is a Pivotal Year for America\" - Reuniting Network with Flagship Voice Ahead of Defining Election Cycle": 0.6,
  "If GTA VI Delivers, Take-Two Could Hit $300 in 2026": 0.5,
  "E-Commerce Today - Akamai and Visa Team Up for Secure AI-Driven Commerce": 0.5,
  "The Chip Equipment Maker That Quietly Turned $1,000 Into $11,280 in a Decade": 0.8,
  "INSM Stock Plummets on Sinus Study Failure, Adds New Pipeline Asset": 0.2,
  "Big Tech-backed coalition supports biowaste carbon removal firm": 0.5,
  "Opendoor (OPEN) Slashes 9% on Market Pessimism, Leadership Changes": -0.6,
  "LUMN Surges 26% in the Past Year: Can It Sustain the Momentum in 2026?": 0.6,
  "Will Direct Distribution in Southern Europe Boost ISRG's Margins?": 0.2,
  "Gilead Sciences Appoints Keeley Wettan as Executive Vice President, General Counsel, Legal & Compliance": 0.5,
  "Buy 5 Non-Tech Nasdaq Stocks for 2026 That Helped It Surge in 2025": 0.2,
  "The 4 Highest-Yielding S&P 500 Utility Stocks Are Strong 2026 Buys After Big Pullback": 0.8,
  "Data, Collaboration and Flexibility: Visual Lease Data Institute Uncovers the Strategic Priorities Shaping 2026 for Finance and Real Estate Leaders": 0.5,
  "Leverage Shares by Themes expands its single stock Leveraged ETF suite to include NIO, SNAP, BIDU, CNC, KLAC, PBR, and VALE": 0.2,
  "CoStar Ranks Top U.S. Small-Bay and Big-Box Industrial Markets": 0.0,
  "SailPoint Announces Integrations with the CrowdStrike Falcon Platform": 0.5,
  "Cognizant and Microsoft Expand Partnership to Advance AI Transformation and Frontier Firm Experiences": 0.6,
  "THE SINGLETON FOUNDATION'S 2025 CEO PRIZE GIVES DONATIONS TO NYU STERN SCHOOL OF BUSINESS AND UCSF ON BEHALF OF THIS YEAR'S AWARDEES": 0.5,
  "Delayed Gift? DoorDash Saves the Day with its Holiday Gift Rescue": 0.6,
  "Amazon Business Prime Offers Small and Midsize Businesses Even More Value with New Benefits from Intuit QuickBooks, CrowdStrike, and Gusto": 0.6,
  "Hypori Launches New Global Partner Program to Help Transform Enterprise Mobility With New Next Gen BYOD Innovation": 0.8,
  "Here is What to Know Beyond Why Booking Holdings Inc. (BKNG) is a Trending Stock": 0.2,
  "Synopsys, Inc. (SNPS) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Investors Heavily Search ASML Holding N.V. (ASML): Here is What You Need to Know": 0.5,
  "Lionsgate Partners Exclusively with FreeWheel to Give Ad Buyers Direct Access to Its Premium FAST Inventory": 0.5,
  "Micron Technology Stock Soars 9% on Q1 Earnings Beat, Strong Guidance": 0.8,
  "Will EUV Adoption in Logic and DRAM Lift ASML's Margins Over Time?": 0.2,
  "This AI stock has shot up 55,000% in the past 2 years": 0.8,
  "Here’s Why Parnassus Value Equity Fund Sold Airbnb (ABNB)": 0.1,
  "Intuit’s Consumer Platform Powers the Future of Tax Filing: TurboTax and Credit Karma Launch \"Now This Is Taxes\" Highlighting Trusted Tax Experts and Maximized Refunds": 0.8,
  "Should You Invest in Cadence (CDNS) Based on Bullish Wall Street Views?": 0.5,
  "Micron upgraded, PayPal downgraded: Wall Street's top analyst calls": 0.2,
  "PayPal to use PYUSD stablecoin to fund AI infrastructure through USD.AI": 0.5,
  "Industrious Ventures Announces Appointment of Matt White, EVP & CFO of Linde, to Stoke Space's Board of Directors": 0.5,
  "Verisk Analytics (VRSK) Fell Following the Quarterly Results": -0.5,
  "Top Semiconductor Stocks for 2026 -- Nvidia and Broadcom Lead Chip Picks": 0.8,
  "DexCom (DXCM) Fell Due to Modest Guidance": -0.5,
  "Travel Demand Still Rising in 2026? 4 Stocks to Ride the Boom": 0.5,
  "Lovable valued at $6.6 billion in latest funding round as AI coding demand surges": 0.8,
  "Activist investor Elliott Management acquires $1bn Lululemon stake": 0.5,
  "Block's Ecosystem Expansion: Will Partnerships Boost Profitability?": 0.5,
  "Assessing ASML After 2025 Pullback and Mixed Signals from DCF and Earnings Multiples": 0.1,
  "Is Intuitive Surgical (ISRG) Still Undervalued After Its Recent 27% Three-Month Share Price Climb?": 0.2,
  "Comcast Completes Network Expansions to Unserved Residents and Businesses in Hopewell and Maurice River Townships, Cumberland County, NJ": 0.5,
  "Micron, GM, PayPal: Top Analyst Calls": 0.0,
  "PayPal CEO Alex Chriss says stablecoins will be key as his company navigates the ‘classic innovator’s dilemma’": 0.5,
  "What to Expect From Paychex's Q2 2026 Earnings Report": 0.1,
  "If You Own GIS Stock, You May Want to Sell and Buy This Instead": -0.6,
  "Shopify's Free Cash Flow Strength Supports Long-Term Growth, Oppenheimer Says": 0.8,
  "PayPal Slips After Morgan Stanley Downgrade on Growth, Execution Concerns": -0.6,
  "AppLovin (APP) Shares Skyrocket, What You Need To Know": 0.8,
  "Why Lam Research (LRCX) Stock Is Up Today": 0.5,
  "Why Shopify (SHOP) Stock Is Up Today": 0.5,
  "Insmed's Pipeline Can Deliver Potential Gains Despite Brensocatib Setback, RBC Says": 0.6,
  "Sea Limited's Shipping Subsidies Boost GMV: Is Growth Sustainable?": 0.2,
  "Analysts Say This 1 Lesser-Known Chip Stock Is a Top Buy for 2026. Should You Add It to Your Portfolios Here?": 0.6,
  "Cocoa Prices Slide on a Positive Cocoa Crop Outlook in West Africa": -0.7,
  "Keurig Dr Pepper (KDP): Assessing Valuation After a Year of Slower Share Price Momentum": 0.1,
  "Kraft Heinz (KHC) Valuation Check as Steve Cahillane Takes Helm to Steer Planned Corporate Split": 0.2,
  "Top 3 Dividend Stocks To Consider For Your Portfolio": 0.0,
  "PayPal Stock Slides After Third Analyst Downgrade This Month": -0.6,
  "Qualcomm Stock Rises After $2.4 Billion Alphawave Semi Deal": 0.8,
  "December 2025's Stock Selections Estimated To Be Priced Below Fair Value": 0.5,
  "AVGO Stock Drops 20% From 52-Week High: Should You Buy on the Dip?": -0.5,
  "Circle Partners Intuit to Bring Stablecoin Services to Credit Karma, Turbotax, Quickbooks": 0.5,
  "Otter Tail Corporation Appoints Chris Clark and Steve Rasche to Board of Directors": 0.5,
  "Constellation Energy Corporation (CEG): A Bull Case Theory": 0.5,
  "Assessing Cadence Design Systems After AI Design Momentum and Recent Share Price Pullback": 0.2,
  "Is Comcast Offering Long Term Value After Its Recent Share Price Rebound?": 0.2,
  "RBC Sees Near Term Pressure on U.S. Rails": -0.5,
  "Best Stock to Buy Right Now: Constellation Brands vs. PepsiCo": 0.5,
  "Intuit to Integrate USDC Stablecoin Across TurboTax, QuickBooks": 0.5,
  "Niowave Expands Global Supply Agreement with AstraZeneca to Deliver Actinium-225 for Next-Generation Cancer Therapies": 0.8,
  "Amazon Expands Business Prime With New Perks for Small Firms": 0.8,
  "Intel, Paramount are some of Wall Street's best comebacks of 2025": 0.8,
  "Autodesk (ADSK): Exploring Valuation After Recent Share Price Weakness and Ongoing Double-Digit Growth": 0.6,
  "Cintas (CTAS) Valuation Check After Recent Pullback From Earlier Highs": 0.1,
  "Investors in DexCom (NASDAQ:DXCM) have unfortunately lost 43% over the last three years": -0.8,
  "Cocoa Prices Settle Lower on Expectations of Adequate Supplies": -0.5,
  "S&P 500 Stocks: Micron, Sandisk, Robinhood Are 2025 Winners, But Sector Rotation In Full Swing": 0.5,
  "Western Digital Stock Has Quadrupled in 2025, but Analysts Still Think It is a Buy for 2026": 0.6,
  "RWE and Indiana Michigan Power Company partner to support Indiana's growing electricity demand with long-term PPA for 200 MW project": 0.5,
  "Why Axon (AXON) Stock Is Up Today": 0.5,
  "Marvell Technology (MRVL) Stock Is Up, What You Need To Know": 0.5,
  "KLA Corporation (KLAC) Stock Is Up, What You Need To Know": 0.5,
  "Wall Street Loves This Software Stock for 2026. Should You Buy It Now?": 0.5,
  "Seagate Technology, onsemi, Semtech, Nova, and Teradyne Shares Are Soaring, What You Need To Know": 0.8,
  "Sector Update: Tech Stocks Gain Late Afternoon": 0.5,
  "DoorDash, Skillz, MercadoLibre, and Reddit Shares Skyrocket, What You Need To Know": 0.8,
  "Cintas Corp (CTAS) Q2 2026 Earnings Call Highlights: Record Revenue and Operating Margin ...": 0.8,
  "Fastenal and the Belfast Giants Enter Sponsorship Agreement": 0.5,
  "Chipotle flexes its new high-protein menu": 0.6,
  "Does Deeper Thrive–Shopify Integration Change The Bull Case For Block’s Omnichannel Ambitions (SQ)?": 0.2,
  "These Stocks Moved the Most Today: Micron, DJT, Accenture, Tilray, Lululemon, Medline, Rivian, and More": 0.2,
  "The 'Worst-Case Scenario' — Why Insmed Just Reversed After A 181% Six-Month Sprint": 0.1,
  "AI Stocks Got Some Good News—And Surged. Will This Micron-Powered Momentum Last?": 0.6,
  "NYSE Owner ICE in Talks to Invest in MoonPay at Nearly $5 Billion Valuation": 0.6,
  "Accenture Earnings Beat Estimates. Why the Stock Is Dropping.": -0.5,
  "Stock Market Today: Indexes Keep Gains; Western Digital On A Streak As Carvana, Nuke Play Set Up (Live Coverage)": 0.5,
  "Charter to Hold Webcast to Discuss Fourth Quarter and Full Year 2025 Financial and Operating Results": 0.0,
  "AI trade is helping build out the 'next new economy': Strategist": 0.5,
  "Adobe and Runway Partner to Deliver the Next Generation of AI Video for Creators, Studios and Brands": 0.6,
  "Marvell Technology (MRVL): Assessing Valuation After Recent Share Price Pullback": 0.5,
  "Is It Too Late To Consider Lam Research After Its 2024 AI Fueled Surge?": 0.2,
  "Bridgeline Digital, Inc. (BLIN) Reports Q4 Loss, Lags Revenue Estimates": -0.7,
  "BofA Raises Analog Devices (ADI) Target, Sees Long AI-Driven Upgrade Cycle Ahead": 0.6,
  "Goldman, Barclays Lower Roper (ROP) Price Targets Amid Muted End-Market Expectations": -0.5,
  "Pemex Eyes New Production Chief Amid Mounting Output Challenges": -0.5,
  "Workday (WDAY) Earns Buy Rating as BTIG Calls Outlook “De-Risked”": 0.6,
  "ASML (ASML) Outperforms Broader Market: What You Need to Know": 0.5,
  "Cisco Systems (CSCO) Outperforms Broader Market: What You Need to Know": 0.6,
  "Qualcomm (QCOM) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Phillip Maintains Buy on Adobe (ADBE), Sees Steady Growth Into FY26": 0.6,
  "Is It Too Late to Consider Alnylam After a 67.8% Surge in 2025?": 0.2,
  "If AI Financial Automation Happens (It Is) Then These Four Companies Win": 0.5,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On December 18, 2025, the Board of Directors (\"Board\") of American Electric Power Company, Inc. (\"AEP\") granted a special equity award to William J. Fehrman, AEP’s Chair, President and Chief Executive Officer, as part of AEP's retention strategy and to promote further alignment between Mr. Fehrman’s compensation and Company performance. 1. $10,000,000 in performance shares that will": 0.2,
  "Syneron Bio Closes Nearly $100M in Series A and A+ Rounds": 0.8,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (b) On December 19, 2025, Dina Powell McCormick notified Meta Platforms, Inc. (the \"Company\") that she will resign as a member of the Board of Directors of the Company, effective immediately.": -0.5,
  "(Item 1.01) Entry into a Material Definitive Agreement Term Loan Agreement On December 18, 2025, Keurig Dr Pepper Inc. (“ KDP ” or the “ Company ”) entered into a Term Loan Agreement (the “ Term Loan Agreement ”), with the lenders party thereto and Morgan Stanley Senior Funding, Inc. (“ MSSF ”), as administrative agent, pursuant to which each lender has committed, subject to satisfaction of certain conditions set forth in the Term Loan Agreement, to\n\n(Item 1.01) regarding the Term Loan Agreement is incorporated herein by reference.": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition On December 19, 2025, Paychex, Inc. (the \"Company\") issued a press release (the \"Press Release\") reporting its financial results for the three and six months ended November 30, 2025. A copy of the Press Release is attached as Exhibit 99.1 to this Current Report on Form 8-K. The information provided pursuant to this\n\n(Item 2.02) , including Exhibit 99.1, is being \"furnished\" herewith and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities under such section, nor shall the information be deemed to be incorporated by reference into any filing of the Company under the Securities Act of 1933, as amended, or the Exchange Act, except to the extent specifically provided": 0.1,
  "Carnival earnings, home sales, consumer sentiment: What to Watch": 0.2,
  "Milvus Surpasses 40,000 GitHub Stars, Reinforcing Leadership in Open-Source Vector Databases": 0.8,
  "Alnylam’s Manufacturing Expansion and Extra-Hepatic RNAi Delivery Could Be A Game Changer For Alnylam Pharmaceuticals (ALNY)": 0.6,
  "Is CrowdStrike (CRWD) Quietly Redefining Its AI Security Moat Through New Amazon Integrations?": 0.5,
  "Is It Too Late To Consider AstraZeneca After Its Strong 2025 Share Price Rally?": 0.2,
  "China boosts AI chip output by upgrading older ASML machines": 0.5,
  "3 Absurdly Cheap Stocks You Can Buy For Less than $100 Right Now": 0.5,
  "Wells Fargo’s Investment Bankers Are Having Their Best Year Ever": 0.8,
  "How Stronger West African Cocoa Harvest And Dividend News At Mondelez (MDLZ) Has Changed Its Investment Story": 0.5,
  "Agoda Reveals Must-Visit Cities for Dazzling New Year's Eve Fireworks": 0.8,
  "Does Diamondback Energy’s 2025 Valuation Reflect Its Cash Flow Strength After Recent Share Price Pullback?": 0.2,
  "Winners And Losers Of Q3: Charter (NASDAQ:CHTR) Vs The Rest Of The Wireless, Cable and Satellite Stocks": 0.2,
  "Seagate Technology (STX): Buy, Sell, or Hold Post Q3 Earnings?": 0.2,
  "2 Reasons to Watch EA and 1 to Stay Cautious": 0.5,
  "KLA Corporation (KLAC): 3 Reasons We Love This Stock": 0.8,
  "1 Growth Stock to Add to Your Roster and 2 We Question": 0.2,
  "3 Unpopular Stocks with Open Questions": -0.5,
  "3 Unpopular Stocks Walking a Fine Line": -0.5,
  "3 Market-Beating Stocks on Our Watchlist": 0.5,
  "2 Profitable Stocks to Consider Right Now and 1 We Turn Down": 0.2,
  "1 Large-Cap Stock with Competitive Advantages and 2 Facing Headwinds": 0.2,
  "1 Cash-Producing Stock with Impressive Fundamentals and 2 We Ignore": 0.5,
  "3 of Wall Street’s Favorite Stocks with Questionable Fundamentals": -0.5,
  "1 Nasdaq 100 Stock Worth Your Attention and 2 Facing Headwinds": 0.2,
  "3 Mega-Cap Stocks with Warning Signs": -0.5,
  "1 Industrials Stock Worth Your Attention and 2 We Brush Off": 0.2,
  "1 Mooning  Stock to Own for Decades and 2 Facing Headwinds": 0.2,
  "CTAS Q4 Deep Dive: Margin Discipline and Vertical Growth Drive Steady Performance": 0.6,
  "Starbucks rival shuts key location as bankruptcy looms": -0.8,
  "Evaluating Diamondback Energy (FANG) After Its Recent Pullback: Is the Stock Undervalued?": 0.5,
  "Is Analyst Scrutiny Of Incentive Costs And Integration Challenges Altering The Investment Case For Celsius (CELH)?": 0.1,
  "Why Shopify Stock Jumped Thursday": 0.5,
  "Broadcom or AMD - I have a few shares of AMD, but the recent dip in Broadcom seems attractive. But both have relatively high P/E ratios. Broadcom’s debt is far larger than AMD's. AMD's goal is to gain market share from Nvidia. But Google's TPU performance shows that big techs can rely on their own custom chips rather than buying from Nvidia or AMD. Therefore, I am guessing big techs will use more and more": 0.2,
  "Should You Buy the 3 Highest-Paying Dividend Stocks on the Nasdaq?": 0.2,
  "Will PayPal Bank Push Transform PayPal Holdings' (PYPL) Narrative Into Full‑Scale Digital Banking?": 0.2,
  "Here's What to Expect From Fastenal’s Next Earnings Report": 0.2,
  "Alvotech and Teva Secure U.S. Settlement Date for AVT06, a Proposed Biosimilar to Eylea®": 0.5,
  "KeyBanc Turns Bearish on Adobe (ADBE) Despite Strong Q4 Results": -0.5,
  "CrowdStrike’s (CRWD) Market Leadership Supports Premium, Citizens Says": 0.5,
  "Will Weakness in Copart, Inc.'s (NASDAQ:CPRT) Stock Prove Temporary Given Strong Fundamentals?": 0.5,
  "Heard on the Street Thursday Recap: Memory Boost": 0.2,
  "US Stock Market Today: S&P 500 Futures Rise amid Global Rate Hikes, Cooling Inflation": 0.5,
  "Cognizant, Microsoft agree multi-year partnership for AI integration": 0.6,
  "Qualcomm wraps up $2.4bn acquisition of Alphawave Semi": 0.5,
  "r/Stocks Daily Discussion & Fundamentals Friday Dec 19, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is": 0.2,
  "Zacks Investment Ideas feature highlights CAPITAL ONE, MARRIOTT INTERNATIONAL and Tesla's": 0.2,
  "Roper Technologies, Inc. (NASDAQ:ROP) Stock's Been Sliding But Fundamentals Look Decent: Will The Market Correct The Share Price In The Future?": 0.5,
  "Texas Instruments Incorporated's (NASDAQ:TXN) latest 3.0% decline adds to one-year losses, institutional investors may consider drastic measures": -0.6,
  "Weekly Recap: 10 Finance Press Releases You Need to See": 0.5,
  "Here’s Why Alnylam Pharmaceuticals (ALNY) Surged in Q3": 0.5,
  "Brown Advisors Mid-Cap Growth Strategy Exited Zscaler (ZS) on Valuation": -0.5,
  "3 Stocks Estimated To Trade At Discounts Of Up To 49.7%": 0.5,
  "The most-read industry analysis from Just Food in 2025": 0.0,
  "Are Investors Undervaluing Atlassian Corporation (NASDAQ:TEAM) By 33%?": 0.2,
  "Qualcomm’s Monster Rally Has a Catch—Can the Stock Keep Climbing?": 0.2,
  "Monster Beverage Insider Sale Leads to Investor Scrutiny": -0.5,
  "Frontier inks $44.2M deal with biowaste carbon removal company": 0.6,
  "Stocks Mostly Up Pre-Bell as Traders Digest Latest Inflation Data": 0.5,
  "Duke Energy vs. Exelon: Which Power Utility Stock Offers More Upside?": 0.5,
  "Here Are Friday’s Top Wall Street Analyst Research Calls: Birkenstock, Coreweave, Lockheed Martin, Lyft, Paccar, Stryker, Synaptics, and More": 0.2,
  "UNIVERSAL MUSIC GROUP AND ROBLOX ANNOUNCE STRATEGIC AGREEMENT TO EXPAND CREATIVE AND COMMERCIAL MUSIC EXPERIENCES ON THE PLATFORM FOR ARTISTS, LABELS AND FANS": 0.8,
  "Is NXP Semiconductors N.V. (NASDAQ:NXPI) Potentially Undervalued?": 0.5,
  "Google Cloud lands deal with Palo Alto Networks 'approaching $10 billion,' per source": 0.6,
  "Dow Jones Futures: Tech Stocks Eye Key Level; Oracle, Nike, FedEx In Focus": 0.5,
  "The Zacks Analyst Blog Amazon, Atlassian and Cloudflare": 0.5,
  "Cintas Guidance Implies Moderating Revenue Growth in Fiscal H2 2026, RBC Says": 0.1,
  "Palo Alto Networks and Google Cloud Forge Landmark Agreement to Help Customers Securely Accelerate Cloud and AI Initiatives": 0.8,
  "thegeekconf 2025 Panel Puts Enterprise Focus on AI’s Practical Usage": 0.5,
  "Jabil Is Flying Under the Radar—But a 50% Surge May Be Coming": 0.6,
  "Paychex Reports Second Quarter Results": 0.0,
  "This 1 Lesser-Known Stock Is Set to Dominate with Nvidia and Broadcom in 2026": 0.6,
  "Implied Volatility Surging for Old Dominion Stock Options": 0.5,
  "Paychex: Fiscal Q2 Earnings Snapshot": 0.0,
  "Is the Options Market Predicting a Spike in TMobile US Stock?": 0.2,
  "Paychex (NASDAQ:PAYX) Reports Q4 CY2025 In Line With Expectations": 0.5,
  "Exchange-Traded Funds Higher, Equity Futures Mixed Pre-Bell Friday Amid Economic Data Releases": 0.5,
  "Criminal IP and Palo Alto Networks Cortex XSOAR integrate to bring AI-driven exposure intelligence to automated incident response": 0.5,
  "PayPal Holdings, Inc. (PYPL) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Palo Alto Networks, Inc. (PANW) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "CrowdStrike (CRWD) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Constellation Energy Corporation (CEG) is Attracting Investor Attention: Here is What You Should Know": 0.6,
  "We Ran A Stock Scan For Earnings Growth And Baker Hughes (NASDAQ:BKR) Passed With Ease": 0.6,
  "Stock Market News for Dec 19, 2025": 0.0,
  "Aoris International Fund Sold Copart (CPRT) in Q3": 0.1,
  "Is NXP (NXPI) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Why GE HealthCare Technologies (GEHC) is a Top Stock for the Long-Term": 0.6,
  "Lam Research (LRCX) Just Flashed Golden Cross Signal: Do You Buy?": 0.5,
  "Paychex (PAYX) Q2 Earnings and Revenues Beat Estimates": 0.8,
  "Has AXT (AXTI) Outpaced Other Computer and Technology Stocks This Year?": 0.5,
  "Circle Internet initiated, Lyft downgraded: Wall Street's top analyst calls": -0.5,
  "Linde (LIN) Isn’t Seeing US Reshoring, Says Jim Cramer": -0.5,
  "The Christmas rally is here!! - With the release of CPI data, Japan's rate hike implemented, the UK's rate cut finalized, the ECB holding steady, and the remaining earnings reports out, the market is poised to settle down. Its next move will be dictated by market forces alone. The Nasdaq opened higher yesterday and continued consolidating around 23,000, while Nasdaq futures posted two consecutive gains. The Christmas rally may be quietly approaching. * NVDA: Buy": 0.8,
  "Palo Alto Networks stock rises on expanded Google Cloud partnership": 0.8,
  "Can This $2 Billion AI Investment Help Nvidia’s Secret Portfolio From Collapsing?": 0.2,
  "Bubbles and Boring Bets: What’s Coming for Tech Stocks in 2026": 0.2,
  "Meta Joins the AI Video Race: Report. It Needs to Catch Google and OpenAI.": 0.2,
  "Costco Renewal Rates Stay Near Historical Highs Despite Digital Shift": 0.5,
  "Dear Western Digital Stock Fans, Mark Your Calendars for Dec. 22": 0.5,
  "Paychex's higher quarterly expenses overshadow annual earnings forecast raise": -0.5,
  "Paychex Lifts Earnings Guidance Mid-Point, Sees Revenue at Low End of Outlook": 0.2,
  "Medline IPO sets surprising record": 0.6,
  "Assessing NXP Semiconductors (NXPI) Valuation After Its Recent 17% One-Month Share Price Rise": 0.2,
  "JPMorgan Highlights 11 Tech Stocks for 2026": 0.5,
  "S&P 500 Stocks Upgraded: AI Data Center Power Plays And Truck Makers": 0.5,
  "Restoring AI Confidence: MU Earnings Report Delivers One of the Biggest Surprises in U.S. Chip History. - 1: Micron Technology recently released better than expected earnings, sending its stock soaring 14% and marking one of the biggest surprises in U.S. chip industry history. 2: Wall Street analysts have raised Micron's earnings forecasts and target prices while assigning buy ratings, noting that its 69% growth in DRAM chip revenue has boosted confidence among U.S. tech bulls.": 0.8,
  "Why Advanced Micro Devices Stock Is Jumping Today": 0.5,
  "3 Soaring Stocks to Hold for the Next 20 Years": 0.5,
  "Should You Invest $1,000 in Costco Stock Right Now?": 0.5,
  "Form 8.3": 0.0,
  "Palo Alto (PANW) Up 0.4% Since Last Earnings Report: Can It Continue?": 0.2,
  "Paychex Q2 Earnings & Revenues Surpass Estimates, Increase Y/Y": 0.8,
  "Lam Research (LRCX) Surges 6.27% as 3 Firms Turn Bullish": 0.8,
  "CHDN vs. TTWO: Which Stock Is the Better Value Option?": 0.0,
  "Wedbush maintains a Buy rating on Google and raises its price target to $350. - Weybush analyst Scott Devitt maintained a Buy rating on Google and raised its target price from $320 to $350. According to TipRanks data, the analyst has achieved an overall win rate of 49.9% and an average return of 12.3% over the past year. What is your target price for GOOG?": 0.8,
  "3 IT Services Stocks to Buy Right Now From a Prospering Industry": 0.6,
  "Global IoT providers focus on multi-network service management in H2 2025": 0.5,
  "Sandisk Rises 371% in Six Months: Should You Buy the Stock?": 0.8,
  "4 software stocks facing guidance risks in 2026, Morgan Stanley warns": -0.6,
  "Intuit & Circle Team Up for Smarter Money Movement With Stablecoins": 0.5,
  "Top Midday Stories: Oracle, Others Form JV to Oversee TikTok in US; More Drugmakers to Announce US Drug Price Deals": 0.5,
  "Why Jabil (JBL) Stock Is Trading Up Today": 0.5,
  "Strategy (MSTR) Stock Is Up, What You Need To Know": 0.5,
  "Applied Materials (AMAT) Stock Trades Up, Here Is Why": 0.5,
  "ComEd Awards $500,000 EV Charging Rebate to bp pulse": 0.5,
  "US Reopens China's Door to Nvidia Chips--But Risks Undermining Its AI Edge": -0.5,
  "Favorable West African Weather Weighs on Cocoa Prices": -0.6,
  "Google Cloud Strikes Nearly $10 Billion AI Security Deal With Palo Alto Networks": 0.8,
  "Nvidia-Intel deal cleared by US antitrust agencies": 0.5,
  "Intel vs. Taiwan Semiconductor Manufacturing: Which Stock Will Outperform in 2026?": 0.2,
  "Palo Alto, Google Cloud Strike 'Multi-Billion-Dollar' Deal to Deliver End-to-End AI Security": 0.8,
  "Xcel Energy Announces Pricing Terms of Cash Tender Offers for Certain Outstanding First Mortgage Bonds Issued by Northern States Power Company (a Minnesota corporation)": 0.0,
  "How Investors May Respond To Palo Alto Networks (PANW) Expanding AI Security Partnership With Google Cloud": 0.5,
  "Does Honeywell Offer Value After Portfolio Shift Toward Automation Aviation and Energy Transition?": 0.2,
  "Up 50% in 2025, Should You Buy ASML Stock Right Now?": 0.5,
  "AppLovin's Margin Engine Fuels its Accelerating Momentum": 0.8,
  "3 Growth Companies With High Insider Ownership Seeing Earnings Growth Up To 68%": 0.5,
  "3 Stocks Estimated To Be Undervalued By Up To 48.3%": 0.5,
  "Is Cognizant Still Attractive After Its 15.9% Surge and Strategic Focus on AI?": 0.5,
  "Nvidia's Intel stake cleared by FTC, existing home sales rise": 0.5,
  "Axon vs. Woodward: Which Aerospace & Defense Stock Should You Bet On?": 0.2,
  "Cintas' Q2 Earnings Surpass Estimates, Revenues Increase Y/Y": 0.8,
  "US Oil Drillers Slow Activity In Tough Price Environment": -0.5,
  "Broadcom (AVGO) - What is the general consensus on AVGO? I think the drop over the last few weeks has been a massive overreaction, its earnings report was great. Granted, I'm still bullish on the AI trade in the long term.": 0.6,
  "Sector Update: Tech Stocks Gain Friday Afternoon": 0.5,
  "Jim Cramer Notes Linde “Has Tremendous Pricing Power”": 0.8,
  "As Intuit Jumps Into Stablecoin Business, Should You Buy, Sell, or Hold INTU Stock?": 0.2,
  "Starbucks taps Amazon's Anand Varadarajan as new chief technology officer": 0.5,
  "Gilead and U.S. Government Enter Agreement to Lower Costs of Medicines for Americans": 0.8,
  "Infosys Pares Gains After Stock Spike. No One Knows What Prompted the Move.": -0.5,
  "AMGEN TAKES ACTION WITH THE U.S. GOVERNMENT TO LOWER THE COST OF MEDICINES FOR AMERICAN PATIENTS": 0.8,
  "Cocoa Prices Undercut Amid the Prospects of Abundant Supplies": -0.8,
  "Honeywell to end 2025 in the red, but 2026 could be different": 0.2,
  "Nine Big Drugmakers Reach Pricing Deals With White House": 0.5,
  "UBS Believes Diamondback Energy (FANG) is Poised for a 2026 Breakout Following Period of Stagnation": 0.8,
  "Is Shopify Inc (SHOP) the Best Non-US Stock To Buy?": 0.5,
  "Wall Street Has a Positive Opinion on ASML Holding N.V. (ASML), Here’s Why": 0.8,
  "Here’s What Wall Street Thinks About Linde plc (LIN)": 0.1,
  "PDD Holdings Inc. (PDD) Down 15.5% in a Month, Here’s What You Need to Know": -0.5,
  "AstraZeneca PLC (AZN) Announces Approval of Saphnelo by the European Union": 0.5,
  "What Is Shifting the Take Two Narrative After Fresh GTA 6 and NBA 2K Optimism": 0.5,
  "Insider Buying And Hydrogen Bets Might Change The Case For Investing In Linde (LIN)": 0.5,
  "Jim Cramer on Micron: “It Is One of My Absolute Favorite Stocks”": 0.8,
  "Jim Cramer on TJX: “I Want You to Wait for a Pullback”": 0.2,
  "Jim Cramer on AppLovin: “I’m Not Lovin’ as Much”": -0.6,
  "Why DoorDash (DASH) Stock Is Trading Up Today": 0.5,
  "Why Gilead Sciences (GILD) Stock Is Up Today": 0.5,
  "Seagate Technology (STX) Stock Is Up, What You Need To Know": 0.5,
  "Why NXP Semiconductors (NXPI) Stock Is Up Today": 0.5,
  "Crude Oil Prices Settle Higher on Heightened Geopolitical Risks": 0.5,
  "Dave Ramsey Reveals 3 Ways To Fix The Housing Problem": 0.5,
  "Bay Area Council Forms Search Committee to Recruit New CEO": 0.0,
  "Sector Update: Health Care Stocks Rise Late Afternoon": 0.5,
  "Utilities Look Cheap. 2 Stocks to Consider Buying.": 0.5,
  "Paychex Inc (PAYX) Q2 2026 Earnings Call Highlights: Strong Revenue Growth Amid Integration ...": 0.8,
  "What New Catalysts Are Shaping the Evolving Narrative for Cisco?": 0.2,
  "Palo Alto Networks (PANW): Evaluating Valuation After New Multibillion-Dollar AI Security Deal With Google Cloud": 0.5,
  "Is Airbnb Still Attractively Priced After Recent Share Price Surge?": 0.2,
  "More Drugmakers Reach Deals With White House to Lower Prices": 0.5,
  "Why Is Lam Research (LRCX) Stock Soaring Today": 0.5,
  "Upland Software, Unity, Palantir Technologies, AppLovin, and C3.ai Shares Are Soaring, What You Need To Know": 0.5,
  "Nine Drugmakers Strike Deals With Trump, With More to Come": 0.5,
  "Trump reaches deal with 9 drug companies to lower prices": 0.8,
  "Nvidia, Tesla dominate Dec. trading as 2025 options demand surges": 0.5,
  "Lam Research, IBD Stock Of The Day, Hits All-Time High On 2026 Prospects": 0.8,
  "Stock Market Today: Nasdaq Up With Nvidia Among Reinvigorated Tech Names (Live Coverage)": 0.5,
  "Is Spectrum’s Softer Quarter And Underused Network Altering The Investment Case For Charter Communications (CHTR)?": 0.1,
  "AMD, Intel, KLA Corporation, Western Digital, and Nova Stocks Trade Up, What You Need To Know": 0.5,
  "Forget Kraft Heinz: Buy This Unstoppable Consumer Staple Leader Instead": 0.6,
  "What stocks are you guys picking up for 2026? - I’m rebuilding my portfolio from the ground up after absolutely nuking it. Day trading and options ain’t for me lol. Some sectors are looking very interesting to me right now too. I do want good growth, something that’ll outperform the S&P or similar ETFs. My main targets have been PAAS, SOFI, GOOGL, AMZN, RIVN and then an ETF like XEQT as a safety net. I": 0.6,
  "2025 retail roundup: The tug-of-war between narrative & numbers": 0.2,
  "2025 is almost over, how much has your investment account grown? - 2025 is almost over, and it’s been a year full of ups and downs in the market. For me, my investment account grew by 37% this year. I caught some great opportunities with NVDA and LLY, and in December, I started trading more frequently. Fortunately, I ended up with a profit overall. How about you? How has your investment journey been this year?": 0.8,
  "Dow Jones' Merck, Other Drugmakers Strike Drug-Pricing Bargains With Trump": 0.5,
  "Datadog (DDOG) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Starbucks (SBUX) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "Why Shopify (SHOP) Outpaced the Stock Market Today": 0.5,
  "Applied Materials (AMAT) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Intuitive Surgical, Inc. (ISRG) Rises Higher Than Market: Key Facts": 0.5,
  "The biggest stupid decision I made this year - Yesterday, after the market slowly pulled back, my account took a hit of almost $35,000 due to the recent drop in tech stocks. Damn, I don’t even know what kind of mindset I was in when I decided to reduce my positions in NVDA, Meta, and even close out some stocks I had been really bullish on. Now, 85% of my account is in cash, and": -0.8,
  "Stock Market Today, Dec. 19: NYSE Halts Infosys Trading After ADRs Spike": -0.5,
  "SoftBank races to fulfill $22.5 billion funding commitment to OpenAI by year-end": 0.5,
  "Costco Renewal-Rate Concerns Are Overblown, Says Analyst. Plus, Zillow, Micron Tech, and More Stocks.": 0.5,
  "Universal Studios Looks to Saudi Arabia for New Theme Park": 0.5,
  "Basin rig count down three as prices slide": -0.5,
  "Microchip Technology (MCHP): Reassessing Valuation After Upgraded Guidance and Analyst Targets Meet Softer Chip Sentiment": 0.2,
  "Do You Own BJ Stock? You May Want to Sell and Buy TJX Instead.": -0.6,
  "Burlington Stores Offers More Than Coats to Keep Investors Warm This Winter": 0.6,
  "Should GoDaddy’s (GDDY) AI Identity Push Reshape Its Core Competitive Positioning Story?": 0.2,
  "Stock-Split Watch: Is ASML Next?": 0.2,
  "Has Amgen’s 26% Rally in 2025 Already Priced In Its Obesity and Oncology Ambitions?": -0.5,
  "How Investors May Respond To DoorDash (DASH) Embedding Grocery Ordering Into ChatGPT With OpenAI": 0.2,
  "PAYX Q4 Deep Dive: AI Investments and Paycor Integration Shape Outlook Amid Margin Pressures": 0.5,
  "Is Coca-Cola Europacific Partners PLC (AMS:CCEP) Trading At A 21% Discount?": 0.1,
  "Rotating into Value energy stocks? VST (Vistra Corp) DD - **My basic non-AI write up** I've been looking at reducing tech exposure considering recent jitters and been sifting through stocks worth strong value propositions in infrastructure, finance and tech. Viagra stood out for me. Here is my rationale. Vistra stock is an energy play recently trading at a \\\\\\~20% discount from ATH, currently trading $160-170 from $219. Analyst targets range from Low (217) to High": 0.2,
  "125 Crypto Groups Tell Congress Stablecoin Yield Ban Favors Big Banks": -0.5,
  "Citizens Reaffirms Outperform Rating on Shopify (SHOP) as European Share Expands": 0.6,
  "CrowdStrike (CRWD) Price Target Reiterated After Solid Q3 Results": 0.8,
  "Cocoa prices are plunging. Why is chocolate still so expensive?": -0.6,
  "Charter Communications (CHTR): Reassessing Valuation After a Steep Share Price Decline": 0.2,
  "Biohaven (BHVN) Is Down 5.9% After New BHV-1510 Combo Data - What's Changed": -0.5,
  "Boeing’s Debt Wall Is Approaching as Bond Markets Show Signs of Stress Company News - I wanted to try trading futures on Boeing (BA) and NVIDIA (NVDA) yesterday on Bitget. Boeing futures aren’t available there yet, but while digging deeper into BA, what stood out was how concerning the underlying credit picture looks compared to the equity narrative. Boeing’s total debt has reached roughly $53.3 billion, with a significant maturity wall approaching: about $4.3 billion": -0.6,
  "Xcel Energy (XEL) Sued for ‘Blatant Negligence’ in Wildfire Incident": -0.8,
  "Why Analysts See Western Digital’s Story Shifting With Rising Targets And AI Driven Tailwinds": 0.6,
  "Constellation Energy (CEG) Price Target Raised to $420": 0.6,
  "The Former Ice-Hockey Player Who Nailed This Year’s AI Trade": 0.2,
  "MarketBeat Week in Review – 12/15 - 12/19": 0.0,
  "Is It Too Late To Consider Qualcomm After Its Strong Multi Year Share Price Rally?": 0.2,
  "What PeptiDream (TSE:4587)'s New Oral IL-17 Program and RNAi Milestone Mean For Shareholders": 0.5,
  "Old Dominion Freight Line (NASDAQ:ODFL) Is Investing Its Capital With Increasing Efficiency": 0.8,
  "How AI will drive profit growth for credit cards, retailers in 2026": 0.6,
  "Palantir, AppLovin Lead Five Stocks In Buy Zones As Market Revs Up": 0.6,
  "Stellar Solutions Awarded Contract for Missile Defense Agency SHIELD IDIQ": 0.8,
  "NVDA shows a rare setup where valuation risk declined even as the stock price held up - Over the last cycle, NVDA's valuation ratios hit extreme levels as AI hype ran way ahead of fundamentals. What's interesting: PS and PE multiples compressed sharply, but the stock never really collapsed. Instead, earnings growth did the heavy lifting, the business basically caught up to where the price already was The risk profile changed not from price falling,": 0.6,
  "Costco will soon do something it only does 7 times a year": 0.2,
  "AppLovin (APP) Is Up 7.6% After Analysts Spotlight AXON Ads And AI Ad Stack Momentum": 0.8,
  "NVDA vs AMD for 2026 - where's the better value? - Both NVDA and AMD peaked on October 29th and have since pulled back: - NVDA: Down ~17% from $212 to ~$175 - AMD: Down ~21% from $267 to ~$211 Both are showing oversold signals. But they're very different bets. **The quick comparison:** | Metric | NVDA | AMD | |--------|------|-----| | Forward P/E | 25x | ~42x | | Gross Margin | 75% |": 0.2,
  "Sandisk Stock Had a Strong Week. Revenue Could Grow 76% in Two Years, This Firm Says.": 0.8,
  "Is Constellation Energy’s Huge Multi Year Rally Still Supported by Its Fundamentals in 2025": 0.1,
  "r/Stocks Weekly Thread on Meme Stocks Saturday - Dec 20, 2025 - The meme stock scheduled posts will now run weekly and post Saturday afternoon and won't be a sticky; you're probably seeing this because automod sent you here! [Full list of meme stocks here.](https://www.reddit.com/r/stocks/wiki/meme-stocks) This will be updated every once in a while. ------ Welcome traders who just can't help them selves discuss the same exact stock that's been discussed 100s of times a": 0.1,
  "UBER is being irrationally undervalued due to autonomous driving concerns - I’ve been researching $UBER and believe the stock is significantly oversold due to excessive fear that autonomous vehicles will soon destroy the ride-hailing business. This mirrors the situation with $GOOG earlier this year, when panic over ChatGPT and generative AI led to a sharp sell-off on concerns that search market share would vanish overnight. In reality, Google integrated AI into its products, preserved its": 0.8,
  "Ferrovial (BME:FER): Is Nasdaq 100 Inclusion Already Priced Into the Share Price?": 0.2,
  "Tech vs. Consumer Staples – Where’s the Better 2026 Play? - Lately I’ve been comparing two very different sectors: Microsoft ($MSFT) vs Procter & Gamble ($PG). Both are strong companies, but the risk/reward and growth narratives are very different. Microsoft highlights: • Cloud growth continues with Azure • AI integration could accelerate revenue across Office, search, and enterprise solutions • Forward P/E ~30x, strong margins, massive cash flow • Risks: Competition in AI/Cloud, macro slowdown": 0.6,
  "PDD Holdings (NasdaqGS:PDD): Reassessing Valuation After Leadership Shake-Up and Rising Regulatory Scrutiny": 0.2,
  "Does PACCAR Still Offer Value After 15.6% Monthly Gain And Strong Five Year Rally?": 0.6,
  "Why a Soaring Education Stock at All-Time Highs Drew a New $3.5 Million Investment": 0.8,
  "This Crypto Stock Fell 40% in Weeks but One Investor Has Revealed a New $4.7 Million Bet": 0.2,
  "How Recent Developments Are Reshaping The Xcel Energy Investment Story": 0.5,
  "SoFi is the first nationally chartered U.S. bank to offer its own coin with the launched of SoFiUSD. - The new US dollar coin is built on Ethereum. A platform that prioritizes security and decentralization. It is backed 1:1 by cash reserves and would be able to share an attractive yield to SoFiUSD holders and partners. Modernizing finance with faster and cheaper payments for fintechs, banks, and members. SoFiUSD can also be used for cost": 0.8,
  "Is Ross Stores (ROST) Fairly Priced After Its Recent 3-Month Rally? A Fresh Look at Valuation": 0.2,
  "This SaaS Stock Is Down 45% From Its Peak but Just Became a $12.5 Million Bet": 0.2,
  "This Software Stock Is Down 20% in a Year and Just Became One Fund's $6 Million Bet": 0.2,
  "Is Leadership Reshuffle Amid Regulatory Scrutiny Altering The Investment Case For PDD Holdings (PDD)?": 0.1,
  "How Investors May Respond To Xcel Energy (XEL) Wildfire Lawsuit, Bond Buyback and Board Expansion": 0.2,
  "Portfolio recommendations 2026-2030 - Hello! So 2024 and 2025 have been really good years for me growth wise. 100%+ growth 2 years in a row. (Thank you rklb, asts, and eose) I personally dont think my my luck will continue, but I still want to try my best to beat the indexes over the next few years of so. Im looking to shave some positions and reallocate into something new or potentially even ones in": 0.5,
  "Wash sale rules advice - So I took some losses on AMD last few weeks. I decided to get out of my shares and harvest my losses. Problem is, I still want to be invested in AMD, especially at these prices. So I purchased some 2026 Sept 210C options. My broker couldn’t confirm if it was considered a wash sale. They said it’s up to the IRS but I’m confused. I thought the broker had": -0.5,
  "Why The Narrative Around Kroger Is Shifting After New Digital Partnership Updates": 0.5,
  "Is $TKO (UFC & WWE) the next sleeping giant in media? - I’ve been a huge fan of UFC and WWE for over a decade and have watched how these sports have evolved over time from the traditional PPV model to major partnerships with streaming platforms like Netflix and Paramount/Skydance. The company’s owners and executives are also closely connected to the current administration, particularly Dana White and Donald Trump. Dana White’s recent appointment to Meta’s": 0.6,
  "How do you spot “future giants” early (NVDA/Amazon-type winners) without pure luck? - I’m trying to understand the process people use to catch smaller companies before they become massive (like NVDA early days, AMZN early days, etc.). What signals do you look for (financials, product adoption, TAM, leadership, moats)? What makes you buy and hold through volatility? Any red flags that would have saved you from “false future giants”? Would appreciate specific examples and what": 0.2,
  "Hi Reddit Which company of the MAG 7 will retain it's position 5 years from now? - The Magnificent 7 have been carrying the market for the past few years. Most of them operate globally and have massive moats, with products that are deeply embedded in everyday life. I’m curious looking 5 years ahead, which of the Mag 7 do you think will still hold their spots, and which might potentially lose relevance or fall": 0.5,
  "Street Calls of the Week": 0.0,
  "Makers of Everyday Essentials Once Offered Investors Safety. Do They Still?": 0.1,
  "Monolithic Power Systems (NASDAQ:MPWR) Has More To Do To Multiply In Value Going Forward": 0.5,
  "Investing in Workday (NASDAQ:WDAY) three years ago would have delivered you a 33% gain": 0.5,
  "The Bull Case For Graphic Packaging (GPK) Could Change Following CEO Shake-Up And Activist Backlash – Learn Why": 0.5,
  "Jacobio Pharma Enters Global Exclusive License Agreement with AstraZeneca for Pan-KRAS Inhibitor JAB-23E73": 0.8,
  "Could This Bear-Market Buy Help You Become a Millionaire?": 0.5,
  "Stocks enter final stretch of 2025 just off record highs: What to watch this week": 0.5,
  "Denver woman has roaches and bad reviews after renting Airbnb to her hoarder mom. She has 2 options to fix the mess": -0.6,
  "A Note On Exelon Corporation's (NASDAQ:EXC) ROE and Debt To Equity": 0.1,
  "Analog Devices, Inc.'s (NASDAQ:ADI) Stock On An Uptrend: Could Fundamentals Be Driving The Momentum?": 0.5,
  "Intel stock soared in 2025. But the chipmaker still has a long road ahead.": 0.5,
  "Atlassian Corporation (TEAM): BTIG Says AI Disruption Risk Overblown": 0.6,
  "Is Tesla (TSLA) Poised for Another Breakout or Facing Resistance? - Tesla (TSLA) has been one of the most watched stocks in the market, and its recent price action is setting up some interesting trade opportunities. On the fundamental side, Tesla continues to dominate the EV market with strong deliveries, expanding Gigafactory production, and innovation in battery and autonomous driving technology. Its energy division provides additional diversification, though margins are under pressure from rising costs": 0.6,
  "3 Dividend Growth Stocks Analysts Are Upgrading for 2026": 0.5,
  "JPMorgan Maintains Overweight Rating On Constellation Energy Corporation (CEG)": 0.5,
  "Morgan Stanley Lowers Price Objective On Exelon Corporation (EXC)": -0.5,
  "Texas Attorney General Sues Xcel Energy Inc. (XEL) unit over Smokehouse Creek Wildfire": -0.6,
  "Truist and RBC Capital Raise Price Targets on Intuitive Surgical (ISRG)": 0.5,
  "Is Intuit (INTU) One of the Best Large Cap Stocks to Invest In?": 0.5,
  "Moody’s Rating Upgrades MercadoLibre, Inc. (MELI), Here’s Why": 0.6,
  "Wall Street Maintains a Positive Outlook on Marvell Technology (MRVL), Here’s Why": 0.8,
  "Microsoft Corporation (MSFT) and Cognizant Announce a Multi-Year Partnership": 0.5,
  "Where is Taiwan Semiconductor Manufacturing (TSM) Headed According to Analysts?": 0.2,
  "How Oracle became a ‘poster child’ for AI bubble fears": -0.5,
  "The Best Artificial Intelligence (AI) Stock To Buy in 2026 (Hint: It's Not Nvidia)": 0.2,
  "Jim Cramer on Take-Two Interactive: “Strauss Zelnick Will Deliver”": 0.6,
  "Jim Cramer Says Victory Against Tariffs Could Finally Pull Costco Stock “From Its Continued, and Endless, and Terrible Tailspin”": 0.6,
  "Jim Cramer Calls NVIDIA a “Fabulous” Company": 0.8,
  "Jim Cramer Says Applied Materials Is a “Great Long-Term Performer”": 0.8,
  "Jim Cramer on SentinelOne: “You Got to Stick With the High-Quality Ones”": 0.6,
  "Here’s How Axon Shares Can Hit $900 in 2026": 0.6,
  "BTIG Lifts PT on AppLovin (APP) Stock": 0.5,
  "Jim Cramer Shows a Bullish Sentiment Toward Broadcom": 0.8,
  "DoorDash (DASH) Experiments With Standalone AI-powered App for Users to Locate New Restaurants, Reports Bloomberg": 0.5,
  "BofA Reduces PT on Marvell Technology (MRVL) Stock": -0.5,
  "​Wall Street Bullish on Innovative Solutions and Support, Inc. (ISSC) Amid Growing Avionics Opportunities": 0.8,
  "Is MercadoLibre (MELI) One of the Best Stocks to Buy for the Next 5 Years?": 0.6,
  "Cantor Fitzgerald Trims Marvell (MRVL) PT to $100, Cites Neutral Stance Amid AI Expansion": 0.1,
  "DoorDash (DASH) Outlook Tempered by Concerns Over Investment Costs and AI Disruption": -0.5,
  "Where Will Costco Stock Be in 1 Year?": 0.0,
  "Breaking out the 'selective scalpel': Wall Street sees AI stock trade as intact": 0.5,
  "What MercadoLibre (MELI)'s Investment Grade Upgrade and Humanoid Robot Deal Mean For Shareholders": 0.2,
  "The 3 Deep Learning Stocks That Could Be Worth 50% More by 2027": 0.5,
  "1 Top Cryptocurrency to Buy Before It Soars 1,049%, According to Strategy's Michael Saylor": 1.0,
  "The 5 Largest Publicly Traded Solana Treasury Firms": 0.0,
  "Want to Invest in Quantum Computing? 3 Stocks That Are Great Buys Right Now": 0.8,
  "Assessing Applied Materials Valuation After AI Driven Surge In 2025": 0.5,
  "CrowdStrike (CRWD) Valuation Check After Falcon AIDR Launch, New Partnerships, and Upgraded Guidance": 0.6,
  "Starbucks makes a bold move beyond coffee": 0.5,
  "MicroStrategy’s Saylor Signals Imminent Bitcoin Buy Amid MSTR Stock YTD Decline": 0.5,
  "Analysts Expect Outperformance As NXP Semiconductors (NXPI) Ramps Down Radio Power Line": 0.6,
  "Analysts Bullish on Qualcomm Inc. (QCOM) As It Completes Alphawave Semi Acquisition": 0.8,
  "Assessing AppLovin (APP) Valuation After Its Recent Share Price Surge": 0.2,
  "Is Paychex Offering Value After an 18.9% Slide Amid HR Tech Competition?": -0.5,
  "Riding the AI wave? You need a 'strong stomach': Dan Ives' strategy": 0.2,
  "Peter Thiel Reported To Me, Says Elon Musk, Calls PayPal Exit 'Palace Coup' Fueled By Board: 'There Was Nothing Anyone Could…'": 0.1,
  "Assessing PACCAR (PCAR) Valuation After Its Strong Multi‑Year Share Price Performance": 0.5,
  "Is It Too Late to Consider AppLovin After Its 111.1% 2025 Surge?": 0.2,
  "Costco adds big-name brands, shoppers won’t believe what’s new": 0.6,
  "Niskanen Center Examines American Electric Power Company, Inc. (AEP)’s Place In The US Transmission Grid": 0.0,
  "ServiceNow (NOW) in Focus as Bernstein Calls It the Cheapest Large-Cap Software Name": 0.5,
  "BofA Reiterates Buy on META as AI Spending Fears Ease": 0.6,
  "Bank of America resets Micron stock price target, rating": 0.0,
  "Atlassian (TEAM) Valuation Check After Raised Cloud Outlook and Fresh Analyst Buy Ratings": 0.5,
  "The State of Software Stocks - Software has taken a relative beating this year: while the software ETF, IGV, is up 8%, many stalwart software names like Adobe, ServiceNow, Salesforce, Asana, Workday, and Atlassian are down or treading water at best. **My take is there's opportunity here, as a bunch of these names will return to the premium valuations they used to command. NOW, CRM, INTU, VEEV, CDNS, and SNPS are some ones that look": 0.5,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Resignation of Chief Executive Officer and Director On December 19, 2025, Daniel L. Florness, the Chief Executive Officer ('CEO') of Fastenal Company ('Fastenal') and a director of Fastenal's Board of Directors (the 'Board'), submitted a letter to the Board advising them of the following: (1) Mr. Florness' decision to voluntarily step out of his role as\n\n(Item 5.02) , a copy of which is furnished with this Current Report on Form 8-K as Exhibit 99.1, which is incorporated by reference herein. The information in this": -0.2,
  "(ITEM 5.02) . DEPARTURE OF DIRECTORS OR CERTAIN OFFICERS; ELECTION OF DIRECTORS; APPOINTMENT OF CERTAIN OFFICERS; COMPENSATORY ARRANGEMENTS OF CERTAIN OFFICERS. As previously reported on the Current Report on Form 8-K filed on July 30, 2025, the Board of Directors (the “Board”) of DexCom, Inc. (“Dexcom” or the “Company”) appointed Jacob S. Leach, President and Chief Operating Officer, as the President and Chief Executive Officer and as a director of the Company, effective January 1, 2026, following": 0.1,
  "(Item 8.01) . Other Events. On December 22, 2025, Cintas Corporation (the “Company” or “Cintas”) issued a press release confirming that it delivered to the Board of Directors of UniFirst Corporation (“UniFirst”) a proposal to acquire all of the outstanding common and class B shares of UniFirst for $275.00 per share (the “Proposal”) in cash. A copy of the press release, attached hereto as Exhibit 99.1, and the accompanying presentation slides, attached hereto as Exhibit 99.2, are": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers . On December 18, 2025, Sasan Goodarzi and Richard P. Wong each notified Atlassian Corporation (the “ Company ”) of their respective decisions to retire as a director of the Company, each effective as of January 1, 2026. Neither of their decisions to retire were the result of any disagreement with the Company on any matter": -0.2,
  "(Item 8.01) Other Events. ATM Update On December 22, 2025, Strategy Inc (\"Strategy\") announced an update with respect to sales made under its at-the-market offering program (\"ATM\") of the following securities: During Period December 15, 2025 to December 21, 2025 As of December 21, 2025 Security Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) STRF Stock - $ - $ - $ 1,619.3 10.00% Series A": 0.1,
  "(Item 1.01) Entry into a Material Definitive Agreement. On December 19, 2025, Netflix, Inc. (“Netflix”) successfully replaced a portion of the commitments under its previously disclosed bridge commitment letter with a more permanent and cost effective funding structure, as further described below. Revolving Credit Agreement On December 19, 2025, Netflix entered into a Senior Unsecured Revolving Credit Agreement (the “Revolving Credit Agreement”) with the lenders party thereto and Wells Fargo Bank, National Association, as the administrative agent.\n\n(Item 1.01) of this Current Report on Form 8-K is incorporated by reference herein.": 0.5,
  "(Item 2.02) Results of Operations and Financial Condition As previously announced on October 22, 2025, beginning in the first quarter of 2026, Honeywell International Inc. (the “Company”) intends to realign its business units comprising its Industrial Automation and Energy and Sustainability Solutions reportable business segments. This realignment will result in the formation of a new reportable business segment, Process Automation and Technology, and also result in a new composition of the Industrial Automation reportable business segment. Process\n\n(Item 2.02) , including Exhibit 99.1, should be read in conjunction with the Company's Annual Report on Form 10-K for the year ended December 31, 2024, and the Company's quarterly reports on Form 10-Q for the quarterly periods ended March 31, 2025, June 30, 2025, and September 30, 2025. The information furnished pursuant to this\n\n(Item 2.02) , including Exhibit 99.1 in\n\n(Item 8.01) Other Events As previously disclosed, on March 1, 2023, Flexjet, LLC (“Flexjet”) brought suit against the Company, alleging breach of the parties’ aircraft engine maintenance service agreement and seeking liquidated damages for delayed engine repairs. Flexjet provides private jet services to customers, and the Company maintains aircraft engine maintenance service contracts with Flexjet. The Company is providing an update with respect to the previously disclosed Flexjet-related litigation matters. The Company is in ongoing settlement negotiations\n\n(Item 2.02) hereof). 104 Cover Page Interactive Data File (the cover page XBRL tags are embedded within the Inline XBRL document).": 0.1,
  "Before You Buy the Dip on Costco Stock, Here Are 3 Things to Watch in 2026": 0.1,
  "Meet the \"Magnificent Seven\" Stock That Pays More Dividends Than Any Other S&P 500 Company. Here's Why It's a Buy Before 2026.": 0.8,
  "3 Reasons to Buy Luckin Coffee Stock in 2026": 0.5,
  "Is ASML (NasdaqGS:ASML) Overvalued After Its Strong Year-to-Date Rally?": -0.5,
  "Dow Jones Futures Rise; Palantir, GE Lead 12 Stocks In Buy Zones": 0.5,
  "Jacobio Strikes New Cancer Drug Deal with AstraZeneca": 0.5,
  "2 Cash-Heavy Stocks with Exciting Potential and 1 We Brush Off": 0.6,
  "2 Large-Cap Stocks Worth Investigating and 1 We Find Risky": 0.2,
  "1 Volatile Stock for Long-Term Investors and 2 Facing Headwinds": -0.5,
  "1 Cash-Producing Stock Worth Investigating and 2 Facing Headwinds": 0.2,
  "3 Volatile Stocks Walking a Fine Line": -0.5,
  "1 Safe-and-Steady Stock on Our Watchlist and 2 We Turn Down": 0.2,
  "2 Cash-Producing Stocks to Consider Right Now and 1 We Find Risky": 0.5,
  "Medtronic’s diabetes spinoff MiniMed files for IPO": 0.5,
  "Faron Announces Strategic Collaboration with The Institute for Cancer Research to Launch BLAZE Trial, Targeting Immunotherapy Resistance in Cancer": 0.8,
  "ENHERTU® Granted Breakthrough Therapy Designation in the U.S. as Post-Neoadjuvant Therapy for Patients with HER2 Positive Early Breast Cancer": 0.6,
  "AstraZeneca Drug Combination Falls Short of Goal in Lung-Cancer Trial": -0.7,
  "2 Top Stocks to Buy and Hold for the Long Term": 0.0,
  "Billionaire Stanley Druckenmiller Sells Broadcom Stock and Buys an Overlooked Stock Up 6,910% Since Its IPO": 0.8,
  "This Former Ice-Hockey Pro Nailed the AI Trade": 0.6,
  "Adobe (ADBE): Reassessing Valuation After New Runway AI Video Partnership and Creative Cloud Push": 0.5,
  "Western Digital (WDC) Soars 3.5%: Is Further Upside Left in the Stock?": 0.5,
  "Starbucks hires technology chief from Amazon": 0.5,
  "Palo Alto Networks, Google Cloud partner to enhance AI and cloud security": 0.6,
  "AIG, Amwins and Blackstone form Lloyd’s Syndicate 2479": 0.0,
  "Prediction: These Could Be the Biggest Stock-Split Winners of 2026": 0.5,
  "Earnings Preview: What to Expect From Seagate Technology's Report": 0.5,
  "Costco vs. Walmart: Which Retail Giant Should You Buy?": 0.2,
  "What Is One of the Best AI Stocks to Buy and Hold in 2026 and Beyond?": 0.5,
  "Jefferies Upgrades KLA (KLAC) to Buy, Sees Run Just Beginning": 0.8,
  "Nvidia and Palantir Stock: One Is Set to Rise and the Other to Fall in 2026": 0.2,
  "Lam Research (LRCX) Surges 4.6%: Is This an Indication of Further Gains?": 0.6,
  "Japan’s Biggest Bitcoin Holder Now Offering Dividend Shares to Investors": 0.8,
  "The value that neocloud companies offer to major AI players": 0.5,
  "Cadence Design Systems (NASDAQ:CDNS) Seems To Use Debt Rather Sparingly": 0.5,
  "Does Keurig Dr Pepper Inc.'s (NASDAQ:KDP) Weak Fundamentals Mean That The Stock Could Move In The Opposite Direction?": 0.1,
  "HONEYWELL PROVIDES SUPPLEMENTAL FINANCIAL INFORMATION FOR PLANNED SEGMENT REALIGNMENT; ADJUSTS OUTLOOK TO EXCLUDE ADVANCED MATERIALS": 0.1,
  "Market Chatter: SoftBank Racing to Fulfill $22.5 Billion Funding Commitment to Microsoft-Backed OpenAI by End of Year": 0.5,
  "Li Auto And 2 More Growth Companies With Strong Insider Confidence": 0.6,
  "This Week In AI Chips - Navigating AI Integration Challenges and Enterprise Risk Management": 0.1,
  "Undervalued Equities That May Offer Value In December 2025": 0.5,
  "US High Growth Tech: 3 Stocks to Watch": 0.5,
  "AMD Analysts See 40% Upside as AI Momentum Builds": 0.8,
  "Honeywell expects $470 million charge from Flexjet settlement": -0.5,
  "SoftBank races to fulfill $22.5 billion funding deal with OpenAI, sources": 0.2,
  "ENHERTU® (fam-trastuzumab deruxtecan-nxki) granted Breakthrough Therapy Designation in the US as post-neoadjuvant therapy for patients with HER2-positive early breast cancer": 0.5,
  "Positioning for a Big Move: ABNB Long Straddle Trade Idea": 0.5,
  "Marvell Technology, Inc. (NASDAQ:MRVL) is favoured by institutional owners who hold 83% of the company": 0.6,
  "Illumina (ILMN) Surges 3.3%: Is This an Indication of Further Gains?": 0.6,
  "Warren Buffett Departs With 64% of Berkshire Hathaway in 5 Stocks to Hold Forever": 0.5,
  "“We’re Gonna See Western Digital (WDC) Go Up,” Says Jim Cramer": 0.6,
  "“We’re Gonna See Seagate (STX) Go Up,” Says Jim Cramer": 0.6,
  "Stocks Rise Pre-Bell Ahead of Holiday-Shortened Trading Week": 0.5,
  "This Year’s Best Growth Stock Isn’t What You Think It Is": 0.5,
  "Global $31.45 Billion Wireless Mesh Network Market Outlook, 2025-2032 Featuring Strategic Analysis of Cisco Systems, Hewlett Packard, Fortinet, Extreme Networks, NETGEAR and Other Key Players": 0.5,
  "This Week In Digital Payment - Euronet Wins Mastercard Award for Agile Credit Innovation": 0.6,
  "These AI Stocks Could Still Deliver Big Upside in December and Beyond": 0.8,
  "Intuit CFO: Stablecoins are the new ‘digital dollar’ rail": 0.5,
  "Starlab Closes Credit Facility": -0.5,
  "ASML reports transactions under its current share buyback program": 0.0,
  "Gilead Sciences Exercises Option to License Assembly Biosciences’ Helicase-Primase Inhibitor Programs for Recurrent Genital Herpes": 0.5,
  "Fastenal Announces CEO Transition": 0.0,
  "Cintas Proposes to Acquire UniFirst for $275.00 Per Share in Cash": 0.5,
  "Lam Research Hits 52-Week High: Is the Stock Still Worth Buying?": 0.5,
  "Baker Hughes to Supply Liquefaction Equipment for Commonwealth LNG Export Project": 0.5,
  "NVDA vs. AMAT: Which Semiconductor Stock Is the Better Buy Now?": 0.5,
  "Strategy pauses bitcoin buys, boosting cash reserve by $748 million last week": 0.5,
  "Can Completion of Qualcomm's Alphawave Buyout Deal Propel Its Shares?": 0.5,
  "Billionaire Michael Saylor’s Strategy Boosts USD Reserves by $748M to $2.19B": 0.8,
  "Tesla, UniFirst, Clearwater jump premarket; Honeywell slips": 0.2,
  "Drug Sector on a High as 9 Drugmakers Strike Drug Pricing Deals": 0.6,
  "Analyst who predicted Palantir rally picks top stock for 2026. - Guilfoyle is still a Palantir fan and a devotee of Palantir CEO Alex Karp and AMD CEO Lisa Su. However, he has taken a different direction this year, backing another company led by a dynamic CEO, Anthony Noto’s SoFi Technologies, as his best idea for 2026. https://www.thestreet.com/investing/stocks/analyst-who-predicted-palantir-rally-picks-top-stock-for-2026": 0.6,
  "Meta Platforms, Inc. (META) Bolsters AI Glasses with new Software Update for Noise Reduction": 0.6,
  "Morgan Stanley Lifts Apple Inc. (AAPL) Price Target on Earnings Growth Expectations": 0.8,
  "Jefferies Affirms Buy Rating on Netflix, Inc. (NFLX) on Warner Bros. Discovery Acquisition Prospects": 0.8,
  "Wall Street Firms Cut Adobe Inc. (ADBE) Price Target but Tout Revenue Growth and Long-term Outlook": 0.5,
  "England High Court  Sanctions QUALCOMM Incorporated (QCOM)’s Alphawave IP Group Acquisition": 0.5,
  "Is KLA Corporation (KLAC) One of the Best Forever Stocks to Buy According to Hedge Funds?": 0.5,
  "Morgan Stanley Upgrades DexCom (DXCM), Cites Undervalued Recovery and G7 Margin Potential": 0.8,
  "BMO Capital Sees Impressive Guidance and Construction Cloud Momentum at Autodesk (ADSK)": 0.8,
  "BofA Maintains Buy on AMD, Views 2026 as the Midpoint of a Decade-Long AI Infrastructure Cycle": 0.6,
  "Jefferies Urges Selectivity in Internet Stocks for 2026 as AI Disruption and Rising Costs pressure Margins": -0.5,
  "Xcel Energy Announces Upsizing and Results of Cash Tender Offers for Certain Outstanding First Mortgage Bonds Issued by Northern States Power Company (a Minnesota corporation)": 0.1,
  "Premarket Movers: Nvidia is Still Pushing Aggressively Higher": 0.8,
  "1 Surprising Chip Stock Every Investor Should Own In 2026": 0.5,
  "How Low Could Palantir (PLTR) Stock Go In 2026?": -0.5,
  "Honeywell Lowers 2025 Outlook Following Advanced Materials Business Unit Spinoff": -0.5,
  "Bull of the Day: Micron Technology (MU)": 0.5,
  "Permian Operations to Drive Resilience for These 3 Oil Stocks in 2026": 0.5,
  "Here's What to Expect From Netflix's Next Earnings Report": 0.2,
  "OneMedNet CEO Aaron Green Issues Letter to Shareholders Highlighting 2025": 0.5,
  "CSX Corp. Announces Date for Fourth Quarter Earnings Release and Earnings Call": 0.0,
  "Unloved Energy Bet Is Set to Become Most Profitable Private-Equity Deal Ever": 0.8,
  "Investors Heavily Search Comcast Corporation (CMCSA): Here is What You Need to Know": 0.5,
  "Here is What to Know Beyond Why Cisco Systems, Inc. (CSCO) is a Trending Stock": 0.2,
  "Investors Heavily Search Meta Platforms, Inc. (META): Here is What You Need to Know": 0.5,
  "T-Mobile US Insiders Sell US$15m Of Stock, Possibly Signalling Caution": -0.5,
  "The Real Winner From Latin America’s Retail Boom": 0.5,
  "Only Seen Twice in 153 Years: History’s Clear Warning for the Stock Market in 2026": -0.8,
  "NOT another Ai bubble post, just questions about hope, truth and direction - Lately I have been getting a lot of posts into my timeline from the likes of Ed Zitron and others who claim that Ai and all the companies involved is a massive bubble. The accusations range from straight up accounting fraud (millions of unused GPus in Warehouses) to raising questions about IMO legitimate concerns like how OpenAI will honor a trillion dollars": 0.1,
  "If You Like AMD’s Future, AMDY Lets You Go Full Send With An Over 100% Distribution Yield": 0.6,
  "The Global X MSCI Argentina ETF Has Had A Shockingly Good 200% Run": 0.8,
  "Buy 3 AI Semiconductor Powerhouses Poised to Dominate 2026": 0.5,
  "Renewed AI Chip Enthusiasm Boosts US Equity Futures While War Jitters Lift Oil": 0.6,
  "International Markets and Broadcom Inc. (AVGO): A Deep Dive for Investors": 0.5,
  "Zacks Industry Outlook Highlights Vertiv, Cognizant Technology Solutions and EPAM Systems": 0.5,
  "This Retail Dividend Stock Rallying in 2025 Beats Big Tech Giants": 0.6,
  "Netflix Cuts $25 Billion from Bridge Loan for WBD Acquisition": 0.5,
  "Paychex (PAYX) Reports Q2 Earnings: What Key Metrics Have to Say": 0.2,
  "Is Micron (MU) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "ASML (ASML) Recently Broke Out Above the 50-Day Moving Average": 0.5,
  "Brokers Suggest Investing in Lam Research (LRCX): Read This Before Placing a Bet": 0.5,
  "Is It Worth Investing in Strategy (MSTR) Based on Wall Street's Bullish Views?": 0.5,
  "If You Think Apple Trading For 36x Earnings Is Nuts, You Can Bet Against Them With AAPD ETF": -0.5,
  "Microsoft Stock Has 29% Upside in 2026, Says Dan Ives. Why It’s an AI Front-Runner.": 0.6,
  "Gilead Sciences Exercises Option With Assembly Bio to License Herpes Drugs": 0.5,
  "Paramount's new WBD bid, Nvidia & China, Clearwater to go private": 0.0,
  "BofA upgrades credit ratings of Intel and Micron": 0.8,
  "The Zacks Analyst Blog Highlights Constellation Energy, Talen Energy and Dominion Energy": 0.5,
  "PANW Deepens Ties With Google: Will This Enhance Prisma AIRS Adoption?": 0.5,
  "Paramount has an updated Warner Bros. Discovery bid": 0.2,
  "Circle CEO Jeremy Allaire shares his 10-year vision: We want to be foundational to the internet": 0.6,
  "Micron management’s comments are bullish for these 3 chip stocks: analyst": 0.8,
  "MU hits another record high how long can this rally last? - I've held MU for nearly nine months, and it's delivered solid returns. After ORCL and AVGO released their earnings reports, MU's stock price kept falling. At that point, I debated whether to reduce my position, but since MU's earnings were coming up soon, I decided to wait it out. Fortunately, MU's earnings didn't disappoint the stock surged after the report and hit new": 0.6,
  "Oracle's Larry Ellison agrees to backstop $40.4 billion in financing for Paramount acquisition of Warner Bros.": 0.5,
  "The Zacks Analyst Blog Highlights Kraft Heinz, Delta Air Lines, FedEx, United Natural Foods and LATAM Airlines": 0.5,
  "Do Nebius Mega Deals Increase Customer Concentration Risk?": 0.0,
  "Baird Reaffirms Buy on Intuitive Surgical (ISRG) After New FDA Clearances": 0.8,
  "Constellation Energy (CEG): Analyst Target Cut, Major Award, and Landmark Acquisition": 0.5,
  "UBS Reaffirms Buy on Linde (LIN) at $500, Sees 10%+ EPS Growth": 0.8,
  "UBS, Citi Raise Baker Hughes (BKR) Targets Ahead of Energy Recovery": 0.6,
  "Wearable AI Industry Sizing and Opportunity Outlook 2025-2030 Featuring Apple, BRAGI, OrCam Technologies, Polar Electro, RealWear, Nexxbase Marketing, ThirdEye Gen, Everysight and Other Key Players": 0.5,
  "Wall Street Analysts See a 44.75% Upside in Atlassian (TEAM): Can the Stock Really Move This High?": 0.5,
  "The Zacks Analyst Blog Highlights Micron Technology and Palantir Technologies": 0.5,
  "Comcast Business Caps 2025 with Unprecedented Wave of Analyst Recognition for Enterprise Managed Services and Secure Networking Leadership": 0.6,
  "Are CrowdStrike's Expanding Partnerships a Catalyst for Future Growth?": 0.5,
  "Analysis-How AI boom is pressuring videogame console industry in race for memory chips": 0.1,
  "Stock Indexes Higher on Strength in Tech Stocks": 0.5,
  "Nvidia and Micron Stocks Climb -- Wall Street Picks 2026 Semiconductor Winners": 0.6,
  "My take on TSM for the long run - Last night I was chatting with some friends about TSM and looking at it as a long term hold and I wanted to hear what everyone else thinks TSM is still the clear king of pure foundry especially in advanced nodes like 5nm and 3nm where basically no one can really touch them Demand from high performance computing and data centers is pushing it forward like": 0.6,
  "Billionaire Ellison offers personal guarantee for son's bid for Warner Bros": 0.5,
  "Post-Christmas Can Nvidia Keep Rising With AI Competition - Hey yall I’ve been thinkin a lot about Nvidia NVIDIA lately They’re the top dog in the AI chip world no doubt But with more and more competition coming their way what’s the market gonna look like after Christmas Given how fast AI tech is developing do yall think Nvidia can keep its stock up Especially with all the changes that might come after the holiday": 0.2,
  "AZN, Daiichi's Enhertu Gets Breakthrough Tag for Expanded Cancer Use": 0.5,
  "AI trade: Where risk is becoming apparent as 2025 closes out": -0.5,
  "Year-End Window Dressing? 3 Stocks Funds May Buy Late in 2025": 0.2,
  "UniFirst Confirms Receipt of Unsolicited, Non-Binding Proposal from Cintas Corporation": 0.2,
  "AI Chips Are Driving a Foundry Boom. Why TSMC Is Winning the Most": 0.5,
  "Cintas Reiterates $275-Per-Share Bid to Acquire UniFirst": 0.5,
  "Micron's impressive revenue growth, but can the momentum last? - Micron (MU) Reports Record Q1 FY2026 Earnings and Issues Optimistic Guidance Last week, Micron Technology (MU) posted record earnings for Q1 of fiscal year 2026 and issued optimistic guidance for the upcoming quarter, which led to a strong rally in its stock. This has further solidified the company’s impressive performance this year, with its stock up over 200% year-to-date. As a leader in memory chips,": 0.8,
  "CDW Price Target Reduced as Morgan Stanley Analyst Turns More Selective on IT Hardware Exposure": -0.5,
  "Question about maxing Roth contribution before year end - If I transfer the money into my Roth but don't buy anything by the end of the year, am I still able to contribute to the limit again next year? Have like 3k left to invest from 2025, but everything is so high that I'm hesitant to jump in. If I have to buy in, any fun suggestions? Is SOFI still a good speculative bet? VOO": 0.2,
  "Microchip (MCHP) Target Up as Mizuho Turns Selective on Chips": 0.5,
  "Accenture and Palantir Form New AI Partnership to Accelerate Enterprise Transformation": 0.8,
  "MELI vs. JD: Which Global E-commerce Stock Has More Upside?": 0.5,
  "Is Palantir Stock a Buy in 2026?": 0.0,
  "BMNR Stock Up 612.7% in 6 Months: Should You Still Buy It in 2026?": 0.5,
  "BofA Sees 2026 as Midpoint of AI Infrastructure Cycle, Lifts TXN Target": 0.5,
  "5 Stocks That Pay Out Dividends Like Apple": 0.5,
  "SoftBank Races to Finalize $22.5B OpenAI Investment by Year-End": 0.5,
  "Morgan Stanley Sees Cisco (CSCO) Benefiting From AI Infrastructure Demand": 0.6,
  "A comprehensive list of 2025 tech layoffs": -0.5,
  "Applied Materials (AMAT) Target Raised, but Mizuho Flags China and Intel Risks": -0.5,
  "Keeping Communities Connected When It Matters Most": 0.8,
  "Nvidia dominated the headlines in 2025 — these were its 15 biggest events of the year": 0.5,
  "Strategy Paused Bitcoin Buys Last Week. It Bought the Crypto Aggressively Earlier This December.": 0.5,
  "Apple (AAPL) Target Raised as Jefferies Sees Stronger iPhone Demand": 0.8,
  "Strategy raises $747.8 million via stock sales, pauses bitcoin purchases": 0.1,
  "DoorDash Is Getting into the AI Game. Should You Buy DASH Stock Here": 0.2,
  "Cintas Isn’t Taking Years of No for an Answer, Makes Fresh Bid for UniFirst": 0.2,
  "Microsoft Positioned for AI-Driven Growth in 2026, Wedbush Says": 0.6,
  "Alphabet to acquire data center and energy infrastructure company Intersect - Google parent [Alphabet](https://www.cnbc.com/quotes/GOOGL/) on Monday [announced](https://abc.xyz/investor/news/news-details/2025/Alphabet-Announces-Agreement-to-Acquire-Intersect-to-Advance-U-S--Energy-Innovation-2025-DVIuVDM9wW/default.aspx) it will acquire Intersect, a data center and energy infrastructure company, for $4.75 billion in cash in addition to the assumption of debt. Alphabet said Intersect’s operations will remain independent, but that the acquisition will help bring more data center and generation capacity online faster. “Intersect will help us expand capacity, operate more nimbly in building new power": 0.5,
  "Larry Ellison Offers Personal Financial Guarantee For Paramount's Warner Bros. Bid": 0.5,
  "How Caterpillar Crushed the Magnificent 7 in 2025 — And It’s Not Done Yet!": 0.8,
  "TSLA hits new highs can it break through the $500 mark before Christmas? - Tesla hit another all time high today, briefly surpassing $498 during trading just a hair's breadth away from the $500 mark. I believe the key catalysts are:Market perception of Robotaxi road testing and autonomous driving progress as tangible long term growth potential,Alongside emotional support from the CEO's legal and incentive developments. Do you think TSLA can break through $500 before Christmas?": 0.6,
  "Monster Beverage Positioned for Sustainable High Growth Versus Peers, Morgan Stanley Says": 0.8,
  "Paychex Faces Softer Revenue Trends, Paycor Reacceleration Risk, Morgan Stanley Says": -0.5,
  "TER vs. AMD: Which AI Component Supplier Stock Is the Better Buy?": 0.5,
  "Michael Saylor's Strategy expands dollar reserve instead of Bitcoin": -0.5,
  "DoorDash vs. Shopify: Which E-Commerce Stock Has an Edge Now?": 0.2,
  "This Michael Burry Warning Could Be Bigger Than His Short Call on Palantir": 0.5,
  "$MU post-ER:directional vs neutral option setups - MU just posted a strong earnings and guidance update driven by AI and data center memory demand The stock ripped after earnings and the overall story is clearly bullish but from an options standpoint I am trying to figure out the best risk reward after such a big move A few things on my mind Post earnings IV crush has probably already played out Near term upside feels": 0.6,
  "Top Midday Stories: Nvidia Said to Start H200 Shipments to China by Mid-February; Alphabet to Buy Intersect for $4.75 Billion": 0.5,
  "3 Must-Watch 5G Stocks Poised for the Next Growth Wave in 2026": 0.6,
  "Strategy (MSTR) Stock Trades Up, Here Is Why": 0.5,
  "The Honest Company (HNST) Stock Is Up, What You Need To Know": 0.5,
  "Boyar Value Group Urges UniFirst Board to Immediately Initiate Strategic Review Following 60%+ Premium Offer": 0.8,
  "Technip Energies awarded a large authorization by Commonwealth LNG for key equipment purchase orders": 0.8,
  "Micron (MU) Is Up 10.28% in One Week: What You Should Know": 0.6,
  "Get Ready for a Fruity Facebook as Meta Preps New Mango AI Model. Should You Buy META Stock Here?": 0.5,
  "There's a Growth Stock Trading at Value Prices": 0.5,
  "Strategy pauses Bitcoin buying, builds cash reserves": -0.5,
  "Roblox Stock Down 38% in 3 Months: Buy the Dip or Sell More?": -0.6,
  "Larry Ellison Steps Up His Bid to Help Paramount Pull Warner Bros. From Netflix": 0.5,
  "Advanced Micro Devices Could Score Major China Coup": 0.6,
  "‘Top Pick’ Amazon Had a Dismal Year: What’s AMZN Stock’s Forecast for 2026?": -0.5,
  "Reasons to Hold MSTR Stock Despite a 50% Decline in 3 Months": 0.5,
  "AI Boom Drives Sharp Profit Growth at Broadcom (AVGO)": 0.6,
  "Heavy AI Investment Positions Microsoft (MSFT) for Strong Growth Beyond 2026": 0.8,
  "Crude Oil Prices Higher on Venezuelan and Ukraine-Russia Risks": 0.5,
  "Palantir Zooms Into Buy Zone After Contract Wins, Earnings Beat": 0.8,
  "PayPal (PYPL)’s “Going Lower, Maybe Much Lower,” Says Jim Cramer": -0.6,
  "Is PepsiCo's Protein and Prebiotic Push a New Functional Edge?": 0.2,
  "Discover 3 Elite Growth Stocks With Significant Insider Ownership": 0.5,
  "Ad Launching Platform Ads Uploader Exits Beta with Users in 30 Countries": 0.5,
  "3 Stocks Estimated To Be Trading Below Their Intrinsic Value In December 2025": 0.5,
  "Is Lam Research (LRCX) a Solid Growth Stock? 3 Reasons to Think \"Yes\"": 0.6,
  "Netflix Locks In $25 Billion Debt Package to Back Warner Bros. Deal": 0.2,
  "Larry Ellison Backs Paramount's Warner Bros Bid With $40.4 Billion Personal Guarantee": 0.8,
  "SoftBank Races to Secure $22.5 Billion OpenAI Funding by Year-End": 0.5,
  "Alibaba Weighs Major AMD AI Chip Order": 0.5,
  "Microsoft Set to Outpace AI Growth Expectations, Says Wedbush": 0.8,
  "Microsoft, Salesforce and Oracle Named Top Software Picks for 2026": 0.8,
  "Larry Ellison Backs Paramount's Warner Bros Discovery Bid With $40bn Guarantee": 0.8,
  "AMD Shares Climb on Reports of Alibaba Massive AI Chip Order": 0.8,
  "US Equity Indexes Rise Amid Gains in Materials, Financials; Gold, Silver Break Price Records": 0.8,
  "INTC: Intel Foundry Push and Nvidia Backing Could Drive 2026 Growth": 0.6,
  "TTD vs. AMZN: Which Ad-Tech Stock Is the Smarter Buy Now?": 0.5,
  "Mondelez (MDLZ) Valuation Check After Recent Share Price Pullback": 0.2,
  "Waymo is back online in San Francisco, but may struggle after failure": -0.5,
  "Billionaire philanthropy’s growing divide: Mark Zuckerberg stops funding immigration reform as MacKenzie Scott doubles down on DEI": 0.2,
  "What Yogi Berra Would Say About the Talks to Take Over Warner Bros. Discovery": 0.2,
  "Sector Update: Consumer Stocks Mixed Monday Afternoon": 0.0,
  "Palo Alto Networks Stock Is Down But Not Out - Worth Buying PANW Here?": 0.5,
  "Will More Circular Deal-Making Be in the Cards for Nvidia in 2026?": 0.2,
  "Un-carrier Unwrapped 2025": 0.0,
  "The world’s largest chain has made its U.S. debut": 0.5,
  "12 Stocks That Dropped After Tax-Loss Selling—and Can Bounce Back": 0.5,
  "Will Tesla Stock Lose Its ‘Elon Musk Premium’ After the SpaceX IPO? And You Should Sell TSLA Here?": -0.5,
  "Sector Update: Energy Stocks Gain Monday Afternoon": 0.5,
  "Equity Markets Rise Intraday; Gold, Silver Reach New Highs": 0.5,
  "Ellison offers $40 billion to beef up Paramount's Warner Bros bid": 0.5,
  "Dominion wind farm project on pause, Honeywell cuts Q4 outlook": -0.5,
  "MU hits a new all-time high .what’s driving it? - Micron MUUS is up over 4 percent in pre market hitting 27729 a fresh all time high Here’s what’s fueling the rally Huatai Securities keeps a Buy rating and raised the target to 360 FY26 Q1 revenue and profits beat expectations thanks to AI driven demand for HBM and DRAM pushing margins higher Capex bumped to 20B HBM4 yield ramping faster and SOCAMM2 advantage is": 0.6,
  "Ranking the Best \"Magnificent Seven\" Stocks to Buy for 2026. Here's My No. 7": 0.5,
  "Broadcom, Circle, and 8 More Stocks That Look Overvalued for 2026": -0.6,
  "Naples attorney celebrates victory in restoration of Elon Musk's pay": 0.6,
  "Coeur Mining - What do you guys think of CDE? So far, it has seen some unbelievable growth this past year. Here are the four main bullish points I found: **1. Improved Financials & Cash Flow** * Better cost control and stronger operating cash flow. * Ongoing debt reduction improves balance-sheet health. * Increased ability to fund growth internally. **2. Production Growth & Asset Base** * Multiple producing mines provide diversification. * Expansion projects are": 0.8,
  "Ellison backs Paramount bid for WBD with $40 billion personal guarantee": 0.5,
  "Bill Ackman Proposes Elon Musk's SpaceX IPO Through SPARC Structure, Offering Tesla Shareholders Priority Access": 0.5,
  "ChatGPT Super Micro Computer Stock Will Close At This Price In The Next 60 Days": 0.2,
  "Tesla vs. BYD: What's the Better Buy?": 0.0,
  "300 WAREHOUSE WORKERS AT UNFI JOIN TEAMSTERS": 0.5,
  "Warner Stock Jumps After Larry Ellison Guarantees Paramount Bid Funding": 0.8,
  "Looking for feedback - DIS to NFLX - I’ve held DIS since 2019, averaged down in 2021–2022, but my thesis hasn’t played out, which put me underwater on this pick. At this point, I don’t see a clear path for Disney to outperform, especially with streaming still pressuring margins and parks carrying earnings. I’m thinking of selling out of DIS entirely and rotating the capital to NFLX, making it a larger holding. Netflix has shown": -0.6,
  "Paramount renews bid for Warner Bros, ensuring $40B Larry Ellison backing": 0.5,
  "NVIDIA & 2 More Profitable S&P 500 Stocks to Buy Before 2026": 0.5,
  "Why Warner Bros. Discovery (WBD) Stock Is Trading Up Today": 0.5,
  "Paramount (PSKY) Stock Is Up, What You Need To Know": 0.5,
  "Why Cloudflare (NET) Stock Is Up Today": 0.5,
  "UniFirst (UNF) Stock Trades Up, Here Is Why": 0.5,
  "Why Tesla (TSLA) Stock Is Trading Up Today": 0.5,
  "Can Shopify (SHOP) Turn Agentic AI and Sustainability Bets Into Durable Platform Advantage?": 0.5,
  "Iconic fast-food seafood chain closed over 800 restaurants": -0.8,
  "A Topsy-Turvy Year for Oracle and the Ellisons Will Bleed Into 2026": -0.5,
  "Crude Oil Prices Higher on Oil Tanker Disruptions": 0.5,
  "Warner Bros. Has Done 'Masterful' Job, Ross Gerber Says": 0.8,
  "Is Microsoft Undervalued by Investors? These Tech Stock Experts Think So.": 0.5,
  "Tesla Stock Poised for Even More Record Highs": 0.8,
  "Bitcoin $200K In 2026? Maybe. Probably, According to These Analysts.": 0.5,
  "US Equity Indexes Head Higher in Final Leg of Trading; Gold, Silver Break Price Records": 0.8,
  "Bitcoin slips below $88,000 as traders brace for $28.5 billion Deribit options expiry": -0.5,
  "Sector Update: Consumer Stocks Mixed Late Afternoon": 0.0,
  "Stock Market Today: Dow Ends Higher; Trump Takes The Wind Out Of This Name (Live Coverage)": 0.1,
  "Sector Update: Tech Stocks Climb Late Afternoon": 0.5,
  "Sector Update: Energy Stocks Rise Late Afternoon": 0.5,
  "Sector Update: Health Care Stocks Higher Late Afternoon": 0.5,
  "Bitcoin Fades After Strategy Sells Stock To Brace For Winter": -0.5,
  "Trump Enters the Race for Fusion Power": 0.5,
  "Vertex to Present at the 44th Annual J.P. Morgan Healthcare Conference on January 12": 0.2,
  "2026 Travel Takes Off: Falling Prices and Global Events Push New Cities Into the Spotlight, per KAYAK Data": 0.5,
  "Larry Ellison Backs Paramount's WBD Offer with $40B Guarantee": 0.8,
  "The Biggest Bitcoin and Crypto Treasury Plays of 2025": 0.5,
  "Stock market today: Dow, S&P 500, Nasdaq rise for third straight day, gold hits record to extend 2025 rally": 0.8,
  "Gilead Sciences to Present at Upcoming Investor Conference": 0.0,
  "Regeneron Announces Presentation at the 44th Annual J.P. Morgan Healthcare Conference": 0.5,
  "Alphabet to buy Intersect Power to bypass energy grid bottlenecks": 0.2,
  "Western Digital (WDC): Assessing Valuation After a Powerful Rebound in Share Price": 0.5,
  "Paramount Stock Rallies After Amended Warner Offer. The Ellisons Are All-In on the Deal.": 0.8,
  "Surf Air Mobility (SRFM) Deepens Palantir Ties: Can SurfOS Become Its Core Competitive Edge?": 0.5,
  "Self-Driving Cars Snarl San Francisco After Power Outage. Tesla Stock Hits Record.": 0.5,
  "Tesla Stock In A Buy Zone Amid More Unsupervised Robotaxi Videos And Musk's Pay Deal Court Win": 0.5,
  "Market will be more volatile than 'patient' on AI CapEx": 0.1,
  "One Liberty Properties Completes Purchase of a Six Building Multi-Tenant Industrial Property for $53.5 Million": 0.5,
  "Honeywell Stock Is Down on a Litigation Charge. Why It Shouldn’t Be.": 0.5,
  "Interface Stock Is Up 14% but Here's Why This Fund Just Cut $2.4 Million": -0.5,
  "These Stocks Moved the Most Today: Tesla, Warner Bros., Rocket Lab, DJT, Dominion Energy, Newmont, Micron, and More": 0.5,
  "Nvidia Stock Climbs On China Export News": 0.6,
  "1 Stock I'd Buy Before Costco (COST) in 2026": 0.2,
  "Freddie Mac Issues Monthly Volume Summary for November 2025": 0.0,
  "Wall Street Advances as Holiday-Shortened Trading Week Begins; Gold, Silver Hit Record Highs": 0.7,
  "Stocks to Watch Monday Recap: Tesla, Rocket Lab, UniFirst, Clearwater Analytics": 0.2,
  "Stocks Advance Toward Records in Broad Rally": 0.8,
  "Prediction: This AI Stock Could Deliver Market-Beating Gains Through 2030": 0.5,
  "How Google reclaimed its position in AI race dominated by OpenAI": 0.5,
  "WBD Bids Could Go Higher, Says Former CNN President Klein": 0.5,
  "US Equity Indexes Rise Amid Thin Trading Volumes; Gold Breaks Record": 0.5,
  "Saylor’s Strategy Raises Reserve, Pauses Bitcoin Purchases": 0.1,
  "Tech, Media & Telecom Roundup: Market Talk": 0.0,
  "The Case for Nvidia Stock Hitting $275 in 2026": 0.6,
  "Stock Bulls Drive S&P 500 to the Brink of Record: Markets Wrap": 0.5,
  "Who has the best last-minute holiday deals --Walmart, Amazon, or Target?": 0.0,
  "Analyst upgrades viral crypto stock's price target after billion-dollar deals": 0.8,
  "Stock Indexes Close Higher on Strength in Tech Stocks": 0.8,
  "Stock Market Today, Dec. 22: Tech Stocks Rise as Nvidia Anchors AI Rebound": 0.6,
  "Musk's Net Worth Nears Three-Quarters of a Trillion Following Landmark Pay Decision": 0.8,
  "Lam Research (LRCX) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Netflix (NFLX) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Palo Alto Networks (PANW) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Airbnb, Inc. (ABNB) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Apple (AAPL) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "AppLovin (APP) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Fortinet (FTNT) Outperforms Broader Market: What You Need to Know": 0.6,
  "Novo Nordisk A/S: Wegovy® pill approved in the US as first oral GLP-1 for weight management": 0.8,
  "Amgen (AMGN) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Paccar (PCAR) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Kraft Heinz (KHC) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Stock Market Today, Dec. 22: Tesla Shares Jump After Court Reinstates Elon Musk Pay Deal": 0.6,
  "TSM vs Broadcom stuck between these two and looking for opinions. - I’ve been diving into TSMC (Taiwan Semiconductor) and Broadcom lately, and honestly, the more I look into both, the harder it gets to choose. They each have some solid advantages. On one hand, Broadcom's recent partnership with OpenAI really stood out to me, especially with their work on custom AI chips and the potential for long-term growth. On the other hand, TSMC’s position": 0.5,
  "Arm Holdings (ARM): Revisiting Valuation After a Recent 20% Share Price Slide": 0.1,
  "Could Booking’s Cost Cuts and Connected Trip Push Outweigh Rising EU Legal Risks for BKNG?": 0.2,
  "Warner Bros. Discovery Confirms Receipt of Amended, Unsolicited Tender Offer from Paramount Skydance": 0.1,
  "Honeywell International Inc. (HON) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Wall Street closes higher, tech gains continue": 0.8,
  "ADBE pullback still needs confirmation. - The recent pullback in ADBE looks more like a normal reset in sentiment and valuation rather than any real deterioration in the underlying business. The core fundamentals remain intact, with a stable subscription model, solid cash flow, and strong product stickiness. This is not a name that suddenly became structurally broken. That said, from a trading perspective, this is also not a high conviction entry yet. The short term": 0.4,
  "Prediction: 2 Artificial Intelligence Stocks That Will Be Worth More Than Nvidia by the End of 2026": 0.5,
  "Why a Uniform Maker's Stock Soared 16% Monday": 0.6,
  "Saks Mulls Bankruptcy Year After Raising Billions for Turnaround": -0.6,
  "Larry Ellison Provides Personal Guarantee for Paramount’s Bid for Warner": 0.5,
  "Stock market today: Dow, S&P 500, Nasdaq futures steady with S&P eyeing fresh record": 0.5,
  "Why 2026 won’t be a Big Tech year - and what replaces it": -0.5,
  "Could AMD Finally Close the Gap on Nvidia AI Dominance?": 0.5,
  "Dow Jones Futures: Nvidia Tests Key Level; AppLovin, Apple, Palantir, Tesla In Buy Zones": 0.5,
  "Best Stock to Buy Right Now: Apple vs. Alphabet": 0.5,
  "MU closed strong today, rotation into memory finally starting? - MU just popped \\~4% on decent volume, and this feels more structural than your typical intra-day swing. The broader semiconductor group has been lagging AI “pure plays,” but memory names had been oversold relative to both Nvidia and the rest of the chip complex. Today’s strength suggests some rotation may finally be happening. There are a few catalysts behind this move: signs of improving memory": 0.8,
  "Review Preview: Festive Vibes": 0.5,
  "Generative Renaissance Comes Alive: SIGGRAPH Asia 2025 Closes in Hong Kong": 0.6,
  "Low cost trading platform recommendations? - I’ve been reading more about how the stock market works and I'm interested in getting started with investing. Do you have any recommendations for low cost platforms I could use to begin? Will certainly research more on the recommendations provided I’m only curious to know which platforms are most commonly used Big thanks in advance to those who leave an insight": 0.5,
  "New LNG and Kuwait Contracts Might Change The Case For Investing In Baker Hughes (BKR)": 0.2,
  "Why Unifirst Stock Crushed the Market Today": 0.5,
  "1 No-Brainer Artificial Intelligence (AI) Stock to Buy With $1,000 in December and Hold for the Long Term": 0.8,
  "Meta's 'Highest-Paid' Employee Is Reportedly Unhappy With Zuckerberg": -0.6,
  "Amazon rival discount retailer files Chapter 11 bankruptcy": -0.8,
  "Vertex Pharmaceuticals (VRTX): Valuation Check After Positive CASGEVY Pediatric Data and Kidney Disease Breakthrough Progress": 0.8,
  "Netflix in 2026: The Three Things Investors Should Watch Closely": 0.2,
  "Agoda Insights Reveal Business Impact of Localization Across Asia's Rapidly Growing Tourism Sector": 0.5,
  "Baker Hughes (BKR): Assessing Valuation After New LNG Contract Win and Analyst Upgrades": 0.5,
  "Is It Too Late To Consider Marriott After Its Strong Multi Year Share Price Rally?": 0.2,
  "Cognizant (CTSH) Valuation Check After New AI Partnerships and India Innovation Lab Expansion": 0.5,
  "This Nuclear Stock Could Turn $1,000 Into $100,000": 0.5,
  "1 Stock I'd Buy Before Tesla in 2026": 0.2,
  "Could Meta Platforms Stock Help You Become a Millionaire?": 0.5,
  "US public companies got halved since the 90s and retail cant catch the next NVDA early anymore - Back in the late 90s we had over 8000 listed companies, now its down to around 4000. Happened cuz regulations went nuts after Sarbanes-Oxley, small companies cant afford all the compliance crap. Private money is everywhere too, VCs and PE sitting on piles of cash so good startups just stay private forever. Big corps also scoop up": -0.6,
  "Jim Cramer Says “I’m a Buyer of Chewy”": 0.6,
  "Jim Cramer Highlights Alphabet’s Diverse Portfolio": 0.5,
  "Jim Cramer on Costco: “We Did Not Like the Way the Conference Call Went When They Reported Last”": -0.5,
  "Jim Cramer Says “I Own Apple, and I Say Own it, Don’t Trade It”": 0.6,
  "Jim Cramer Says Eli Lilly’s GLP-1 Pill Is “Going to Revolutionize Everything”": 0.8,
  "Texas Pacific Land (TPL) Signs Data Center Deal with Bolt Data & Energy": 0.5,
  "Nebius Group (NBIS) Launches AI Cloud 3.1": 0.5,
  "Here’s What Wall Street Has to Say About Sandisk Corporation (SNDK)": 0.2,
  "SailPoint, Inc (SAIL) Integrates Its Identity Security Cloud with the CrowdStrike’s Falcon": 0.5,
  "Press Release: Sanofi and Regeneron’s Dupixent approved in Japan for children aged 6 to 11 years with bronchial asthma": 0.5,
  "Dupixent® (dupilumab) Approved in Japan for Children Aged 6 to 11 Years with Bronchial Asthma": 0.5,
  "How pension changes in 2025 may affect our retirement": 0.0,
  "Is It Too Late To Consider Baker Hughes After Its Strong Multi Year Share Price Run?": 0.2,
  "How Investors Are Reacting To Advanced Micro Devices (AMD) New AI Leadership Moves And Alibaba Accelerator Prospects": 0.5,
  "If You'd Invested $10,000 in Nvidia 10 Years Ago, Here's How Much You'd Have Today": 0.5,
  "Why Microsoft Could Be the Biggest AI Winner in 2026": 0.5,
  "Got $100,000? Buy This Unstoppable Growth Stock Before Its Market Cap Hits $3 Trillion.": 0.5,
  "Former Met chief demands Apple and Google disable stolen phones": -0.5,
  "Markets mostly rise as rate cut hopes bring Christmas cheer": 0.8
}