{
  "Looking Beyond Yield for the Safest Dividend Payers": 0.5,
  "If You Invested $10K In Mid-America Apartment Communities Stock 10 Years Ago, How Much Would You Have Now?": 0.0,
  "The Zacks Analyst Blog Highlights Meta Platforms, Lam Research, Flex and Seagate": 0.5,
  "STMicro Shares Drop on Surprise Loss, Disappointing Outlook": -0.8,
  "CSX Corporation (CSX): “I Am In Charge Of The Rails,” Says Jim Cramer": 0.5,
  "Linde Earns FTSE4Good Inclusion for Tenth Consecutive Year": 0.8,
  "QuickBooks AI Features (2025): QuickBooks Awarded Best AI-Powered Accounting Features in Report by Software Experts": 0.8,
  "Zum Appoints Daniel Berenbaum as Chief Financial Officer": 0.5,
  "2 Top Artificial Intelligence (AI) Stocks Ready for a Bull Run": 0.8,
  "Options Trading Now Available on Latest Five Tradr ETFs: CWVX, SMU, ASTX, GEVX and CEGX": 0.5,
  "Old Dominion Freight Line Announces $0.28 Per Share Quarterly Cash Dividend": 0.5,
  "Institutional investors have a lot riding on O'Reilly Automotive, Inc. (NASDAQ:ORLY) with 86% ownership": 0.2,
  "Keurig Dr. Pepper earnings beat estimates as energy drinks shine, but coffee inflation lurks": 0.2,
  "Marriott finalises acquisition of lifestyle hotel brand citizenM": 0.5,
  "Stocks Mostly Up Pre-Bell as Investors Assess Trump's Latest Tariff Threat, Key Earnings": 0.5,
  "Applied Materials to Report Fiscal Third Quarter 2025 Results on August 14, 2025": 0.0,
  "Regeneron Announces the 2025 Winners of the Regeneron Prize for Creative Innovation": 0.5,
  "Keurig Dr Pepper quarterly revenue beats expectations fueled by US demand": 0.8,
  "Keurig Dr Pepper shares fall as Coffee segment struggles despite earnings beat": -0.6,
  "AAON And 2 Other Insider Picks For Growth Potential": 0.5,
  "3 Stocks That Could Be Trading Below Their Estimated Value In July 2025": 0.5,
  "American Airlines, Southwest, Keurig Dr Pepper: Trending stocks": 0.2,
  "High Growth Tech Stocks In The US For July 2025": 0.5,
  "Keurig Dr Pepper (NASDAQ:KDP) Surprises With Q2 Sales": 0.5,
  "Cognizant's AI Lab Records 59th U.S. Patent, Continuing to Generate AI Breakthroughs": 0.8,
  "Constellation‘s Deal With Calpine Approved by Federal Energy Regulatory Commission": 0.5,
  "onsemi and Schaeffler Expand Collaboration with  New EliteSiC-based PHEV Platform": 0.5,
  "Those who invested in Monster Beverage (NASDAQ:MNST) five years ago are up 53%": 0.5,
  "Nasdaq CEO signals improved IPO market momentum, shares jump on results beat": 0.8,
  "Keurig Dr Pepper, Inc (KDP) Meets Q2 Earnings Estimates": 0.5,
  "Take-Two Interactive Software's Q1 2026 Earnings: What to Expect": 0.0,
  "Longleaf Partners Fund Increased its Holdings in Regeneron Pharmaceuticals (REGN) on a Dip": 0.5,
  "Regeneron Pharmaceuticals, Inc. (REGN): A Bull Case Theory": 0.5,
  "Nubank Appoints Ethan Eismann as Chief Design Officer, Deepening Commitment to Customer Experience": 0.8,
  "Valneva (VALN) Soars 17.4%: Is Further Upside Left in the Stock?": 0.6,
  "Datadog, Inc. (DDOG): A Bull Case Theory": 0.5,
  "Oracle and Bloom Energy Collaborate to Deliver Power to Data Centers at the Speed of AI": 0.5,
  "VideoAmp and Warner Bros. Discovery Sign Multi-Year Deal to Advance Measurement and Currency Innovation": 0.6,
  "Fullmark Energy Appoints Energy Industry Veteran to Chief Financial Officer Delivering Path to Diversified Portfolio Growth": 0.8,
  "Emerging Markets Are Trouncing U.S. Stocks. This Pro Likes Alibaba, Mercado Libre.": 0.5,
  "Intuit Inc. (INTU) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Is Trending Stock Synopsys, Inc. (SNPS) a Buy Now?": 0.2,
  "Want Better Returns? Don't Ignore These 2 Aerospace Stocks Set to Beat Earnings": 0.8,
  "Here is What to Know Beyond Why Axon Enterprise, Inc (AXON) is a Trending Stock": 0.2,
  "When Should You Buy GE HealthCare Technologies Inc. (NASDAQ:GEHC)?": 0.1,
  "Warner Bros. Discovery, Inc. (WBD): I Don’t Think The Split Up Will Be Good, Says Jim Cramer": -0.6,
  "Discuss Reports Record Mid-Year Growth with AI Agentic Approach to Vibe Coding for Market Insights": 0.5,
  "CoStar Group Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "FuzeHub Brings New York State Innovation Summit to Rochester October 29 - 30": 0.5,
  "Should You Invest in Constellation Energy Corporation (CEG) Based on Bullish Wall Street Views?": 0.5,
  "Norfolk Southern stock rises after confirming merger talks with Union Pacific": 0.8,
  "CrowdStrike Holdings, Inc. (CRWD): A Bull Case Theory": 0.5,
  "Micron Stock Is Riding the AI Wave. A Rival’s Sales Surge Is Good News.": 0.5,
  "Keurig Dr Pepper Q2 Volume Growth Obscured By Margin Cut, Currency Headwind": -0.5,
  "Estimating The Fair Value Of Analog Devices, Inc. (NASDAQ:ADI)": 0.1,
  "Is DexCom, Inc.'s (NASDAQ:DXCM) ROE Of 24% Impressive?": 0.2,
  "Analysts Estimate Exelon (EXC) to Report a Decline in Earnings: What to Look Out for": -0.5,
  "Xcel Energy (XEL) Earnings Expected to Grow: Should You Buy?": 0.5,
  "Analysts Estimate Biogen Inc. (BIIB) to Report a Decline in Earnings: What to Look Out for": -0.5,
  "LRCX Likely to Beat Q4 Earnings Estimates: How to Play the Stock?": 0.5,
  "Micron Technology, Inc. (MU): A Bull Case Theory": 0.5,
  "PayPal Holdings, Inc. (PYPL): A Bull Case Theory": 0.5,
  "Energy Drink Demand Helps Keurig Dr Pepper Beat Profit and Sales Estimates": 0.8,
  "Heartland Express (HTLD) Reports Q2 Loss, Lags Revenue Estimates": -0.7,
  "Will DXCM Q2 Earnings Reflect U.S. Coverage Expansion & Stelo Impact?": 0.2,
  "\"You Get Praise For Serving Others,\" Not Flashing Wealth — Sheraton Hotels And Perdue Farms Heiress Sold Her $1.2 Million Ring For Ukraine Aid": 0.5,
  "Constellation Energy Corporation (CEG): A Bull Case Theory": 0.5,
  "Coming Soon to the Coffee Aisle: Tariffs": -0.5,
  "Keurig Q2 Earnings Meet Estimates, U.S. Refreshing Beverages Up 10.5%": 0.5,
  "American Electric Power to Post Q2 Earnings: What's in Store?": 0.0,
  "Will lululemon's Innovation Pipeline Deliver Growth in 2H25?": 0.5,
  "Keurig Dr Pepper CEO on Q2 beat, coffee sales, cane sugar": 0.5,
  "CSX Q2 Earnings Came Ahead of Estimates, Revenues Decline Y/Y": 0.2,
  "O'Reilly Q2 Earnings Beat Estimates, '25 Revenue Outlook Raised": 0.8,
  "O'Reilly Automotive Shows Growth in Q2 But Cost Concerns Loom, UBS Says": 0.1,
  "GOOGL Q2 Earnings Beat Estimates, Revenues Up Y/Y, Shares Rise": 0.8,
  "Young Women in Illinois Rev Up to Build, Race Electric Vehicles in ComEd’s EV Rally": 0.6,
  "Rail Operators Union Pacific, Norfolk in Advanced Talks About Potential Merger": 0.5,
  "GE HealthCare launches new advanced digital X-ray system to enable access and increase efficiency in high throughput settings": 0.8,
  "All eyes on CSX as Union Pacific and Norfolk Southern confirm talks": 0.5,
  "Verisk Sets Precedent as First to Complete Wildfire Catastrophe Model Review Process in California for Insurance Ratemaking": 0.5,
  "AstraZeneca Prepares Showdown With JNJ, Amgen With Phase 3 Win For Myasthenia Gravis Drug Candidate": 0.5,
  "Axon 2 Powers AppLovin's Explosive Growth in Mobile Advertising": 0.8,
  "Electronic Arts (EA) Unveils Epic Battlefield 6 Trailer With Stunning Gameplay Features": 0.8,
  "Marvell Technology (MRVL) Welcomes Veteran Tech Leader Rajiv Ramaswami to Board": 0.8,
  "Compared to Estimates, Keurig Dr Pepper (KDP) Q2 Earnings: A Look at Key Metrics": 0.2,
  "CSX (CSX) Stock Is Up, What You Need To Know": 0.5,
  "Earnings Dip for [CSX] (CSX) in Q2 While US$402 Million Buyback Continues": -0.2,
  "Keurig Dr Pepper Sees Continued U.S. Beverage Strength; Warns of Tariff Hit to Coffee": 0.2,
  "Old Dominion Freight Line (ODFL) Announces 7.7% Increase in Quarterly Dividend to US$0.28": 0.8,
  "3 Stocks Estimated To Be Trading Below Intrinsic Value By Up To 44.1%": 0.5,
  "Keurig Dr Pepper (KDP) Reaffirms 2025 Earnings Guidance For Mid-Single-Digit Sales Growth": 0.5,
  "How's MELI Using Argentina's Economic Recovery to Fuel its Growth?": 0.5,
  "Why T-Mobile US Stock Rose on Thursday": 0.5,
  "O'Reilly (ORLY) Stock Trades Up, Here Is Why": 0.5,
  "Cadence Design Systems, Inc. (CDNS): A Bull Case Theory": 0.5,
  "Intuit Inc. (INTU): A Bull Case Theory": 0.5,
  "Old Dominion Freight Line, Inc. (ODFL): A Bull Case Theory": 0.5,
  "Why O'Reilly Automotive Stock Raced Higher Today": 0.5,
  "Microchip Tech (MCHP) Sheds 6.7% as Chip Giant Signals Soft Outlook": -0.6,
  "Gilead Sciences to Release Second Quarter 2025 Financial Results on Thursday, August 7, 2025": 0.0,
  "KKR Completes Acquisition of Metronet through Joint Venture, Accelerating Fiber Expansion Across the U.S.": 0.8,
  "Oak Hill and Cinelli Family Complete Sale of Metronet": 0.2,
  "UScellular announces expected name change to Array Digital Infrastructure": 0.2,
  "UScellular Announces Expected Amount of Special Dividend": 0.2,
  "Stocks Close at Record as Alphabet Fuels AI Hopes: Markets Wrap": 0.8,
  "These Stocks Moved the Most Today: Tesla, Alphabet, IBM, Dow Inc., Honeywell, UnitedHealth, Southwest, American, and More": 0.0,
  "Union Pacific and Norfolk Southern in Talks. Stocks Drop.": -0.6,
  "Stocks to Watch Thursday: Tesla, T-Mobile, American Airlines, Broadcom": 0.5,
  "Auto & Transport Roundup: Market Talk": 0.0,
  "Nasdaq, S&P 500 Reach New Highs as Markets Track Latest Earnings": 0.8,
  "Elon Musk Says 'They Simply Don't' Have The Funding, Doubts Stargate AI": -0.6,
  "Lululemon (LULU) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Datadog (DDOG) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Workday (WDAY) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Airbnb, Inc. (ABNB) Laps the Stock Market: Here's Why": 0.5,
  "(Item 1.01) Entry into a Material Definitive Agreement. On July 24, 2025, MicroStrategy Incorporated ® d/b/a Strategy ™ (the “Company”) entered into an underwriting agreement (the “Underwriting Agreement”) with Morgan Stanley & Co. LLC, as lead manager and representative of the several underwriters (the “Underwriters”), relating to the issuance and sale in an underwritten offering (the “Offering”) of 28,011,111 shares (the “Shares”) of the Company’s Variable Rate Series A Perpetual Stretch Preferred Stock, $0.001 par value per\n\n(Item 8.01) Other Events. On July 25, 2025, the Company issued a press release relating to the pricing of the Offering. A copy of the press release is filed as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated by reference. Neither this Current Report on Form 8-K nor the press release attached hereto constitute an offer to sell or the solicitation of an offer to buy any securities. Forward-Looking Statements Statements in this": 0.1,
  "(ITEM 2.02) . RESULTS OF OPERATIONS AND FINANCIAL CONDITION. On July 25, 2025, Charter Communications, Inc. issued a press release announcing its results for the second quarter ended June 30, 2025. The following information, including the entirety of the press release appearing in Exhibit 99.1 hereto, is not filed but is furnished pursuant to\n\n(item 2.02) , \"Results of Operations and Financial Condition.\"": 0.0,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. As part of Apple Inc.’s (“Apple’s”) previously announced Chief Operating Officer transition plan, Apple’s Board of Directors appointed Sabih Khan, 58, as Apple’s Chief Operating Officer, effective July 25, 2025. Mr. Khan succeeds Jeff Williams in the role of COO. Mr. Khan joined Apple in August 1995 and assumed his current position in July 2025. Mr. Khan’s": 0.2,
  "Zai Lab Ltd (ZLAB) Delivers Positive Results for Potential Gastric Cancer Treatment": 0.8,
  "Assembly Bio’s (ASMB) HBV Drug Shows Strong Efficacy in Phase 1b Trial": 0.8,
  "JMP Securities Raises Zscaler (ZS) Price Target Amid Strong Growth Momentum": 0.8,
  "2 Reasons to Like INTU and 1 to Stay Skeptical": 0.5,
  "1 Nasdaq 100 Stock to Target This Week and 2 That Underwhelm": 0.2,
  "1 High-Flying Stock to Own for Decades and 2 Facing Headwinds": 0.2,
  "2 Cash-Producing Stocks to Target This Week and 1 We Brush Off": 0.2,
  "2 Volatile Stocks Worth Your Attention and 1 We Find Risky": 0.2,
  "1 Unpopular Stock That Deserves Some Love and 2 Facing Challenges": 0.2,
  "KDP Q2 Deep Dive: Volume-Led Growth as New Brands Gain Traction, Cost Pressures Loom": 0.2,
  "HON Q2 Deep Dive: Portfolio Overhaul, Margin Pressure, and Guidance Lift": 0.5,
  "Disney Stock Is Ready to Rally After a Lost Decade": 0.8,
  "Applied Materials' Quarterly Earnings Preview: What You Need to Know": 0.0,
  "Gilead Receives Positive CHMP Opinions Under Accelerated Review From European Medicines Agency for Twice-Yearly Lenacapavir for HIV Prevention": 0.8,
  "3 Soaring Tech Stocks With Amazing Dividends": 0.5,
  "The AI Race: How Shopify Positions Itself to Win": 0.5,
  "O'Reilly Automotive Inc (ORLY) Q2 2025 Earnings Call Highlights: Strong Sales Growth and ...": 0.8,
  "Zacks.com featured highlights Affiliated Managers, Greenbrier, Signet Jewelers, Cognizant Technology and PagSeguro Digital": 0.2,
  "What to Expect From Workday’s Q2 2025 Earnings Report": 0.2,
  "What You Need to Know Ahead of Ross Stores’ Earnings Release": 0.1,
  "Intuit’s Quarterly Earnings Preview: What You Need to Know": 0.0,
  "UAV Propulsion Market Forecast to Reach $11.3 Billion by 2030: Projections by Technology, Component, Platform, MTOW and Region Featuring Profiles of Industry Leaders": 0.5,
  "The Zacks Analyst Blog Highlights Cisco Systems, Caterpillar, Charles Schwab and Elite Pharmaceuticals": 0.5,
  "Company News for Jul 25, 2025": 0.0,
  "Marriott opens largest AC Hotel in North America": 0.5,
  "Got $5,000? 3 Tech Stocks to Buy and Hold for the Long Term": 0.5,
  "Bloomington-Normal Marriott hotel completes renovation": 0.5,
  "Starlink Reports Outage Following T-Mobile Satellite Service Launch": -0.5,
  "Intuitive Surgical, Inc. Just Beat Analyst Forecasts, And Analysts Have Been Updating Their Predictions": 0.5,
  "Buy 3 Cybersecurity Stocks to Strengthen Portfolio Security in 2H25": 0.5,
  "ZURZUVAE® (zuranolone) Receives Positive Opinion from CHMP for the Treatment of Women with Postpartum Depression": 1.0,
  "A Look At The Fair Value Of Vertex, Inc. (NASDAQ:VERX)": 0.1,
  "Regeneron Pharmaceuticals Earnings Preview: What to Expect": 0.0,
  "Should You Hold Atlassian Corporation (TEAM)?": 0.0,
  "ComEd CEO Seeks Rules to Prevent AI From Boosting Energy Bills": 0.2,
  "Warren Buffett Says His $31,500 House Brings Him More Joy Than 10 Mansions — And He'd Rather Eat A McDonald's Burger Than A $100 Meal": 0.8,
  "Dow Jones Futures Rise After Google Lifts AI Giants, Tesla Robotaxi To Launch In San Francisco?": 0.5,
  "IRS Zeroes In on Rental Income - Clear Start Tax Warns Landlords About 2025 Enforcement Surge": -0.5,
  "Trade Desk (NASDAQ:TTD) Is Looking To Continue Growing Its Returns On Capital": 0.6,
  "Honeywell vulnerability exposes building systems to cyber attacks": -0.8,
  "T-Mobile US Second Quarter 2025 Earnings: EPS Beats Expectations": 0.8,
  "HONEYWELL ANNOUNCES QUARTERLY DIVIDEND": 0.2,
  "Robinhood and Alpha Metallurgical have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "CEG vs. AEP: Which Utility Is Best Positioned for Long-Term Growth?": 0.2,
  "Exelon to Release Q2 Earnings: What's in Store for the Stock?": 0.0,
  "Xcel Energy to Release Q2 Earnings: Here's What You Need to Know": 0.2,
  "Can ISRG's Strong Q2 Procedure Volume Translate Into Durable EPS Upside?": 0.5,
  "Costco vs. Target: Which Discount Retailer Is the Better Bet?": 0.5,
  "Investors Heavily Search CrowdStrike (CRWD): Here is What You Need to Know": 0.5,
  "Warner Bros. Discovery, Inc. (WBD) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Lam Research (LRCX) Q4 Earnings Preview: What You Should Know Beyond the Headline Estimates": 0.5,
  "Insights Into Electronic Arts (EA) Q1: Wall Street Projections for Key Metrics": 0.1,
  "AEP (AEP) Q2 Earnings on the Horizon: Analysts' Insights on Key Performance Measures": 0.0,
  "What Analyst Projections for Key Metrics Reveal About Cognizant (CTSH) Q2 Earnings": 0.2,
  "CSGP Q2 Deep Dive: Product Expansion and Sales Force Investments Drive Momentum": 0.8,
  "PCAR Q2 Deep Dive: Tariff Uncertainty, Parts Growth, and Regulatory Shifts Shape Outlook": 0.2,
  "ISRG Q2 Deep Dive: New Platform Drives Procedure Growth Amid Global Expansion": 0.8,
  "CSX Q2 Deep Dive: Service Recovery and Network Upgrades Drive Sequential Improvement": 0.6,
  "Wall Street Analysts See Axon (AXON) as a Buy: Should You Invest?": 0.5,
  "Here's Why Gilead Sciences (GILD) is a Strong Value Stock": 0.8,
  "Visa, CVS, and 4 More Oversold Stocks Worth a Look Before Earnings": 0.5,
  "Are You a Growth Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Scottish Greens propose holiday homes tax to ‘protect Gaelic language’": 0.2,
  "Should You Forget Tesla and Buy These 2 Artificial Intelligence (AI) Stocks Right Now?": 0.5,
  "REGN Q2 Earnings: Will Higher Dupixent Profits Fuel Growth?": 0.5,
  "Regeneron (REGN) Expected to Beat Earnings Estimates: What to Know Ahead of Q2 Release": 0.5,
  "Copart Sees Insider Stock Selling": -0.5,
  "Keurig Dr Pepper buys powdered-drinks business Dyla Brands": 0.2,
  "Electronic Arts (EA) to Report Q1 Earnings: What's in the Cards?": 0.2,
  "Intel Casts Doubts on Next-Gen Chip Manufacturing. What It Means for TSMC and ASML Stock.": -0.5,
  "Nvidia Hits Highs As These Growth Stocks Rally": 0.8,
  "Eye Outliers Like Synopsys Early with Money Flows": 0.2,
  "Devon or Diamondback Energy: Which Stock Offers Better Value in 2025?": 0.2,
  "Voxpopme Unveils “Voxpopme Signals” to Deliver Proactive, AI-Powered Consumer Insights": 0.5,
  "Solid Corporate Earnings Results Support Stocks": 0.8,
  "Even Patrick Mahomes Can’t Give Airbnb a Quick Win": -0.5,
  "Micron (MU) Down 11.3% Since Last Earnings Report: Can It Rebound?": -0.5,
  "Are You Looking for a High-Growth Dividend Stock?": 0.0,
  "Verisk Set to Report Q2 Earnings: Here's What You Should Know": 0.0,
  "Berkshire Stock Is Losing Its Buffett Premium. Now Is the Time to Buy.": 0.8,
  "Raymond James Raised the PT on Diamondback Energy (FANG), Kept a Buy Rating": 0.5,
  "Cisco Systems (CSCO) Tapped for $17B Bahrain’s Digitization Drive": 0.5,
  "Microsoft Corp (MSFT) Patches SharePoint Vulnerability amid Global Havoc": 0.2,
  "Piper Sandler Reaffirms Overweight Rating on SAP Amid Cloud Momentum": 0.6,
  "TSX up 41 Points at Midday With Most Sectors Lower": -0.5,
  "UiPath vs. AppLovin: Which AI-Driven Tech Stock is Purchase-Worthy?": 0.5,
  "SS&C Technologies Stock Earns IBD Rating Upgrade": 0.6,
  "Why Gilead Sciences Stock Just Popped": 0.5,
  "For Sale: A $35 Million Historic Home Near Harvard": 0.5,
  "How the rise of dupes and store brands could change the way you shop": 0.2,
  "Equities Rise Intraday as Markets Track Earnings, Trade Developments": 0.5,
  "Why Gilead Sciences (GILD) Stock Is Up Today": 0.5,
  "CHICAGO GOURMET 2025 POWERED BY INVESCO QQQ: PREMIER CULINARY FEST, TICKETS ON SALE JULY 25": 0.5,
  "JAKKS Pacific Reveals All-New SUPER MARIO, THE SIMPSONS, DC X SONIC THE HEDGEHOG, BENDY and DOG MAN Toys and Collectibles at San Diego Comic-Con 2025": 0.6,
  "Sector Update: Consumer Stocks Rise in Late Afternoon Trading": 0.5,
  "Equity Markets Higher Ahead of US-EU Trade Talks": 0.8,
  "Bad Break In Cybersecurity Stocks Led To CIBR Trade Exit": -0.6,
  "S&P 500, Nasdaq Rise to Records as Trump-Fed Tensions Ease, EU Trade Talks Loom": 0.6,
  "Equity Markets Close Higher Ahead of Trump's Meeting With European Commission President": 0.6,
  "Stocks to Watch Friday: Intel, Centene, Paramount, Boston Beer": 0.2,
  "Stock Market Week Ahead: The Fed, July Jobs, Tariff Deadline + Mag 7 Earnings": 0.5,
  "Tech, Media & Telecom Roundup: Market Talk": 0.0,
  "S&P 500, Nasdaq Extend Record Run as Wall Street Posts Weekly Gains": 0.8,
  "Best Stock to Buy Right Now: Apple vs. Costco Wholesale": 0.5,
  "Synopsys (SNPS) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "The Trade Desk (TTD) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "MercadoLibre (MELI) Stock Falls Amid Market Uptick: What Investors Need to Know": 0.1,
  "AppLovin (APP) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "CrowdStrike Holdings (CRWD) Laps the Stock Market: Here's Why": 0.5,
  "Lululemon Needs Overseas Growth, Says J.P. Morgan. Plus, Valero, Cleveland-Cliffs, and More Stocks.": 0.2,
  "ON Semiconductor Corp. (ON) Outperforms Broader Market: What You Need to Know": 0.5,
  "Why Comcast Stock Sank Today": -0.5,
  "Must build out infrastructure to achieve AI dominance: Onsemi CEO": 0.2,
  "Mag 7 earnings, Fed meeting, PCE, jobs report: What to Watch": 0.2,
  "Texas Instruments Incorporated (TXN): A Bull Case Theory": 0.5,
  "CoStar Group, Inc. (CSGP): A Bull Case Theory": 0.5,
  "IDACORP, Inc. (IDA): A Bull Case Theory": 0.5,
  "IDEXX Laboratories, Inc. (IDXX): A Bull Case Theory": 0.5,
  "CDW Corporation (CDW): A Bull Case Theory": 0.5,
  "Regeneron Pharmaceuticals, Inc. (REGN) Acquires 23andMe Assets in $256M Deal": 0.5,
  "Vertex Pharmaceuticals Incorporated (VRTX) Launches JOURNAVX, First Non-Opioid Acute Pain Treatment": 0.8,
  "Here Is What You Need To Know Before Investing In PDD Holdings Inc. (PDD)": 0.0,
  "Jim Cramer Says: “Don’t Be in a Hurry to Buy Lam Research”": -0.6,
  "Jim Cramer Say’s Notes That Campbell’s Not PepsiCo, But Still in the Same League": 0.2,
  "Jim Cramer on Marvell: “It Should Have Gone Up After That Last Quarter”": 0.5,
  "Oversold Honeywell (HON) Could Offer Industrial Strength with Dividend Reliability": 0.6,
  "Analog Devices (ADI) Enters Oversold Territory with a Dividend Worth Watching": 0.5,
  "Comcast (CMCSA) Looks Oversold: Here’s Why Dividend Investors Should Take a Second Look": 0.5,
  "Is Linde (LIN) a Safe Bet for Dividend Investors Seeking Industrial Exposure?": 0.2,
  "Charter Communications Inc (CHTR) Q2 2025 Earnings Call Highlights: Steady Growth Amid ...": 0.5,
  "Billionaires Sell Apple Stock and Buy a Stock-Split Stock Up 510% in the Last Decade": 0.5,
  "2 Growth Stocks to Invest $1,000 in Right Now": 0.5,
  "T-Mobile (TMUS) Impresses With Whopping Gains on 5th Day": 0.8,
  "2 Bargain Stocks That Could Double Your Money": 0.8,
  "Where Will Intuitive Surgical Be in 5 Years?": 0.2,
  "With 80% institutional ownership, Axon Enterprise, Inc. (NASDAQ:AXON) is a favorite amongst the big guns": 0.6,
  "3 Brilliant Growth Stocks to Buy Right Now": 0.8,
  "AI Data Center Plays, DoorDash Lead Five Stocks Near Buy Points": 0.5,
  "These 7 Stocks Are Analyst Favorites For Magnificent Earnings Growth; Arista, Micron Lead": 0.8,
  "Airbnb's Cash Cow Can Thrive Despite Its Challenges": 0.8,
  "Analysts Have Made A Financial Statement On Honeywell International Inc.'s (NASDAQ:HON) Second-Quarter Report": 0.1,
  "Shopify Stock Is Now An AI Play, But Google May Pose A Threat": 0.1,
  "Charter Communications (CHTR) Falls 18% as Customer Count Continues to Drop": -0.8,
  "Honeywell International (HON) Declares US$1.13 Quarterly Dividend Payment": 0.5,
  "Rising Fiscal Deficits Drive Billions Into Credit": 0.2,
  "The Median Retirement Savings for American Households Is $87,000. Here Are 3 Incredible Stocks to Buy Now and Hold for Decades.": 0.5,
  "Intuitive Surgical, Inc. (ISRG): “I Really Like” It, Says Jim Cramer": 0.8,
  "Texas Instruments Incorporated (TXN)’s Stock Fell Because Of Management’s Tone, Says Jim Cramer": -0.5,
  "Worried About a Bear Market? 3 Reasons to Buy PepsiCo Like There's No Tomorrow": 0.6,
  "Should Netflix Be More Like Walt Disney?": 0.0,
  "Why Kimberly-Clark, CareTrust, And Comcast Are Winners For Passive Income": 0.5,
  "Better Beverage Stock: Coca-Cola vs. PepsiCo": 0.5,
  "My 3 Favorite Stocks to Buy Right Now": 0.0,
  "COST Stock Price Prediction: Where Costco Could Be by 2025, 2026, and 2030": 0.5,
  "Breaking down Netflix viewership in 1H25": 0.0,
  "What Are the 3 Best Bargain Artificial Intelligence (AI) Stocks to Buy Right Now": 0.5,
  "Love Palantir Technologies? These 3 Artificial Intelligence Stocks Could Have Much More Upside.": 0.8,
  "Doss, AI-Native ERP, Acquires Shopify Inventory Leader Genie to Supercharge E-Commerce and Partner Growth  Genie Founder Sebastiaan Debrouwere Joins as Partnerships Head": 0.6,
  "Diamondback Energy (NASDAQ:FANG) shareholders have earned a 35% CAGR over the last five years": 0.8,
  "Estimating The Intrinsic Value Of NXP Semiconductors N.V. (NASDAQ:NXPI)": 0.1,
  "Is Amgen Inc. (NASDAQ:AMGN) Trading At A 50% Discount?": 0.2,
  "The Smartest Growth Stock to Invest $5,000 in Right Now": 0.5,
  "Is SentinelOne Stock a Buy, Sell, or Hold in July 2025?": 0.0,
  "5 silly earnings season stock price moves!": -0.5,
  "2 Healthcare Stocks That Are Losing to the S&P 500 This Year": -0.5,
  "Micron Technology, Inc. (MU) Launches Industry’s Highest-Density, Radiation-Tolerant SLC NAND Flash Memory": 0.8,
  "UBS Raises PT on Lam Research Corporation (LRCX) from $95 to $120": 0.8,
  "Workday, Inc. (WDAY) Launches Subsidiary for U.S. Government; Partners with Seattle University": 0.5,
  "Loop Capital Initiates Coverage on Autodesk, Inc. (ADSK) with ‘Hold’ Rating": 0.2,
  "Keurig Dr Pepper Second Quarter 2025 Earnings: EPS Misses Expectations": -0.7,
  "ASML: Limited China Risk, Leading-Edge Exposure Could Drive Outperformance": 0.8,
  "Cisco Systems (CSCO): A Steady Performer Among the Dogs of the Dow": 0.5,
  "Dogs of the Dow: Why Amgen’s (AMGN) Dividend Power Makes it a Standout Pick": 0.6,
  "T-Mobile launches a cheap new service amid customer struggles": 0.1,
  "Disney’s ‘Fantastic Four’ Rockets to $118 Million Debut": 0.8,
  "1 Remarkable Stat That Highlights Just How Amazing Netflix Stock Has Been in Recent Years": 0.8,
  "AT&T Inc. (T) Is Very Good At What It Does, Says Jim Cramer": 0.8,
  "T-Mobile US, Inc. (TMUS) Is Very Good At What It Does, Says Jim Cramer": 0.8,
  "Dover Corporation (DOV) Had An “Unbelievable” Quarter, Says Jim Cramer": 0.8,
  "Honeywell International Inc. (HON): “I Think You Buy” It, Says Jim Cramer": 0.6,
  "Forget a Takeover From Autodesk, PTC Is a Great Stock to Buy Anyway. Here's Why.": 0.8,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. As previously announced, Warner Bros. Discovery, Inc. (the “Company”) plans to separate the Company, in a tax-free transaction (the “Separation”), into two publicly traded companies (referred to herein, respectively, as “Warner Bros.” and “Discovery Global”). Appointment of Chief Financial Officer On July 28, 2025, the Company announced that Fraser Woodford will be appointed as the Chief\n\n(Item 5.02) of Form 8-K, the Company will amend this Current Report on Form 8-K within four business days after such information is determined or becomes available. There are no family relationships between Mr. Woodford and any director or executive officer of the Company, and no arrangements or understandings between Mr. Woodford and any other person pursuant to which Mr. Woodford was appointed to serve as Chief Financial Officer of the Company. There are no transactions in\n\n(Item 5.02) of Form 8-K, the Company will amend this Current Report on Form 8-K within four business days after such information is determined or becomes available. There are no family relationships between Mr. Rauch and any director or executive officer of the Company, and no arrangements or understandings between Mr. Rauch and any other person pursuant to which Mr. Rauch was appointed to serve as Chief Accounting Officer of the Company. There are no transactions in": 0.1,
  "(Item 8.01) . Other Events. PepsiCo Senior Notes Offering. On July 21, 2025, PepsiCo, Inc. (“PepsiCo”) announced an offering of €500,000,000 aggregate principal amount of its 3.450% Senior Notes due 2037 (the “2037 Notes”) and €500,000,000 aggregate principal amount of its 4.050% Senior Notes due 2055 (the “2055 Notes,” and together with the 2037 Notes, the “Notes”). Deutsche Bank AG, London Branch, HSBC Bank plc and Mizuho International plc were joint book-running managers for the offering of": 0.1,
  "(Item 8.01) Other Events. ATM Updates On July 28, 2025, MicroStrategy Incorporated d/b/a Strategy (“Strategy” or the “Company”) announced updates with respect to its at-the-market offering programs: ATM Program Summary During Period July 21, 2025 to July 27, 2025 As of July 27, 2025 Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) Common ATM - - - $17,042.7 Securities Offered: Class A Common Stock, $0.001 par": 0.1,
  "(Item 1.01) Entry into a Material Definitive Agreement. As previously disclosed, Cadence Design Systems, Inc. (“Cadence”) has been responding to subpoenas received from the Bureau of Industry and Security (“BIS”) of the U.S. Department of Commerce in February 2021 and the U.S. Department of Justice (the “DOJ”) in November 2023. In December 2024, Cadence began discussions with BIS and the DOJ regarding their preliminary findings and a potential resolution. In June 2025, Cadence, BIS and the DOJ": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On July 28, 2025 Cadence Design Systems, Inc. (“Cadence”) issued a press release announcing its financial results for the quarter ended June 30, 2025. A copy of the press release is attached hereto as Exhibit 99.01 and a copy of the commentary by the Chief Financial Officer of Cadence regarding Cadence's financial results for the quarter ended June 30, 2025 is attached hereto as Exhibit 99.02, and the": 0.1,
  "Robinhood stock HOOD symbol, not app - I bought way too many shares of Robinhood when it ipo’ed back in 2021 I was down like 70%/80% for years and now I’m up 200% I put a substantial amount in…like probably about 8% of my total funds Is now the time to sell some? Many tech stocks like NVDA, Google, Meta, Coinbase, and others have risen a lot over the last couple years I am somewhat": 0.2,
  "Electronic Arts (EA) Reports Q2: Everything You Need To Know Ahead Of Earnings": 0.5,
  "Datadog (DDOG): 3 Reasons We Love This Stock": 0.6,
  "Vertex Pharmaceuticals (VRTX): Buy, Sell, or Hold Post Q1 Earnings?": 0.2,
  "3 Reasons to Buy Walmart Stock Like There's No Tomorrow": 0.6,
  "1 Consumer Stock on Our Buy List and 2 That Underwhelm": 0.2,
  "2 Unpopular Stocks That Deserve a Second Chance and 1 We Ignore": 0.2,
  "1 Large-Cap Stock to Keep an Eye On and 2 That Underwhelm": -0.5,
  "3 Profitable Stocks That Concern Us": -0.5,
  "1 Large-Cap Stock to Research Further and 2 We Ignore": 0.2,
  "2 Cash-Heavy Stocks on Our Buy List and 1 We Find Risky": 0.2,
  "3 Nasdaq 100 Stocks on Our Watchlist": 0.0,
  "1 Profitable Stock for Long-Term Investors and 2 Facing Challenges": 0.5,
  "/C O R R E C T I O N -- DIGITIMES ASIA/": 0.0,
  "Tesla has just purchased capacity from the once-empty Samsung Taylor, TX fab. What does this mean for US chip manufacturing capacity? - So picture this: Samsung US Fab is full because Elon is walking and sleeping in the fab TSMC Arizona fab is fully booked until 2027 Trump puts a 25% tariff on 80% of your chips coming from Taiwan and South Korea. And in 1 year it may be 100% tariff. Will you pay": -0.6,
  "The 5 Most Interesting Analyst Questions From NXP Semiconductors’s Q2 Earnings Call": 0.5,
  "Costco (COST) Stock Reaffirmed Outperform After Strong June Sales and Warehouse Expansion": 0.8,
  "T-Mobile (TMUS) Stock Upgraded Despite Concerns Over Fiber Strategy and Market Slowdown": 0.2,
  "BofA Sees Upside in AT&T (T) With Bonus Depreciation Boost": 0.6,
  "Linde (LIN) to Invest $400M in Louisiana ASU for Low-Carbon Ammonia Project": 0.8,
  "BMO Cuts Amgen (AMGN) Price Target After Mixed MariTide Data at ADA Conference": -0.5,
  "PepsiCo (PEP) Partners With Cargill to Advance Regenerative Farming Across Corn Supply Chain": 0.5,
  "TD Cowen Remains Bullish on Gilead Sciences (GILD)": 0.6,
  "Canaccord Reiterates a Buy Rating on Regeneron Pharmaceuticals (REGN)": 0.6,
  "Citi Maintains a Buy Rating on Gilead Sciences (GILD)": 0.5,
  "BofA Reiterates a Sell Rating on Amgen (AMGN)": -0.5,
  "HCSA Community Services and Tan Tock Seng Hospital Sign MOU to Hepatitis C Elimination in Singapore": 0.8,
  "‘Customer satisfaction at the end of the day’: TikTok users push Costco’s return policy to the limit with wild refunds": 0.2,
  "PepsiCo's Snack‑Soda Synergy: A Consumer Combo Worth Buying": 0.8,
  "STV warns over profits as advertising market slumps and TV projects delayed": -0.7,
  "'Really, really scary': Dave Ramsey urges caller not to join grandma's scheme to deceive IRS about $1 million debt": -0.8,
  "Why companies are leaning into skills-first, AI-enabled employment models": 0.5,
  "lululemon athletica's Quarterly Earnings Preview: What You Need to Know": 0.5,
  "Kraft Heinz and Live Nation Partner to Bring Iconic Flavors to Fans Nationwide": 0.6,
  "At US$310, Is It Time To Put Charter Communications, Inc. (NASDAQ:CHTR) On Your Watch List?": 0.2,
  "Possible Bearish Signals With Marvell Technology Insiders Disposing Stock": -0.7,
  "Is There An Opportunity With Adobe Inc.'s (NASDAQ:ADBE) 34% Undervaluation?": 0.5,
  "Here's Why We Think Cintas (NASDAQ:CTAS) Might Deserve Your Attention Today": 0.5,
  "Gilead wins positive European approval opinion for twice-yearly HIV injection": 0.8,
  "A&R Group acquires Fairfield Inn & Suites property in Destin, Florida": 0.5,
  "The 3 Things That Matter for Vertex Pharmaceuticals Now": 0.2,
  "US Kids Food and Beverage Market Forecast and Company Analysis Report 2025-2033 Conagra, PepsiCo, Kellogg, Campbell Soup, General Mills, Nestle, Lifeway Foods, The Hershey Company": 0.0,
  "Saudi Arabia Data Center Market Overview and Company Analysis Report 2025-2033 Featuring Delta Electronics, Cisco Systems, Equinix, Fujitsu, General Electric, Hitachi, Schneider Electric, and Siemens": 0.5,
  "QuickLogic Unveils Aurora PRO: 50% Better Resource Utilization & 35% Faster Fmax": 0.8,
  "Latest News In AI Chips - AI Meets Blockchain Highlighted At Malaysia's Technological Innovation Event": 0.5,
  "Robust Demand Lifted Axon Enterprise (AXON) Shares to New Heights": 0.8,
  "IDEXX to Release Q2 Earnings: What's in Store for the Stock?": 0.0,
  "Cognizant and Lineage Partner to Set Customer Experience Standard in the Cold Chain": 0.6,
  "An excellent week for CSX Corporation's (NASDAQ:CSX) institutional owners who own 78% as one-year returns inch higher": 0.8,
  "Taking A Look At Exelon Corporation's (NASDAQ:EXC) ROE": 0.1,
  "ISRG's Gross Margin Falls on Product Transition and Trade Pressures": -0.5,
  "4 Must-Buy Stocks as S&P 500 Continues to Reach New Milestones": 0.6,
  "EU Warns Temu on Safety of Products Sold on Its Platform": -0.5,
  "Intuit Launches New App Partner Program to Drive Growth for Third-Party Developers and Enhance Customer Experiences": 0.8,
  "Dexcom Launches Revolutionary AI-Powered Meal Logging Feature Across Glucose Biosensing Portfolio": 0.8,
  "Here's How Much a $1000 Investment in ON Semiconductor Corp. Made 10 Years Ago Would Be Worth Today": 0.5,
  "Five9 Gears Up to Report Q2 Earnings: What's in Store for the Stock?": 0.2,
  "ABNB Stock Price Prediction: Where Airbnb Could Be by 2025, 2026, and 2030": 0.5,
  "AMSC Gears Up to Report Q1 Earnings: What's in Store for the Stock?": 0.5,
  "Cisco Stock Downgraded. Analyst Wants Artificial Intelligence Revenue Numbers.": -0.5,
  "MercadoLibre, Inc. to Report Second Quarter 2025 Financial Results": 0.0,
  "SAFE and Cisco Partner to Deliver Unified AI Risk Management with Business Impact Visibility": 0.5,
  "Amgen Inc. (AMGN) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Is Trending Stock Broadcom Inc. (AVGO) a Buy Now?": 0.2,
  "Intuitive Surgical, Inc. (ISRG) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "How to Find Strong Medical Stocks Slated for Positive Earnings Surprises": 0.6,
  "Cisco Systems, Inc. (CSCO) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Here is What to Know Beyond Why Applied Materials, Inc. (AMAT) is a Trending Stock": 0.2,
  "Roblox Stock Soars 79% in 3 Months: Lock in Gains or Hold Tight?": 0.5,
  "The Zacks Analyst Blog Highlights NVIDIA, Netflix, Goldman Sachs and AMREP": 0.0,
  "IDEXX Laboratories (IDXX) Rallied in Q2. Here’s Why": 0.6,
  "Is Roblox Stock a Buy, Sell, or Hold for July 2025?": 0.0,
  "Should You Grab This ‘Strong Buy’ Semiconductor Stock Ahead of Earnings?": 0.5,
  "Copart (CPRT) Fell as It Missed Revenue Expectations": -0.7,
  "This chip name emerges as a key winner in U.S.-EU trade deal": 0.8,
  "Is It Worth Investing in CrowdStrike (CRWD) Based on Wall Street's Bullish Views?": 0.5,
  "Geopolitical Alert: Trump Warns Iran Not to Restart Nuclear Program Should We Watch Oil & Gas and Military Stocks? - Trump just spoke out and warned Iran not to restart its nuclear program. While this isn't the first time US-Iran relations have been strained, given his current favorability ratings in the 2024 election, this kind of statement could trigger some reaction in the market - especially in the energy and military sectors. Directions to watch:": 0.2,
  "Here's Why Cognizant (CTSH) is a Strong Value Stock": 0.8,
  "Nuclear Power Is Going Mainstream. These Stocks Stand to Benefit.": 0.5,
  "Nvidia Stock Rises. Watch This Figure From Microsoft, Meta, and Amazon Earnings.": 0.5,
  "Are You a Momentum Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "r/Stocks Daily Discussion Monday - Jul 28, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.2,
  "‘I Prep for Survival’: OpenAI CEO Sam Altman Worries About The ‘Nonzero’ Chance The World Will End From ‘a Lethal Synthetic Virus’": -0.6,
  "Cisco upside now largely priced in, Evercore ISI downgrades stock": -0.6,
  "NYPSC Approves Constellation Energy’s Acquisition of Calpine Corporation": 0.5,
  "Gilead Sciences stock falls amid reports of preventive health panel dismissal": -0.5,
  "ACI Learning Expands Access to Industry-Leading On-Demand Training Through OpenSesame Partnership": 0.5,
  "SSD Demand Aids Micron's NAND Growth: Can the Momentum Continue?": 0.5,
  "PUCO Adopts AEP Ohio Data Center Proposal to Protect Consumers": 0.5,
  "ComEd Announces New Improvements To The Itasca Substation’s Power Infrastructure": 0.5,
  "Before Figma Goes Public, Should You Double Down on Adobe or Bet on the Underdog?": 0.2,
  "2 Top Dividend Stocks to Buy Right Now and Hold Forever": 0.5,
  "Booking Holdings to Make Second Quarter 2025 Earnings Press Release Available on Company's Investor Relations Website on July 29": 0.0,
  "ON Semiconductor Corp. (ON) Expected to Beat Earnings Estimates: What to Know Ahead of Q2 Release": 0.5,
  "Axon Enterprise (AXON) Reports Next Week: Wall Street Expects Earnings Growth": 0.5,
  "BioMarin Pharmaceutical (BMRN) Reports Next Week: Wall Street Expects Earnings Growth": 0.5,
  "Diamondback Energy (FANG) Expected to Beat Earnings Estimates: Can the Stock Move Higher?": 0.5,
  "Idexx Laboratories (IDXX) Earnings Expected to Grow: Should You Buy?": 0.5,
  "Vertex Pharmaceuticals (VRTX) Reports Next Week: Wall Street Expects Earnings Growth": 0.5,
  "What You Need to Know Ahead of Autodesk’s Earnings Release": 0.0,
  "This Stock Doubled My Money – and I’m Buying More": 0.8,
  "Copart’s Quarterly Earnings Preview: What You Need to Know": 0.2,
  "This is the Most Dangerous Week for Investors in 20 Years": -0.8,
  "3 No-Brainer Energy Stocks to Buy With $500 Right Now": 0.5,
  "Adobe's Q3 2025 Earnings: What to Expect": 0.0,
  "Analyst bullish on Texas Instruments on earnings lift as capex winds down": 0.8,
  "Biogen Gears Up to Report Q2 Earnings: Here's What to Expect": 0.5,
  "Trump: “China Deal Is Close” Ahead of EU and Stockholm Trade Talks Tariffs, Semis, and Rare Earths on the Table - US President Donald Trump said on Sunday that an agreement with China was “basically” reached, although details remain unclear. His remarks came ahead of high-level talks between China and the US scheduled for Monday in Stockholm, with Chinese Vice Premier He Lifeng and US Treasury Secretary Scott Pritzker set to lead the discussions. Extension": 0.5,
  "CRISPR Therapeutics to Report Q2 Earnings: What's in the Cards?": 0.2,
  "Little Kid TV, Big Money: How Children's Shows Became Streaming's Most Valuable Asset": 0.5,
  "Will Axon's AI-Driven Platform Continue to Enhance Community Safety?": 0.5,
  "Defense stocks, Cisco, ChargePoint: Trending Tickers": 0.0,
  "What Costco's Balance Sheet Says About Its Financial Strength": 0.5,
  "Lululemon Expands Global Footprint with First Italy Store in Milan": 0.8,
  "Wells Fargo coverage: Bullish on Take-Two, cautious on EA": 0.5,
  "Microsoft has to hit its earnings out of the park: Opening Bid top takeaway": 0.5,
  "Heavy-Duty Earnings Week Commences": 0.5,
  "Morgan Stanley makes bold S&P 500 projection as U.S. dollar weakens": 0.6,
  "What to Expect From Broadcom's Next Quarterly Earnings Report": 0.2,
  "KLAC Set to Report Q4 Earnings: How Should You Play the Stock?": 0.5,
  "Figma targets $18.8 billion valuation in US IPO after bumping up price range": 0.8,
  "EU admits it can’t guarantee $600B promise to Trump. The extra investments pledged under the trade deal would come from private companies. - https://www.politico.eu/article/eus-600bn-us-investment-will-come-exclusively-from-private-sector/ The European Union has admitted it doesn’t have the power to deliver on a promise to invest $600 billion in the United States economy, only hours after making the pledge at landmark trade talks in Scotland. That’s because the cash would come entirely from private sector investment over which Brussels has": -0.6,
  "Top Stock Movers Now: Nike, Cheniere Energy, Revvity, and More": 0.5,
  "Cushman & Wakefield Welcomes Conor Flannery as Executive Vice Chair in Silicon Valley": 0.6,
  "Why Duolingo (DUOL) Stock Is Falling Today": -0.5,
  "IonQ Hires Quantum Veteran From JPMorgan": 0.5,
  "Warner Bros. Discovery Announces Post-Separation Company Names and Leadership Appointments": 0.5,
  "Why MicroStrategy (MSTR) Stock Is Up Today": 0.5,
  "ARM to Post Q1 Earnings: Should the Stock be in Your Portfolio?": 0.2,
  "Old Dominion's Q2 Earnings Coming Up: What's in Store for the Stock?": 0.2,
  "Warner Bros to get studio business after split, Discovery to house news, sports brands": 0.1,
  "Cognizant to Report Q2 Earnings: What's in Store for the Stock?": 0.2,
  "Should You Buy, Sell, or Hold GE Healthcare Before Q2 Earnings?": 0.2,
  "Shopify Making 'Meaningful' Share Gains in Enterprise Ecommerce, UBS Says": 0.6,
  "Is Qualcomm Stock a Smart Buy Before Q3 Earnings Release?": 0.5,
  "Warner Bros. Cable Arm to Be Named Discovery Global After Split": 0.1,
  "Paramount, Disney, Warner Bros. Discovery: Media earnings preview": 0.0,
  "Less than 2 years after Flexport bought Convoy’s tech stack, it’s being sold to DAT": -0.5,
  "DAT to Acquire the Convoy Platform from Flexport": 0.2,
  "DoorDash Hires Spotify Advertising Head as Chief Revenue Officer": 0.5,
  "Tesla, Samsung, energy stocks, & European semiconductors climb": 0.6,
  "Palantir - concerned about upcoming earnings - I've been holding PLTR for a while, and it's absolutely exploded – I'm up roughly 10x on my initial investment. The problem is, it now makes up a really substantial percentage of my overall portfolio. With their next earnings report coming I'm getting a little nervous. The valuation seems incredibly high and I'm worried about a potential correction, especially after such a massive run-up. Should I trim some": -0.6,
  "Tariffs will likely raise toy prices, toymaker warns": -0.6,
  "Top Founder-Run Company Stocks That Are Outperforming the Market": 0.5,
  "Figma’s Hot IPO Is This Week. Adobe Is Still Alive and Kickin’.": 0.5,
  "Warner Bros. Discovery Sets Leadership for Post-Split Companies": 0.2,
  "Sector Update: Tech Stocks Gain Monday Afternoon": 0.5,
  "YouTube vs Netflix: User-led 'open' platforms rise in popularity": 0.5,
  "ROKU up 71% since April, 5% today, earnings on 7/31 - How does everybody feel about the stock heading into earnings? They reported earnings in the heat of Liberation Day, I think they'll sound more bullish on the earnings call with the storm & dust settling. Positive read-through on streaming based on Netflix & Google's earnings calls (YouTube) Get more details on the Amazon & ROKU partnership": 0.8,
  "Why Are Super Micro (SMCI) Shares Soaring Today": 0.5,
  "Opendoor (OPEN) Stock Trades Down, Here Is Why": -0.5,
  "This Company Is Surging on Plans to Become the MicroStrategy of the BNB Crypto. Should You Buy Its Stock Now?": 0.6,
  "Bernstein upgrades Charter on improving cash outlook despite broadband headwinds": 0.6,
  "These four threats could ’upset’ bullish S&P 500 momentum: Sevens Report": -0.5,
  "AST is building a unique, hard-to-replicate satellite network to enable direct-to-device connectivity for any smartphone - AST has made a breakthrough by enabling traditional smartphones to connect to low Earth orbit (LEO) satellites without any modifications to the phone's hardware or software. As a result, any conventional smartphone can access voice, data and video services directly from space, breaking the complete dependence on terrestrial base stations. This is a radical paradigm shift for rural, remote": 0.8,
  "One Buy-Rated Stock With an Unbreakable Moat That You Can’t Ignore": 0.6,
  "Sector Update: Consumer Stocks Mixed Late Afternoon": 0.0,
  "Sector Update: Tech Stocks Advance Late Afternoon": 0.5,
  "These Are The 5 Best Stocks To Buy Now Or Watch": 0.5,
  "Cadence Reports Second Quarter 2025 Financial Results": 0.0,
  "Josh Brown Highlights His New Best Industrial Stock Pick in 2025": 0.5,
  "Analyst Highlights ‘Game Changer’ Catalyst for Eli Lilly (LLY)": 0.8,
  "Cadence: Q2 Earnings Snapshot": 0.0,
  "Biotech stocks dip as Trump administration mulls patent fee overhaul": -0.5,
  "US-EU Trade Deal Excitement Lost - What just happened in the EU markets today? Last night when the trade deal was announced, EU markets jumped over 1%. Then the morning the EU market lost all those gains. I think the market has yet to price in the tariffs. The US is going from 2.5% average tariff rate to nearly 20% on Aug. 1st. The tariffs will be getting priced in next week and we will": -0.5,
  "These Stocks Moved the Most Today: Tesla, AMD, ASML, Nike, Revvity, Charter, and More": 0.2,
  "Nvidia Partner, Rival Lead S&P 500 Stocks Monday": 0.5,
  "Why Gilead Sciences Stock Slipped Today": -0.5,
  "Stocks to Watch Monday: Cheniere, TSM, Nike, Tesla": 0.5,
  "Stock Market Today: Dow Dips As Microsoft Slips Ahead Of Earnings; Cathie Wood Loads Up On This Stock Amid 47% Plunge (Live Coverage)": -0.5,
  "Heard on the Street Recap: Done Deal": 0.0,
  "Cadence’s (NASDAQ:CDNS) Q2 Sales Top Estimates, Stock Soars": 0.8,
  "Chip design software provider Cadence raises annual sales forecast - https://www.reuters.com/technology/chip-design-software-provider-cadence-raises-annual-sales-forecast-2025-07-28/ > July 28 (Reuters) - Cadence Design Systems raised its sales forecast for the year on Monday, after the U.S. lifted export curbs on chip design software to China earlier this month, allowing the company to resume sales to the key market. > Shares of the San Jose, California-based company rose 7% in extended trading after rising about 10% this year.": 0.8,
  "Cadence Design Systems Stock Jumps On Beat-And-Raise Earnings Report": 0.8,
  "Stocks Hold at Record, Dollar Jumps on Trade Hopes: Markets Wrap": 0.5,
  "MSTR Introduces New Preferred Stock With Initial 9% Dividend": 0.6,
  "Charter Slows Pay-TV Losses, but Shares Dive on Internet Hit": -0.5,
  "Shareholders of UK fintech Wise vote to move main stock market listing to US - https://www.theguardian.com/business/2025/jul/28/shareholders-of-uk-fintech-wise-vote-to-move-main-stock-market-listing-to-us The UK online payments company Wise is to move its main stock market listing to the US after shareholders approved the move. Investors in Wise, one of the biggest financial technology businesses in the UK with a market value of about £11bn, voted on Monday in favour of a dual listing in the US in an attempt to attract": 0.2,
  "Cadence Design Systems (CDNS) Q2 Earnings and Revenues Top Estimates": 0.8,
  "Cadence shares rise 6% premarket after chip designer lifts full-year outlook": 0.8,
  "Cadence Design Systems Pleads Guilty to Export Violation, Will Pay $140.6 Million in Settlement": -0.8,
  "Lululemon Stock Has Rebounded. What to Expect From Earnings.": 0.5,
  "Spectrum suffers major loss as customers pull the plug on service": -0.8,
  "Shopify (SHOP) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Intuit (INTU) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "Why Applied Materials (AMAT) Outpaced the Stock Market Today": 0.5,
  "PDD Holdings Inc. Sponsored ADR (PDD) Stock Falls Amid Market Uptick: What Investors Need to Know": 0.2,
  "Cisco Systems (CSCO) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Broadcom Inc. (AVGO) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Warner Bros. Discovery (WBD) Laps the Stock Market: Here's Why": 0.5,
  "Gilead Sciences (GILD) Stock Dips While Market Gains: Key Facts": 0.1,
  "Amgen (AMGN) Stock Falls Amid Market Uptick: What Investors Need to Know": 0.1,
  "Marvell Technology (MRVL) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Thirsty for Dividend Income? 2 Beverage Companies That Qualify as Dividend Kings": 0.5,
  "Why Analog Devices (ADI) Outpaced the Stock Market Today": 0.5,
  "Copart, Inc. (CPRT) Stock Sinks As Market Gains: Here's Why": -0.5,
  "August: Time to Unplug from Markets?": 0.1,
  "Analyst sets new shocking price target hot on tech stock": 0.6,
  "AMD options advice - I bought a few option on a lark while waiting for coffee back in May, nothing massive but first foray into options. Looking for advice on best way to handle it. Both are pretty deep itm Both 140 calls 1 expires in Dec 19 up 956% 5 expire June 18th next year up 464% Should I sell the Dec and just hang onto the other 5 until next year sometime?": 0.5,
  "(Item 2.02) . Results of Operations and Financial Condition. On July 29, 2025, Booking Holdings Inc. announced its financial results for the second quarter ended June 30, 2025. The press release is attached as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated herein by reference. Copies of Booking Holdings' consolidated balance sheet at June 30, 2025, consolidated statement of operations for the three and six months ended June 30, 2025, and consolidated statement\n\n(Item 2.02) , including Exhibit 99.1, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such a filing.": 0.1,
  "(Item 1.01) . Entry into a Material Definitive Agreement. Merger Agreement On July 28, 2025, Baker Hughes Company, a Delaware corporation (“Baker Hughes”), Tango Merger Sub, Inc., a Delaware corporation and an indirect wholly owned subsidiary of Baker Hughes (“Merger Sub”), and Chart Industries, Inc., a Delaware corporation (“Chart”) entered into an Agreement and Plan of Merger (the “Merger Agreement”), pursuant to which Baker Hughes will acquire Chart through a merger of Merger Sub with and into": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On July 29, 2025, Starbucks Corporation issued a press release announcing its financial results for the quarter ended June 29, 2025. A copy of the press release is attached as Exhibit 99.1.": 0.0,
  "(Item 8.01) Other Events. On July 29, 2025, Strategy issued a press release relating to the closing of the Offering. A copy of the press release is filed as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated by reference. Neither this Current Report on Form 8-K nor the press release filed hereto constitute an offer to sell or the solicitation of an offer to buy any securities. Forward-Looking Statements Statements in this Current": 0.1,
  "(Item 2.02) Result of Operations and Financial Condition. On July 29, 2025, Electronic Arts Inc. (\"Electronic Arts\" or “EA”) issued a press release announcing its financial results for the first fiscal quarter ended June 30, 2025. A copy of the press release is attached hereto as Exhibit 99.1. Neither the information in this Form 8-K nor the information in the press release attached hereto as Exhibit 99.1 shall be deemed “filed” for purposes of Section 18 of\n\n(Item 8.01) Other Events. On July 25, 2025, the Audit Committee of EA, on behalf of EA’s full Board of Directors declared a cash dividend of $0.19 per share of EA's common stock. The dividend is payable on September 17, 2025 to stockholders of record as of the close of business on August 27, 2025.": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition The information in\n\n(Item 2.02) of this Current Report, including the accompanying Exhibit 99.1, is being furnished and shall not be deemed “filed” for the purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of Section 18. The information in\n\n(Item 2.02) of this Current Report shall not be incorporated by reference into any registration statement or other document filed pursuant to the Securities Act of 1933, as amended, or the Exchange Act, regardless of any general incorporation language contained in such filing. Financial Results for the Quarter Ended June 30, 2025 On July 29, 2025, PayPal Holdings, Inc. (“PayPal,” the “Company,” “we,” “us,” or “our”) issued a press release announcing its financial results for the quarter": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On July 29, 2025 , we issued a press release announcing earnings for the second quarter ended June 30, 2025. A copy of the press release is furnished as Exhibit 99.1 to this current report. This information, including Exhibit 99.1, will not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities": 0.0,
  "Netflix And Disney Quietly Use $545M-Backed Runway For AI Video — And It's Raising Big Questions In Hollywood": 0.5,
  "Is Synopsys Stock Your Ticket to Becoming a Millionaire?": 0.5,
  "Costco Is One of the Largest Consumer Goods Companies by Market Cap. But Is It a Buy?": 0.5,
  "Agoda Reveals First-Half 2025 Travel Insights: China, Malaysia, and South Korea Remain Top Visitors to Thailand": 0.5,
  "What To Expect From Verisk’s (VRSK) Q2 Earnings": 0.2,
  "GE HealthCare (GEHC) Reports Q2: Everything You Need To Know Ahead Of Earnings": 0.5,
  "Earnings To Watch: DexCom (DXCM) Reports Q2 Results Tomorrow": 0.5,
  "Old Dominion Freight Line (ODFL) Reports Q2: Everything You Need To Know Ahead Of Earnings": 0.5,
  "Kraft Heinz (KHC) Reports Q2: Everything You Need To Know Ahead Of Earnings": 0.5,
  "Lam Research Earnings: What To Look For From LRCX": 0.5,
  "What makes Google so low? - Google consistently posts massive profits and yet its PE is around 20, which is much lower than other big tech names that sit at 40+, Tesla with a PE near 180, and PLTR up in the 600s. If we go by valuation multiples alone, Google should easily be trading above $380. What's happening?": 0.2,
  "DexCom (DXCM) Q2 Earnings Preview: What You Should Know Beyond the Headline Estimates": 0.5,
  "Why the Minibar Vanished: How Hotels Maximize Profit From Your Stay": -0.5,
  "3 Reasons We Love The Trade Desk (TTD)": 0.5,
  "3 Large-Cap Stocks We Think Twice About": -0.5,
  "1 Volatile Stock to Keep an Eye On and 2 We Avoid": 0.2,
  "3 Cash-Producing Stocks with Questionable Fundamentals": -0.5,
  "3 Market-Beating Stocks Worth Your Attention": 0.5,
  "GEHC- A Healthcare Equipment Stock That Will Benefit from Trade Deals": 0.5,
  "Jim Cramer While Discussing CrowdStrike: “I’ll See You at $1,000”": 0.6,
  "Jim Cramer on Intuitive Surgical: “I’m Inclined to Recommend the Stock”": 0.6,
  "5 Insightful Analyst Questions From CoStar’s Q2 Earnings Call": 0.5,
  "5 Must-Read Analyst Questions From Intuitive Surgical’s Q2 Earnings Call": 0.1,
  "5 Insightful Analyst Questions From Texas Instruments’s Q2 Earnings Call": 0.5,
  "Tigermed Completes Acquisition of Japanese CRO Micron": 0.5,
  "Intel’s (INTC) Margins Under Watch Amid Delayed Product Ramps": -0.5,
  "Linde (LIN) Expected to Beat EPS for 26th Quarter, Says Bernstein": 0.6,
  "Truist Raises Price Target for Texas Instruments (TXN) Amid Tariff-Driven Q2 Surge": 0.6,
  "Citi Raises Netflix (NFLX) Price Target After Solid Q2 Results": 0.8,
  "MicroStrategy (MSTR) Stock Target Raised as Bitcoin Strategy Continues to Lead": 0.8,
  "DoorDash Target Raised to $275 as Analysts Bet on Growth Beyond Delivery": 0.8,
  "KeyBanc Lifts Shopify Price Target to $145": 0.5,
  "PepsiCo Gets Price Target Boost from JPMorgan, Neutral Rating Held": 0.5,
  "JPMorgan Holds Overweight on Keurig Dr Pepper Despite Tariff Clouds": 0.5,
  "UBS Nudges Monster Beverage Target Higher, Keeps Neutral Rating": 0.2,
  "Is Google's every Tech Company bigger competitor? - I just realized that Google is typically the primary or secondary threat for almost every major tech company I can think of. Think about the combined market cap of the competitors, is the market undervaluing Google? * Tesla – Waymo + Google AI * Apple – Android + Google Search * Microsoft – Google Workspace + Google Cloud + Google Search * Amazon – Google Shopping +": 0.2,
  "Ransomware Surges as Attempts Spike 146% Amid Aggressive Extortion Tactics": -0.8,
  "Cadence Design Systems Inc (CDNS) Q2 2025 Earnings Call Highlights: Strong AI-Driven Growth ...": 0.8,
  "Heard in the Street Monday Recap: Done Deal": 0.0,
  "Ericsson announces completion of Aduna transaction": 0.5,
  "Navigating volatility: what are you buying now? - Markets are jittery, tech valuations are stretched, rate cuts keep getting pushed, and geopolitics won't quit. Despite all that, I'm still buying - carefully. I've shifted from growth heavy plays into companies with pricing power, resilient margins, and real-world demand. Recently, I've added to COST, WRD. I've cut back on the \"high hopes\" names and instead focused on balance sheets, cash flow, and sectors that aren't overrun": 0.6,
  "Email Encryption Market Forecast Report 2025-2030 | Rising Breaches, BEC Frauds, Regulatory Pressure, and Tech Advancements Fueling Expansion": 0.5,
  "Intuit Launches Intelligent Automations to Simplify Accounting for Businesses": 0.8,
  "Can Tesla and Samsung Find Salvation in Each Other?": 0.2,
  "Cane Sugar vs. Corn Syrup: How Soda Sweeteners Stack Up for Your Health": 0.5,
  "r/Stocks Daily Discussion & Technicals Tuesday - Jul 29, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on technical analysis (TA), but if TA is not your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly": 0.2,
  "White Castle offers robot delivery in Chicago with Uber Eats, Coco": 0.2,
  "China Semiconductor for Automotive Market Trends and Strategy Report 2025 | Rising Global Demand and Strategic Export Through Hong Kong Trade Hub Fueling Expansion": 0.6,
  "Paccar weighs risks of tariffs, US security threat investigation": -0.2,
  "onsemi Collaborates with NVIDIA to Accelerate Transition to 800 VDC Power Solutions for Next-Generation AI Data Centers": 0.5,
  "Order Up! Take a Trip to the Pizzeria with Kraft Mac & Cheese’s New Limited-Edition Pizza Flavor": 0.6,
  "Markets rose slightly after Trump announced a U.S.-EU trade deal with 15% tariffs on most European goods and a global tariff rate of 15–20%. - The broad market index’s initial moderate gains earlier in the day followed President Donald Trump’s announcement Sunday that the U.S. has struck a trade deal with the European Union, an agreement that will impose 15% tariffs on most goods imported from Europe, including automobiles. The president also said Monday that": 0.2,
  "2 Brilliant Growth Stocks to Buy Now and Hold for the Long Term": 0.8,
  "Ransomware attacks against oil and gas firms surge": -0.7,
  "Cadence Design Systems Raises Full-Year Outlook Following Second-Quarter Beat": 0.8,
  "QuickBooks' New AI Agents Explained: What Each One Does - Expert Consumers Report": 0.5,
  "Trump’s Trade Victories Could Be Hollow. Why Markets Must Be Wary of China Talks.": -0.5,
  "U.S. Exporters Get Welcome Surprise in Trump Tax Law": 0.6,
  "Here's Why Texas Instruments (NASDAQ:TXN) Can Manage Its Debt Responsibly": 0.8,
  "Investors ignore increasing losses at Warner Bros. Discovery (NASDAQ:WBD) as stock jumps 7.0% this past week": 0.2,
  "Insiders At Broadcom Sold US$337m In Stock, Alluding To Potential Weakness": -0.6,
  "LEAD3R Launches 2025 Healthy Team Summit, Sponsored by The Future of Teamwork Podcast": 0.5,
  "Here’s Why Roper Technologies (ROP) Shares Traded Down in Q2": -0.5,
  "Stocks Gain Pre-Bell as Investors Monitor Latest US-China Trade Talks; Fed Meeting, Earnings on Deck": 0.5,
  "SoFi Beats EPS by a significant margin with the Highest quarter EPS to date of 8 cents vs estimated 6 cents. Raised 2025 Guidance to 31c. - **SoFi is profitable on a GAAP basis for the Seventh quarter in a row, turning in 0.08 cents in earnings per share. Analysts estimated EPS was 0.06 cents** **Raised full-year guidance to 31 cents. Far above the Wall Street's estimate of 25 cents.** **\"Our biggest challenge beyond 2025,": 1.0,
  "ARK Invest Buys the Dip on Ether Strategy Firm BitMine With $18.6M Purchase": 0.6,
  "Cadence to pay $140m fine for illegal tech exports to China": -0.8,
  "Costco's Q4 2025 Earnings: What to Expect": 0.0,
  "Micron Technology's Quarterly Earnings Preview: What You Need to Know": 0.5,
  "Should You Forget Palantir and Buy 2 Artificial Intelligence (AI) Stocks Instead?": 0.2,
  "Netlist Initiates Another Patent Infringement Action Against Samsung and Micron": -0.8,
  "Keye Launches from Stealth to Transform Private Equity Due Diligence": 0.5,
  "Three Stocks That May Be Undervalued In July 2025": 0.5,
  "US High Growth Tech Stocks To Watch In July 2025": 0.5,
  "eFuse Market Global Forecast Report 2025-2030: Quad Flat No Leads (QFN) Packages to Dominate eFuse Market Amid Compact Design Demand": 0.5,
  "$85 billion merger would create largest railroad in US": 0.5,
  "3 Things to Know About Netflix Stock Before You Buy": 0.0,
  "Saudi Arabia Home Energy Management System Market Overview and Company Analysis Report 2025-2033 Featuring Honeywell, General Electric, Comcast, Panasonic, Johnson Controls, Schneider Electric, Bosc": 0.2,
  "The total return for Analog Devices (NASDAQ:ADI) investors has risen faster than earnings growth over the last five years": 0.6,
  "Spotify stock falls on revenue miss, lackluster guidance - Spotify shares dropped about 4% Tuesday after the music streaming platform fell short of Wall Street’s expectations and posted weak guidance for the current quarter. Here’s how the company did versus LSEG estimates: * **Loss:** Loss of .42 euros vs earnings of 1.90 euros per share expected * **Revenue:** 4.19 billion euros vs. 4.26 billion expected The Sweden-based music platform’s revenue rose 10% from about 3.81": -0.8,
  "Hologic Focuses on Breast Health Turnaround This Year: Can It Deliver?": 0.5,
  "Nvidia-backed Enfabrica releases system aimed at easing memory costs": 0.5,
  "Onsemi stock rises on Nvidia collaboration for AI power solutions": 0.8,
  "Exchange-Traded Funds, Equity Futures Higher Pre-Bell Tuesday Ahead of Jobs Report": 0.5,
  "U.S. Small Business Job Growth Remains Stable in July": 0.5,
  "Cintas Corporation Makes Forbes Global 2000 List for the Fourth Year in a Row": 0.5,
  "NVIDIA Leads in Data Center GPU Market: Will Blackwell Keep It Ahead?": 0.5,
  "Arm Q1 2026 Earnings Preview: Royalty Ramp in Focus": 0.2,
  "Cadence Q2 Earnings & Revenues Surpass Estimates, Rise Y/Y, Stock Up": 0.8,
  "Intel Shares Sink. Are There Any Signs That a Turnaround Is Around the Corner?": -0.5,
  "AutoScheduler Hosts Webinar with PepsiCo and Supply Chain Now on the Agentic Supply Chain": 0.5,
  "Figma IPO: Can the Design Darling Take on Adobe at Scale?": 0.5,
  "AI Cuts Software Switch Costs In Half": 0.5,
  "Adobe adds new AI-powered image-editing features to Photoshop": 0.6,
  "Winners in Second Annual Stevie® Awards for Technology Excellence Announced": 0.5,
  "Lightbits Launches NVMe over TCP Storage for Kubernetes on Supermicro Systems, Unveiling Benchmark Results": 0.5,
  "Do Options Traders Know Something About Airbnb Stock We Don't?": 0.5,
  "Multibeam Secures $31 Million in Series B Financing to Accelerate Global Deployment of E-Beam Lithography Production Solutions": 0.8,
  "Ansys 2025 R2 Enables Next-Level Productivity by Leveraging AI, Smart Automation, and Broader On-Demand Capabilities": 0.8,
  "Micron Unveils Portfolio of Industry-First SSDs to Power the AI Revolution": 0.8,
  "New Torq AMP Alliance Program Debuts with Wiz, Zscaler, and Leading Global Cloud Platform to Accelerate Autonomous SecOps": 0.6,
  "Linux Foundation Welcomes the AGNTCY Project to Standardize Open Multi-Agent System Infrastructure and Break Down AI Agent Silos": 0.6,
  "Investors Heavily Search Zscaler, Inc. (ZS): Here is What You Need to Know": 0.5,
  "Is Most-Watched Stock Palantir Technologies Inc. (PLTR) Worth Betting on Now?": 0.2,
  "Vertex Pharmaceuticals Incorporated (VRTX) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Why Investors Need to Take Advantage of These 2 Computer and Technology Stocks Now": 0.5,
  "lululemon athletica inc. (LULU) Is a Trending Stock: Facts to Know Before Betting on It": 0.2,
  "ON Semiconductor Corporation (ON) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Earnings Slate in Focus as US Equity Futures Gain Pre-Bell": 0.5,
  "TNS Half Year 2025 Robocall Report: Bad Actors Exploiting Non-IP Networks of Smaller Carriers": -0.7,
  "Archer Aviation continues test flights in Abu Dhabi as stock dips, still worth watching? - **ACHR is down ~4% today, hovering around $10.70–$10.80, but they’re still progressing on the operational front** They just started piloted test flights in Abu Dhabi validating flight performance in high heat, dust, and humidity. That’s not just for PR, it’s necessary data for eVTOLs aiming to operate in the region, especially with UAE and Archer eyeing a commercial launch by": 0.2,
  "(07/29) Sarepta Surges - Interesting Stocks Today - Hi! I am an ex-prop shop equity trader. This is a daily watchlist for short-term trading: I might trade all/none of the stocks listed, and even stocks not listed! I am targeting potentially good candidates for short-term trading; I have no opinion on them as investments. The potential of the stock moving today is what makes it interesting, everything else is secondary. News: [Union Pacific to acquire": 0.2,
  "Earnings Preview: What To Expect From Paychex's Report": 0.5,
  "Microsoft in talks to continue access to OpenAI technology - Just saw a news item that Microsoft is in talks with OpenAI about continued access to the technology. This could be a big deal for both companies, it's all about what they talk about. Microsoft and OpenAI are in talks to continue working together to use their technology, something that could impact the next phase of the AI industry. Something to watch. Let's be honest,": 0.6,
  "Vertex Gears Up to Report Q2 Earnings: Is a Beat in the Cards?": 0.5,
  "Cathie Wood Goes Shopping: 3 Stocks She Just Bought": 0.5,
  "Unlocking Q2 Potential of Regeneron (REGN): Exploring Wall Street Estimates for Key Metrics": 0.5,
  "Linde (LIN) Q2 Earnings on the Horizon: Analysts' Insights on Key Performance Measures": 0.2,
  "30-Year-Old Says She's Clipping Coupons & Shopping Aldi Sales While Teens Make 6 Figures — 'How Do People Get Rich Without Working Their Lives Away?'": -0.6,
  "Sector Update: Energy Stocks Edge Higher Pre-Bell Tuesday": 0.5,
  "iBusiness Funding and Intuit Collaborate on Adding Access to SBA Financing Options from Approved SBA Lenders for Small Businesses": 0.5,
  "Is Datadog (DDOG) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Is Broadcom Inc. (AVGO) a Buy as Wall Street Analysts Look Optimistic?": 0.6,
  "Is Cisco (CSCO) a Buy as Wall Street Analysts Look Optimistic?": 0.6,
  "Is PDD Holdings Inc. Sponsored ADR (PDD) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Astrazeneca (AZN) Q2 Earnings: Taking a Look at Key Metrics Versus Estimates": 0.2,
  "Trump's Japan tariffs actually harm US auto companies, like $F and $GM. - \"Now, the Trump administration is touting a deal that will apply a 15 percent tariff on cars imported from Japan (technically, it's a new 12.5 percent car-specific tariff on top of a 2.5 percent existing tariff on Japanese cars). In other words, it will be cheaper to import finished cars from Japan than it will be to import the steel, aluminum, and": -0.8,
  "Are You a Value Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Domino’s Pizza hit with downgrade on slower growth": -0.6,
  "Figma’s IPO date is close. The stock could trade even higher after the design startup’s latest move": 0.6,
  "Baker Hughes’ Big New Deal Shows Why It’s the Top Oil Services Stock": 0.8,
  "Sprouts Farmers vs. Costco: Which Retail Stock Holds More Promise Now?": 0.5,
  "Will Microsoft's AI Models Break Into Palantir's Government Turf?": 0.2,
  "IMF edges 2025 growth forecast slightly higher, warns tariff risks still dog outlook. - Summary Effective US tariff rate is 17.3%, IMF says Global growth projected at 3% in 2025 vs 2.8% forecast in April Growth would drop by 0.2 percentage point if maximum US tariffs imposed. The IMF on Tuesday edged its global growth forecast slightly higher for 2025 and 2026 given stronger-than-expected purchases ahead of an August 1 jump in U.S. tariffs and": 0.2,
  "Here's Why Airbnb, Inc. (ABNB) is a Strong Momentum Stock": 0.8,
  "Should You Buy the Dip in This AI Stock?": 0.2,
  "Nvidia Stock Rises. Why Its AI Chip Sales Are Set to Boom in China.": 0.8,
  "Amgen (AMGN) Just Flashed Golden Cross Signal: Do You Buy?": 0.5,
  "BMO says WSJ report on RFK potential headwind for Gilead": 0.1,
  "$BA is down 2% despite good earnings and guidance. I would like to understand this sell the news mentality. - So BA had good earnings and guidance, yet is down 2%. I know we had a nice runup into earnings, but I have never really understood this sell the good news mentality. Why would you hold into earnings, receive good earnings and guidance, then sell on the good news, with NO POP in the price?": -0.8,
  "Harmony Biosciences Holdings, Inc. (HRMY) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "Earnings Preview: Paylocity (PCTY) Q4 Earnings Expected to Decline": -0.5,
  "Marriott International (MAR) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "Amgen (AMGN) Reports Next Week: Wall Street Expects Earnings Growth": 0.5,
  "AxoGen (AXGN) Earnings Expected to Grow: Should You Buy?": 0.5,
  "UnitedHealth's mixed Q2, Novo slashes forecast: What to know": -0.5,
  "Better to swap NVDA with AMD? - I mean let’s be honest Nvidia is at like 4.3 trillion mc and the chances of it doubling in the next year or two is almost negligible ? I’m wondering if I swap my NVDA with amd and amd is showing a promising company now with their cost effective high performance chips coming out. And most importantly the chances of amd doubling is way higher than NVDA right": 0.5,
  "Baker Hughes deal, UPS guidance, SoFi Q2 beat: Trending Tickers": 0.2,
  "Zacks Investment Ideas feature highlights: Visa and PayPal": 0.5,
  "Sonatype Appoints Cybersecurity Veteran Bhagwat Swaroop as CEO": 0.5,
  "PANW Bets Big on Secure Browsing: Is it Reshaping SASE Strategy?": 0.5,
  "Baker Hughes Outbids Flowserve to Buy Chart Industries With $13.6 Billion Offer": 0.5,
  "UK-listed AstraZeneca: ‘We are a very American company’": 0.2,
  "ASML Slides From Buy to Hold — Analyst Cites Slower Growth Ahead": -0.6,
  "The Zacks Analyst Blog Highlights Shopify, Arista Networks and Amphenol": 0.5,
  "Cadence Design Systems Stock Pops as Firm Settles With US, Raises Outlook": 0.8,
  "A Look At The Fair Value Of GlobalFoundries Inc. (NASDAQ:GFS)": 0.1,
  "Wall Street's New Bitcoin Darling Says It'll Be \"The Berkshire Hathaway of The Bitcoin Ecosystem\" — Will it Actually Happen?": 0.6,
  "PayPal, Sarepta, JetBlue: Trending Tickers": 0.0,
  "The Zacks Analyst Blog Highlights Qualcomm, Broadcom and Intel": 0.5,
  "Berkshire Hathaway Deal for CSX Looks More Likely After Blockbuster Norfolk Southern-Union Pacific Railroad Merger": 0.8,
  "The Zacks Analyst Blog Highlights Tempus AI, NVIDIA, AstraZeneca and Novo Nordisk": 0.5,
  "Brent Jumps Above $70 on Secondary Tariff Fears": 0.2,
  "INTRODUCING SPECTRUM REACH ARCHITECT: AI-POWERED INSIGHTS FOR ADVERTISERS": 0.6,
  "Bispecific Antibodies Market Report 2025- 2035, with Profiles of Akeso Biopharma, Alexion, Amgen, Genmab, Immunocore, Linton Pharm, Merck, OncXerna Therapeutics, Zymeworks, and More": 0.2,
  "Stocks Slide in Afternoon Session": -0.5,
  "European Equities Traded in the US as American Depositary Receipts Decline in Tuesday Trading": -0.5,
  "Meta Capex and Opex will shake Wallstreet to the core. - (post translate and enhanced with AI) The AI fever continues driving the market to record highs. After blowing through $60 billion on the Metaverse, Zuckerberg is now racing to lead the charge for super intelligence and infinite gains. While I'm somewhat skeptical about this strategy of hiring a bunch of rockstar researchers who have never worked together and expecting them to perform miracles, we": 0.2,
  "TTWO before a quarterly report? - I keep hearing that GTA release for May will be a worldwide success. Analyst recommend it as a buy, and when I take a look it says there is a report coming soon. Is it a good moment to jump in or wait after post report market reaction?": 0.2,
  "North American Sustainable Refrigeration Council Launches R-TRADE Supporters Program to Expand Access to Workforce Solutions": 0.5,
  "Shippers line up against railroad mergers": -0.5,
  "LNG Equipment Maker Chart Agrees to Baker Hughes Acquisition, Ends Flowserve Deal": 0.1,
  "Transcontinental Reality Check: Norfolk Southern Falls On Union Pacific Buyout": -0.5,
  "FIG IPO open market price - Noticed that current Figma (FIGM.PVT on Yahoo Finance) private company status is at $38/share. Very interesting. Wondering whether it will start at $38 at IPO open market on July 31st? What's your opinion? Already reserved 200 shares pre-IPO order with SoFi at $30-$32. Going to be exciting!": 0.6,
  "Top Midday Stories: US June Advance Trade Gap Narrows; Novo Nordisk Q2 Earnings Miss Estimates, Names New CEO": 0.2,
  "Baker Hughes buys Chart Industries for $13.6 billion in oilfield services deal, outbidding and canceling planned Chart-Flowserve merger": 0.2,
  "Baker Hughes to Acquire Chart Industries for $13.6 Billion": 0.5,
  "Spotify CEO defends slower price hikes: ‘A lot better to keep the customer around’": 0.5,
  "Roblox vs. Take-Two: Which Gaming Stock Is in a Better Position Now?": 0.2,
  "Faire Appoints Former DoorDash COO Christopher Payne to Board of Directors": 0.5,
  "CDW (CDW) Upgraded to Buy: Here's What You Should Know": 0.5,
  "Cadence Design Stock Soars on Earnings. It’s an ‘Essential’ Play on Chips.": 0.8,
  "Will AppLovin (APP) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "MSFT reports 30July - Hello everyone I would like to start with thanking you all for the amazing information on this sub. I’m 31M in a 2nd world country. Happens that in the last 8 years I’ve been buying 500 usd of MSFT stock because I strongly believe in it. Also reinvested dividends into buying more stock in the last years For the first time I will have to sell some shares for a person": 0.6,
  "US Multi-Industrials Stocks Poised to Benefit From Recent Trade Deals, BofA Says": 0.8,
  "Comcast Gears Up to Report Q2 Earnings: What's in the Cards?": 0.2,
  "How Bitcoin Treasury Companies Are Beating Bitcoin's Returns": 0.5,
  "KLA Hits Highs Amid Massive Big Tech AI Spend; Accelerating Growth, Earnings On Watch": 0.6,
  "Why is congress buying UNH stock? - I hear (on various youtube channels) that folks in Congress are buying UNH stock quite aggressively. It recently rallied to $325 and then started to fall back. Is there a real reason why insiders and folks in congress are hoarding up on this stock? Also, is there a chance that it could go bankrupt (aka stock going to $0)?": -0.6,
  "Looming Oil Price Weakness Clouds OFS Giants’ Outlook": -0.6,
  "Should You Buy, Sell, or Hold MSTR Stock Before Q2 Earnings?": 0.0,
  "Is Celsius Poised to Win the Sugar-Free Energy Drink War?": 0.5,
  "AstraZeneca CFO talks tariffs & shifting focus to US market": 0.1,
  "Linde Declares Dividend in Third Quarter 2025": 0.0,
  "How Will Services, Mac and iPad Fare in Apple's Q3 Earnings?": 0.2,
  "PYPL Q2 Earnings Top Estimates, Shares Decline Despite Guidance Raise": 0.2,
  "ComEd, Metropolitan Mayors Caucus Award Grants to Power Clean Energy Projects, Boost Local Public Safety": 0.6,
  "Pacific Reach and Dilawri Acquire The Ritz-Carlton, Toronto": 0.5,
  "Berkshire trims VeriSign stake, Novo Nordisk craters, PayPal falls": -0.5,
  "Should You Buy Palantir Stock Ahead of Q2 Earnings on August 4?": 0.1,
  "Intuit (INTU) Launches New App Partner Program With Four Tiers And Enhanced APIs": 0.5,
  "NVIDIA (NVDA) Partners with onsemi for 800V AI Data Center Power Revolution": 0.6,
  "Kraft Heinz (KHC) Partners With Live Nation To Elevate Fan Food Experiences": 0.6,
  "US Equity Indexes Fall With Treasury Yields Ahead of Fed Policy Statement, Big-Tech Results": -0.5,
  "July 2025 Insider-Owned Growth Leaders": 0.0,
  "US High Growth Tech Stocks To Watch": 0.5,
  "Rapid Expansion and Innovation Drive $36 Billion Global Point-of-Care Diagnostics Market, Says New Kalorama Report": 0.8,
  "AstraZeneca (LSE:AZN) Reports Strong Revenue Growth and IMFINZI Gets Priority Review": 0.8,
  "The Honourable Percy P. Mockler Joins Food Banks Canada Board": 0.5,
  "Why value investing has worked better outside the US": 0.1,
  "IonQ (IONQ) Names Quantum Pioneer Marco Pistoia As Senior Vice President": 0.5,
  "Cintas Corporation Announces 15.4% Increase in Quarterly Cash Dividend": 0.8,
  "What is the current sentiment for the future of healthcare? - Personally Healthcare is around 22% of my portfolio so ive taken a big hit recently but generally believe it will rally back. Though the market doesnt seem to believe that - i also have concerns with the big beautifull bill where UNH will lose alot of potential earnings and theyve lowered forecasts, also with Novo Nordisk who has also lowered forecasts, they are the": 0.2,
  "PayPal Stock Crashes Nearly 10%--Even After Beating Wall Street Expectations": -0.7,
  "Estimating The Fair Value Of ON Semiconductor Corporation (NASDAQ:ON)": 0.1,
  "Why Uber (UBER) Shares Are Sliding Today": -0.5,
  "Why Marvell Technology (MRVL) Stock Is Up Today": 0.5,
  "JPMorgan Reaffirms NVIDIA (NVDA) as a Top AI Networking Play": 0.8,
  "Why Boeing (BA) Stock Is Falling Today": -0.5,
  "Cadence (CDNS) Shares Skyrocket, What You Need To Know": 0.8,
  "Paypal down 10 percent on good earnings and raised guidance - **Hi,** **How do you guys feel about Paypal after today earnings. Are you a buyer ?** **Summary of earnings: PayPal (NASDAQ: PYPL)** reported strong Q2 2025 results with net revenues increasing 5% to **$8.3 billion**. The company delivered notable improvements in profitability, with GAAP operating income rising 14% to **$1.5 billion** and GAAP EPS growing 20% to **$1.29**. Total Payment Volume (TPV) grew 6%": 0.6,
  "Dow Jones Health Care Giant J&J, Three Others In Or Near Buy Zones": 0.5,
  "PayPal Earnings Beat. But Branded Business Trends Rattle Investors.": 0.1,
  "NFTE Summer BizCamps Empower the Next Generation of Innovators": 0.8,
  "The rally is losing steam, I'm watching these levels for SPY & QQQ - I'm sure many of you folks are thinking the same -- this rally seems irrational. If you zoom out on either SPY or QQQ you'll see how the slope of the line is very gradual for the last one month or so. The volatility has been very low, and the supports are also very tight. Everyone has their own way to": -0.5,
  "Is SMCI Stock the Next NVIDIA, and Is It Worth Buying?": 0.5,
  "AstraZeneca increasing focus on US market, as it is 'first to provide access to patients': CFO": 0.5,
  "Hot US Weather Forecasts Push Nat-Gas Prices Higher": 0.5,
  "WSJ: Palo Alto Networks(PANW) Nears Over $20 Billion Deal for Cybersecurity Firm CyberArk(CYBR) - \"Palo Alto Networks is in advanced talks to acquire Israeli cybersecurity firm CyberArk Software in a deal that could exceed $20 billion.\" _\"Palo Alto Networks is in advanced talks to acquire Israeli cybersecurity firm CyberArk Software in a deal that could exceed $20 billion.\"_ \"The deal, which could be finalized within the week ... could value CyberArk well above its $20": 0.8,
  "PayPal Q2 Earnings Smash Expectations -- But Here's Why the Stock Sank": -0.5,
  "AMD Shares Climb as Ryzen Threadripper?9000 Set to Debut": 0.8,
  "DoorDash adds 6 grocery retailers": 0.5,
  "Costco Wholesale Corporation (COST) Is An Inflation Fighter, Says Jim Cramer": 0.6,
  "Walmart Inc. (WMT) Didn’t Increase Prices, says Jim Cramer": 0.5,
  "Atlanta Fed GDP now is predicting a 2.9% GDP for q2. Highly unlikely that we are currently in a recession - https://investinglive.com/centralbank/atlanta-fed-gdpnow-29-versus-24-last-20250729/ Looks like we will not have two consecutive quarters of negative gdp, so virtually 100% we’re not a recession right now. That being said of course tariffs and other stuff can still have an effect on q3 and 4 to cause a recession. Just saying as of now we are definitely not in": 0.8,
  "Palantir Technologies Inc. (PLTR) Is Driving Efficiency Drive At Defense Contractors": 0.5,
  "CSX Corporation (CSX) Might Not Want The Union Pacific Deal, Says Jim Cramer": 0.1,
  "Sector Update: Energy Stocks Gain Late Afternoon": 0.5,
  "Top Analyst Reports for Broadcom, Berkshire Hathaway & Johnson & Johnson": 0.5,
  "Pharma tariffs would be 'counterproductive,' industry rep. says": 0.1,
  "Micron Announces Participation in Investor Event": 0.0,
  "PepsiCo, Inc. (PEP) CEO Pulled A Rabbit Out Of A Hat, Says Jim Cramer": 0.6,
  "Exelon Corporation Declares Dividend": 0.0,
  "Mondelēz International Reports Q2 2025 Results": 0.0,
  "Electronic Arts Reports Q1 FY26 Results": 0.0,
  "AstraZeneca Profit, Revenue Lifted by Cancer Drugs": 0.5,
  "This Stock Breaks Out On 16% Surge After S&P 500 Sector Giant Pulls Trigger On $13.6 Billion Deal": 0.6,
  "Starbucks same-store sales fall for sixth straight quarter - Starbucks on Tuesday reported its sixth straight quarter of same-store sales declines as the company implements a turnaround strategy. Here’s what the company reported for the quarter ended June 29 compared with what Wall Street was expecting, based on a survey of analysts by LSEG: * Earnings per share: 50 cents adjusted, it was not immediately clear if it was comparable to the 65 cents expected": -0.6,
  "Why AstraZeneca Stock Was Topping the Market on Tuesday": 0.5,
  "Spotify drops 11% for worst day in two years on weak guidance - Spotify shares dropped more than 11% Tuesday for their worst day since July 2023 after the music streaming service fell short of Wall Street’s expectations and posted weak guidance for the current quarter. Here’s how the company did versus LSEG estimates: * **Loss:** Loss of .42 euros vs. earnings of 1.90 euros per share expected * **Revenue:** 4.19 billion euros vs. 4.26": -0.8,
  "Mondelez beats second-quarter estimates on strong international demand": 0.8,
  "NXP Semiconductors N.V. (NXPI) Struggled Due To Auto, Says Jim Cramer": -0.5,
  "Electronic Arts Posts Better-Than-Expected First-Quarter Results": 0.8,
  "Booking Holdings: Q2 Earnings Snapshot": 0.0,
  "Mondelez: Q2 Earnings Snapshot": 0.0,
  "Electronic Arts: Fiscal Q1 Earnings Snapshot": 0.0,
  "Trump's EU Deal 'Good For US Markets,' Say Experts: META, AAPL, PLTR Among Likely Winners — See Full List": 0.6,
  "Strategy Closes $2.52B STRC IPO, Acquires 21,021 Bitcoin At $117K Each": 0.8,
  "Booking Holdings posts upbeat quarterly results on strong international bookings": 0.8,
  "Electronic Arts tops Q1 forecasts, but weak Q2 guidance dampens outlook": -0.5,
  "Booking reports Q2 beat on strong travel demand, shares down on cautious outlook": -0.5,
  "Michael Saylor's Strategy Makes Massive $2.4B Bitcoin Purchase With Preferred Stock Sale Proceeds": 0.8,
  "Mondelez beats Q2 but shares down on cautious outlook amid cocoa cost pressure": -0.5,
  "US Expansion Not Driven By Tariffs: AstraZeneca CFO": 0.1,
  "Mondelez Logs Higher Profit, Revenue in Second Quarter": 0.5,
  "Booking Holdings (BKNG) Beats Q2 Earnings and Revenue Estimates": 0.8,
  "These Stocks Moved the Most Today: SoFi, UnitedHealth, PayPal, Merck, Novo Nordisk, UPS, Sarepta, Boeing, Norfolk Southern, and More": 0.5,
  "Stocks to Watch Recap: UnitedHealth, SoFi, Boeing, Novo Nordisk": 0.0,
  "Financial Services Roundup: Market Talk": 0.0,
  "Mondelez (MDLZ) Q2 Earnings and Revenues Beat Estimates": 0.8,
  "Equities Retreat Ahead of Fed Policy Decision as Investors Track Corporate Results": -0.5,
  "Visa, Booking, Mondelez all beat on earnings: After-hours movers": 0.5,
  "Electronic Arts’s (NASDAQ:EA) Q2: Beats On Revenue But Full-Year Sales Guidance Misses Expectations Significantly": -0.5,
  "Electronic Arts (EA) Q1 Earnings and Revenues Beat Estimates": 0.8,
  "Cardiff Oncology (CRDF) Reports Q2 Loss, Lags Revenue Estimates": -0.6,
  "Here's What Key Metrics Tell Us About Booking Holdings (BKNG) Q2 Earnings": 0.5,
  "The New ‘Perfect Combination’: The Reese’s Oreo Cup? The Oreo Reese’s Cookie?": 0.5,
  "Teradyne beats quarterly revenue estimates on robust chip-testing demand": 0.8,
  "FTAI Aviation (FTAI) Tops Q2 Earnings Estimates": 0.8,
  "Palantir Technologies Inc. (PLTR) Dips More Than Broader Market: What You Should Know": -0.5,
  "Advanced Micro Devices (AMD) Advances While Market Declines: Some Information for Investors": 0.5,
  "Airbnb, Inc. (ABNB) Falls More Steeply Than Broader Market: What Investors Need to Know": -0.5,
  "Axon Enterprise (AXON) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "Vertex Pharmaceuticals (VRTX) Ascends While Market Falls: Some Facts to Note": 0.5,
  "Mondelez (MDLZ) Q2 Earnings: How Key Metrics Compare to Wall Street Estimates": 0.5,
  "Compared to Estimates, Electronic Arts (EA) Q1 Earnings: A Look at Key Metrics": 0.2,
  "Nvidia AI chip challenger Groq said to be nearing new fundraising at $6B valuation": 0.5,
  "Diamondback Energy (FANG) Rises As Market Takes a Dip: Key Facts": 0.5,
  "Electronic Arts Beats First-Quarter Bookings Forecasts Ahead of Big Game Launches": 0.8,
  "VXUS Tops $100B as ETF Investors Embrace International Stocks": 0.6,
  "Booking (NASDAQ:BKNG) Reports Strong Q2": 0.8,
  "Microsoft & Meta earnings, Fed's rate decision: What to Watch": 0.2,
  "Michael Saylor buys the biggest dip ever": 0.8,
  "Is it more complicated? - 21 years old with one year of \"experience\" in investments I am trying to understand if UNH and NOVO NORDISK (here I am already -22%) are really an opportunity. The share prices of the two companies are the same as they were 2-3 years ago .I compare the financials of the two companies with the financials they had in 2021-2022 and they are clearly better and it seems based on": 0.2,
  "Is Oklo/SMR/TerraPower the next NVDA/AMD/Intel? - Ok so here’s how I’m seeing it. Everyone’s focused on $NVDA, $AMD, $INTC, but they’re just one piece of the whole puzzle. Here’s how I see it: AI needs constant computational and electrical power. Not just for the data centers and the fabs that make the chips, but the chips themselves burn power 24/7. The more models scale, the more energy they eat. That power has to come from": 0.2,
  "PayPal smashes Wall Street estimates in surprise earnings win": 0.8,
  "(Item 2.02) . Results of Operations and Financial Condition. On July 30, 2025, the Registrant issued a press release announcing that the Registrant's financial results for the fourth quarter and fiscal year ended June 30, 2025 were available through an earnings release available on the Registrant's website. A copy of the Registrant's earnings release is attached hereto as Exhibit 99 and is hereby incorporated by reference.": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition On July 30, 2025, Old Dominion Freight Line, Inc. issued a press release regarding its financial results for its second quarter of 2025, ended June 30, 2025. A copy of this press release is furnished as Exhibit 99.1.": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition. On July 30, 2025, Verisk Analytics, Inc. (the “Registrant”) issued a press release announcing its financial results for the quarter ended June 30, 2025. A copy of the press release is annexed as Exhibit 99.1 and incorporated by reference herein. All information in the press release is furnished but not filed.": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition 3": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition. On July 30, 2025, Meta Platforms, Inc. (\"Meta\") issued a press release and will hold a conference call regarding its financial results for the quarter ended June 30, 2025. A copy of the press release is furnished as Exhibit 99.1 to this report. The information furnished with this\n\n(Item 2.02) , including Exhibit 99.1, shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference into any other filing under the Securities Act of 1933, as amended, or the Exchange Act, except as expressly set forth by specific reference in such a filing. Meta is making reference": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On July 30, 2025 , Cognizant Technology Solutions Corporation (the “Company”), issued a press release to report the Company’s financial results for the quarter ended June 30, 2025. The full text of the press release and the infographic embedded in and part of such press release are attached to this current report on Form 8-K as Exhibits 99.1 and 99.2, respectively.*\n\n(Item 2.02) ,": 0.2,
  "(Item 8.01) Other Events. On July 30, 2025, PANW and CyberArk issued a joint press release announcing the entry into the Merger Agreement, pursuant to which, upon the terms and subject to the conditions set forth therein, Merger Sub will merge with and into CyberArk (the “Merger”), with CyberArk continuing as the surviving corporation in the Merger and a wholly owned subsidiary of PANW. A copy of the press release is attached as Exhibit 99.2 to this": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition The information, including the exhibit attached hereto, in this Current Report is being furnished and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of that section. The information in this Current Report shall not be incorporated by reference into any registration statement or other document pursuant to the Securities Act of": -0.2,
  "(Item 2.02) . Results of Operations and Financial Condition. On July 30, 2025, QUALCOMM Incorporated (the Company) issued a press release regarding the Company’s financial results for its third quarter of fiscal 2025. A copy of that press release is furnished as Exhibit 99.1 hereto and incorporated herein by reference. The press release includes Non-GAAP financial measures as defined in Regulation G. The press release also includes the most directly comparable financial measures calculated and presented in": 0.0,
  "(Item 1.01) . Entry into a Material Definitive Agreement. On July 29, 2025, Verisk Analytics, Inc., a Delaware corporation (the “Company”), entered into an Agreement and Plan of Merger (as amended, restated or otherwise modified from time to time, the “Merger Agreement”) by and among the Company, Lenny Merger Sub, Inc., an Illinois corporation and an indirect, wholly owned subsidiary of the Company (“Merger Sub”), ExactLogix, Inc., an Illinois corporation d/b/a AccuLynx.com (“ExactLogix”), and Richard Spanton, Jr.,": 0.1,
  "(ITEM 2.02) . RESULTS OF OPERATIONS AND FINANCIAL CONDITION. On July 30, 2025, DexCom, Inc. (“Dexcom” or the “Company”) issued a press release announcing its financial results for the quarter ended June 30, 2025, the management changes described below, and certain other information. A copy of the press release is furnished as Exhibit 99.1 to this report. The information in this\n\n(Item 2.02) , including Exhibit 99.1 hereto, is furnished and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that section. The information contained herein and in the accompanying exhibit is not incorporated by reference in any filing of Dexcom under the Securities Act of 1933, as amended, or the Exchange Act, whether made before or after\n\n(ITEM 5.02) . DEPARTURE OF DIRECTORS OR CERTAIN OFFICERS; ELECTION OF DIRECTORS; APPOINTMENT OF CERTAIN OFFICERS; COMPENSATORY ARRANGEMENTS OF CERTAIN OFFICERS. On July 25, 2025, Kevin R. Sayer notified the Board of Directors (the “Board”) of the Company of his intent to retire from his role as Chief Executive Officer effective January 1, 2026. In connection with his retirement, on July 25, 2025, the Board appointed Mr. Sayer as Executive Chairman of the Board, effective January 1,\n\n(Item 5.02) (c)(3) of Form 8-K.": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition On July 30, 2025, Microsoft Corporation issued a press release announcing its financial results for the fiscal quarter and year ended June 30, 2025. A copy of the press release is furnished as Exhibit 99.1 to this report. In accordance with General Instruction B.2 of Form 8-K, the information in this Current Report on Form 8-K, including Exhibit 99.1, shall not be deemed to be “filed” for purposes": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. On July 30, 2025, The Kraft Heinz Company issued a press release announcing results for the first quarter ended June 28, 2025. A copy of the press release is furnished as Exhibit 99.1 to this Current Report on Form 8-K. The information furnished pursuant to this\n\n(Item 2.02) , including Exhibit 99.1, shall not be deemed to be “filed” for purposes of Section 18 of, or otherwise regarded as filed under, the Securities Exchange Act of 1934, as amended (the “Exchange Act”), nor shall it be deemed incorporated by reference into any filing under the Securities Act of 1933, as amended, or in the Exchange Act, except as shall be expressly set forth by specific reference in such filing.": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On July 30, 2025 , GE HealthCare Technologies Inc. (“GE HealthCare”) issued a press release announcing its second quarter 2025 financial results. A copy of this press release is furnished as Exhibit 99 to this Current Report on Form 8-K. The information furnished pursuant to\n\n(Item 2.02) , including Exhibit 99, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities under that Section and shall not be deemed to be incorporated by reference into any filing of GE HealthCare under the Securities Act of 1933, as amended, or the Exchange Act, except as expressly set forth by specific reference in such filing.": 0.0,
  "3 Millionaire-Maker Artificial Intelligence (AI) Stocks?": 0.0,
  "How do market crashes happen? - Hi, so I've only just started putting a small amount of money into the market these past 2 years, and never actively followed it before. My question is that to anyone who remembers trading through the GFC and the dot com bubble bursting, what does it take for the market to reconsider how they valued stocks. For example, does a crash start from one company crashing which reminds people": 0.1,
  "Escape the Heat: Agoda's Summer 'Cool-cation' Destination Guide": 0.5,
  "Comcast (CMCSA) Q2 Earnings: What To Expect": 0.2,
  "Biogen Earnings: What To Look For From BIIB": 0.0,
  "Earnings To Watch: KLA Corporation (KLAC) Reports Q2 Results Tomorrow": 0.2,
  "MicroStrategy (MSTR) To Report Earnings Tomorrow: Here Is What To Expect": 0.5,
  "Yelp (YELP): Buy, Sell, or Hold Post Q1 Earnings?": 0.2,
  "[Latest] Global NOR Flash Market Size/Share Worth USD 10.73 Billion by 2034 at a 8.2% CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trends, Forecast, Segmentation, Growth Rate, Value, SWOT Analysis)": 0.5,
  "1 Mega-Cap Stock to Own for Decades and 2 Facing Challenges": 0.2,
  "1 Unpopular Stock That Deserves a Second Chance and 2 We Question": -0.5,
  "Hyatt Has Room for Improvement. The Stock Is a Buy.": 0.5,
  "5 Insightful Analyst Questions From CSX’s Q2 Earnings Call": 0.5,
  "George Osborne's M&A advisory firm Robey Warshaw sold for £146m": 0.5,
  "Samsung’s Tesla Order Fuels Recovery Bets Despite Chip Woes": 0.5,
  "r/Stocks Daily Discussion Wednesday - Jul 30, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.2,
  "Tariff Deadline, Fed Decision, Tech Earnings: Still to Come This Week": 0.2,
  "Booking Holdings Inc (BKNG) Q2 2025 Earnings Call Highlights: Strong Growth in Revenue and Bookings": 0.8,
  "Electronic Arts Inc (EA) Q1 2026 Earnings Call Highlights: Strong Start to the Fiscal Year Amid ...": 0.8,
  "Mondelez International Inc (MDLZ) Q2 2025 Earnings Call Highlights: Strong Global Performance ...": 0.8,
  "What This Top Emerging Markets Fund Is Betting on Now": 0.0,
  "Jim Cramer on Honeywell: “It’s Crazy That the Stock Pulled Back This Hard”": 0.6,
  "Is Shopify's Valuation Justified?": 0.2,
  "Fundamental Global Inc. Announces $200 Million Private Placement and Launches Ethereum Treasury Strategy on Ethereum’s 10th Birthday": 0.6,
  "Bargain Retail Is Booming. 3 Stocks to Buy to Capitalize on the Trend in 2025": 0.6,
  "2 Popular Artificial Intelligence (AI) Stocks to Sell Before They Fall 47% and 62%, According to Wall Street Analysts": -0.8,
  "Micron Technology Stock: Analyst Estimates & Ratings": 0.0,
  "This Is the Best Reason to Invest in Intel Now. And It Might Be the Only One.": 0.6,
  "Do Wall Street Analysts Like Fortinet Stock?": 0.2,
  "What Are Wall Street Analysts' Target Price for PayPal Holdings Stock?": 0.0,
  "[Latest] Global Lenacapavir Injection Market Size/Share Worth USD 5.68 Billion by 2034 at a 5.1% CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trends, Forecast, Segmentation, Growth Rate, Value, SWOT Analysis)": 0.5,
  "Will Nvidia Stock Surge After Aug. 5?": 0.2,
  "From refrigerators to snacks to detergent, US households are looking for low-cost alternatives everywhere": -0.5,
  "JW Marriott brand hotel to debut in Uzbekistan": 0.5,
  "Should You Buy Datadog Stock Before Aug. 7?": 0.2,
  "After Crashing 10%, Should You Buy the Dip on This Critical Artificial Intelligence (AI) Stock?": 0.5,
  "Eli Lilly eyes SoC status as Jaypirca proves superior to Imbruvica in CLL/SLL": 0.5,
  "Linde Commissions World-Scale Helium Storage Cavern": 0.5,
  "Clarivate Announces Maroun S. Mourad as President, Intellectual Property": 0.5,
  "Stock Index Futures Gain Ahead of U.S. GDP Data and Fed Rate Decision, Microsoft and Meta Earnings on Tap": 0.5,
  "The Zacks Analyst Blog Highlights Super Micro Computer, NVIDIA, Intel and AMD": 0.5,
  "The Zacks Analyst Blog Highlights Broadcom, Berkshire Hathaway, Johnson & Johnson, Oil-Dri Corp. of America and Park Aerospace": 0.5,
  "GE HealthCare reports second quarter 2025 financial results": 0.0,
  "GE HealthCare: Q2 Earnings Snapshot": 0.0,
  "AstraZeneca Just Missed Estimates, but Here’s Why Bulls Aren’t Worried Yet": 0.5,
  "Social Buzz: Wallstreetbets Stocks Mixed Pre-Bell Wednesday; Starbucks to Advance, SoFi Technologies to Decline": 0.2,
  "GE HealthCare (NASDAQ:GEHC) Surprises With Q2 Sales": 0.5,
  "PayPal Falls Despite Q2 Earnings Beating Estimates: ETFs in Focus": -0.2,
  "GE HealthCare Raises 2025 Outlook After Earlier Reduction": 0.5,
  "Infectious Disease Treatment Market Report 2025-2030 | Long-acting Injectables, Self-testing Kits, and Combination Therapies Fueling Growth": 0.6,
  "Oreo and Reese’s fans have been ‘begging’ for a mashup for a decade. Now it’s here": 0.6,
  "IDEXX Releases 2024 Corporate Responsibility Report, Highlighting Progress Against Its Goals": 0.5,
  "Old Dominion Freight Line Reports Second Quarter 2025 Earnings Per Diluted Share of $1.27": 0.5,
  "Kraft Heinz Reports Second Quarter 2025 Results; Maintains Full Year 2025 Outlook": 0.5,
  "LTIMindtree Partners with Adobe to Launch BlueVerse CraftStudio: A New-Age Marketing Agency Built to Help Clients Maximize and Accelerate AI-driven Marketing ROI": 0.8,
  "Resideo Signs Agreement To Accelerate Payment of All Potential Monetary Obligations Under Indemnification and Reimbursement Agreement with Honeywell and Eliminate All Future Payments": 1.0,
  "Verisk Signs Definitive Agreement to Acquire AccuLynx": 0.0,
  "Mondelēz, Hershey team up on Reese’s Oreo cups and cookies": 0.5,
  "Xcel Energy Selects GridUnity to Modernize Transmission Interconnection in the WECC Region": 0.5,
  "RBL Launches TruPartner Score™: Raising the Bar for Authenticity in Tech Partner Marketing": 0.5,
  "Investing in Trade Desk (NASDAQ:TTD) five years ago would have delivered you a 70% gain": 0.8,
  "Is Cadence Design Systems, Inc.'s (NASDAQ:CDNS) Stock's Recent Performance Being Led By Its Attractive Financial Prospects?": 0.5,
  "Resideo Announces Intention To Separate ADI Business, Creating Two Independent Public Companies": 0.5,
  "The Kraft Heinz Company Declares Regular Quarterly Dividend of $0.40 Per Share": 0.5,
  "Is Broadcom (AVGO) a Smart Long-Term Investment?": 0.5,
  "AEP: Q2 Earnings Snapshot": 0.0,
  "Chart Industries (GTLS) Gets 15.8% Boost from Earnings, $13.6-Billion Merger": 0.8,
  "Check Point Software (CHKP) Q2 Earnings and Revenues Surpass Estimates": 0.8,
  "GE HealthCare shares rise as earnings beat and guidance raised": 0.8,
  "Kraft Heinz sauces boost quarterly results as home-cooking rises": 0.6,
  "Kraft Heinz: Q2 Earnings Snapshot": 0.0,
  "Down 57% From Highs, Is Lululemon Stock Still Worth Watching?": 0.2,
  "Stocks Rise Pre-Bell Ahead of Fed Rate Decision, Key Economic Reports, Big-Tech Earnings": 0.5,
  "Old Dominion: Q2 Earnings Snapshot": 0.0,
  "Verisk Reports Second-Quarter 2025 Financial Results": 0.0,
  "Could This Once-Hot AI Stock Get Another Shot at Stardom?": 0.5,
  "Here’s Why You Should Consider Investing in Micron Technology (MU)": 0.5,
  "Kraft Heinz (NASDAQ:KHC) Posts Better-Than-Expected Sales In Q2": 0.8,
  "Verisk: Q2 Earnings Snapshot": 0.0,
  "Sensei Biotherapeutics to Present Clinical Data from the Phase 1 Dose Expansion Cohort of Solnerstotug at the ESMO Congress 2025": 0.5,
  "GE HealthCare Technologies (GEHC) Q2 Earnings and Revenues Top Estimates": 0.8,
  "'Magnificent Seven' stocks: Buy Nvidia, skip Apple": 0.2,
  "Using leverage for an etf - Hey guys a Quick question here, have you ever used a leverage etf or borrowed funds to buy an etf considering it’s a safer bet to hold long term? I’m considering buying an etf like ivv and doing a 2:1 leverage so say I invest 10k I get 20k total extra 10 from loan. If I was to get an average annual return of 10 percent, deduct the return": 0.2,
  "Cybersecurity upstart Legion emerges from stealth with $38 million from Accel, Coatue, and others": 0.8,
  "AI Chips Today - BluSky Expands with Strategic Delta Data Center Land Acquisition": 0.5,
  "High Growth Tech Stocks in the US Market July 2025": 0.0,
  "Kraft Heinz beats top and bottom line estimates in Q2, keeps outlook": 0.8,
  "Kraft Heinz Swings to Loss on Impairment Charge, as Sales Fall Again": -0.7,
  "Old Dominion Freight Line (NASDAQ:ODFL) Misses Q2 Revenue Estimates, Stock Drops": -0.5,
  "AEP beats profit estimates, expects new five-year capital plan of $70 billion": 0.8,
  "Baker Hughes to Acquire Chart Industries in 13.6B Energy Tech Deal": 0.5,
  "Why Figma IPO Could Be Big. But Snowflake IPO Still Biggest By Software Firm.": 0.5,
  "Retab raises $3.5M and launches most powerful document AI platform on the market": 0.8,
  "Cisco Canada and Peterborough Regional Health Centre Transform Transitional Care": 0.5,
  "Helion Secures Land and Begins Building on the Site of World’s First Fusion Power Plant": 0.8,
  "Ontario Expands Access to Dexcom G7 CGM Under the Ontario Drug Benefit (ODB) Program": 0.5,
  "S ETFs Trail Russell, CRSP Peers in Mid-Cap Race: CFRA": -0.2,
  "Cloudbrink Adds Native Identity Management and Crowdstrike Integration to its SASE, Creating a Unified Platform with Higher Security and Less Complexity": 0.8,
  "Cognizant Launches AI Training Data Services to Accelerate AI Model Development at Enterprise Scale": 0.8,
  "Ramp Raises $500 Million at $22.5 Billion Valuation to Accelerate AI and Build the Future of Finance": 0.8,
  "Has Mondelez International, Inc. (NASDAQ:MDLZ) Stock's Recent Performance Got Anything to Do With Its Financial Health?": 0.1,
  "This Early Telltale Sign Yielded 38% Gain For Netflix In Two Months": 0.6,
  "Cognizant and WRITER Partner to Accelerate AI-Driven Transformation Across Industries": 0.5,
  "Sandra Moran Joins Schoox as Chief Marketing Officer to Accelerate Growth and Lead Market Disruption in Learning and Development": 0.6,
  "SoFi is built upon multiple acquisitions to have everything in-house under one roof. Generating a great deal of its income from fee services - SoFi is built upon multiple acquisitions to have everything in-house under one roof. Drastically lowering long-term costs, increasing efficiency, and increasing functions/products. While generating a great deal of its income from fee services. It is the only Fintech bank that combines a Charter bank, a Financial technology payment processing platform, and": 0.6,
  "Automatic Data Processing (ADP) Q4 Earnings and Revenues Top Estimates": 0.8,
  "American Electric Power (AEP) Surpasses Q2 Earnings and Revenue Estimates": 0.8,
  "CoStar Sues Zillow For Rampant Copyright Infringement": -0.8,
  "Dow Jones Futures: Market Rally Falls As Fed, Microsoft, Meta Loom; 7 Early Movers": -0.2,
  "Early Alzheimer's Patients Continue to Benefit from Four Years of LEQEMBI® (lecanemab-irmb) Therapy New Clinical Data Presented at AAIC": 0.5,
  "Kraft Heinz (KHC) Q2 Earnings and Revenues Surpass Estimates": 0.8,
  "Old Dominion Freight Line (ODFL) Q2 Earnings and Revenues Lag Estimates": -0.5,
  "1 Incredible Reason to Buy AppLovin Before Aug. 6": 0.8,
  "ADP National Employment Report: Private Sector Employment Increased by 104,000 Jobs in July; Annual Pay was Up 4.4%": 0.6,
  "Legion Emerges From Stealth With $38M to Redefine AI-Driven Security Operations": 0.8,
  "Anika Therapeutics (ANIK) Reports Q2 Loss, Tops Revenue Estimates": 0.5,
  "Verisk’s (NASDAQ:VRSK) Q2 Earnings Results: Revenue In Line With Expectations, Full-Year Outlook Slightly Exceeds Expectations": 0.5,
  "US private employers add 104,000 jobs in big July rebound": 0.8,
  "Loacker Debuts Costco-Exclusive Minis Mix with New Dark Chocolate Flavor": 0.6,
  "US private payrolls increase in July": 0.5,
  "Verisk Analytics (VRSK) Q2 Earnings and Revenues Beat Estimates": 0.8,
  "Marvell Technology stock soars 10% on Microsoft AI chip prospects": 0.8,
  "Palo Alto Plans CyberArk Buyout: Can This Boost PANW's Identity Edge?": 0.5,
  "Accountants Embrace AI and Strategic Advisory Services to Fuel Growth, Yet Continue to Face Tech and Talent Barriers, According to 2025 Intuit QuickBooks Survey": 0.5,
  "This Under-the-Radar Gaming Stock Just Bought $259M Worth of Ethereum in One Week—Here's Why Wall Street Should Pay Attention": 0.5,
  "Calls and Puts... wtf? - Newbie here. I've been investing for the past six months and have gotten comfortable with things while even making a small bit of change. While I'm mostly in it for the long run, I'd like to play around a little and make (or lose) some fast cash with \"calls and puts.\" But what exactly are they, and how do you make money from them? From what I've learned, a call": 0.2,
  "FTSE 100 climbs as earnings cascade brings cheer": 0.6,
  "Exchange-Traded Funds, Equity Futures Higher Pre-Bell Wednesday Ahead of Fed Rate Decision": 0.5,
  "Tesla signs $4.3B battery deal with LG finally moving away from China for LFPs? - Tesla just signed a $4.3B deal with LG Energy Solution for lithium iron phosphate (LFP) batteries not for cars, but for energy storage systems (ESS). What’s interesting is that the batteries will come from LG’s Michigan factory, not China. This looks like a clear move to reduce China dependence, especially after Tesla’s CFO said earlier this year that tariffs on": 0.6,
  "Stocks Hold Steady. GDP Was Better Than Expected.": 0.5,
  "Chip stocks targets raised at Morgan Stanley on ’exceptional’ AI strength": 0.8,
  "GE HealthCare Tops Estimates, Lifts Profit Outlook on Smaller Tariff Impact": 0.8,
  "Amgen Gears Up to Report Q2 Earnings: Will the Beat Streak Continue?": 0.5,
  "Trump says US to impose 25% tariff on India from Aug 1 - [https://www.reuters.com/world/india/trump-says-us-impose-25-tariff-india-aug-1-2025-07-30/](https://www.reuters.com/world/india/trump-says-us-impose-25-tariff-india-aug-1-2025-07-30/) WASHINGTON, July 30 (Reuters) - U.S. President Donald Trump said on Wednesday that United States will impose a 25% tariff on goods imported from India starting on Aug. 1.Trump said India will also face an unspecified penalty on Aug. 1, but he did elaborate on the amount or what it was for.": -0.6,
  "First look: Old Dominion Q2 earnings": 0.2,
  "Fortinet Fabric-Ready Technology Alliance Partner Program Surpasses 3,000 Integrations Across More Than 400 Partners": 0.8,
  "CALICHE DEVELOPMENT PARTNERS PUTS WORLD'S LARGEST HELIUM SALT CAVERN IN SERVICE WITH LONG-TERM LINDE CONTRACT": 0.8,
  "Sustainability Roundtable, Inc. and Aquila Clean Energy Announce the Purchase of 30 MW of Purchaser-Caused Solar Energy through SR Inc’s Net Zero Consortium for Buyers (NZCB)": 0.5,
  "The AREA Welcomes ShapesXR as a Member": 0.5,
  "SiMa.ai Expands Strategic Collaboration with Synopsys to Accelerate Automotive AI Innovation": 0.6,
  "New Data Presented at AAIC Demonstrates Investigational LEQEMBI® (lecanemab-irmb) 360 mg Subcutaneous Maintenance Dosing Could Offer a New Option for Ongoing Treatment of Early Alzheimer's Disease": 0.6,
  "Scoop Up These 4 Top-Ranked Liquid Stocks to Augment Portfolio Returns": 0.6,
  "Dear MicroStrategy Stock Fans, Mark Your Calendars for July 31": 0.5,
  "Can Palantir Stock Hit $170 in 2025?": 0.5,
  "Is Trending Stock The Trade Desk (TTD) a Buy Now?": 0.2,
  "Is Trending Stock Texas Instruments Incorporated (TXN) a Buy Now?": 0.2,
  "Is Most-Watched Stock Gilead Sciences, Inc. (GILD) Worth Betting on Now?": 0.2,
  "PDD Holdings Inc. Sponsored ADR (PDD) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Shareholders Are Optimistic That Fastenal (NASDAQ:FAST) Will Multiply In Value": 0.8,
  "Zillow sued by Homes.com owner CoStar for 'massive' copyright violations": -0.8,
  "American Companies Prove Robust, Adding More Than 100,000 New Jobs, ADP Report Shows": 0.8,
  "Fed decision, GDP & ADP, Microsoft & Meta earnings: 3 things": 0.1,
  "Palo Alto Networks to acquire CyberArk in $25 billion deal - [https://www.cnbc.com/2025/07/30/palo-alto-networks-cyberark-deal.html](https://www.cnbc.com/2025/07/30/palo-alto-networks-cyberark-deal.html) >[Palo Alto Networks](https://www.cnbc.com/quotes/PANW/) will [take over](https://investors.paloaltonetworks.com/news-releases/news-release-details/palo-alto-networks-announces-agreement-acquire-cyberark-identity) Israeli identity security provider [CyberArk](https://www.cnbc.com/quotes/CYBR/) in a deal valued at roughly $25 billion. >The California-based cybersecurity company will pay shareholders $45 apiece for 2.2005 shares of CyberArk, representing a 26% premium to its share price Friday. The deal is expected to close during Palo Alto Networks’ fiscal year 2026. >Shares of Palo Alto fell more than 7%": 0.2,
  "Mizuho Lifts Broadcom (AVGO) PT, Keeps Outperform Rating": 0.6,
  "Jefferies Raises Netflix (NFLX) PT, Maintains Buy Rating": 0.6,
  "Stocks Are Way Too Expensive. Why You Should Buy Them Anyway.": -0.5,
  "Texas Instruments (TXN) International Revenue Performance Explored": 0.0,
  "The REESE'S and OREO® Brands Announce Iconic Collaboration, Finally Giving Fans What They Have Been Asking For": 0.8,
  "Wall Street's Insights Into Key Metrics Ahead of ON Semiconductor Corp. (ON) Q2 Earnings": 0.5,
  "Biogen (BIIB) Q2 Earnings on the Horizon: Analysts' Insights on Key Performance Measures": 0.5,
  "Wall Street's Insights Into Key Metrics Ahead of MercadoLibre (MELI) Q2 Earnings": 0.5,
  "Idexx (IDXX) Q2 Earnings Preview: What You Should Know Beyond the Headline Estimates": 0.5,
  "Axon (AXON) Q2 Earnings Preview: What You Should Know Beyond the Headline Estimates": 0.2,
  "Stay Ahead of the Game With Vertex (VRTX) Q2 Earnings: Wall Street's Insights on Key Metrics": 0.5,
  "Treasury Yields Rise on Stronger-Than-Expected Indicators": 0.5,
  "Software startup Observe raises $156 million in Sutter Hill-led fundraise": 0.8,
  "EURUSD falls to lowest since early July What does this mean for equities and macro? - With the recent macro situation, this could have a knock-on effect on equities and risk assets: This morning, the EURUSD fell to its lowest since early July and is currently hovering around 1.0800. That's not a small drop, and a few days ago we were near the top of 1.09. There are probably a few reasons at the heart": -0.6,
  "Did anyone here trade stocks in the days before the internet? How was that? - Did you rely entirely on an agent to make all decisions? Or did things move much slower then, and you could get a daily or weekly Finance magazine with stock news and you'd try to predict things from there? Were there much less companies available to buy than there is today? Was it possible to invest in international markets?": 0.2,
  "'Turkey's Uber' Joins Strategy, Tesla As Bitcoin Treasury Company": 0.5,
  "Kraft Heinz (KHC) Traded Down Due to Mixed Earnings Results": -0.5,
  "Comcast Stock Outlook: Is Wall Street Bullish or Bearish?": 0.2,
  "Compared to Estimates, Old Dominion (ODFL) Q2 Earnings: A Look at Key Metrics": 0.2,
  "ADP (ADP) Reports Q4 Earnings: What Key Metrics Have to Say": 0.1,
  "Kraft Heinz (KHC) Q2 Earnings: How Key Metrics Compare to Wall Street Estimates": 0.5,
  "Compared to Estimates, AEP (AEP) Q2 Earnings: A Look at Key Metrics": 0.0,
  "Compared to Estimates, GE HealthCare (GEHC) Q2 Earnings: A Look at Key Metrics": 0.2,
  "Humana, Seagate, Palo Alto: Trending Tickers": 0.0,
  "Meta and Microsoft earnings: What to watch for": 0.0,
  "Are Computer and Technology Stocks Lagging  Couchbase (BASE) This Year?": 0.1,
  "Why This 1 Value Stock Could Be a Great Addition to Your Portfolio": 0.8,
  "Peloton upgraded, Booking downgraded: Wall Street's top analyst calls": 0.2,
  "SoFi Stock Is Falling. Potential Dilution Could Be to Blame.": -0.6,
  "Do Options Traders Know Something About PACCAR Stock We Don't?": 0.2,
  "The One Tech Company Selling Picks and Shovels to the AI Gold Rush": 0.2,
  "Brown and Brown (BRO) thoughts? - BRO seems like a good company with solid fundamentals. I have looked into the financials and the most recent reports. Everything looks great, consistent company with good cash flow and growing. Boring insurance industry business with good growth. Considering going big into the stock market after the recent pullback. BUT, I can’t figure out why the stock is falling after the recent earnings. I have a rough idea in": 0.6,
  "Why Qualcomm (QCOM) is a Top Momentum Stock for the Long-Term": 0.6,
  "Add These 4 GARP Stocks to Your Portfolio to Receive Handsome Returns": 0.8,
  "$25 billion CyberArk deal seen as ’a home run’ for Palo Alto": 0.8,
  "Should You Forget Intel and Buy These 2 Tech Stocks Instead?": 0.2,
  "Comcast Connects More Than 1,200 Homes and Businesses in Montgomery County to Reliable, High-Speed Internet": 0.8,
  "WLAN Pi Go brings Wi-Fi 7 Analysis to Mobile - By Wi-Fi Professionals, for Wi-Fi Professionals": 0.5,
  "AppLovin (APP) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "GE HealthCare Technologies Insiders Sold US$2.1m Of Shares Suggesting Hesitancy": -0.5,
  "Airbnb, Inc. (ABNB) Reports Next Week: Wall Street Expects Earnings Growth": 0.5,
  "DoorDash, Inc. (DASH) Reports Next Week: Wall Street Expects Earnings Growth": 0.5,
  "Analysts Estimate MannKind (MNKD) to Report a Decline in Earnings: What to Look Out for": -0.5,
  "Monster Beverage (MNST) Earnings Expected to Grow: Should You Buy?": 0.6,
  "Booking Holdings Q2 Earnings Beat Estimates, Revenues Grow Y/Y": 0.8,
  "Most firms still grappling with accounting talent crunch": -0.5,
  "Deepfake AI Market worth $7,272.8 million by 2031 | MarketsandMarkets™": 0.5,
  "American Electric's Q2 Earnings Beat Estimates, Revenues Increase Y/Y": 0.8,
  "Palo Alto Networks to Enter Identity Security Space With $25 Billion CyberArk Acquisition": 0.5,
  "Palo Alto Networks buying CyberArk in cash-and-stock deal valued at about $25 billion": 0.5,
  "Strategy (MSTR) Q2 Earnings Preview: What to Expect From Upcoming Report": 0.5,
  "ADP, GDP & FOMC: Alphabet Soup of Market Data": 0.1,
  "Form 8.3 - Qualcomm Incorporated": 0.0,
  "Indian Stock Market Eyes Gap-Down Opening After Donald Trump Imposes 25% Tariff On India - The Indian stock market awaits a gap-down opening on Thursday, July 30, after US President Donald Trump announced a supersized 25% tariff rate on India for trade. Gift Nifty was trading around 24,712 level, down nearly 150 points, a discount of nearly 140 points from the Nifty futures’ previous close, indicating a muted start for the Indian stock market indices.": -0.8,
  "July Private Sector Hiring Rises More Than Expected, ADP Data Show": 0.5,
  "Palo Alto Networks to Buy CyberArk in $25 Billion Deal": 0.5,
  "Nvidia Stock Rises. Morgan Stanley Makes the Case for $200.": 0.8,
  "QualiZeal Welcomes Healthcare Industry Visionary Dr. Aiman Abdel-Malek to Business Advisory Board": 0.8,
  "BC-Most Active Stocks": 0.0,
  "Starbucks CEO Brian Niccol promises a return to glory days: Opening Bid top takeaway": 0.5,
  "Do Wall Street Analysts Like Starbucks Stock?": 0.2,
  "Automatic Data Processing Q4 Earnings & Revenues Beat Estimates": 0.8,
  "AMD stock's recent breakout suggests it is gaining upward momentum but it remains fundamentally undervalued - The recent breakout in AMD's stock price indicates that it is gaining momentum, but remains fundamentally undervalued. The market is beginning to recognize AMD's positive developments, such as products like the MI300 and MI325X, which are maintaining steady growth in the GPU space, even in the face of geopolitical headwinds. Technical signals, such as the MACD crossover and RSI": 0.6,
  "Verisk Earnings & Revenues Surpass Estimates in Q2, Increase Y/Y": 0.8,
  "Paramount: To take $15 or new shares? - Hi all. Simple question (I hope). I’ve got a bunch of PARA shares with a basis around $33/share. It seems like I’m going to have the option of getting $15/share for them (although it seems like maybe less depending on how many other people take that offer) or exchanging for shares in the new company. What would you do?": 0.2,
  "Starbucks Q3 Earnings Miss Estimates, Revenues Rise Y/Y, Stock Up": 0.5,
  "Must-Watch Streaming Stocks Powering Digital Content Wave": 0.5,
  "Bernstein: World needs a TSMC alternative—and this name is best positioned": 0.5,
  "Altria, Marvell, Vertiv: Trending Tickers": 0.0,
  "Kraft Heinz Q2 Earnings Beat Estimates, Organic Sales Down 2% Y/Y": 0.2,
  "The Palo Alto-CyberArk Deal Is On. Here's Why CyberArk Shares Are Slipping.": -0.5,
  "SPECTRUM'S SEAMLESS ENTERTAINMENT NOW EVEN EASIER WITH ENHANCED DIGITAL SELF-SERVICE FEATURES": 0.6,
  "Two-Year Real-World Study of LEQEMBI® in the United States Presented at Alzheimer's Association International Conference (AAIC) 2025": 0.5,
  "AAPL Stock Q3 Forecast: 4 Things to Watch When Apple Reports Earnings on July 31": 0.5,
  "Q2 Advance GDP Ticks in Unexpectedly High": 0.5,
  "Norfolk Stock Drops on Union Pacific Merger. That Isn’t Supposed to Happen.": -0.6,
  "Starbucks' Business Improvement, Narrative Driving the Stock, Morgan Stanley Says": 0.6,
  "Consumers are focused on value right now: What earnings tell us": 0.5,
  "Roku's second quarter earnings outlook: Wall Street is optimistic about its partnership with Amazon and the growth potential of its advertis - Consumer electronics company Roku (Nasdaq: ROKU) will report its second-quarter results after the market closes on Thursday, July 31. Investors will closely monitor signs of growth in ad inventory, potential growth from its partnership with Amazon, and subscription growth. Analysts expect Roku to report a loss of $0.16 per share and revenue of": 0.8,
  "Zillow is the target of a massive infringement lawsuit that could force it to pay north of $1 billion in damages": -0.7,
  "4 takeaways from Starbucks’ customer experience plans": 0.5,
  "Starbucks is shutting down an entire line of cafes": -0.7,
  "Young, Certified, and Winners: Pearson's Certiport Announces 2025 Adobe Certified Professional World Champions": 1.0,
  "Old Dominion Freight Line CEO Remains Confident In Long-Term Growth Despite Downturn": 0.8,
  "Electronic Arts Q1 Earnings Decline Year Over Year, Revenues Increase": 0.2,
  "ASHTY vs. FAST: Which Stock Is the Better Value Option?": 0.2,
  "Top Midday Stories: US GDP, Private Payrolls Rise More Than Expected; Visa Posts Higher Non-GAAP Earnings, Revenue": 0.5,
  "Electronic Arts Poised to Outpace Market Growth Through 2027, Wedbush Says": 0.8,
  "‘Tesla Takedown’ protesters have a new target: Elon Musk’s Tesla Diner - For months, protesters have gathered outside Tesla showrooms in response to Elon Musk’s role in reducing US government spending as part of the Department of Government Efficiency. This weekend, protesters in Los Angeles found a new destination: Musk’s new 24-hour Tesla Diner in the Hollywood area. Joel Lava, who has helped organize “Tesla Takedown” demonstrations and has spearheaded protests at the diner, believes": -0.7,
  "Nvidia (NVDA) Ignites Rally Ahead of Microsoft and Meta Earnings": 0.6,
  "Top Stock Movers Now: Humana, Hershey, VF Corp., and More": 0.5,
  "Booking's Alternative Accommodation Business Continued to Perform in Q2, Morgan Stanley Says": 0.5,
  "Starbucks Wants to Tap The Protein Trend. Here's How": 0.5,
  "Palantir Technologies Stock: Analyst Estimates & Ratings": 0.0,
  "Abby Joseph Cohen on Fed Rates, Tariff Concerns and M&A": 0.2,
  "Should Palantir Stock Be in Your Portfolio Before Q2 Earnings?": 0.2,
  "Teradyne Stock Is the Top Performer in the S&P 500. Here’s Why.": 0.8,
  "Ad Fatigue Hits Hard in Southeast Asia: 2 in 3 Consumers Tune Out Repetitive Ads": -0.8,
  "Palo Alto Stock Falls As Wall Street Ponders $25 Billion CyberArk Acquisition": -0.5,
  "Is Intel Stock a Hidden AI Winner?": 0.5,
  "AMD Could Add Billions in AI Revenue -- BofA Just Raised the Target": 0.8,
  "Tesla Battery Pivot Sparks ETF Rotation: America In, China Out?": 0.2,
  "SK Group Just Dropped a $5.8 Billion Bombshell--Here's Why It Could Reshape the EV Race": 0.8,
  "Why Mondelez (MDLZ) Shares Are Plunging Today": -0.8,
  "Why Verisk (VRSK) Stock Is Trading Lower Today": -0.5,
  "Why Is Electronic Arts (EA) Stock Rocketing Higher Today": 0.8,
  "Why Saia (SAIA) Stock Is Down Today": -0.5,
  "Why GE HealthCare (GEHC) Shares Are Getting Obliterated Today": -0.8,
  "Why Palo Alto Networks (PANW) Stock Is Nosediving": -0.8,
  "Why Are Resideo (REZI) Shares Soaring Today": 0.5,
  "Twenty One Boosting Bitcoin Holdings; CEO Jack Mallers Sees $150K BTC Incoming": 0.5,
  "Circle Internet Drops 6% in a Month: Buy, Sell or Hold the Stock?": -0.5,
  "LG & Tesla, Hershey trims outlook, Peloton upgraded": 0.2,
  "A Twitchy Market Is Punishing Stocks for the Slightest Earnings Dings": -0.7,
  "Figma's Billion-Dollar Payday: Dylan Field's Elon-Style Deal Could Mint Tech's Next Mega Fortune": 0.8,
  "Why Costco (COST) is a Top Dividend Stock to Buy in August": 0.6,
  "Prologis to Develop Largest Rooftop Community Solar Portfolio in Northern Illinois": 0.8,
  "US travel demand lags behind Europe & Asia, Booking CFO says": -0.5,
  "Biotech Has Been Stalling. 3 Stocks That Could See Healthy Gains.": 0.5,
  "Dexcom CEO Kevin Sayer to step down": -0.5,
  "Can Taboola's Realize Platform Drive Scalable, AI-Powered Ad Growth?": 0.5,
  "ADP reported US added 104k jobs in July. Does this align with reality? - Today's ADP jobs report indicating +104k jobs, but I'm having a hard time reconciling this with reality. I'm hearing/reading about layoffs and anecdotal hiring freezes. But we went from -23k jobs in June to +104k in July? How does +46k in hospitality make sense when all reports point to steep decline in travel TO and WITHIN the US? Are these artificially": -0.6,
  "Tesla's $4.3B Battery Pivot Just Shook the Supply Chain--But Investors Didn't Cheer": -0.5,
  "Thoughts on Samsung SDI ? - Earlier this week hit an all time low 25€ while having an all time high of 149€, tomorrow there is an earning call and the stock just started surging. I can see a comeback of Samsung batteries especially now that a trade deal has been agreed between the EU and the US. Also, they have a 3% dividend payout which is frozen until 2028, but sounds sweet. Thinking about": 0.6,
  "Old Dominion not changing course as downturn lingers": 0.1,
  "Wingstop Flies After Strong Earnings, But Starbucks Cedes Gains": 0.2,
  "Old Dominion Stock Dips After Q2 Earnings & Revenues Miss Estimates": -0.7,
  "Old Dominion falls, Teradyne soars, Palo Alto Networks & CyberArk": 0.2,
  "Yahoo Finance 35 Charts - I found these charts and the article to give me some confidence that perhaps we aren't in a bubble. I haven't found anyone commenting on it, however, so thought I would ask. Do any of you have any observations on the article's take on our economy rights now? [https://finance.yahoo.com/news/yahoo-finance-chartbook-35-charts-tell-the-story-of-markets-and-the-economy-midway-through-2025-080012747.html](https://finance.yahoo.com/news/yahoo-finance-chartbook-35-charts-tell-the-story-of-markets-and-the-economy-midway-through-2025-080012747.html)": 0.5,
  "Palo Alto Networks to buy CyberArk for $25 billion": 0.5,
  "NVIDIA (NVDA) Enhances Video Intelligence And CAD Systems For AI-Driven Innovation": 0.8,
  "Booking Holdings (BKNG) Q2 Revenue Climbs to US$6,798 Million Amidst Lower Earnings": -0.5,
  "American Electric Power Lifts Annual GAAP Outlook, To Announce $70 Billion Capital Plan": 0.5,
  "Markets want rate cut, but Fed faces tough choice, chief investment officer says": 0.1,
  "Starbucks (SBUX) Reports Q3 Revenue Growth But Net Income Falls YoY": -0.5,
  "Accelerating Impact: AstraZeneca and Revna Biosciences Expand Access to Lung Cancer Treatment in Ghana": 0.8,
  "Buy Texas Instruments (TXN) for its Innovation and Steady Dividend Income": 0.6,
  "Comcast (CMCSA) Invests Nearly US$600 Million Expanding Fiber Network In Indiana": 0.8,
  "Are Starbucks CEO Niccol's Moves the 'Shot of Energy' the Coffee Chain Needs?": 0.6,
  "Cintas (CTAS) Announces 15% Dividend Increase Continuing 42-Year Growth Streak": 0.8,
  "Buy Honeywell (HON) for its Innovation-Led Dividend Performance": 0.6,
  "Daily Roundup of Key US Economic Data for July 30": 0.0,
  "Sector Update: Consumer Stocks Decline in Afternoon Trading": -0.5,
  "Exploring US High Growth Tech Stocks For Potential Portfolio Expansion": 0.5,
  "US Equity Indexes Mixed as Strong Economic Data Help Push Yields Higher Ahead of Fed Decision": 0.5,
  "Exelon (EXC) Declares US$0.40 Dividend for September 2025 Payout": 0.2,
  "Why Old Dominion Freight Line (ODFL) Stock Is Falling Today": -0.5,
  "Sector Update: Financial Stocks Mixed Wednesday Afternoon": 0.0,
  "Sector Update: Energy Stocks Retreat Wednesday Afternoon": -0.5,
  "Flight to Safety? Maybe Take a Stroll to Staples Stocks.": 0.2,
  "Mondelez International (MDLZ) Announces REESE'S OREO Collaboration And 6% Dividend Increase": 0.8,
  "Broadcom Isn’t In the Mag 7. But It’s Hotter Than Most Other Big Tech Stocks.": 0.6,
  "Palo Alto Networks (PANW) Announces US$20 Billion Acquisition Of CyberArk": 0.5,
  "Why Palo Alto Networks Is Buying CyberArk for $25B": 0.2,
  "Starbucks ends 6-year Gen Z experiment after finding proof that human connection is better": 0.8,
  "Xcel Energy Inc. Board Declares Dividend on Common Stock": 0.5,
  "Tesla (TSLA) Gets Analyst Support as Robotaxi Vision Moves Toward Bay Area Launch": 0.6,
  "Update: FCC Probes Comcast's Relationships With Local TV Affiliates": -0.5,
  "Tesla Worth $30 Trillion? Elon Musk Says Yes But Investors Say No": -0.5,
  "Wall Street Sticks With Apple (AAPL) as Earnings and AI Questions Loom": 0.2,
  "Palo Alto Networks agrees to buy CyberArk for $25 billion": 0.5,
  "Starbucks is discontinuing mobile order and pickup-only stores": -0.7,
  "What's Fueling PayPal's Post-Earnings Skepticism?": -0.5,
  "Is AI causing tech worker layoffs? That's what CEOs suggest, but the reality is complicated": 0.2,
  "Companies are rushing to add crypto to their balance sheet—but experts warn it’s a fad": -0.5,
  "Charter Communications, Inc. (CHTR)’s Management Is “Dreaming,” Says Jim Cramer": -0.6,
  "Amazon.com, Inc. (AMZN) Has To Raise CapEx, Says Jim Cramer": 0.2,
  "Baker Hughes Company (BKR)’s Had A Good Quarter, Says Jim Cramer": 0.6,
  "Big Beautiful Bill Fuels Amazon’s (AMZN) GenAI Strategy — Here’s What Analysts Expect": 0.5,
  "Apple Inc. (AAPL): Investor AI Worries Still Haven’t Pushed Stock To $190, Says Jim Cramer": 0.2,
  "Intel Corporation (INTC): New CEO’s “Terrific,” Says Jim Cramer": 0.8,
  "GE HealthCare Core Operating Margin Faces Tariffs Heat, Raises Annual Outlook": 0.5,
  "Best Source for Forward Trading Multiples Time Series Data (Forward PE, EV / EBITDA, EV / Revenue) - Does anyone know of any data source for forward trading multiples for companies (forward PE ration, forward EV / EBITDA, forward EV / revenue)? Specifically I am trying to build a chart of closing forward valuation multiples on a daily basis over a decade or two, with the idea of seeing how forward valuation multiples fluctuate over": 0.2,
  "Sector Update: Financial": 0.0,
  "Steady ship: A guide to navigating market volatility": 0.5,
  "As Palo Alto Networks Announces Deal to Buy CyberArk, How Should You Play PANW Stock?": 0.2,
  "ECB Says U.S.-Backed Stablecoin Use in EU Could Weaken Its Monetary Autonomy - Widespread use of U.S. dollar-denominated stablecoins in the European Union (EU) for payments or settlement could damage the European Central Bank's control over monetary conditions, an ECB adviser said. If U.S.-backed stablecoins, digital assets that are backed by the dollar, gain traction for use in the EU, the effect could be similar to the impact of the U.S. dollar on developing economies,": -0.6,
  "Here's What Traders Expect Amazon Stock To Do After Earnings": 0.2,
  "Sector Update: Energy Stocks Fall Late Afternoon": -0.5,
  "Fed Rate-Cut Odds Slide On Powell Framework; S&P 500 Slips": -0.5,
  "Sector Update: Tech Stocks Softer Late Afternoon": -0.5,
  "Electronic Arts Q1, Steve Madden Q2 miss, Harley-Davidson deal": -0.2,
  "Sector Update: Financial Stocks Retreat Late Afternoon": -0.5,
  "These 3 Hot Stocks Are Building Out Crypto Treasuries. Should You Buy, Sell, or Hold Them Now?": 0.5,
  "Pacific Reach, Dilawri Group team up to buy The Ritz-Carlton Toronto": 0.2,
  "Sector Update: Health Care Stocks Decline in Late Afternoon Trading": -0.6,
  "Cognizant Attempts World's Largest Vibe Coding Event to Accelerate AI Literacy Across Thousands of Employees": 0.6,
  "Qualcomm Earnings Release Available on Company’s Investor Relations Website": 0.0,
  "Cognizant Reports Second Quarter 2025 Results": 0.0,
  "Warner Bros Discovery to lay off 10% of film group, source says": -0.7,
  "Dexcom Reports Second Quarter 2025 Financial Results, Updates Full Year 2025 Guidance and Announces CEO Succession Plan": 0.5,
  "Qualcomm's premium smartphone chip reliance, Apple modem loss overshadow upbeat forecast": -0.5,
  "Arm Holdings plc Reports Results for the First Quarter of the Fiscal Year Ending 2026": 0.0,
  "Sage Therapeutics Announces Second Quarter 2025 Financial Results": 0.0,
  "Synopsys Announces Earnings Release Date for Third Quarter Fiscal Year 2025": 0.0,
  "Lam Research Corporation Reports Financial Results for the Quarter Ended June 29, 2025": 0.0,
  "Tesla Signed A $16 Billion Deal For Samsung AI Chips. It Just Inked Another Deal To Sidestep China.": 0.5,
  "Microsoft posts Q4 beat on top and bottom line on cloud, AI strength": 0.8,
  "Microsoft to spend record $30 billion this quarter as AI investments pay off": 0.8,
  "Arm shares drop as outlook disappoints; company looks to invest to make own chips": -0.6,
  "Qualcomm: Fiscal Q3 Earnings Snapshot": 0.0,
  "Booking Holdings Beats Q2 Expectations With 'Steady' Travel Demand Despite Uncertainty": 0.6,
  "AI Stock With Unique Focus Joins Palantir, Nvidia On 3 Elite Lists": 0.5,
  "Meta shares jump as AI fuels ad sales, outweighing big capital costs": 0.6,
  "DexCom: Q2 Earnings Snapshot": 0.0,
  "Cognizant: Q2 Earnings Snapshot": 0.0,
  "Tesla Stock Fell. What a New Battery Supplier Might Matter for Tariffs.": -0.5,
  "Arm-Backed Ambiq Micro Shares Rise 61% After $96 Million IPO": 0.6,
  "Meta beats Q2 expectations, stock jumps on better than anticipated Q3 outlook - Facebook parent Meta ([META](https://finance.yahoo.com/quote/META/)) reported its second quarter earnings on Wednesday, outperforming expectations and offering a better than expected outlook for Q3. The company says it anticipated between $47.5 billion and $50.5 billion in third quarter revenue, well ahead of the $46.2 billion Wall Street was calling for. Meta stock jumped more than 8% immediately following the announcement. For Q2, Meta saw": 0.8,
  "Stock market today: Dow, S&P 500, Nasdaq mixed as Fed holds rates, Powell says 'no decisions' on September": 0.1,
  "While shippers cite merger concerns, rival railroad looks instead to ‘collaborations’": 0.2,
  "Microsoft posts Q4 beat on top and bottom line on cloud, AI strength - Microsoft ([MSFT](https://finance.yahoo.com/quote/MSFT/)) [reported its fiscal fourth quarter earnings](https://www.microsoft.com/en-us/Investor/earnings/FY-2025-Q4/press-release-webcast) on Wednesday beating analysts' expectations on the top and bottom lines on the strength of its cloud revenue. Microsoft stock climbed more than 6% on the news. \"Cloud and AI is the driving force of business transformation across every industry and sector,\" Microsoft CEO Satya Nadella said in a statement. “We’re innovating across": 0.8,
  "Wingstop’s smart kitchen improves speed and sales, executives say": 0.6,
  "FUBO Undervalued and Ready for a Breakout - Fubo's stock has acted like a company on the brink of collapse, but its fundamentals are actually stabilizing and it looks significantly undervalued compared to competitors like Roku or DIS, especially with macro trends once again favoring the elimination of cable services, and with its Fubo sports betting business model still evolving, they're in a great position to be able to vertically integrate streaming media with their": 0.8,
  "Lam Research: Fiscal Q4 Earnings Snapshot": 0.0,
  "The Resilience of U.S. Equities: How Record ETF Flows Signal Unwavering Investor Confidence Amid Turbulence - \\- U.S. equity markets in 2025 face macroeconomic risks but see record $500B+ ETF inflows into S&P 500, surpassing 2024's pace. \\- Retail investors drive $33B+ into low-cost S&P 500 ETFs like VOO/SPLG, defying market declines and showing \"buy-the-dip\" resilience. \\- Institutional flows remain cautious, with SPY/IVV seeing outflows amid fears of 2026 recession and sector rotation toward energy/defensive": 0.6,
  "Big Tech to work with Trump administration to build digital health ecosystem": 0.5,
  "Calpine and CyrusOne Announce Thad Hill Energy Center Powered Land to Support Hyperscale Data Center Development in Texas": 0.5,
  "Comcast Earnings Are Nearly Here. This Number Is Key.": 0.2,
  "Stock Market Today: Dow Drops After Fed Powell Comments; Meta, Microsoft Soar On Earnings (Live Coverage)": 0.5,
  "diversification in the beginning of the ai revolution is a mistake - After meta and msft earnings, it basically confirms it. If you invest in anything else at this time, you're losing opportunity. Trying to find a loser that'll bounce back like unh and nvo is gonna kill you. I made that mistake for years and i regret it so bad. I literally could retire right now if 10 years ago I put everything into": -0.8,
  "Meta stock jumps on Q2 earnings beat, upbeat Q3 revenue guide": 0.8,
  "As Trump Says He Wants Tesla to ‘THRIVE,’ How Should You Play TSLA Stock?": 0.5,
  "GE HealthCare Stock Falls Despite Earnings Beat. Tariffs Are Creating Confusion.": -0.5,
  "Arm-Backed Chipmaker Ambiq Micro Nearly Doubles in First Day of Trading": 0.6,
  "These Stocks Moved the Most Today: Humana, SoFi, LendingClub, Generac, Palo Alto, Teradyne, Harley-Davidson, Peloton, and More": 0.2,
  "Top Research Reports for Apple, Meta Platforms & ServiceNow": 0.5,
  "Earnings live: Microsoft, Meta stocks surge; Robinhood beats; Ford warns on tariff exposure": 0.5,
  "Qualcomm shares dip as guidance disappoints investors": -0.6,
  "Cognizant sees quarterly revenue above estimates on strong enterprise demand": 0.8,
  "Lam Research forecasts upbeat quarterly revenue on strong chip equipment demand": 0.8,
  "Quick QQQ options question - Hi all, Do 0DTE QQQ contracts officially expire at 4:00 PM or 4:15 PM? I saw volume and pricing after 4 today, and I am aware you can trade them till 4:15. For example: for a covered call, does the underlying need to be below the strike at 4:00 close, or is it judged based on the 4:15 after hours time?": 0.0,
  "Qualcomm Earnings Beat Forecasts. Why the Stock Is Falling.": -0.5,
  "Not Interested in Apple or Amazon: I/O Fund's Kindig": -0.5,
  "Cato Networks' CEO Feels 'Zero Pressure' From Hyperscalers": 0.5,
  "Should You Buy the Post-Earnings Dip in Starbucks Stock?": 0.2,
  "Arm’s Earnings Meet Expectations. Why the Stock Is Falling.": -0.5,
  "Google proposes to open Play Store to more real-money games in India": 0.5,
  "Stocks to Watch Recap: Freeport-McMoran, Hershey, Palo Alto, Starbucks": 0.0,
  "Align Technology (NASDAQ:ALGN) Misses Q2 Sales Targets, Stock Drops 33.4%": -0.8,
  "NVIDIA Sets Conference Call for Second-Quarter Financial Results": 0.0,
  "Qualcomm (QCOM) Q3 Earnings Surpass Estimates": 0.8,
  "Bitcoin, Ethereum, XRP dip as Fed keeps interest rate unchanged": -0.5,
  "Starbucks reports sixth straight quarter of declining same-store sales": -0.8,
  "Qualcomm Logs Higher Profit as Chip Sales Rise": 0.6,
  "Qualcomm (NASDAQ:QCOM) Reports Q2 In Line With Expectations But Stock Drops": -0.5,
  "DexCom (DXCM) Q2 Earnings and Revenues Top Estimates": 0.8,
  "Cognizant (CTSH) Q2 Earnings and Revenues Surpass Estimates": 0.8,
  "Microsoft, Meta, Ford, Robinhood: Stocks to Watch Afterhours": 0.5,
  "Lam Research (LRCX) Q4 Earnings and Revenues Top Estimates": 0.8,
  "DexCom’s (NASDAQ:DXCM) Q2 Sales Beat Estimates": 0.8,
  "Dexcom Earnings Beat. Diabetes Device Maker Names New CEO.": 0.5,
  "Arm Matches June-Quarter Estimates. Stock Falls On Earnings Outlook.": -0.5,
  "Arm Holdings Posts Lower First-Quarter Profit On Increase in Engineering Spending": -0.5,
  "Equinix raises annual results forecast on steady data center demand": 0.6,
  "Cactus Announces Second Quarter 2025 Results": 0.0,
  "Arm-backed Ambiq debuts on NYSE: CEO talks IPO, AI demand": 0.5,
  "Cognizant (CTSH) Q2 Earnings: Taking a Look at Key Metrics Versus Estimates": 0.5,
  "Qualcomm (QCOM) Q3 Earnings: Taking a Look at Key Metrics Versus Estimates": 0.2,
  "Lam Research (NASDAQ:LRCX) Reports Upbeat Q2, Provides Optimistic Revenue Guidance for Next Quarter": 0.8,
  "Arm reports in-line Q1: Strategist discusses Arm's biggest risk": 0.1,
  "Qualcomm beats Q3 estimates, saw some 'real progress'": 0.6,
  "ARM Holdings reports soft guidance after mixed fiscal Q1 results; shares slump": -0.6,
  "Microsoft and Meta fuel $500-billion gain in AI stocks": 0.8,
  "Podcast: Federal Reserve Holds the Line on Rates": 0.5,
  "Fortinet (FTNT) Declines More Than Market: Some Information for Investors": -0.5,
  "Here's Why Lululemon (LULU) Fell More Than Broader Market": -0.5,
  "August 1st Tariffs - So I’m confused are the August 1st tariffs happening or not? And if they are is it safe to expect a large dip for a few days and weeks like in April. After the U.S. China talks they haven’t come out saying that they’re paused. And the tariffs were just imposed on India. For all we know it could be chaos on Friday and Trump reverses over the weekend.": -0.5,
  "Compared to Estimates, DexCom (DXCM) Q2 Earnings: A Look at Key Metrics": 0.2,
  "Qualcomm Earnings: Non-Smartphone Growth": 0.5,
  "5 Reasons Nvidia Stock Is Still a Genius Buy Right Now": 0.8,
  "Trump Ends the ‘De Minimis’ Tax Exemption Globally. What It Means for Retail Stocks.": 0.2,
  "Harley Davidson's Financing Arm Partnership (FAP) template boosts stock value - https://www.investopedia.com/harley-davidson-stock-jumps-as-partners-buy-stakes-in-financing-arm-11781907 Harley Davidson (HOG) starting the next trend with Financing Arm Partnerships (FAP) in order to unlock value and boost company. They may have just provided a template for companies with financing divisions to create value and get cash rich. Might become the next trend now hst Bitcoin Treasury plays have fizzled out": 0.8,
  "Robinhood or AppLovin Could Join S&P 500 if Paramount Is Dumped": 0.2,
  "Qualcomm Slides After Posting Lackluster Phone Chip Sales": -0.6,
  "Wedbush Sticks with AAPL $270 Call on China Rebound": 0.5,
  "Prediction: This Artificial Intelligence (AI) Stock Will Outperform Nvidia by 2030": 0.8,
  "Figma Prices IPO at $33 a Share, Valuing It at $19.3 Billion. The Stock Starts Trading Tomorrow.": 0.5,
  "Zuckerberg claims ‘superintelligence is now in sight’ as Meta lavishes billions on AI": 0.6,
  "Figma raises $1.2 billion in US IPO, signaling thaw in tech listings": 0.6,
  "Meta’s ‘superintelligence’ isn’t here yet. But its AI bets are already paying off": 0.5,
  "Microsoft Stock Surges 7% After Earnings. Here Are the Numbers That Blew Investors Away.": 0.8,
  "NVDA's H20 AI Chips Head Back to China": 0.1,
  "Zuckerberg says people without AI glasses will be at a disadvantage in the future": 0.2,
  "This Company Could Be the Amazon of Artificial Intelligence (AI) Infrastructure": 0.8,
  "Nvidia, AI Chip Stocks Score Price-Target Hikes": 0.5,
  "Meta Shares Soar as Ad Business Continues to Fuel AI Ambitions": 0.8,
  "Why Nvidia Could Be the Biggest Tech Winner of the 'One Big Beautiful Bill'": 0.6,
  "Which one of these would you choose and why? NVO,UNH,PYPL - I'm considering adding one of these stocks to my portfolio. Which one would you choose and why? I understand that the healthcare sector is facing challenges this year, but I believe this will be temporary. Next year could be more promising for healthcare stocks. I've also included PayPal on my list. 1. PayPal 2. UnitedHealth 3. Novo Nordisk Thank you in advance!": 0.5,
  "Catherine Wood's Strategic Moves: Circle Internet Group Inc. Takes Center Stage": 0.5,
  "Google Signs EU AI Code Amid Concerns": 0.1,
  "Meta Faces Italy Probe Over WhatsApp AI": -0.5,
  "Fortinet (FTNT) Gets PT Hike—But Can It Deliver Beyond Q2?": 0.2,
  "“I’ve Already Got CrowdStrike”: Customer Confidence Highlights CRWD’s AI Strength": 0.6,
  "Telnyx expands conversational AI stack with new audio, TTS, and integration capabilities": 0.5,
  "Bernstein Analyst Sees Upside in Beaten-Down Qualcomm (QCOM)": 0.6,
  "Meta’s Mark Zuckerberg laid out his AI vision that outperformed Q2 expectations and sent shares soaring": 0.8,
  "Farxiga and Jardiance pose affordability issues, says Maryland drug board": -0.5,
  "Stock market today: Dow, S&P 500, Nasdaq futures rise as South Korea trade deal, Big Tech earnings boost sentiment": 0.8,
  "Strong earnings from Meta, Microsoft but misses 1 critical metric": 0.2,
  "Datadog’s (DDOG) AI Growth Accelerates, Driven by OpenAI—But for How Long?": 0.1,
  "Tesla (TSLA) Signs $16.5B AI Chip Deal With Samsung—Musk Calls It “Hard to Overstate”": 0.8,
  "Samsung says tariff agreement reduces uncertainty, expects boost from Tesla deal": 0.6,
  "Apple (AAPL) Faces Google Deal Fallout—Should Investors Be Worried?": -0.5,
  "Meta Stock Surges on Blowout Earnings. So Much for High Expectations.": 0.5,
  "Alphabet (GOOGL): Outperform Rating Holds as AI Efforts Gain Traction": 0.8,
  "Microsoft (MSFT) Unveils AI-Powered ‘Copilot Mode’ for Edge Browser": 0.6,
  "Quantum Computing Stocks Rally As Microsoft CEO Hails Tech As 'Next Big Accelerator'": 0.8,
  "Microsoft climbs to $4 trillion in after-hours trading on blowout earnings": 0.8,
  "Wall Street sees Amazon primed to outperform ahead of the tech giant's 2nd quarter results": 0.8,
  "Hedged vs unhedged - I sort of understand the difference between hedged and unhedged stocks. My question is this... would an unhedged stock like META performance the same as a hedged stock like META.TO? If you graphed their performance together would they be parallel? Thanks": 0.2,
  "Samsung Expects Earnings Improvement After Profit Drop": 0.5,
  "Analysts reset AMD stock price target ahead of key earnings": 0.5,
  "GitHub Copilot crosses 20 million all-time users": 0.8,
  "Stocks respond to Fed cut decision, Meta Platforms & Microsoft earnings": 0.5,
  "Trump Organization Sues Amazon, Walmart, eBay Sellers For Marketing 'Inferior Imitations' Of Trump Merch": -0.7,
  "Asia Morning Briefing: MSFT, Meta Soar on Strong AI Earnings, But Crypto AI Tokens Fail to Follow": 0.5,
  "US reach deal with South Korea - WASHINGTON/SEOUL (Reuters) -President Donald Trump said on Wednesday the U.S. will charge a 15% tariff on imports from South Korea as part of a deal that eases, for now, tension with a top-10 trading partner and key Asian ally. The arrangement, announced shortly after Trump met with Korean officials at the White House, came during a blizzard of trade policy announcements ahead of a self-imposed August 1 deadline.": 0.5,
  "Trump slaps universal 50% tariff on copper imports - President Donald Trump on Wednesday signed on order imposing a universal 50% tariff on copper imports, the latest metal he has targeted with a steep import tax. U.S. copper prices plunged as much as 18% in after-hours trading as soon as the White House announced the new tariff rate.": -0.8,
  "OpenAI hits $12 billion in annualized revenue, The Information reports": 0.6,
  "Qualcomm Q3 2025 beats EPS forecast, stock edges up - Qualcomm reported its fiscal third-quarter 2025 earnings, surpassing analyst expectations with an EPS of $2.77 against a forecast of $2.71. The company’s revenue reached $10.37 billion, slightly above the anticipated $10.33 billion. Following the announcement, Qualcomm’s stock exhibited a modest increase of 0.57% in aftermarket trading, bringing the price to $163 per share. According to [InvestingPro](https://ca.investing.com/pro/QCOM) data, the company maintains a strong financial health score": 0.8,
  "Angry Farmers Vow to Fight If Korea Leader Bows to Trump Demands": -0.8,
  "If You Invested $10K In Nvidia Stock 10 Years Ago, How Much Would You Have Now?": 0.0,
  "Microsoft tops $4 trillion in market cap after hours, joining Nvidia in exclusive club - The $4 trillion club has a second member, at least based on after-hours trading. Following a better-than-expected earnings report on Wednesday, Microsoft shares jumped 8%, lifting the software giant’s market cap to about $4.1 trillion. Should the rally stick on Thursday, Microsoft would join chipmaker Nvidia, which hit $4 trillion for the first time earlier this month. Microsoft reported 18%": 0.8,
  "Samsung’s profit more than halves, missing expectations as chip business plunges 94% - Samsung Electronics on Thursday reported a second-quarter operating profit of 4.7 trillion Korean won, missing expectations, weighed by a 93.8% profit slump in its chip business. While Samsung’s second-quarter operating profit beat its own forecast of around 4.6 trillion won, it was a steep drop from the 10.44 trillion won recorded in the same period last year. The South Korean technology giant": -0.8,
  "Euronet Worldwide Reports Second Quarter 2025 Financial Results - Highlighted by 13% Operating Income Growth": 0.6,
  "Dow Jones Futures Rise As Microsoft, Meta Soar On Earnings After Fed's Powell Hits Rate-Cut Hopes": 0.8,
  "$AAPL reports tomorrow $200 or $240, playing straddle! - They are losing market share in China, so my take is $200, but because I am usually wrong on this stock, you are welcome to buy calls and share the profits with me (just kidding). But seriously, WTF - AAPL is so behind in AI, who uses SIRI? Check out GROK, so much better.....Not sure what to do here, but maybe fuc\\* it go ahead and": -0.6,
  "Regeneron (REGN) Q2 Earnings: What To Expect": 0.0,
  "Full port RDDT for earnings? - Tech/AI earnings have been mostly solid across the board this earnings season. META was a good indicator that social advertising should be robust, which is promising for RDDT’s own earnings. I full ported RDDT for last earnings and got burned. But tempted to try again this time. Maybe even RDTL. Thoughts?": 0.5,
  "INNODATA REPORTS EARNINGS TOMORROW - $INOD a data training/labeling company that is sitting around 1.5B market cap, has 0 debt and last quarter printed 100%+YoY revenue growth. They work with majority of Mag 7 stocks on training their Ai. Now check out the technicals on the daily! I’m excited to see their report tomorrow!": 0.8,
  "Warner Bros Discovery to lay off 10% of film group: source": -0.7,
  "Adobe Partners with Premier League to Enhance Fan Engagement with AI, Creativity Tools": 0.6,
  "UBS Raises PT on Amgen Inc. (AMGN) to $326 From $315, Keeps a Neutral Rating": 0.2,
  "BTIG Lifts Datadog (DDOG) PT to $169 on Strong Competitive Gains, New Product Success": 0.8,
  "UBS Lifts PT on QUALCOMM Incorporated (QCOM) to $165 From $145, Keeps a Neutral Rating": 0.5,
  "Jefferies Raises CrowdStrike (CRWD) PT to $530 from $520 Amid Cybersecurity Outlook": 0.5,
  "Ireland awakens to the risk of relying on US investment": 0.1,
  "Ambiq Micro shares close up 60% after IPO as chip designer targets smart glasses": 0.6,
  "American Electric Power (AEP) Board Approves Quarterly Dividend": 0.5,
  "Mondelez International, Inc. (MDLZ) Recalls RITZ Peanut Butter Cracker Sandwich Products": -0.5,
  "Microsoft's Xbox Shoots to PlayStation Top?10": 0.5,
  "Morning bid: Dangers abound ahead of deadline day": -0.6,
  "ExiScale Earns 4.7-Star Trustpilot Rating, Strengthening Its Position as a Reliable Meta Ad Account Provider": 0.8,
  "I want to realize all my individual stocks and then slowly DCA into ETFs. Is this a good strategy? - I currently hold the following and they're all short term capital gains. NVDA: up 55% MSFT: up 33% GOOGL: up 15% AAPL: up 2% AMZN: up 23% In total they're about 60k of gains I am thinking of selling all of them and slowly DCA into ETFs like VOO/VTI. Is this a good strategy?": 0.2,
  "Chips Are Getting Stale. How Walmart, Kroger, and Other Food Titans Are Reinventing Snacks.": 0.2,
  "Agoda launches campaign to drive tourism as Singapore celebrates 60 years of independence": 0.5,
  "Nscale, Aker and OpenAI to establish Stargate Norway: a 100,000 NVIDIA GPU AI Gigafactory powered by renewable energy in Northern Norway": 0.8,
  "Warner Bros. Discovery and 3 Other Hollywood Stocks to Ride the Box-Office Boom": 0.5,
  "Satellite group SES beats forecasts as defence spending rises in Europe": 0.5,
  "China’s Cybersecurity Regulator Summons Nvidia Over Chip Security Issue": -0.5,
  "Samsung’s Chip Profit Tumbles While Investors Seek Bottom": -0.6,
  "Microsoft, Meta surge after blowout results": 0.8,
  "Aker, Nscale, OpenAI plan $1 billion Norway AI facility": 0.5,
  "China summons chip giant Nvidia over alleged security risks": -0.5,
  "Sylva Accelerates Telco Cloud Innovation with Host Based Routing, v1.4 Release and New Industry Backing": 0.6,
  "The Kraft Heinz Co (KHC) Q2 2025 Earnings Call Highlights: Strategic Investments and Emerging ...": 0.5
}