{
  "Zacks.com featured highlights NVIDIA, AppLovin and GE Aerospace": 0.2,
  "2 Stocks to Buy on the Dip and Hold for 10 Years": 0.5,
  "Company News for Jul 22, 2025": 0.0,
  "3 Healthcare Stocks to Buy Before They Announce Game-Changing Clinical Trial Results": 0.5,
  "Is CrowdStrike a Buy a Year After the Big IT Outage?": 0.2,
  "Liberty Group exits hotel business after 45 years": -0.5,
  "Biogen to invest further $2bn in North Carolina’s Research Triangle Park": 0.8,
  "Airbnb ‘take over’ now driving up Atlanta homeowners’ costs — here’s why insurance may be their next headache": -0.6,
  "Market Chatter: Hackers Breach US, European Government Networks Using Microsoft SharePoint Software Flaw": -0.8,
  "Those who invested in Marvell Technology (NASDAQ:MRVL) five years ago are up 110%": 0.8,
  "Here's Why We Think Axon Enterprise (NASDAQ:AXON) Is Well Worth Watching": 0.6,
  "15 names that Morgan Stanley’s analysts expect to move meaningfully on earnings": 0.5,
  "Applied Materials Appoints Jim Anderson to Board of Directors": 0.5,
  "1 Stock-Split Stock to Buy Hand Over Fist in July and 1 to Avoid": 0.5,
  "Here’s Why Copart (CPRT) Lagged the Market": -0.5,
  "Exploring High Growth Tech Stocks In The US Market": 0.5,
  "Vertex Pharmaceuticals' Quarterly Earnings Preview: What You Need to Know": 0.2,
  "SentinelOne (S) Moves 9.8% Higher: Will This Strength Last?": 0.2,
  "PACCAR Achieves Good Quarterly Revenues and Profits": 0.8,
  "45% Of This Constellation Energy Insider's Holdings Were Sold": -0.5,
  "CrowdStrike Named the Frost Radar™ Leader in Managed Detection and Response for Second Consecutive Year": 0.8,
  "Paccar: Q2 Earnings Snapshot": 0.0,
  "PACCAR (NASDAQ:PCAR) Posts Better-Than-Expected Sales In Q2": 0.8,
  "Intuit Launches New Agentic AI Experiences and Financial Management Capabilities for Intuit Enterprise Suite to Drive Mid-Market Business Growth": 0.5,
  "Is the Options Market Predicting a Spike in Analog Devices Stock?": 0.2,
  "PPL vs. Xcel Energy: Which Utility Stock Offers More Upside?": 0.5,
  "Flexential Names 2 VPs to Lead Site Growth and Energy Strategy": 0.5,
  "VAYK Appoints Jason Armstrong as CEO for Organic Growth to $5 Million Revenue": 0.6,
  "Fortinet Advances Quantum-Safe Security to Guard against Emerging Quantum Threats": 0.5,
  "Micron Launches Space-Qualified Portfolio to Power Mission-Critical Data for Aerospace Innovation": 0.6,
  "Why Investors Need to Take Advantage of These 2 Computer and Technology Stocks Now": 0.5,
  "How to Boost Your Portfolio with Top Medical Stocks Set to Beat Earnings": 0.5,
  "Investors Heavily Search Micron Technology, Inc. (MU): Here is What You Need to Know": 0.5,
  "AppLovin Corporation (APP) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Those who invested in Exelon (NASDAQ:EXC) a year ago are up 25%": 0.5,
  "Coca-Cola Europacific Partners to close non-refundable PET line in Germany": -0.5,
  "PACCAR shares up after Q2 profit beat": 0.8,
  "Vuori plots international growth with 15 stores": 0.5,
  "Morning Movers: Cleveland-Cliffs rallies after second quarter earnings release": 0.6,
  "Paccar (PCAR) Beats Q2 Earnings and Revenue Estimates": 0.8,
  "Palo Alto Networks Completes Acquisition of Protect AI": 0.5,
  "Hotel Dining Steps Into The Spotlight: OpenTable and KAYAK Debut The Top 100 Hotel Restaurants in America": 0.5,
  "Brokers Suggest Investing in Zscaler (ZS): Read This Before Placing a Bet": 0.5,
  "Is It Worth Investing in Take-Two (TTWO) Based on Wall Street's Bullish Views?": 0.5,
  "Brokers Suggest Investing in Marvell (MRVL): Read This Before Placing a Bet": 0.5,
  "Paccar (PCAR) Reports Q2 Earnings: What Key Metrics Have to Say": 0.2,
  "Applied Materials (AMAT) Recently Broke Out Above the 20-Day Moving Average": 0.6,
  "Here's Why CDW (CDW) is a Strong Value Stock": 0.6,
  "Netflix downgraded, Intel initiated: Wall Street's top analyst calls": 0.1,
  "Stifel Q2 cybersecurity survey: Macro dynamics weighing on near-term results": -0.5,
  "Over 30 million US homes don’t have a mortgage, report says — why that’s a red flag for the housing market": -0.6,
  "Here's Why Intuit (INTU) is a Strong Growth Stock": 0.6,
  "S&P 500 stocks: List of additions and removals in 2025": 0.0,
  "Hotel Dining Steps Into The Spotlight: OpenTable and KAYAK Debut The Top 50 Hotel Restaurants in Canada": 0.5,
  "Electronic Arts (EA) Expected to Beat Earnings Estimates: What to Know Ahead of Q1 Release": 0.5,
  "Booking Holdings (BKNG) Earnings Expected to Grow: Should You Buy?": 0.5,
  "Earnings Preview: Mondelez (MDLZ) Q2 Earnings Expected to Decline": -0.5,
  "Is Alibaba Cloud's Growing Partner Base a Catalyst for Future Returns?": 0.5,
  "Jefferies Maintains Underperform on Lululemon (LULU), Trims Target to $175": -0.5,
  "NXP Semiconductors Q2 Earnings Beat Estimates, Revenues Fall Y/Y": 0.2,
  "Meet the Newest Growth Stock Joining the S&P 500. It's Up 80% in 3 Months, and It's Still a Buy Right Now, According to Wall Street.": 0.8,
  "Stocks Pressured by Chip Stock Weakness": -0.5,
  "Should You Consider Adding IDEXX Laboratories (IDXX) to Your Portfolio?": 0.5,
  "How Global Expansion Is Shaping Costco's Long-Term Profile": 0.5,
  "Fortinet Expands via Cross-Selling: A Path to More Profitability?": 0.5,
  "Dollar General Up 51% in 6 Months: Time to Cash Out or Hold DG Stock?": 0.2,
  "Mondelez Q2 Earnings Expected to Be 'Positive Catalyst' for Stock, Vital Farms Likely to Raise Outlook, Morgan Stanley Says": 0.8,
  "Are These Stocks the Next FANG? Jim Cramer Thinks So": 0.5,
  "Micron Launches First Space-Ready Memory Chip To Power AI Missions In Orbit": 0.8,
  "Veho and Enveyo Integration Enables Enterprise Shippers and 3PLs to Easily Diversify Last Mile Delivery": 0.5,
  "Arm Holdings (ARM) Stays on Analyst Radar as AI Demand Fuels Fresh Price Target": 0.6,
  "Electronic Arts (EA) Stock Trades Up, Here Is Why": 0.5,
  "SafeRacks Launches Viral Bin Storage Rack, Redefining Home and Garage Organization": 0.6,
  "AEP Declares Quarterly Dividend on Common Stock": 0.0,
  "Why Take-Two (TTWO) is Poised to Beat Earnings Estimates Again": 0.8,
  "Will CDW (CDW) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Chip stocks slide, NXP weak outlook, Coinbase inks PNC deal": -0.5,
  "CRWD Bets on Agentic AI Security: Will it Unlock Next Growth Phase?": 0.6,
  "GitLab's Partner Base Expands: Is Growth Thesis Strengthening?": 0.6,
  "Nvidia, Apple Partner Sets Up After 217% Surge; Custom Chip King Eyes AI Boom": 0.6,
  "Why Paccar Stock Popped Today": 0.5,
  "Etsy faces user boycott over ‘Alligator Alcatraz’-branded products": -0.8,
  "PACCAR CEO Optimistic About Growth Despite Soft Truckload Market, Tariff Concerns": 0.8,
  "Vertex Announces Marketing Authorization in Canada for ALYFTREK, a Once-Daily Next-Generation CFTR Modulator for the Treatment of Cystic Fibrosis": 0.8,
  "Intuit (INTU) Enhances Enterprise Suite With AI Agents For Mid-Market Business Efficiency": 0.6,
  "American Electric Power Company (AEP) Declares US$0.93 Quarterly Dividend Payable September 2025": 0.5,
  "Linde (LIN) Expands U.S. Space Footprint With New Industrial Gas Facilities": 0.5,
  "NXP Semiconductors (NXPI) Reports Lower Q2 Earnings, Provides Q3 Revenue Guidance": -0.5,
  "Palo Alto Networks (PANW) Eyes Possible Acquisition of SentinelOne for Approximately US$7 Billion": 0.5,
  "US Equity Indexes Mixed as General Motors Reports $1.1 Billion Tariff Hit, Economic Data Show Weakness": -0.5,
  "Arm Holdings (ARM) Reports Strong Year-Over-Year Performance Despite Net Income Dip": 0.6,
  "Microsoft Says Chinese Hackers Exploiting SharePoint Flaws": -0.6,
  "Why This Analog Semiconductor Stock Is A Top Undervalued Pick": 0.8,
  "NXPI Q2 Deep Dive: Early Signs of Cyclical Recovery, Automotive Inventory Headwinds Ease": 0.6,
  "Lululemon's China Cooldown And US Struggles Weigh On Outlook": -0.5,
  "Navitas vs. ON Semiconductor: Which Power Stock is a Better Bet Now?": 0.2,
  "Sector Update: Tech Stocks Retreat Late Afternoon": -0.5,
  "SentinelOne (S) Rallies 9.8% on $10-Billion Potential Buyout": 0.8,
  "Oracle & OpenAI, Amazon, NXP Semi: Trending Tickers": 0.0,
  "CoStar Group Q2 Revenue Increases 15% Year-over-Year, Achieves All-time High Quarterly Net New Bookings of $93 million and Increases Homes.com Members 56% from Q1 2025": 0.8,
  "Alphabet’s Longest Rally Since 2010 Underlines Earnings Optimism": 0.8,
  "CoStar: Q2 Earnings Snapshot": 0.0,
  "Figma’s Auction-Like IPO Set Up to Capitalize on Strong Demand": 0.8,
  "CoStar’s (NASDAQ:CSGP) Q2 Sales Top Estimates": 0.8,
  "Hershey Lifts Candy Prices, Citing High Cocoa Costs": -0.5,
  "Arm Rises 3% as Wells Fargo Lifts Price Target to $175": 0.8,
  "Constellation Energy and Vistra stocks surge after PJM capacity auction results": 0.8,
  "CoStar raises annual revenue forecast as net bookings climb": 0.8,
  "Intuitive Surgical, Inc. (ISRG) Q2 Earnings and Revenues Top Estimates": 0.8,
  "CoStar Group (CSGP) Q2 Earnings and Revenues Beat Estimates": 0.8,
  "CoStar (CSGP) Reports Q2 Earnings: What Key Metrics Have to Say": 0.2,
  "Marvell Technology (MRVL) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Fortinet (FTNT) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Intuitive Surgical (ISRG) Reports Q2 Earnings: What Key Metrics Have to Say": 0.2,
  "Analog Devices (ADI) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "Gilead Sciences (GILD) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Booking Holdings (BKNG) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Vertex Pharmaceuticals (VRTX) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Intuitive Surgical reports upbeat quarterly earnings on strong demand for surgical robots": 0.8,
  "Ross Stores (ROST) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "KLA (KLAC) Stock Falls Amid Market Uptick: What Investors Need to Know": -0.2,
  "Why Autodesk (ADSK) Outpaced the Stock Market Today": 0.5,
  "Tech, Media & Telecom Roundup: Market Talk": 0.0,
  "Mondelēz 2024 Snacking Made Right Report: Waste": -0.5,
  "Why Micron Stock Sank Today": -0.5,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On July 22, 2025, Sara Martinez Tucker notified the Board of Directors (“Board”) of American Electric Power Company, Inc. (the “Company”) that she would resign as the Chair of the Board effective as of July 31, 2025. Ms. Tucker stated that she is resigning as Chair of the Board for personal reasons and not due to": -0.2,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. The Board of Directors (the “Board”) of Marvell Technology, Inc. (the “Company”) approved the appointment of Rajiv Ramaswami to the Board effective July 22, 2025. Mr. Ramaswami, age 59, has served as a Director and the President and Chief Executive Officer of Nutanix, Inc., an enterprise Cloud computing company since December 2020. Mr. Ramaswami has more than": 0.2,
  "(Item 2.02) . Results of Operations and Financial Condition. On July 23, 2025, Alphabet Inc. (“ Alphabet ” or the “ Company ”) is issuing a press release and holding a conference call regarding its financial results for the quarter ended June 30, 2025. A copy of the press release is furnished as Exhibit 99.1 to this Current Report on Form 8-K. This information shall not be deemed “filed” for purposes of Section 18 of the Securities\n\n(Item 8.01) . Other Events. Alphabet’s Board of Directors declared a quarterly cash dividend of $0.21 payable on September 15, 2025 to stockholders of record for each of the Company’s Class A, Class B, and Class C shares as of September 8, 2025.": 0.2,
  "(Item 8.01) . Other Events. PepsiCo Senior Notes Offering. On July 21, 2025, PepsiCo, Inc. (“PepsiCo”) announced an offering of $750,000,000 aggregate principal amount of its 4.100% Senior Notes due 2029 (the “2029 Notes”), $650,000,000 aggregate principal amount of its 4.300% Senior Notes due 2030 (the “2030 Notes”), $850,000,000 aggregate principal amount of its 4.650% Senior Notes due 2032 (the “2032 Notes”) and $1,250,000,000 aggregate principal amount of its 5.000% Senior Notes due 2035 (the “2035 Notes,”": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On July 23, 2025, Tesla, Inc. released its financial results for the quarter ended June 30, 2025 by posting its Second Quarter 2025 Update on its website. The full text of the update is attached hereto as Exhibit 99.1 and is incorporated herein by reference . This information is intended to be furnished under\n\n(Item 2.02) of Form 8-K, “Results of Operations and Financial Condition” and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such a filing.": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition On July 23, 2025, CSX Corporation issued a press release and its CSX Quarterly Financial Report on financial and operating results for the quarter ended June 30, 2025. A copy of the press release is attached as Exhibit 99.1 and a copy of the CSX Quarterly Financial Report is attached as Exhibit 99.2, each of which is incorporated by reference herein. These documents are available on the Company's": 0.1,
  "(Item 2.02) – Results of Operations and Financial Condition ​ On July 23, 2025, O’Reilly Automotive Inc. (the “Company”) issued a press release announcing its 2025 second quarter earnings. The text of the press release is attached hereto as Exhibit 99.1. ​ Section 9 – Financial Statements and Exhibits ​": 0.0,
  "(Item 8.01) Other Events. On July 21, 2025, a purported class action lawsuit was filed in the Court of Chancery of the State of Delaware against us and our board of directors (the “Board”) alleging violations of the Delaware General Corporation Law (the “DGCL”), and asserting a claim against our Board for breach of fiduciary duty in connection with the purported DGCL violation. The plaintiff, David Dodge (the “Plaintiff”), purports to assert claims on behalf of himself": -0.5,
  "(Item 2.02) — Results of Operations and Financial Condition On July 23, 2025, T-Mobile US, Inc. (the “Company”) issued a press release announcing the financial and operating results of the Company for the quarter ended June 30, 2025. The text of the press release and accompanying Investor Factbook are furnished as Exhibits 99.1 and 99.2 and incorporated herein by reference. The information in\n\n(Item 2.02) to this Current Report on Form 8-K, including Exhibits 99.1 and 99.2 , is being furnished and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended, except as expressly set forth by specific reference in such filing.": 0.1,
  "AI Bookkeeping Software (2025): QuickBooks Named Leading AI Bookkeeping Solution in Report by Expert Consumers": 0.8,
  "Agoda Reveals 5 Most Booked Asian Destinations in the First Half of 2025": 0.5,
  "3 Reasons We’re Fans of DoorDash (DASH)": 0.5,
  "3 of Wall Street’s Favorite Stocks with Impressive Fundamentals": 0.6,
  "1 Cash-Producing Stock with Competitive Advantages and 2 We Find Risky": 0.5,
  "Here's What to Expect From DoorDash's Next Earnings Report": 0.2,
  "What to Expect From Gilead Sciences’ Q2 2025 Earnings Report": 0.2,
  "NXP Semiconductors NV (NXPI) Q2 2025 Earnings Call Highlights: Navigating Market Challenges ...": 0.2,
  "PACCAR Inc (PCAR) Q2 2025 Earnings Call Highlights: Record Parts Revenue and Strategic ...": 0.5,
  "Intuitive Surgical Inc (ISRG) Q2 2025 Earnings Call Highlights: Robust Revenue Growth and ...": 0.8,
  "CoStar Group Inc (CSGP) Q2 2025 Earnings Call Highlights: Record Revenue Growth and Strategic ...": 0.8,
  "Bear of the Day: Atlassian (TEAM)": 0.0,
  "Calciphylaxis Market Forecast Report 2025-2034 | Rising Incidence of Chronic Kidney Disease (CKD) and End-Stage Renal Disease (ESRD) Fueling Demand and Growth": 0.6,
  "Atopic Dermatitis Market Forecast Report 2025-2034 | FDA Approval of Tralokinumab-Ldrm Stimulates Treatment Advances": 0.5,
  "S&P 500 Is Getting More Bitcoin Exposure as Block Joins the Club": 0.5,
  "Luxury all‑inclusive resorts boom in Europe": 0.6,
  "DIGITIMES ASIA: Nvidia picks Micron for massive SOCAMM rollout": 0.5,
  "Will Buffett’s Successor Get the Same Free Pass From Investors?": 0.1,
  "Why this early Google investor is funding think tanks in the U.S. and India": 0.5,
  "This one big money move sets rich retirees apart": 0.5,
  "United Airlines Holdings Inc (UAL): Get With The Program, Says Jim Cramer": 0.5,
  "Intuitive Surgical tempers tariff impact expectations": 0.5,
  "CDW to Announce Second Quarter 2025 Results on August 6": 0.0,
  "Is There An Opportunity With AppLovin Corporation's (NASDAQ:APP) 23% Undervaluation?": 0.5,
  "Cognizant Technology Solutions Corporation's (NASDAQ:CTSH) Stock Been Rising: Are Strong Financials Guiding The Market?": 0.5,
  "July 2025's Noteworthy Stocks Trading Below Estimated Fair Value": 0.5,
  "Exelon's Q2 2025 Earnings: What to Expect": 0.0,
  "Microchip Technology (MCHP) Surged Following the Improvement in Fundamentals": 0.8,
  "Tenovi Expands Access to Glucose Data for Remote Patient Monitoring and Cardiometabolic Programs Through Dexcom Integration": 0.5,
  "Do You Believe in the Growth Potential of Amgen (AMGN)?": 0.5,
  "GE HealthCare drives growth with investment in AI-enabled medical devices and tops FDA’s list of AI authorizations for 4th Year with 100": 0.8,
  "Amgen's (NASDAQ:AMGN) three-year earnings growth trails the 10% YoY shareholder returns": 0.2,
  "The Return Trends At Workday (NASDAQ:WDAY) Look Promising": 0.8,
  "Old Dominion Freight Line (NASDAQ:ODFL) jumps 3.4% this week, though earnings growth is still tracking behind five-year shareholder returns": 0.1,
  "Analyst Bullish on Crowdstrike Holdings (CRWD) Says Cybersecurity Could Be ‘Biggest Subsector’ For Tech": 0.8,
  "Clorox files $380 million suit blaming Cognizant for 2023 cyberattack": -0.7,
  "Meta Platforms and Atlassian have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "ISRG Stock Gains on Q2 Earnings & Sales Beat, Gross Margin Contracts": 0.2,
  "Company News for Jul 23, 2025": 0.0,
  "Tempus AI Gains FDA Nod Amid Booming AI ECG Market Momentum": 0.6,
  "AI-Driven Cybersecurity Boom Makes These 3 Stocks Worth Buying": 0.8,
  "Payactiv Named a Workday Partner": 0.5,
  "Paychex Again Named to Selling Power’s \"60 Best Companies to Sell For\" 2025 List": 0.6,
  "Palo Alto Networks, Inc. (PANW) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Investors Heavily Search Constellation Energy Corporation (CEG): Here is What You Need to Know": 0.5,
  "Is Now The Time To Look At Buying Warner Bros. Discovery, Inc. (NASDAQ:WBD)?": 0.2,
  "Is Atlassian Corporation (NASDAQ:TEAM) Potentially Undervalued?": 0.5,
  "Marvell Appoints Rajiv Ramaswami to its Board of Directors": 0.5,
  "AI Boom Leads to Record US Grid Costs, Call for New Plants": 0.2,
  "US court dismisses child-labour claims against cocoa importers": 0.5,
  "ISRG: Solid Numbers, Tariff Concerns": 0.5,
  "Intuitive Surgical (ISRG) Is Considered a Good Investment by Brokers: Is That True?": 0.5,
  "Texas Instruments Q2 Earnings Beat Estimates, Revenues Rise Y/Y": 0.8,
  "Shopify and Unity downgraded: Wall Street's top analyst calls": -0.5,
  "The Trade Desk vs. Alphabet: Which Ad-Tech Stock is the Smarter Buy?": 0.5,
  "Why Marvell Technology (MRVL) is a Top Growth Stock for the Long-Term": 0.8,
  "Amgen vs. Novo Nordisk: Which Pharma Giant Is the Better Buy?": 0.5,
  "Why CDW (CDW) is a Top Momentum Stock for the Long-Term": 0.6,
  "PACCAR Q2 Earnings Surpass Expectations, Sales Decline Y/Y": 0.2,
  "Is Oklo Stock's Sky-High Valuation Justified or Simply Driven by Hype?": -0.5,
  "Zai Lab Limited (ZLAB) Stock Jumps 6.8%: Will It Continue to Soar?": 0.6,
  "UNC Health Southeastern Taps Transact + CBORD to Launch Mobile Meal Ordering": 0.2,
  "Trintech Achieves Workday Certified Integration to Further Accelerate Financial Close Processes": 0.5,
  "CDW (CDW) Expected to Beat Earnings Estimates: Should You Buy?": 0.5,
  "Automatic Data Processing (ADP) Reports Next Week: Wall Street Expects Earnings Growth": 0.5,
  "American Electric Power (AEP) Expected to Beat Earnings Estimates: What to Know Ahead of Q2 Release": 0.5,
  "Kraft Heinz (KHC) Expected to Beat Earnings Estimates: Can the Stock Move Higher?": 0.5,
  "Cognizant (CTSH) Reports Next Week: Wall Street Expects Earnings Growth": 0.5,
  "Lam Research (LRCX) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "Earnings Preview: Old Dominion Freight Line (ODFL) Q2 Earnings Expected to Decline": -0.7,
  "Rheumatoid Arthritis Therapeutics Market Forecast Report 2025-2034 | Rising Preference for Combination Therapies, and Entry of Generic Drugs Supports Expansion": 0.6,
  "This Analyst Says Lam Research (LRCX) is Among the Best AI Semiconductor Stocks to Buy on the Dip": 0.8,
  "Talen Energy, Constellation, and Vistra Stock Are on the Rise. What’s Lifting Shares.": 0.5,
  "Enterprise Suite and Agentic AI: Can Intuit Win Mid-Market?": 0.2,
  "Looking Back to the Future: Gilead's Long-Standing Commitment To Help End the HIV Epidemic": 0.5,
  "Chip Stocks Are Weighing on the Nasdaq": -0.6,
  "Chocolate cravings are about to be costlier as Hershey’s confirms price increases are on the way": -0.7,
  "Amyotrophic Lateral Sclerosis (ALS) Market Forecast Report 2025-2034 | Advancements in Therapeutics and Approved Medications Such as Riluzole, Edaravone, and Nuedexta Drive Growth": 0.6,
  "Axon Eyes Expansion in Drone Equipment Space: Can It Deliver Growth?": 0.2,
  "Jim Cramer on Micron: “The Chart is Saying We Gotta Wait”": 0.2,
  "Jim Cramer on Costco: “It is a Victim of its Own Success”": -0.5,
  "lululemon's Premium Valuation Shows Strength: Time to Buy or Wait?": 0.5,
  "Uranium Equities Rise While Prices Remain Steady, RBC Capital Markets Says": 0.5,
  "Oppenheimer Touts Marvell Technology (MRVL) as Top Data Center Play amid AI Infrastructure Ramp": 0.6,
  "Canadian rail giants may disrupt bids for Norfolk Southern, CSX": -0.5,
  "Applied Materials' R&D Investment is Climbing: Can it Deliver Results?": 0.5,
  "TOP SCIENCE TEACHERS ANNOUNCED FOR 12TH ANNUAL REGENERON STEM TEACHING FELLOWSHIP": 0.5,
  "Berkshire Hathaway Poised for Strong Q2 on Insurance Growth, UBS Says": 0.8,
  "Beyond Nvidia, Palantir, Top Funds Keep Loving This AI Stock": 0.5,
  "ComEd Announces $130,000 in Scholarships to City Colleges Line Worker Training Program": 0.8,
  "Adobe’s CTO is getting more creative on the software maker’s approach to generating ‘safe’ AI tools": 0.5,
  "4 Technology Stocks Poised to Beat Earnings Estimates in Q2": 0.5,
  "CrowdStrike Named a Leader and Fast Mover in the 2025 GigaOm Radar Report for Identity Security Posture Management (ISPM)": 0.8,
  "Marriott completes CitizenM acquisition": 0.5,
  "Will CoStar's Earnings & Revenue Beat in Q2 Drive the Stock Price?": 0.2,
  "Hershey to raise candy prices by double digits amid elevated cocoa costs": -0.7,
  "Stock Of The Day Plugs Into AI Revolution": 0.5,
  "Why Texas Instruments (TXN) Shares Are Sliding Today": -0.5,
  "Intuitive Surgical (ISRG) Reports Strong Q2 Earnings With Revenue Up To US$2,440 Million": 0.8,
  "Vertex Pharmaceuticals (VRTX) Advances Cystic Fibrosis Treatment With ALYFTREK Approval in Canada": 0.8,
  "BILL vs. Intuit: Which Fintech Powerhouse Stock Is the Smarter Buy?": 0.5,
  "Why CoStar (CSGP) Stock Is Trading Up Today": 0.5,
  "Sector Update: Energy Stocks Rise Wednesday Afternoon": 0.5,
  "Marriott International Completes Acquisition of citizenM Brand": 0.5,
  "Microchip Technology, onsemi, and Allegro MicroSystems Stocks Trade Down, What You Need To Know": -0.5,
  "Why Analog Devices (ADI) Stock Is Trading Lower Today": -0.5,
  "Nat-Gas Prices Tumble as US Weather Forecasts Cool": -0.5,
  "Gilead Sciences, Omnicom Group, and QuinStreet Shares Skyrocket, What You Need To Know": 0.8,
  "Acadia Healthcare, Henry Schein, The Pennant Group, Ziff Davis, and Atlassian Shares Are Soaring, What You Need To Know": 0.8,
  "Marriott Vacations, Wabash, SmartRent, Vestis, and Tandem Diabetes Stocks Trade Up, What You Need To Know": 0.5,
  "Oklo and Liberty Energy Stocks Get a Boost from ‘Strategic Alliance’ Announcement": 0.6,
  "Sector Update: Energy Stocks Higher Late Afternoon": 0.5,
  "The Trade Desk Announces Date of Second Quarter 2025 Financial Results and Conference Call": 0.0,
  "CSX Corp. Announces Second Quarter 2025 Results": 0.0,
  "Airbnb to Announce Second Quarter 2025 Results": 0.0,
  "CSX: Q2 Earnings Snapshot": 0.0,
  "ServiceNow Reports Second Quarter 2025 Financial Results": 0.0,
  "Oil Services Is Making a Comeback. 2 Energy Equipment Stocks to Watch.": 0.5,
  "Alphabet beats earnings expectations, raises spending forecast - Alphabet reported second-quarter earnings on Wednesday after the bell. Here’s how the company did, compared with estimates from analysts polled by LSEG: * **Revenue:** $96.43 billion vs. $94 billion estimated * **Earnings per share:** $2.31 vs. $2.18 estimated Wall Street is also watching several other numbers in the report: * **YouTube advertising revenue**: $9.79 billion vs. $9.56 billion, according to StreetAccount * **Google Cloud revenue:** $13.62 billion": 0.8,
  "Intuitive Surgical Yo-Yoes Despite 'Solid' Quarter. All Eyes On Da Vinci 5.": 0.2,
  "Texas Instruments Stock Falls On Weak Earnings Outlook": -0.8,
  "O’Reilly Automotive, Inc. Reports Second Quarter 2025 Results": 0.0,
  "CSX (NASDAQ:CSX) Reports Q2 In Line With Expectations": 0.5,
  "CSX Quarterly Profit, Sales Fall as Uncertainty Persists Among Industrial Markets": -0.6,
  "SOUTHWEST AIRLINES REPORTS SECOND QUARTER 2025 RESULTS": 0.0,
  "O'Reilly Automotive: Q2 Earnings Snapshot": 0.0,
  "First look: Weaker coal, carloads hit CSX earnings": -0.5,
  "CoStar Group Names Grant Montgomery as National Director of Multifamily Analytics": 0.5,
  "S&P 500 Reaches New High Amid Hopes of More Trade Deals": 0.8,
  "O'Reilly (NASDAQ:ORLY) Posts Q2 Sales In Line With Estimates": 0.5,
  "Alphabet Inc. (GOOG) Q2 Earnings and Revenues Top Estimates": 0.8,
  "O’Reilly automotive shares slip as full-year guidance disappoints": -0.6,
  "There’s Still No Growth at Railroader CSX—Unless Buffett Makes a Bid": 0.1,
  "O'Reilly Automotive (ORLY) Surpasses Q2 Earnings Estimates": 0.8,
  "Podcast: Tesla Profit Is Hit by Weak EV Sales": -0.6,
  "Vertex Pharmaceuticals (VRTX) Rises Higher Than Market: Key Facts": 0.5,
  "Take-Two Interactive (TTWO) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "ON Semiconductor Corp. (ON) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Ross Stores (ROST) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "MaxLinear (MXL) Matches Q2 Earnings Estimates": 0.5,
  "Marvell Technology (MRVL) Reaffirmed as a Buy—Here’s Why Stifel Is Bullish": 0.8,
  "Does the ASML Stock Sell-Off Signal Trouble for Nvidia and Broadcom?": -0.5,
  "EU Wrestles With China’s Chokehold Over Crucial Defense Supplies": -0.6,
  "(Item 2.02) . Results of Operations and Financial Condition. The information contained in this\n\n(Item 2.02) , including Exhibit 99.1, shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), or incorporated by reference in any filing under the Securities Act of 1933, as amended (the \"Securities Act\"), or the Exchange Act, except as expressly set forth by specific reference in such a filing. On July 24, 2025 , Keurig Dr Pepper Inc. (the \"Company\" or \"KDP\") issued a": 0.1,
  "(Item 8.01) Other Events. On July 24, 2025, the Company issued a press release announcing that its Board of Directors had declared a quarterly cash dividend of $0.28 per share of common stock, payable on September 17, 2025, to shareholders of record at the close of business on September 3, 2025. The press release is attached hereto as Exhibit 99.1 and incorporated herein by reference.": 0.0,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On July 23, 2025, Lloyd W. Howell, Jr. notified GE HealthCare Technologies Inc. (the “Company”) of his resignation from the Company’s Board of Directors (the “Board”), effective immediately. Mr. Howell’s resignation from the Board was not a result of any disagreement on a matter related to the Company’s operations, policies, or practices.": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition. On July 24, 2025, Intel Corporation (“Intel” or the \"Company\") issued a press release announcing the financial results of its second quarter ended June 28, 2025 and forward-looking statements relating to its third quarter of 2025. A copy of this press release is attached hereto as Exhibit 99.1 and is incorporated by reference herein. The attached press release includes non-GAAP financial measures relating to our operations and forecasted outlook.\n\n(Item 2.02) of this Report and the press release attached hereto as Exhibit 99.1 are furnished and shall not be treated as filed for purposes of the Securities Exchange Act of 1934, as amended.": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition On July 24, 2025, Honeywell International Inc. (the “Company”) issued a press release announcing its second quarter 2025 earnings, which is furnished herewith as Exhibit 99. The information furnished pursuant to this\n\n(Item 2.02) , including Exhibit 99, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934 (the “Exchange Act”) or otherwise subject to the liabilities under that Section and shall not be deemed to be incorporated by reference into any filing of the Company under the Securities Act of 1933 or the Exchange Act.": 0.1,
  "AppLovin (APP) Gets $525 Price Target Ahead of Q2 Earnings Beat, Says Analyst": 0.8,
  "Texas Instruments CEO's tariff comments surprise investors": -0.5,
  "Mountain Valley MD Holdings Announces Changes to Board of Directors": 0.0,
  "Agoda Ranks Asia's Most Affordable Summer Destinations for Hoteliers to Manage Yields from Deals": 0.5,
  "Video Gaming Stocks Q1 Recap: Benchmarking Take-Two (NASDAQ:TTWO)": 0.1,
  "2 Reasons to Like AMGN and 1 to Stay Skeptical": 0.5,
  "3 Reasons ADI is Risky and 1 Stock to Buy Instead": -0.6,
  "AI Chat With Roland Rott,  President & CEO of Imaging at GE HealthCare": 0.5,
  "3 of Wall Street’s Favorite Stocks to Keep an Eye On": 0.5,
  "3 Low-Volatility Stocks We’re Skeptical Of": -0.5,
  "Jim Cramer on Adobe: “Might Get This Thing at a Cheaper Price”": 0.2,
  "3 Low-Volatility Stocks We Steer Clear Of": -0.5,
  "Analog Devices Earnings Preview: What to Expect": 0.5,
  "What You Need To Know Ahead of Synopsys' Earnings Release": 0.1,
  "CSX Corp (CSX) Q2 2025 Earnings Call Highlights: Navigating Revenue Challenges with Strategic ...": 0.5,
  "Looking Beyond Yield for the Safest Dividend Payers": 0.5,
  "Alphabet Inc. (GOOG) Q2 Earnings and Revenues Top Estimates (Revised)": 0.8,
  "If You Invested $10K In Mid-America Apartment Communities Stock 10 Years Ago, How Much Would You Have Now?": 0.0,
  "CAR T-Cell Therapy Market Trends and Forecasts, 2021-2024 & 2025-2033 | Focus on Yescarta, Tecartus, Kymriah, Breyanzi, Abecma, Carvykti, and Carteyva": 0.5,
  "3 Growth Levers That Could Power Shopify's Next Chapter": 0.5,
  "The Zacks Analyst Blog Highlights Meta Platforms, Lam Research, Flex and Seagate": 0.5,
  "Target Corporation (TGT): The Downgrade Isn’t Wrong, Says Jim Cramer": 0.2,
  "Costco Wholesale Corporation (COST) Isn’t Increasing Prices, Says Jim Cramer": 0.5,
  "STMicro Shares Drop on Surprise Loss, Disappointing Outlook": -0.8,
  "CSX Corporation (CSX): “I Am In Charge Of The Rails,” Says Jim Cramer": 0.5,
  "What to Expect From Palo Alto Networks' Q4 2025 Earnings Report": 0.2,
  "Biosimilars Markets Global Forecast Report 2025-2035 | Launch of Glp-1 Biosimilars, Increasing Strategic Partnerships and Collaborations, & Growing Focus on Advanced R&D Fueling Opportunities": 0.6,
  "2 Top Stocks I Wouldn't Hesitate to Invest $1,000 in Right Now": 0.5,
  "QuickBooks AI Features (2025): QuickBooks Awarded Best AI-Powered Accounting Features in Report by Software Experts": 0.8,
  "Zum Appoints Daniel Berenbaum as Chief Financial Officer": 0.5,
  "Linde Earns FTSE4Good Inclusion for Tenth Consecutive Year": 0.8,
  "How LegitScript’s CFO and CTO are building systems to scale smarter": 0.5,
  "Knox Launches on AWS Marketplace: SaaS Companies Can Now Achieve FedRAMP in 90 Days Using Their Existing AWS App and Budget": 0.6,
  "My Top AI Growth Stock to Buy Now and Hold Through at Least 2030": 0.6,
  "Velveeta says ‘Respect the Drip’ for first major campaign in 2 years": 0.5,
  "Anyone else getting 2021 vibes? - Yes the monetary conditions are not exactly the same. But I remember the behavior and sentiment well as I perused reddit and various message boards over the years: Extreme risk on sentiment and margin, people favouring stocks over indexes because \"way better returns bro. Have fun with your 7% per year grandpa lol\". Meme stock short squeeze, people piling into stocks with little revenue that have already 10x in": -0.8,
  "2 Top Artificial Intelligence (AI) Stocks Ready for a Bull Run": 0.8,
  "Options Trading Now Available on Latest Five Tradr ETFs: CWVX, SMU, ASTX, GEVX and CEGX": 0.5,
  "Baker Hughes Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "Old Dominion Freight Line Announces $0.28 Per Share Quarterly Cash Dividend": 0.5,
  "Keurig Dr Pepper Reports Q2 2025 Results and Reaffirms Guidance for 2025": 0.0,
  "Low IV Alert: Stocks that Could be Ready to Pop": 0.5,
  "Are Texas Instruments Incorporated (NASDAQ:TXN) Investors Paying Above The Intrinsic Value?": -0.5,
  "Institutional investors have a lot riding on O'Reilly Automotive, Inc. (NASDAQ:ORLY) with 86% ownership": 0.2,
  "Keurig Dr. Pepper earnings beat estimates as energy drinks shine, but coffee inflation lurks": 0.2,
  "Marriott finalises acquisition of lifestyle hotel brand citizenM": 0.5,
  "Stocks Mostly Up Pre-Bell as Investors Assess Trump's Latest Tariff Threat, Key Earnings": 0.5,
  "Applied Materials to Report Fiscal Third Quarter 2025 Results on August 14, 2025": 0.0,
  "Regeneron Announces the 2025 Winners of the Regeneron Prize for Creative Innovation": 0.5,
  "Keurig Dr Pepper quarterly revenue beats expectations fueled by US demand": 0.8,
  "Keurig Dr Pepper shares fall as Coffee segment struggles despite earnings beat": -0.6,
  "AAON And 2 Other Insider Picks For Growth Potential": 0.5,
  "3 Stocks That Could Be Trading Below Their Estimated Value In July 2025": 0.5,
  "Habit Burger & Grill to open outlet in Santa Clarita, California": 0.0,
  "American Airlines, Southwest, Keurig Dr Pepper: Trending stocks": 0.2,
  "High Growth Tech Stocks In The US For July 2025": 0.5,
  "Analyst Explains Why Nvidia China News Could be ‘Huge’ for ASML Holding (ASML)": 0.6,
  "Keurig Dr Pepper (NASDAQ:KDP) Surprises With Q2 Sales": 0.5,
  "onsemi and Schaeffler Expand Collaboration with  New EliteSiC-based PHEV Platform": 0.5,
  "Constellation‘s Deal With Calpine Approved by Federal Energy Regulatory Commission": 0.5,
  "Banuba Unveils Revolutionary Virtual Try-On Feature for Glasses and Sunglasses in Shopify Plugin": 0.8,
  "Cognizant's AI Lab Records 59th U.S. Patent, Continuing to Generate AI Breakthroughs": 0.8,
  "Those who invested in Monster Beverage (NASDAQ:MNST) five years ago are up 53%": 0.5,
  "Elon Musk's xAI Eyes $12 Billion Chip Purchase Deal With Nvidia": 0.5,
  "Nasdaq CEO signals improved IPO market momentum, shares jump on results beat": 0.8,
  "Keurig Dr Pepper, Inc (KDP) Meets Q2 Earnings Estimates": 0.5,
  "Take-Two Interactive Software's Q1 2026 Earnings: What to Expect": 0.0,
  "The Kraft Heinz Company (KHC) Fell Due to Sluggish Food and Beverage Industry": -0.6,
  "Longleaf Partners Fund Increased its Holdings in Regeneron Pharmaceuticals (REGN) on a Dip": 0.5,
  "Regeneron Pharmaceuticals, Inc. (REGN): A Bull Case Theory": 0.5,
  "Latest News In E-Commerce - Subscription Market Poised for Significant Growth by 2030": 0.8,
  "Nubank Appoints Ethan Eismann as Chief Design Officer, Deepening Commitment to Customer Experience": 0.6,
  "ASML best positioned for 2026 in the Semicap pack: New Street Research": 0.6,
  "Valneva (VALN) Soars 17.4%: Is Further Upside Left in the Stock?": 0.6,
  "Only 34% of Americans Feel on Track for Retirement. Here Are 2 Stocks to Buy Now and Hold for Decades.": 0.2,
  "Texas Instruments Incorporated (TXN): “They’re So Good,” Says Jim Cramer": 0.8,
  "All these rumors about tariffs are just to manipulate the markets?! - From the ongoing negotiations between the United States and the EU, rumors are filtering out that an agreement between the parties is very close. It would appear to be an agreement similar to the one with Japan, with 15% duties for European products. Some exclusions for drugs, airplanes, alcohol. Some improvements in conditions also occurred in the automotive and steel sectors. All that": 0.2,
  "Datadog, Inc. (DDOG): A Bull Case Theory": 0.5,
  "Fullmark Energy Appoints Energy Industry Veteran to Chief Financial Officer Delivering Path to Diversified Portfolio Growth": 0.8,
  "Emerging Markets Are Trouncing U.S. Stocks. This Pro Likes Alibaba, Mercado Libre.": 0.5,
  "VideoAmp and Warner Bros. Discovery Sign Multi-Year Deal to Advance Measurement and Currency Innovation": 0.6,
  "Oracle and Bloom Energy Collaborate to Deliver Power to Data Centers at the Speed of AI": 0.6,
  "Want Better Returns? Don't Ignore These 2 Aerospace Stocks Set to Beat Earnings": 0.8,
  "Is Trending Stock Synopsys, Inc. (SNPS) a Buy Now?": 0.2,
  "Intuit Inc. (INTU) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Here is What to Know Beyond Why Axon Enterprise, Inc (AXON) is a Trending Stock": 0.2,
  "Stocks making big moves yesterday: Power Integrations, Booz Allen Hamilton, Wendy's, SentinelOne, and Boston Scientific": 0.2,
  "When Should You Buy GE HealthCare Technologies Inc. (NASDAQ:GEHC)?": 0.0,
  "Warner Bros. Discovery, Inc. (WBD): I Don’t Think The Split Up Will Be Good, Says Jim Cramer": -0.6,
  "Discuss Reports Record Mid-Year Growth with AI Agentic Approach to Vibe Coding for Market Insights": 0.5,
  "CoStar Group Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "FuzeHub Brings New York State Innovation Summit to Rochester October 29 - 30": 0.5,
  "Ahead of Mondelez (MDLZ) Q2 Earnings: Get Ready With Wall Street Estimates for Key Metrics": 0.2,
  "Gear Up for Booking Holdings (BKNG) Q2 Earnings: Wall Street Estimates for Key Metrics": 0.2,
  "UNH admits its under federal investigation, two months after refuting the first WSJ article on this and calling them\"deeply irresponsible\" - UNH Untied Healthcare previously stated they were not aware of being federally investigated and had no idea what the charges were (despite curiously mentioning the integrity of their Medicare Advantage Plans in this same address), which is in fact the very thing they are being investigated for. Also calling out the WSJ as deeply": -0.8,
  "Selective Estrogen Receptor Degrader (SERDs) Market Research Report 2025-2030 Featuring AstraZeneca, Eli Lilly, EnhancedBio, Olema Oncology, Radius Therapeutics, and Roche": 0.2,
  "Marketing Automation Market Surges to $81.01 Billion by 2030 - Dominated by HubSpot (US), Adobe (US), Oracle (US)": 0.5,
  "Should You Invest in Constellation Energy Corporation (CEG) Based on Bullish Wall Street Views?": 0.5,
  "Down 18%, Should You Buy the Dip on ASML Holding?": 0.2,
  "Norfolk Southern stock rises after confirming merger talks with Union Pacific": 0.8,
  "CrowdStrike Holdings, Inc. (CRWD): A Bull Case Theory": 0.5,
  "Micron Stock Is Riding the AI Wave. A Rival’s Sales Surge Is Good News.": 0.6,
  "Keurig Dr Pepper Q2 Volume Growth Obscured By Margin Cut, Currency Headwind": -0.5,
  "VERSANT Board of Directors for Future Independent Media Company Announced": 0.0,
  "Estimating The Fair Value Of Analog Devices, Inc. (NASDAQ:ADI)": 0.1,
  "Analysts Estimate Exelon (EXC) to Report a Decline in Earnings: What to Look Out for": -0.5,
  "Is DexCom, Inc.'s (NASDAQ:DXCM) ROE Of 24% Impressive?": 0.2,
  "Xcel Energy (XEL) Earnings Expected to Grow: Should You Buy?": 0.5,
  "Analysts Estimate Biogen Inc. (BIIB) to Report a Decline in Earnings: What to Look Out for": -0.5,
  "Earnings Preview: Comcast (CMCSA) Q2 Earnings Expected to Decline": -0.5,
  "LRCX Likely to Beat Q4 Earnings Estimates: How to Play the Stock?": 0.5,
  "Micron Technology, Inc. (MU): A Bull Case Theory": 0.5,
  "PayPal Holdings, Inc. (PYPL): A Bull Case Theory": 0.5,
  "Energy Drink Demand Helps Keurig Dr Pepper Beat Profit and Sales Estimates": 0.8,
  "Heartland Express (HTLD) Reports Q2 Loss, Lags Revenue Estimates": -0.7,
  "Will DXCM Q2 Earnings Reflect U.S. Coverage Expansion & Stelo Impact?": 0.2,
  "\"You Get Praise For Serving Others,\" Not Flashing Wealth — Sheraton Hotels And Perdue Farms Heiress Sold Her $1.2 Million Ring For Ukraine Aid": 0.5,
  "Comcast Corporation (CMCSA): A Bull Case Theory": 0.5,
  "Constellation Energy Corporation (CEG): A Bull Case Theory": 0.5,
  "Coming Soon to the Coffee Aisle: Tariffs": -0.5,
  "Palo Alto Networks (PANW): “.These Guys Are Frantically Getting Customers,” Says Jim Cramer": 0.6,
  "Keurig Q2 Earnings Meet Estimates, U.S. Refreshing Beverages Up 10.5%": 0.6,
  "Domino’s Pizza, (DPZ): “Be Prepared To Be steamrolled,” Says Jim Cramer": 0.2,
  "American Electric Power to Post Q2 Earnings: What's in Store?": 0.2,
  "DoorDash (DASH): CEO’s “A Hitter,” Says Jim Cramer": 0.6,
  "Will lululemon's Innovation Pipeline Deliver Growth in 2H25?": 0.2,
  "Keurig Dr Pepper CEO on Q2 beat, coffee sales, cane sugar": 0.5,
  "Union Pacific in mega US railroad merger talks with rival Norfolk Southern - Union Pacific said on Thursday it was in advanced discussions with rival Norfolk Southern for a possible mega merger that would create a transcontinental railroad behemoth. Norfolk shares were up 3.5%, while Union Pacific fell 2.3% in premarket trading. A deal, if it goes through, will combine Union Pacific's dominant position in the Western two-thirds of the U.S. with Norfolk's 19,500-mile route": 0.6,
  "World Premiere: Battlefield 6 First Trailer Reveals the Thrilling Future of the Iconic Series": 0.8,
  "Australia Wireless Router Market Trends Report 2025-2033 | Wi-Fi 6, Smart Home Appliances and Remote Work Drive Demand": 0.6,
  "CSX Q2 Earnings Came Ahead of Estimates, Revenues Decline Y/Y": 0.2,
  "O'Reilly Q2 Earnings Beat Estimates, '25 Revenue Outlook Raised": 0.8,
  "PANW's AI Threat Defense Expands: Will Protect AI be the Game Changer?": 0.6,
  "C3.ai Expands Beyond Oil: Is Diversification Paying Off?": 0.5,
  "T-Mobile stock pops on Q2 earnings: CEO breaks down the big quarter": 0.6,
  "Amazon Gave Prime Day Shoppers More Time to Browse. Many Went to Walmart": -0.6,
  "[Latest] Global Aeroderivative Gas Turbine Market Size/Share Worth USD 6.79 Billion by 2034 at a 6.34% CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trends, Forecast, Segmentation, Growth Rate, Value, SWOT Analysis)": 0.5,
  "O'Reilly Automotive Shows Growth in Q2 But Cost Concerns Loom, UBS Says": 0.1,
  "Sinch Named a Leader in the 2025 Gartner® Magic Quadrant™ for CPaaSThird Year in a Row": 0.8,
  "NBC's reported sports network, IBM, Honeywell: Trending Tickers": 0.0,
  "Top Midday Stories: Alphabet, Tesla Kick Off 'Magnificent 7' Earnings; Union Pacific, Norfolk Southern in 'Advanced' Merger Talks": 0.5,
  "Comcast names board of directors for media spinoff": 0.2,
  "GOOGL Q2 Earnings Beat Estimates, Revenues Up Y/Y, Shares Rise": 0.8,
  "OKTA Trades 25% Below 52-Week High: Right Time to Buy the Stock?": 0.5,
  "Booking Holdings to Report Q2 Earnings: What's in the Cards?": 0.2,
  "Chewy, Eaton and 2 Other Stocks Set to Gain After Earnings, Says Morgan Stanley": 0.5,
  "Young Women in Illinois Rev Up to Build, Race Electric Vehicles in ComEd’s EV Rally": 0.6,
  "Rail Operators Union Pacific, Norfolk in Advanced Talks About Potential Merger": 0.5,
  "GE HealthCare launches new advanced digital X-ray system to enable access and increase efficiency in high throughput settings": 0.8,
  "All eyes on CSX as Union Pacific and Norfolk Southern confirm talks": 0.5,
  "Why C3.ai (AI) Stock Is Trading Lower Today": -0.5,
  "Verisk Sets Precedent as First to Complete Wildfire Catastrophe Model Review Process in California for Insurance Ratemaking": 0.5,
  "AstraZeneca Prepares Showdown With JNJ, Amgen With Phase 3 Win For Myasthenia Gravis Drug Candidate": 0.5,
  "Axon 2 Powers AppLovin's Explosive Growth in Mobile Advertising": 0.8,
  "Electronic Arts (EA) Unveils Epic Battlefield 6 Trailer With Stunning Gameplay Features": 0.8,
  "Marvell Technology (MRVL) Welcomes Veteran Tech Leader Rajiv Ramaswami to Board": 0.8,
  "Commerce Sec. Lutnick says U.S. auto CEOs are ‘cool with’ higher tariffs than Japan - >Lutnick brushed off complaints from a group representing General Motors, Ford and Stellantis that Trump’s plan could give Japanese automakers an advantage over the “Big Three” Detroit car companies. > >“Oh my God, that’s just so silly,” Lutnick said on CNBC’s “Squawk on the Street” after being asked about criticism by the American Automotive Policy Council. ... > “Come on,": 0.2,
  "Compared to Estimates, Keurig Dr Pepper (KDP) Q2 Earnings: A Look at Key Metrics": 0.2,
  "Why Honeywell (HON) Shares Are Plunging Today": -0.7,
  "CSX (CSX) Stock Is Up, What You Need To Know": 0.5,
  "Earnings Dip for [CSX] (CSX) in Q2 While US$402 Million Buyback Continues": -0.2,
  "Keurig Dr Pepper Sees Continued U.S. Beverage Strength; Warns of Tariff Hit to Coffee": 0.2,
  "What happened to Fiserv (FISV)!? - I went from $140k to $80k in the last 4 months and just yesterday it was $100k. I rarely check my stocks but I got on to put find out my numbers as we are looking at buying a house, but man... that feels just brutal. Anyone have any kind of forecast? Did they just over inflate themselves and it's going back to the price it was years ago?": -0.8,
  "Old Dominion Freight Line (ODFL) Announces 7.7% Increase in Quarterly Dividend to US$0.28": 0.8,
  "3 Stocks Estimated To Be Trading Below Intrinsic Value By Up To 44.1%": 0.5,
  "Keurig Dr Pepper (KDP) Reaffirms 2025 Earnings Guidance For Mid-Single-Digit Sales Growth": 0.5,
  "Honeywell International (HON) Raises 2025 Sales Guidance, Reports Q2 Revenue Growth": 0.8,
  "gMG race hots up as AstraZeneca’s star candidate meets Phase III targets": 0.6,
  "How's MELI Using Argentina's Economic Recovery to Fuel its Growth?": 0.5,
  "Why T-Mobile US Stock Rose on Thursday": 0.5,
  "O'Reilly (ORLY) Stock Trades Up, Here Is Why": 0.5,
  "Earnings Reports Leave Equities Mixed Ahead of Trump's Fed Visit": 0.1,
  "The Dow Drops 165 Points as the S&P, Nasdaq Chase Records. It’s Messy.": -0.5,
  "Tesla’s stock plunges 9% after another weak quarter for auto sales - Tesla shares fell 9% Thursday after the company reported a second straight quarter of declining auto sales, and CEO Elon Musk told analysts that there could be a “few rough quarters” ahead due to the expiration of federal electric vehicle tax credits. Musk’s EV maker reported a 16% decline in automotive revenue from a year earlier to $16.7 billion. Total revenue fell 12%": -0.8,
  "Discounters Five Below and Ollie’s Deliver Stock Gains While Costco Sags": 0.5,
  "Cadence Design Systems, Inc. (CDNS): A Bull Case Theory": 0.5,
  "Intuit Inc. (INTU): A Bull Case Theory": 0.5,
  "Quantum Space A High Risk / High Reward Play - **Quantum Scape (QS) $12.50** **Industry/Sector/Type – – – Solid State Batteries / Breakthrough in Battery Technology/High Risk / High Reward** **Biggest catalyst for the stock:** Possibly achieving commercialization with Volkswagen in the next few years, after a successful milestone completion. **Positives** QS is one of the leaders in next-generation solid-state lithium-metal battery technology, partnering with PowerCo, a subsidiary of Volkswagen. PowerCo handles production, while QS": 0.6,
  "Old Dominion Freight Line, Inc. (ODFL): A Bull Case Theory": 0.5,
  "Why O'Reilly Automotive Stock Raced Higher Today": 0.6,
  "Chipotle (CMG) might be an interesting story from here (11% IRR from DCF) - The stock sold off from weak quarterly comps and guidance cut. It's trading around 30x FCF at the moment. The stock appears to be cheap as it is trading at the lower end of the 5-year average of EV/EBITDA and P/FCF). In general, times like this (when there is a multiple compression) is a good time to buy. My quick 5-year": 0.6,
  "What’s your long, mid, and short term plays? - Got 60% of my portfolio in mostly ETFs and companies in the S&P (long play) 25-30% in small/mid caps and international. Might reallocated depending on earnings and general outlook? Rest in options play because r/wallstreetbets": 0.2,
  "Baker Hughes (BKR) Rallies 11.6% on 5th Day on Impressive Earnings": 0.8,
  "Microchip Tech (MCHP) Sheds 6.7% as Chip Giant Signals Soft Outlook": -0.6,
  "Texas Instruments (TXN) Falls 13.3% on Weak Outlook": -0.8,
  "Gilead Sciences to Release Second Quarter 2025 Financial Results on Thursday, August 7, 2025": 0.0,
  "S&P, Nasdaq Build on Records. IBM, Honeywell Drag on the Dow.": 0.5,
  "KKR Completes Acquisition of Metronet through Joint Venture, Accelerating Fiber Expansion Across the U.S.": 0.8,
  "Oak Hill and Cinelli Family Complete Sale of Metronet": 0.5,
  "Intel beats on revenue, issues better-than-expected forecast - Intel reported second-quarter results on Thursday that beat Wall Street expectations on revenue, as the company’s new CEO Lip-Bu Tan announced significant cuts in chip factory construction. The stock ticked higher in extended trading. Here’s how the chipmaker did versus LSEG consensus estimates: * **Earnings per share**: Loss of 10 cents per share, adjusted. * **Revenue**: $12.6 billion versus $11.92 billion estimated Intel said it expects revenue": 0.8,
  "Honeywell Stock Falls After Earnings Beat. Here’s Why.": 0.2,
  "UScellular announces expected name change to Array Digital Infrastructure": 0.2,
  "UScellular Announces Expected Amount of Special Dividend": 0.2,
  "Why the Dow Jones Industrial Average is slipping right now": -0.5,
  "Big Food Companies Are Rethinking Portfolios as Sales Fall. Nestlé Is the Latest.": -0.5,
  "DoorDash, IBD Stock Of The Day, Delivers Strong Gains, And Fries": 0.6,
  "Top Analyst Reports for Cisco, Caterpillar & Charles Schwab": 0.0,
  "Stocks Close at Record as Alphabet Fuels AI Hopes: Markets Wrap": 0.8,
  "These Stocks Moved the Most Today: Tesla, Alphabet, IBM, Dow Inc., Honeywell, UnitedHealth, Southwest, American, and More": 0.0,
  "Nvidia, AI Chipmakers Buoyed By Google Capex, Trump Plan": 0.5,
  "Union Pacific and Norfolk Southern in Talks. Stocks Drop.": -0.6,
  "Stocks to Watch Thursday: Tesla, T-Mobile, American Airlines, Broadcom": 0.5,
  "Auto & Transport Roundup: Market Talk": 0.0,
  "Nasdaq, S&P 500 Reach New Highs as Markets Track Latest Earnings": 0.8,
  "Scholastic (SCHL) Q4 Earnings and Revenues Beat Estimates": 0.8,
  "Elon Musk Says 'They Simply Don't' Have The Funding, Doubts Stargate AI": -0.6,
  "TMC Dilution (equity compensation vote) - Anyone want to guess what the market reaction will be if this passes? I bought shares a few months back as a long position with the understanding that commercial permits are “around” the corner; lot’s of nuance there, but I’m “hopeful”. Not sure what to make of this though. It proposes 40 million more shares which is significant. Any thoughts? Is the company low enough on liquidity not to": -0.2,
  "Lululemon (LULU) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Datadog (DDOG) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Workday (WDAY) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Airbnb, Inc. (ABNB) Laps the Stock Market: Here's Why": 0.2,
  "Anyone else concerned about LUCID Stock? - I am a small shareholder at only 275 shares, but I purchased a majority of them at $25 and $20 so for me to hear that they are going to do a reverse split troubles me. Especially when they are nowhere near $1 or under, and do not have to fear becoming an OTC stock. I'm kind of mad that I have believed in this company since the": -0.6,
  "Stock Market Today: Russell 2000 Sinks 1.4%; Alphabet Surges, Tesla Slammed (Live Coverage)": 0.2,
  "(ITEM 2.02) . RESULTS OF OPERATIONS AND FINANCIAL CONDITION. On July 25, 2025, Charter Communications, Inc. issued a press release announcing its results for the second quarter ended June 30, 2025. The following information, including the entirety of the press release appearing in Exhibit 99.1 hereto, is not filed but is furnished pursuant to\n\n(item 2.02) , \"Results of Operations and Financial Condition.\"": 0.0,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. As part of Apple Inc.’s (“Apple’s”) previously announced Chief Operating Officer transition plan, Apple’s Board of Directors appointed Sabih Khan, 58, as Apple’s Chief Operating Officer, effective July 25, 2025. Mr. Khan succeeds Jeff Williams in the role of COO. Mr. Khan joined Apple in August 1995 and assumed his current position in July 2025. Mr. Khan’s": 0.2,
  "(Item 1.01) Entry into a Material Definitive Agreement. On July 24, 2025, MicroStrategy Incorporated ® d/b/a Strategy ™ (the “Company”) entered into an underwriting agreement (the “Underwriting Agreement”) with Morgan Stanley & Co. LLC, as lead manager and representative of the several underwriters (the “Underwriters”), relating to the issuance and sale in an underwritten offering (the “Offering”) of 28,011,111 shares (the “Shares”) of the Company’s Variable Rate Series A Perpetual Stretch Preferred Stock, $0.001 par value per\n\n(Item 8.01) Other Events. On July 25, 2025, the Company issued a press release relating to the pricing of the Offering. A copy of the press release is filed as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated by reference. Neither this Current Report on Form 8-K nor the press release attached hereto constitute an offer to sell or the solicitation of an offer to buy any securities. Forward-Looking Statements Statements in this": 0.1,
  "Markets rose on trade deal optimism and ahead of the Fed meeting, with rates expected to stay unchanged. - Recent trade deals between the U.S. and its trading partners have also helped push the market to new heights. Earlier this week, President Donald Trump announced a “massive” trade deal with Japan, which includes 15% “reciprocal” tariffs. The president also said this week that the U.S. and Indonesia have agreed to the framework of a trade": 0.8,
  "Zai Lab Ltd (ZLAB) Delivers Positive Results for Potential Gastric Cancer Treatment": 0.8,
  "Assembly Bio’s (ASMB) HBV Drug Shows Strong Efficacy in Phase 1b Trial": 0.8,
  "JMP Securities Raises Zscaler (ZS) Price Target Amid Strong Growth Momentum": 0.8,
  "Broadcom (AVGO) Launches 51.2 Tbps Switch for AI and HPC Applications": 0.6,
  "Loop Capital Bullish on Cadence (CDNS) Amid China Licensing Delays": 0.5,
  "2 Reasons to Like INTU and 1 to Stay Skeptical": 0.5,
  "1 Nasdaq 100 Stock to Target This Week and 2 That Underwhelm": 0.2,
  "1 High-Flying Stock to Own for Decades and 2 Facing Headwinds": 0.2,
  "2 Cash-Producing Stocks to Target This Week and 1 We Brush Off": 0.2,
  "2 Volatile Stocks Worth Your Attention and 1 We Find Risky": 0.2,
  "1 Unpopular Stock That Deserves Some Love and 2 Facing Challenges": 0.2,
  "KDP Q2 Deep Dive: Volume-Led Growth as New Brands Gain Traction, Cost Pressures Loom": 0.2,
  "HON Q2 Deep Dive: Portfolio Overhaul, Margin Pressure, and Guidance Lift": 0.5,
  "Disney Stock Is Ready to Rally After a Lost Decade": 0.8,
  "Applied Materials' Quarterly Earnings Preview: What You Need to Know": 0.5,
  "Gilead Receives Positive CHMP Opinions Under Accelerated Review From European Medicines Agency for Twice-Yearly Lenacapavir for HIV Prevention": 0.8,
  "3 Soaring Tech Stocks With Amazing Dividends": 0.5,
  "The AI Race: How Shopify Positions Itself to Win": 0.5,
  "O'Reilly Automotive Inc (ORLY) Q2 2025 Earnings Call Highlights: Strong Sales Growth and ...": 0.8,
  "Zacks.com featured highlights Affiliated Managers, Greenbrier, Signet Jewelers, Cognizant Technology and PagSeguro Digital": 0.2,
  "What to Expect From Workday’s Q2 2025 Earnings Report": 0.2,
  "What You Need to Know Ahead of Ross Stores’ Earnings Release": 0.1,
  "Intuit’s Quarterly Earnings Preview: What You Need to Know": 0.0,
  "UAV Propulsion Market Forecast to Reach $11.3 Billion by 2030: Projections by Technology, Component, Platform, MTOW and Region Featuring Profiles of Industry Leaders": 0.5,
  "Better Growth Stock: Costco vs. Visa": 0.5,
  "The Zacks Analyst Blog Highlights Cisco Systems, Caterpillar, Charles Schwab and Elite Pharmaceuticals": 0.5,
  "Company News for Jul 25, 2025": 0.0,
  "Marriott opens largest AC Hotel in North America": 0.5,
  "Got $5,000? 3 Tech Stocks to Buy and Hold for the Long Term": 0.5,
  "S&P 500’s Humming Profit Engine Can Keep Powering Stocks Rally": 0.6,
  "r/Stocks Daily Discussion & Fundamentals Friday Jul 25, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is": 0.2,
  "Bloomington-Normal Marriott hotel completes renovation": 0.5,
  "Starlink Reports Outage Following T-Mobile Satellite Service Launch": -0.5,
  "Intuitive Surgical, Inc. Just Beat Analyst Forecasts, And Analysts Have Been Updating Their Predictions": 0.6,
  "Buy 3 Cybersecurity Stocks to Strengthen Portfolio Security in 2H25": 0.5,
  "Trade Outlooks Cap Wall Street Pre-Bell; Asia, Europe Soft": -0.5,
  "ZURZUVAE® (zuranolone) Receives Positive Opinion from CHMP for the Treatment of Women with Postpartum Depression": 1.0,
  "A Look At The Fair Value Of Vertex, Inc. (NASDAQ:VERX)": 0.1,
  "Regeneron Pharmaceuticals Earnings Preview: What to Expect": 0.5,
  "Should You Hold Atlassian Corporation (TEAM)?": 0.0,
  "ComEd CEO Seeks Rules to Prevent AI From Boosting Energy Bills": 0.2,
  "Bristol Myers shuffles its executive ranks with new CMO": 0.1,
  "What Makes Palo Alto Networks (PANW) an Investment Choice?": 0.5,
  "Warren Buffett Says His $31,500 House Brings Him More Joy Than 10 Mansions — And He'd Rather Eat A McDonald's Burger Than A $100 Meal": 0.8,
  "This Week In AI Chips - Mintlify Advances AI-Driven Knowledge Retrieval with Key Acquisition": 0.6,
  "Dow Jones Futures Rise After Google Lifts AI Giants, Tesla Robotaxi To Launch In San Francisco?": 0.5,
  "IRS Zeroes In on Rental Income - Clear Start Tax Warns Landlords About 2025 Enforcement Surge": -0.6,
  "Trade Desk (NASDAQ:TTD) Is Looking To Continue Growing Its Returns On Capital": 0.6,
  "With 84% ownership of the shares, Mondelez International, Inc. (NASDAQ:MDLZ) is heavily dominated by institutional owners": 0.1,
  "Honeywell vulnerability exposes building systems to cyber attacks": -0.8,
  "T-Mobile US Second Quarter 2025 Earnings: EPS Beats Expectations": 0.6,
  "AI and robotics valuations - Hi everyone, I am thinking of tilting my holdings more towards AI and robotics stocks, for medium-long term “protection” against their potential impact on the labour market, but wouldn’t like to enter at too high/speculative valuation levels. Therefore, how would you rate current valuations for AI (infrastructure and software) and robotics (industrial and next-gen) stocks? For reference, the MSCI World AI and Robotics index trades at 27x forward P/E currently.": 0.2,
  "Cadence Set to Report Q2 Earnings: What's in the Offing?": 0.2,
  "Exchange-Traded Funds, Equity Futures Higher Pre-Bell Friday Buoyed by Tech Earnings": 0.5,
  "HONEYWELL ANNOUNCES QUARTERLY DIVIDEND": 0.2,
  "CEG vs. AEP: Which Utility Is Best Positioned for Long-Term Growth?": 0.0,
  "Robinhood and Alpha Metallurgical have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Exelon to Release Q2 Earnings: What's in Store for the Stock?": 0.0,
  "Xcel Energy to Release Q2 Earnings: Here's What You Need to Know": 0.2,
  "Can ISRG's Strong Q2 Procedure Volume Translate Into Durable EPS Upside?": 0.5,
  "Costco vs. Target: Which Discount Retailer Is the Better Bet?": 0.5,
  "Warner Bros. Discovery, Inc. (WBD) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Why Investors Need to Take Advantage of These 2 Retail-Wholesale Stocks Now": 0.5,
  "Investors Heavily Search CrowdStrike (CRWD): Here is What You Need to Know": 0.5,
  "How Is Navitas Leading AI Data Center Power Platform Expansion?": 0.5,
  "Trump expresses support for Musk's development what does this mean for Tesla and subsidy-related stocks? - Trump recently posted a message clearly stating that he has no plans to cut Musk's government subsidies, despite recent rumors that he would target electric vehicle subsidies once in office. He specifically said he hopes Musk and all American companies can achieve “unprecedented prosperity.” Why is this significant? TSLA has already risen by approximately 12% in July, breaking through": 0.8,
  "(07/25) High Stakes Headwinds- Interesting Stocks Today!! - Hi! I am an ex-prop shop equity trader. This is a daily watchlist for short-term trading: I might trade all/none of the stocks listed, and even stocks not listed! I am targeting potentially good candidates for short-term trading; I have no opinion on them as investments. The potential of the stock moving today is what makes it interesting, everything else is secondary. News: [BOFA's Hartnett Renews Warnings": 0.5,
  "Lam Research (LRCX) Q4 Earnings Preview: What You Should Know Beyond the Headline Estimates": 0.5,
  "Unlocking Q4 Potential of ADP (ADP): Exploring Wall Street Estimates for Key Metrics": 0.5,
  "Insights Into Electronic Arts (EA) Q1: Wall Street Projections for Key Metrics": 0.1,
  "AEP (AEP) Q2 Earnings on the Horizon: Analysts' Insights on Key Performance Measures": 0.2,
  "What Analyst Projections for Key Metrics Reveal About Cognizant (CTSH) Q2 Earnings": 0.2,
  "Time to Buy Micron? - It is already down almost 15 percent due to Few Target price downgrades and concerns over HBMs. But SK Hynix earnings was pretty good. Also Last Agust, September and January Micron recovered its losses within 1-2 days with almost %10 percent gain. So I am confident about Micron I am thinking long term options but What do you think, is it time to buyback some $MU?": 0.6,
  "TXN Q2 Deep Dive: Cyclical Recovery Progresses, but Management Signals Caution Amid Supply Chain Volatility": 0.2,
  "CSGP Q2 Deep Dive: Product Expansion and Sales Force Investments Drive Momentum": 0.8,
  "PCAR Q2 Deep Dive: Tariff Uncertainty, Parts Growth, and Regulatory Shifts Shape Outlook": 0.2,
  "ISRG Q2 Deep Dive: New Platform Drives Procedure Growth Amid Global Expansion": 0.8,
  "CSX Q2 Deep Dive: Service Recovery and Network Upgrades Drive Sequential Improvement": 0.6,
  "Wall Street Analysts See Booking Holdings (BKNG) as a Buy: Should You Invest?": 0.5,
  "Wall Street Analysts See Axon (AXON) as a Buy: Should You Invest?": 0.5,
  "NCMEC and Adobe Partner for Live Facial Reconstruction at Comic-Con to Help Identify San Diego John Doe": 0.5,
  "Here's Why Gilead Sciences (GILD) is a Strong Value Stock": 0.8,
  "Visa, CVS, and 4 More Oversold Stocks Worth a Look Before Earnings": 0.5,
  "Are You a Growth Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "PepsiCo to shut manufacturing operations at US drinks plant": -0.7,
  "Scottish Greens propose holiday homes tax to ‘protect Gaelic language’": 0.2,
  "Should You Forget Tesla and Buy These 2 Artificial Intelligence (AI) Stocks Right Now?": 0.5,
  "REGN Q2 Earnings: Will Higher Dupixent Profits Fuel Growth?": 0.5,
  "AMD positions itself in the inference segment, expecting the total addressable market (TAM) for inference to be larger than that of training - ZF Su has done a remarkable job at AMD, taking it from a struggling company to a company that now has a market capitalization that surpasses Intel's and is well ahead of NVIDIA's. This is not the first time that AMD has been at a disadvantage. This isn't the first time AMD": 0.6,
  "3 Momentum Anomaly Picks as Markets Hit Record High on the Trot": 0.6,
  "Regeneron (REGN) Expected to Beat Earnings Estimates: What to Know Ahead of Q2 Release": 0.5,
  "The Returns At Cadence Design Systems (NASDAQ:CDNS) Aren't Growing": -0.5,
  "Copart Sees Insider Stock Selling": -0.5,
  "Paramount Merger Is Nearly Done. But Skydance Faces These Challenges.": 0.2,
  "Keurig Dr Pepper buys powdered-drinks business Dyla Brands": 0.2,
  "NewPrinces strikes €1bn deal to buy Carrefour stores in Italy": 0.5,
  "Apple, Amazon, Meta Highlight Earnings Calendar; S&P 500 Titan Sets Up Ahead Of Results": 0.5,
  "Electronic Arts (EA) to Report Q1 Earnings: What's in the Cards?": 0.2,
  "Intel Casts Doubts on Next-Gen Chip Manufacturing. What It Means for TSMC and ASML Stock.": -0.5,
  "Nvidia Hits Highs As These Growth Stocks Rally": 0.8,
  "Charter Stock Is Tumbling 14%. Why Earnings Failed to Wow Investors.": -0.7,
  "$1B in Nvidia AI chips smuggled to China despite Trump export controls What does this mean for NVDA investors? - Long NVDA (starter position \\~5% portfolio), no options. Looking to scale in further but watching policy risk closely. News broke today (July 25) that **over $1B worth of high-end Nvidia AI chips** (like H100, A100) were illegally routed into **China** despite recent U.S. export controls imposed under Trump’s administration. According to the report, the chips": -0.6,
  "Stocks to watch this week: Microsoft, Apple, Shell, AstraZeneca and HSBC": 0.0,
  "Coca-Cola's failed coffee investment faces uncertain future": -0.5,
  "Nvidia Stock Touches New Record High. What’s Driving the Rally.": 0.8,
  "Eye Outliers Like Synopsys Early with Money Flows": 0.2,
  "Devon or Diamondback Energy: Which Stock Offers Better Value in 2025?": 0.2,
  "Voxpopme Unveils “Voxpopme Signals” to Deliver Proactive, AI-Powered Consumer Insights": 0.5,
  "Baker Hughes to supply DRAs to Genesis Energy": 0.2,
  "Solid Corporate Earnings Results Support Stocks": 0.8,
  "Like Dividends? These 3 AI Stocks Pay Investors": 0.5,
  "CoreWeave vs. Amazon: Which AI Infra Stock Has More Upside Right Now?": 0.5,
  "Even Patrick Mahomes Can’t Give Airbnb a Quick Win": -0.5,
  "Micron (MU) Down 11.3% Since Last Earnings Report: Can It Rebound?": 0.2,
  "Coca-Cola vs. PepsiCo: Which Soft Drinks Behemoth Stays on Top?": 0.0,
  "2 Magnificent S&P 500 Dividend Stocks Down 20% to Buy and Hold Forever": 0.8,
  "Are You Looking for a High-Growth Dividend Stock?": 0.0,
  "Automatic Data Processing to Report Q4 Earnings: What's in Store?": 0.2,
  "Verisk Set to Report Q2 Earnings: Here's What You Should Know": 0.2,
  "Berkshire Stock Is Losing Its Buffett Premium. Now Is the Time to Buy.": 0.8,
  "Raymond James Raised the PT on Diamondback Energy (FANG), Kept a Buy Rating": 0.6,
  "Adobe (ADBE) Faces a New Challenge as Figma Pursues $16.4 Billion IPO": -0.5,
  "Cisco Systems (CSCO) Tapped for $17B Bahrain’s Digitization Drive": 0.5,
  "Microsoft Corp (MSFT) Patches SharePoint Vulnerability amid Global Havoc": 0.1,
  "Piper Sandler Reaffirms Overweight Rating on SAP Amid Cloud Momentum": 0.8,
  "TSX up 41 Points at Midday With Most Sectors Lower": -0.4,
  "Okta (OKTA) Strengthens Cybersecurity Stack Through New Palo Alto Integration": 0.6,
  "Adobe (ADBE) Expands GenStudio with AI Tools for Smarter Ad Creation": 0.6,
  "BofA Securities Raises Kraft Heinz (KHC) Price Target to $29 Amid Potential Spin-Off": 0.6,
  "Chevron Stock Is Flexing Its Muscles. 3 More Attractive Energy Plays to Watch.": 0.6,
  "Palantir highs, Phillips 66 Q2 beat, Comcast's Versant spin-off": 0.5,
  "What do you think about Norwegian Cruise Line (NCLH)? - I originally bought 100 shares of NCL when it was $17.70 last October. Did it for the $100 onboard credit for having it. It went to just over $29 in January then dropped to the mid-teens after the current president started his thing with the tariffs. I saw what it's capable so I bought another 700 shares. It's been on a health climb over the": 0.6,
  "Kraft Heinz's Q2 Earnings on Horizon: What Surprise Awaits Investors?": 0.2,
  "S&P 500, Nasdaq Composite Hit New Highs as Mega-Cap Earnings, Trade Deals Support Risk Sentiment": 0.8,
  "LCID thought? - Lately, I’ve been monitoring LCID closely and I am wondering what’s the consensus here. Regardless of melon, I think TSLA is the king in EV market. However, I think LCID has a niche to eat up the market share from TSLA. Yes, they are not profitable and the stock has been going south since its IPO. I also understand this is like a hit or miss due to the risk it possesses.": 0.2,
  "UiPath vs. AppLovin: Which AI-Driven Tech Stock is Purchase-Worthy?": 0.5,
  "SS&C Technologies Stock Earns IBD Rating Upgrade": 0.5,
  "Shale Stumbles Again as U.S. Rig Count Drops Further": -0.5,
  "Netflix (NFLX) Premieres Epic K-Wave Thriller \"Trigger\" As Global Content Expands": 0.6,
  "PepsiCo (PEP) Raises Quarterly Dividend By 5% To US$1.42 Per Share": 0.5,
  "AstraZeneca (LSE:AZN) Showcases Promising Results For Gefurulimab In Global Myasthenia Gravis Study": 0.8,
  "Why Gilead Sciences Stock Just Popped": 0.5,
  "Why Charter (CHTR) Shares Are Getting Obliterated Today": -0.8,
  "For Sale: A $35 Million Historic Home Near Harvard": 0.5,
  "Marjorie Taylor Greene Increases These 2 Stocks In Portfolio, Including This AI Name Up Over 100% YTD": 0.5,
  "CHTR Misses on Q2 Earnings, Reports Modest Y/Y Revenue Growth": -0.2,
  "Broadcom's record, Charter's Q2 miss, Newmont's buyback plan": 0.2,
  "How the rise of dupes and store brands could change the way you shop": 0.2,
  "Equities Rise Intraday as Markets Track Earnings, Trade Developments": 0.5,
  "AI Chip Giant Broadcom, 2 Others Hit New Highs As Stock Market Rally Extends Gains": 0.6,
  "Why Gilead Sciences (GILD) Stock Is Up Today": 0.5,
  "JAKKS Pacific Reveals All-New SUPER MARIO, THE SIMPSONS, DC X SONIC THE HEDGEHOG, BENDY and DOG MAN Toys and Collectibles at San Diego Comic-Con 2025": 0.6,
  "CHICAGO GOURMET 2025 POWERED BY INVESCO QQQ: PREMIER CULINARY FEST, TICKETS ON SALE JULY 25": 0.5,
  "Forecasts for Hotter US Weather Boost Nat-Gas Prices": 0.5,
  "Sector Update: Consumer Stocks Rise in Late Afternoon Trading": 0.5,
  "Equity Markets Higher Ahead of US-EU Trade Talks": 0.8,
  "Oil Rig Count Drops by 7; Crude Prices Set for Back-to-Back Weekly Decline": -0.6,
  "What a mall/midcap companies relentlessly focus on product/customer satisfaction. - Title kind of says it. What publicly traded (preferably small/midcap) companies are tirelessly focused on product or creating services that match customer needs? As an exemplar, but large cap company, Costco does this exceptionally well and has been a long term reason for the success of the business.": 0.6,
  "Four Reasons To Watch This Nvidia Partner And Agentic AI Stock. A New Breakout Is Just One.": 0.5,
  "Bad Break In Cybersecurity Stocks Led To CIBR Trade Exit": -0.6,
  "S&P 500, Nasdaq Rise to Records as Trump-Fed Tensions Ease, EU Trade Talks Loom": 0.6,
  "Equity Markets Close Higher Ahead of Trump's Meeting With European Commission President": 0.8,
  "Stocks to Watch Friday: Intel, Centene, Paramount, Boston Beer": 0.5,
  "Stock Market Week Ahead: The Fed, July Jobs, Tariff Deadline + Mag 7 Earnings": 0.5,
  "S&P 500, Nasdaq Extend Record Run as Wall Street Posts Weekly Gains": 0.8,
  "Strategy Stock Issues $2.8?billion 9% 'Stretch' Shares": -0.2,
  "Best Stock to Buy Right Now: Apple vs. Costco Wholesale": 0.5,
  "What Can Derail This - This is an overall market discussion. The purpose is to get everyone’s opinion on where we are in the market as a whole. Markets hit all time highs seemingly on a daily basis. VIX is below 15. Meme stocks and zero revenue companies are flying again. Opendoor, kohls, oklo, RKT, ect… all moving on nothing but retail dreams. M2 money supply at all time highs (printer continuing to go brrr).": 0.2,
  "Magic Formula & Cyclicality - I was reviewing the well written books from Joel Greenblatt and Tobias Carlisle who are advocating for the, in their view, still valid magic formula approach and the thesis that it's still working because psychologically it's hard to follow strictly. I think the magic formula (Earnings Yield & Roic) is kind of the essence of value (Earnings Yield) & quality (Roic) investing. However what boggles my mind is how no": 0.5,
  "The Trade Desk (TTD) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Synopsys (SNPS) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "AppLovin (APP) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "MercadoLibre (MELI) Stock Falls Amid Market Uptick: What Investors Need to Know": 0.1,
  "CrowdStrike Holdings (CRWD) Laps the Stock Market: Here's Why": 0.5,
  "Lululemon Needs Overseas Growth, Says J.P. Morgan. Plus, Valero, Cleveland-Cliffs, and More Stocks.": 0.2,
  "ON Semiconductor Corp. (ON) Outperforms Broader Market: What You Need to Know": 0.6,
  "Why Comcast Stock Sank Today": -0.5,
  "Astrazeneca (AZN) Stock Declines While Market Improves: Some Information for Investors": -0.5,
  "Must build out infrastructure to achieve AI dominance: Onsemi CEO": 0.2,
  "Mag 7 earnings, Fed meeting, PCE, jobs report: What to Watch": 0.2,
  "Tariff Deadline, Fed Meeting, Jobs Report, Tech Earnings: What to Watch Next Week": 0.5,
  "Texas Instruments Incorporated (TXN): A Bull Case Theory": 0.5,
  "CoStar Group, Inc. (CSGP): A Bull Case Theory": 0.5,
  "Tesla Clings to the Trillion-Dollar Club. How to Stay In? AI.": 0.5,
  "IDACORP, Inc. (IDA): A Bull Case Theory": 0.5,
  "IDEXX Laboratories, Inc. (IDXX): A Bull Case Theory": 0.5,
  "CDW Corporation (CDW): A Bull Case Theory": 0.5,
  "Starbucks Faces a New Rival That Won’t Let Up": -0.6,
  "With the VIX being so low, is it time to buy UVIX? - Hey everyone, sorry if this has been asked recently, but I couldn't find anything. Basically, I am too scared to invest in anything right now - the VIX is below 15, and we are at 75/100 on the Greed/Fear index. I have been thinking of buying UVIX or UVXY, would that be a good idea? I understand that it is *risky* and": -0.5,
  "Excess & Surplus Lines Fronting Companies - While listening to Kinsale Capital Group’s Q2 Con call I got stuck with something which Brian Haney, President and COO said about the E&S industry is facing right now. “The market is clearly more competitive than a year ago. However, much of the aggressive pricing is coming from MGAs and front-end companies. While there are some highly regarded MGAs out there with long track records of success, the": 0.2,
  "any book recommendation for investing? - I heard some people read hundreds of books before investing. I guess they may have read all sorts of books on accounting, finance, the economy, and so on. I am based in the UK. What do people usually read? I know that there are many technical analysis methods. Which book is good for such information? How about books about understanding financial statements?": 0.2,
  "Regeneron Pharmaceuticals, Inc. (REGN) Acquires 23andMe Assets in $256M Deal": 0.5,
  "Vertex Pharmaceuticals Incorporated (VRTX) Launches JOURNAVX, First Non-Opioid Acute Pain Treatment": 0.8,
  "Here Is What You Need To Know Before Investing In PDD Holdings Inc. (PDD)": 0.0,
  "Jim Cramer Says: “Don’t Be in a Hurry to Buy Lam Research”": -0.6,
  "Jim Cramer Notes “PepsiCo Sold a Ton of Junk Food.”": -0.5,
  "Jim Cramer Highlights General Mills as a 5% Yield Play in a Volatile Environment": 0.6,
  "Jim Cramer Say’s Notes That Campbell’s Not PepsiCo, But Still in the Same League": 0.2,
  "Jim Cramer on Marvell: “It Should Have Gone Up After That Last Quarter”": 0.2,
  "Oversold Honeywell (HON) Could Offer Industrial Strength with Dividend Reliability": 0.6,
  "Analog Devices (ADI) Enters Oversold Territory with a Dividend Worth Watching": 0.6,
  "AP Top Financial News at 1:04 a.m. EDT": 0.0,
  "Comcast (CMCSA) Looks Oversold: Here’s Why Dividend Investors Should Take a Second Look": 0.6,
  "What are we investing in during these crazy times? - So in April when stock prices were down, I scraped up all the cash I could and added more of what currently hold. Since I’ve been just saving up to have some cash on hand and now I’m ready to put more money in the market but like everyone I’m concerned the bubble will burst soon but don’t want to sit and wait so I": 0.2,
  "AstraZeneca’s (AZN) Dividend: Resilient, Predictable, and Built on Innovation": 0.8,
  "Is Linde (LIN) a Safe Bet for Dividend Investors Seeking Industrial Exposure?": 0.2,
  "Charter Communications Inc (CHTR) Q2 2025 Earnings Call Highlights: Steady Growth Amid ...": 0.5,
  "Billionaires Sell Apple Stock and Buy a Stock-Split Stock Up 510% in the Last Decade": 0.5,
  "This Tech Giant Is the Best Artificial Intelligence (AI) Chip Stock to Buy Right Now": 0.8,
  "2 Growth Stocks to Invest $1,000 in Right Now": 0.5,
  "T-Mobile (TMUS) Impresses With Whopping Gains on 5th Day": 0.8,
  "/r/Stocks Weekend Discussion Saturday - Jul 26, 2025 - This is the weekend edition of our stickied discussion thread. Discuss your trades / moves from last week and what you're planning on doing for the week ahead. Some helpful links: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips *": 0.2,
  "2 Bargain Stocks That Could Double Your Money": 0.8,
  "1 Top Cryptocurrency to Buy Before It Soars 17,400%, According to Michael Saylor": 1.0,
  "Where Will Intuitive Surgical Be in 5 Years?": 0.2,
  "With 80% institutional ownership, Axon Enterprise, Inc. (NASDAQ:AXON) is a favorite amongst the big guns": 0.6,
  "3 Brilliant Growth Stocks to Buy Right Now": 0.8,
  "AI Data Center Plays, DoorDash Lead Five Stocks Near Buy Points": 0.5,
  "Palo Alto Networks, Inc.'s (NASDAQ:PANW) high institutional ownership speaks for itself as stock continues to impress, up 3.8% over last week": 0.8,
  "These 7 Stocks Are Analyst Favorites For Magnificent Earnings Growth; Arista, Micron Lead": 0.8,
  "Airbnb's Cash Cow Can Thrive Despite Its Challenges": 0.6,
  "Analysts Have Made A Financial Statement On Honeywell International Inc.'s (NASDAQ:HON) Second-Quarter Report": 0.1,
  "Investing in Starbucks (NASDAQ:SBUX) a year ago would have delivered you a 31% gain": 0.8,
  "Shopify Stock Is Now An AI Play, But Google May Pose A Threat": 0.1,
  "Charter Communications (CHTR) Falls 18% as Customer Count Continues to Drop": -0.8,
  "Intel (INTC) Declines 8.5% on Dismal Earnings, New Round of Layoffs": -0.8,
  "China, Chips, and Chaos: Where Smart Investors Are Putting Their Money Now": 0.5,
  "r/Stocks Weekly Thread on Meme Stocks Saturday - Jul 26, 2025 - The meme stock scheduled posts will now run weekly and post Saturday afternoon and won't be a sticky; you're probably seeing this because automod sent you here! [Full list of meme stocks here.](https://www.reddit.com/r/stocks/wiki/meme-stocks) This will be updated every once in a while. ------ Welcome traders who just can't help them selves discuss the same exact stock that's been discussed 100s of times a": 0.1,
  "China's demand for repairs to U.S.-banned NVIDIA AI chips surges report says - China is seeing a surge in demand for a business that theoretically shouldn't exist: repairing Nvidia's advanced artificial intelligence chipsets that the U.S. has banned from being exported to its trade and technology rivals, Reuters reported on Friday. About a dozen boutique firms now specialize in repairing Nvidia's H100 GPUs, chips that somehow made it into China despite the restrictions, according to": 0.2,
  "The 'Dean of Valuation' Says Most Companies Buying Bitcoin Are Making a Classic CEO Mistake—Here's His Brutal Reality Check": -0.6,
  "Netflix (NFLX) Premieres K-Content Thriller 'Trigger' In Global Release": 0.5,
  "Honeywell International (HON) Declares US$1.13 Quarterly Dividend Payment": 0.5,
  "Cathie Wood Just Loaded Up on This High-Flying Crypto Stock. Should You Follow Her Lead?": 0.5,
  "Massive SPY PUT Volume into August & September - Hedging or Warning Sign ? - There's a massive amount of put contacts expiring on August 15th and September 19th. Is something major coming next week or month? Or is this just hedging? Options are relatively cheap, but the volume is huge. With Trump's tariffs potentially coming August 1st, no rate cuts in sight and the market still pushing higher - are stocks really this unstoppable,": -0.5,
  "FUBO as a possible long term investment? - Wondering how you all see FUBO in the future. It started as a sports streaming service and now does news, entertainment as well. Streaming is a tough market, especially with big competitors like YouTube TV, Netflix. Their last earnings haven’t been great, but they have improved. Back in January there was news it was going to merge with HULU, causing the stock to go from about $1.25": 0.2,
  "Rising Fiscal Deficits Drive Billions Into Credit": 0.2,
  "Cathie Wood reveals strategy to outsmart Wall Street": 0.5,
  "This Warren Buffett Stock Is Reportedly Contemplating a Huge Move": 0.5,
  "Everyone’s busy chasing Nvidia. Meanwhile, SNOW is quietly becoming the AWS of AI. - I met a Snowflake engineering manager last week. Super smart guy, went to Harvey Mudd and actually studied economics before moving to CS. I asked him, what’s going on your stock? It got crushed in 2022 and never seem to recovered. He hesitated and gave me a smile. We then had a 2-hour long conversation where he told me the pre-consensus": 0.2,
  "Healthcare (and Biogen) are heavily underinvested, and big finance are starting to realize that - Healthcare (and Biogen) is heavily underinvested post COVID, and big finance are starting to realize that Fellow Stock pickers, I am following Biogen in more detail and healthcare sector in general for some time now and starting to see patterns. **Biogen is not liked by market**; it is hated due to bad messup with the FDA on Aduhelm, however, it": 0.2,
  "The Median Retirement Savings for American Households Is $87,000. Here Are 3 Incredible Stocks to Buy Now and Hold for Decades.": 0.5,
  "Stocks which will benefit the most if Trump’s Tariff actions are ruled to be illegal… - The US Court of Appeals will hear oral arguments regarding the legality of Trump’s tariff actions on July 31, 2025. A decision within weeks is expected thereafter, and likely further appeal to the US Supreme Court. If the Court upholds Trump’s actions, it seems to be a status quo event. But if it is ruled that the President does": 0.2,
  "Intuitive Surgical, Inc. (ISRG): “I Really Like” It, Says Jim Cramer": 0.8,
  "SPY bears will get a reprieve from the pain. But they'd be wise to jump on the bull side. - We currently have a market that is pricing in a goldilocks regime (inflation down, growth up). We have growth expectations historically low. Recession level low. That is not when corrections happen, so the market is correct in its growth pricing. Growth will slow but not to the level consensus believes it will. With regards to": 0.6,
  "I have a problem - Hello everyone, I have been investing in the stock market for 5 years, I started at the beginning of 2021. I was doing moderately well, but invested a big amount of my portfolio in a company that eventually went bankrupt. Since then, I’ve thankfully been more careful and not repeated the same mistake. Here’s my issue, I’ll find a stock that seems to have a great investment thesis behind it": -0.2,
  "Texas Instruments Incorporated (TXN)’s Stock Fell Because Of Management’s Tone, Says Jim Cramer": -0.5,
  "The Wendy’s Company (WEN) “Had The Worst Quarter,” Says Jim Cramer": -0.6,
  "Figuring out the Figma IPO! (DD on $FIG) - # I love IPOs. The last IPO I thought was amazing was Coreweave, and I posted about it [(and how far we've come!).](https://www.reddit.com/r/stocks/comments/1jllj7u/coreweave_the_biggest_ipo_of_2025_dd_on_crwv/) Figma is IPOing on the 31st and it's going to be a big one. **Figuring Figma Out:** What is Figma? Figma is a \"cloud-based collaborate design platform\". The company boasts of being able to help you \"Prompt, code, and design from first idea": 0.6,
  "Worried About a Bear Market? 3 Reasons to Buy PepsiCo Like There's No Tomorrow": 0.6,
  "LUNR and AMTM, are these good picks? - I've been looking into aerospace/defense and have narrowed down on these two companies, AMTM is more military defense, and LUNR is more space exploration, if I'm not mistaken. The common thing these two companies share is the fact that they both have government contracts, which gives me reason to believe they'll be profitable in the future. I am currently leaning more towards LUNR as of now, but": 0.5,
  "Should Netflix Be More Like Walt Disney?": 0.0,
  "Why Kimberly-Clark, CareTrust, And Comcast Are Winners For Passive Income": 0.5,
  "Volatility Play? - As an investing noob, l've been working hard on understanding the VIX structure in hopes of making a Uvix play. I've been looking at august, 1st month Futures (17.91) and September, second month (19.77), and waiting patiently for possible flattening to make my move just before backwardation. So far the structure is still in strong contango so l'm waiting. Based on what l've said above, does it appear I have a handle": 0.2,
  "Cadence (CDNS) Reports Earnings Tomorrow: What To Expect": 0.2,
  "Should You Buy Palantir Technologies Stock Before Aug. 4?": 0.2,
  "Should You Buy Palantir Technology Stock Before Aug. 4?": 0.2,
  "Better Beverage Stock: Coca-Cola vs. PepsiCo": 0.5,
  "My 3 Favorite Stocks to Buy Right Now": 0.0,
  "COST Stock Price Prediction: Where Costco Could Be by 2025, 2026, and 2030": 0.5,
  "INTC Stock Price Prediction: Where Intel Could Be by 2025, 2026, and 2030": 0.5,
  "Question: Nasdaq settlement cycle for record date (forward split) - I have a question and require your expertise. Background \\-A stock will make a forward stock split (8 for 1) \\-Record date is Monday Aug 11, 2025 \\-Post split trading is on Thursday Aug 14, 2025 Questions: 1) When do I need to buy the shares to be eligable. I thought Aug 11 during market hours could be sufficient, however I understand Nasdaq has a": 0.1,
  "Breaking down Netflix viewership in 1H25": 0.0,
  "What Are the 3 Best Bargain Artificial Intelligence (AI) Stocks to Buy Right Now": 0.5,
  "Love Palantir Technologies? These 3 Artificial Intelligence Stocks Could Have Much More Upside.": 0.8,
  "Doss, AI-Native ERP, Acquires Shopify Inventory Leader Genie to Supercharge E-Commerce and Partner Growth  Genie Founder Sebastiaan Debrouwere Joins as Partnerships Head": 0.5,
  "Diamondback Energy (NASDAQ:FANG) shareholders have earned a 35% CAGR over the last five years": 0.8,
  "Estimating The Intrinsic Value Of NXP Semiconductors N.V. (NASDAQ:NXPI)": 0.1,
  "Federal Reserve meeting, July jobs report, and Big Tech earnings: What to watch this week": 0.5,
  "Broadcom is no longer the 'poor man's Nvidia' in the AI race": 0.5,
  "Is Amgen Inc. (NASDAQ:AMGN) Trading At A 50% Discount?": 0.2,
  "The Smartest Growth Stock to Invest $5,000 in Right Now": 0.5,
  "Is SentinelOne Stock a Buy, Sell, or Hold in July 2025?": 0.0,
  "5 silly earnings season stock price moves!": -0.5,
  "'Probably Should Have Listened To Him': NFL Super Bowl Champion Saquon Barkley Says Michael Saylor Told Him To 'Throw It All In' Bitcoin": 0.5,
  "2 Healthcare Stocks That Are Losing to the S&P 500 This Year": -0.5,
  "Intel CEO outlines 'hard but necessary decisions'; Trader Guilfoyle: CEO Tan 'Has a Chance'": 0.2,
  "What’s Next for Hyperliquid’s HYPE Token? What Wall Street and Analysts Are Saying": 0.5,
  "Faster trading.... Chase is slow - I often scalp trade or day trade and seconds matter. Chase takes 30 to 60 seconds to identify, enter and submit a trade. The process is slow; I trade there infrequently. Webull is much faster for example but the requirements for take profit and stop loss are too tight. What advice can you all give for a fast platform that allows faster trades with fewer restrictions like, for example...": -0.6,
  "Micron Technology, Inc. (MU) Launches Industry’s Highest-Density, Radiation-Tolerant SLC NAND Flash Memory": 0.8,
  "Intel Corporation (INTC) Releases Q2 Financial Results; Beats Revenue Expectations": 0.8,
  "UBS Raises PT on Lam Research Corporation (LRCX) from $95 to $120": 0.8,
  "Workday, Inc. (WDAY) Launches Subsidiary for U.S. Government; Partners with Seattle University": 0.5,
  "Loop Capital Initiates Coverage on Autodesk, Inc. (ADSK) with ‘Hold’ Rating": 0.2,
  "Keurig Dr Pepper Second Quarter 2025 Earnings: EPS Misses Expectations": -0.7,
  "U.S. says tariff deadline of Aug 1 is firm, no extensions - https://www.ctvnews.ca/world/trumps-tariffs/article/us-says-tariff-deadline-of-aug-1-is-firm-no-extensions/ >WASHINGTON - The U.S. deadline of August 1 for imposing tariffs on its trading partners is firm and there will be no extensions, Commerce Secretary Howard Lutnick said Sunday. > >“So no extensions, no more grace periods. August 1, the tariffs are set. They’ll go into place. Customs will start collecting the money, and off we go,” Lutnick told “Fox News Sunday.”": -0.6,
  "ASML: Limited China Risk, Leading-Edge Exposure Could Drive Outperformance": 0.8,
  "China, US to extend tariff pause at Sweden talks by another 90 days: sources - https://www.scmp.com/economy/china-economy/article/3319604/china-us-extend-tariff-pause-sweden-talks-another-90-days-sources >Beijing and Washington are expected to extend their tariff truce by another three months at trade talks in Stockholm beginning on Monday, according to sources close to the matter on both sides. > >China and the United States agreed in May to remove most of the heavy tariffs levied on each other’s goods for 90 days while continuing trade": 0.6,
  "Individual stocks - what do you look for in SEC filings? - So I think Jack Bogle did more than anyone else to help the average retail investor. That said, the single index fund philosophy essentially locks up your money during your accumulation years - which might not be a bad thing - if you want to control your taxes. That along with zero ers, make individual stocks a pretty compelling investment right now. Stating": 0.5,
  "Michael Saylor Is Bringing Bitcoin-Backed Money-Market-Style Vehicle to Wall Street: NYDIG": 0.5,
  "AMD CEO says US fabs now match Taiwan on yield, with only slightly higher cost - is this a big deal? - Came across an interview, Lisa Su (AMD) recently mentioned that semiconductor manufacturing in the US is going surprisingly well - yields are now equivalent to what they're getting in Taiwan, and the cost difference is just in the low single digits. That caught my attention. Not too long ago, the general narrative was": 0.6,
  "Am I missing something with TER? Surprised the stock hasn't popped more after the Amazon deal - So Teradyne (TER) just got confirmed as the supplier behind Amazons new Vulcan warehouse robot through their Universal Robots division. The stock jumped 6% when the news broke a couple weeks ago, but honestly I'm shocked it hasn't sustained bigger gains. This company has some seriously solid capabilities, theyre not just a semiconductor test equipment play anymore. Their": 0.5,
  "Aurora Innovations (AUR) - Current front runner in autonomous trucking software and hardware - https://aurora.tech/ Looking into AUR next. Autonomous trucking hardware/software company. Summary: • Cash on hand: $1.15–1.2B • Burn rate: $142M/Q or $600–700M/annually • Runway: ~6–7 quarters (18–22 months), assuming no change • To extend this runway, Aurora must either reduce burn, raise new funds, or both before cash reserves are exhausted. Aurora Innovation has established strategic partnerships with several leading companies to": 0.5,
  "Cisco Systems (CSCO): A Steady Performer Among the Dogs of the Dow": 0.5,
  "Dogs of the Dow: Why Amgen’s (AMGN) Dividend Power Makes it a Standout Pick": 0.6,
  "Trump Says He Has A Tariff Deal With European Union, Avoiding Trade War - https://www.wsj.com/economy/trade/trump-says-he-has-a-tariff-deal-with-european-union-avoiding-trade-war-3ca72c5d > President Trump said he reached a trade agreement on Sunday with the European Union, avoiding a damaging trade war with the U.S.’s largest trading partner and marking his biggest deal so far in his attempt to remake the global trading system through higher tariffs for U.S. trading partners. > Trump made the announcement at Trump Turnberry, his seaside golf": 0.8,
  "Itch.io is the latest marketplace to crack down on adult games": -0.5,
  "T-Mobile launches a cheap new service amid customer struggles": 0.1,
  "Disney’s ‘Fantastic Four’ Rockets to $118 Million Debut": 0.8,
  "1 Remarkable Stat That Highlights Just How Amazing Netflix Stock Has Been in Recent Years": 0.8,
  "Best non-USD investments due to weak dollar? - The weakening of the USD has evaporated much of my gains in US stock. What are some solid options in EUR? Or is the drop in USD \"done\", so it would be better to now buy cheap and hope it will get stronger again? On the European side I'm already in some individual defense and energy stock, and a European ETF.": -0.2,
  "Ursula von der Leyens official statement on the tariff “deal” - https://ec.europa.eu/commission/presscorner/detail/en/statement_25_1915 Her statement offers more clarity than Trumps garbling. 15% across the board (with some exceptions), 20% is what liberation day rate was so I guess this is slightly better? The prior 4.8% was great too but we can’t always have nice things I guess.": 0.2,
  "AT&T Inc. (T) Is Very Good At What It Does, Says Jim Cramer": 0.8,
  "T-Mobile US, Inc. (TMUS) Is Very Good At What It Does, Says Jim Cramer": 0.8,
  "Dover Corporation (DOV) Had An “Unbelievable” Quarter, Says Jim Cramer": 0.8,
  "Honeywell International Inc. (HON): “I Think You Buy” It, Says Jim Cramer": 0.6,
  "Forget a Takeover From Autodesk, PTC Is a Great Stock to Buy Anyway. Here's Why.": 0.8,
  "(Item 2.02) . Results of Operations and Financial Condition. On July 28, 2025 Cadence Design Systems, Inc. (“Cadence”) issued a press release announcing its financial results for the quarter ended June 30, 2025. A copy of the press release is attached hereto as Exhibit 99.01 and a copy of the commentary by the Chief Financial Officer of Cadence regarding Cadence's financial results for the quarter ended June 30, 2025 is attached hereto as Exhibit 99.02, and the": 0.1,
  "(Item 1.01) Entry into a Material Definitive Agreement. As previously disclosed, Cadence Design Systems, Inc. (“Cadence”) has been responding to subpoenas received from the Bureau of Industry and Security (“BIS”) of the U.S. Department of Commerce in February 2021 and the U.S. Department of Justice (the “DOJ”) in November 2023. In December 2024, Cadence began discussions with BIS and the DOJ regarding their preliminary findings and a potential resolution. In June 2025, Cadence, BIS and the DOJ": 0.1,
  "(Item 8.01) . Other Events. PepsiCo Senior Notes Offering. On July 21, 2025, PepsiCo, Inc. (“PepsiCo”) announced an offering of €500,000,000 aggregate principal amount of its 3.450% Senior Notes due 2037 (the “2037 Notes”) and €500,000,000 aggregate principal amount of its 4.050% Senior Notes due 2055 (the “2055 Notes,” and together with the 2037 Notes, the “Notes”). Deutsche Bank AG, London Branch, HSBC Bank plc and Mizuho International plc were joint book-running managers for the offering of": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. As previously announced, Warner Bros. Discovery, Inc. (the “Company”) plans to separate the Company, in a tax-free transaction (the “Separation”), into two publicly traded companies (referred to herein, respectively, as “Warner Bros.” and “Discovery Global”). Appointment of Chief Financial Officer On July 28, 2025, the Company announced that Fraser Woodford will be appointed as the Chief\n\n(Item 5.02) of Form 8-K, the Company will amend this Current Report on Form 8-K within four business days after such information is determined or becomes available. There are no family relationships between Mr. Woodford and any director or executive officer of the Company, and no arrangements or understandings between Mr. Woodford and any other person pursuant to which Mr. Woodford was appointed to serve as Chief Financial Officer of the Company. There are no transactions in\n\n(Item 5.02) of Form 8-K, the Company will amend this Current Report on Form 8-K within four business days after such information is determined or becomes available. There are no family relationships between Mr. Rauch and any director or executive officer of the Company, and no arrangements or understandings between Mr. Rauch and any other person pursuant to which Mr. Rauch was appointed to serve as Chief Accounting Officer of the Company. There are no transactions in": 0.1,
  "(Item 8.01) Other Events. ATM Updates On July 28, 2025, MicroStrategy Incorporated d/b/a Strategy (“Strategy” or the “Company”) announced updates with respect to its at-the-market offering programs: ATM Program Summary During Period July 21, 2025 to July 27, 2025 As of July 27, 2025 Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) Common ATM - - - $17,042.7 Securities Offered: Class A Common Stock, $0.001 par": 0.1,
  "Thoughts on Ambiq Micro (AMBQ) debuting next week - Just heard that Ambiq Micro (AMBQ) is making their IPO next week. They seem like a really good company to invest in, making low-power SoC chips and Google & Samsung being their customers. Working on a deal with Mouser Electronics that could increase their customer base. They seem to possess SPOT (Sub-threshold Power Optimized Technology) tech in their chips, which makes them power efficient. Looks like": 0.8,
  "Harbour BioMed Announces Positive Profit Alert for 2025 Interim Results": 0.8,
  "Robinhood stock HOOD symbol, not app - I bought way too many shares of Robinhood when it ipo’ed back in 2021 I was down like 70%/80% for years and now I’m up 200% I put a substantial amount in…like probably about 8% of my total funds Is now the time to sell some? Many tech stocks like NVDA, Google, Meta, Coinbase, and others have risen a lot over the last couple years I am somewhat": 0.2,
  "Starbucks (SBUX) Reports Earnings Tomorrow: What To Expect": 0.5,
  "Mondelez (MDLZ) Q2 Earnings: What To Expect": 0.0,
  "Booking Earnings: What To Look For From BKNG": 0.2,
  "Electronic Arts (EA) Reports Q2: Everything You Need To Know Ahead Of Earnings": 0.5,
  "Datadog (DDOG): 3 Reasons We Love This Stock": 0.6,
  "Vertex Pharmaceuticals (VRTX): Buy, Sell, or Hold Post Q1 Earnings?": 0.2,
  "3 Reasons to Buy Walmart Stock Like There's No Tomorrow": 0.8,
  "1 Consumer Stock on Our Buy List and 2 That Underwhelm": 0.2,
  "2 Unpopular Stocks That Deserve a Second Chance and 1 We Ignore": 0.2,
  "1 Large-Cap Stock to Keep an Eye On and 2 That Underwhelm": -0.5,
  "3 Profitable Stocks That Concern Us": -0.5,
  "1 Large-Cap Stock to Research Further and 2 We Ignore": 0.0,
  "2 Cash-Heavy Stocks on Our Buy List and 1 We Find Risky": 0.2,
  "3 Nasdaq 100 Stocks on Our Watchlist": 0.0,
  "1 Profitable Stock for Long-Term Investors and 2 Facing Challenges": 0.5,
  "Mondelez International (MDLZ): A Strong Contender Among Food Dividend Stocks": 0.8,
  "Why Starbucks (SBUX) is Gaining Attention Among Food Dividend Investors": 0.5,
  "Kraft Heinz’s (KHC) Role in the Food Dividend Market: What Investors Should Know": 0.2,
  "/C O R R E C T I O N -- DIGITIMES ASIA/": 0.0,
  "Tesla has just purchased capacity from the once-empty Samsung Taylor, TX fab. What does this mean for US chip manufacturing capacity? - So picture this: Samsung US Fab is full because Elon is walking and sleeping in the fab TSMC Arizona fab is fully booked until 2027 Trump puts a 25% tariff on 80% of your chips coming from Taiwan and South Korea. And in 1 year it may be 100% tariff. Will you pay": 0.2,
  "The 5 Most Interesting Analyst Questions From NXP Semiconductors’s Q2 Earnings Call": 0.5,
  "Costco (COST) Stock Reaffirmed Outperform After Strong June Sales and Warehouse Expansion": 0.8,
  "T-Mobile (TMUS) Stock Upgraded Despite Concerns Over Fiber Strategy and Market Slowdown": 0.2,
  "BofA Sees Upside in AT&T (T) With Bonus Depreciation Boost": 0.6,
  "Linde (LIN) to Invest $400M in Louisiana ASU for Low-Carbon Ammonia Project": 0.8,
  "BMO Cuts Amgen (AMGN) Price Target After Mixed MariTide Data at ADA Conference": -0.5,
  "PepsiCo (PEP) Partners With Cargill to Advance Regenerative Farming Across Corn Supply Chain": 0.6,
  "TD Cowen Remains Bullish on Gilead Sciences (GILD)": 0.6,
  "Canaccord Reiterates a Buy Rating on Regeneron Pharmaceuticals (REGN)": 0.6,
  "Citi Maintains a Buy Rating on Gilead Sciences (GILD)": 0.6,
  "BofA Reiterates a Sell Rating on Amgen (AMGN)": -0.5,
  "3 UK Stocks Estimated To Be Up To 47.5% Below Intrinsic Value": -0.8,
  "Synthetic rescue: Insmed explores a new frontier in genetic therapeutics": 0.6,
  "How to stop the listings exodus that's blighting the City": -0.5,
  "HCSA Community Services and Tan Tock Seng Hospital Sign MOU to Hepatitis C Elimination in Singapore": 0.8,
  "Metaplanet Buys 780 More Bitcoin, Increases Stash to 17,132 BTC": 0.5,
  "Riveron CFO Tony Ciotti on breaking barriers between finance and operations": 0.5,
  "PepsiCo's Snack‑Soda Synergy: A Consumer Combo Worth Buying": 0.8,
  "Is It Too Late to Buy Palantir Stock?": 0.0,
  "Xpeng begins deliveries in Indonesia": 0.5,
  "Can Palantir Be a Trillion-Dollar Company?": 0.5,
  "Is Chipotle Stock a Buy After Its Second-Quarter Earnings?": 0.2,
  "STV warns over profits as advertising market slumps and TV projects delayed": -0.7,
  "Trending tickers: Palantir, Samsung, Heineken, Volkswagen and AstraZeneca": 0.0,
  "Boundless Devices announces the launch of the Motorola MQ20 Wi-Fi 6E Mesh Router with 6 GHz Coverage for Homes": 0.8,
  "'Really, really scary': Dave Ramsey urges caller not to join grandma's scheme to deceive IRS about $1 million debt": -0.8,
  "‘Flying Car’ Industry Taxis Toward Takeoff": 0.5,
  "Why companies are leaning into skills-first, AI-enabled employment models": 0.5,
  "lululemon athletica's Quarterly Earnings Preview: What You Need to Know": 0.2,
  "IMFINZI® (durvalumab) granted Priority Review and Breakthrough Therapy Designation in the US for patients with resectable early-stage gastric and gastroesophageal junction cancers": 0.6,
  "Kraft Heinz and Live Nation Partner to Bring Iconic Flavors to Fans Nationwide": 0.5,
  "Option Volatility And Earnings Report For July 28 – Aug 1": 0.0,
  "At US$310, Is It Time To Put Charter Communications, Inc. (NASDAQ:CHTR) On Your Watch List?": 0.5,
  "Possible Bearish Signals With Marvell Technology Insiders Disposing Stock": -0.7,
  "Is There An Opportunity With Adobe Inc.'s (NASDAQ:ADBE) 34% Undervaluation?": 0.5,
  "Here's Why We Think Cintas (NASDAQ:CTAS) Might Deserve Your Attention Today": 0.5,
  "Gilead wins positive European approval opinion for twice-yearly HIV injection": 0.8,
  "A&R Group acquires Fairfield Inn & Suites property in Destin, Florida": 0.5,
  "The 3 Things That Matter for Vertex Pharmaceuticals Now": 0.2,
  "US Kids Food and Beverage Market Forecast and Company Analysis Report 2025-2033 Conagra, PepsiCo, Kellogg, Campbell Soup, General Mills, Nestle, Lifeway Foods, The Hershey Company": 0.0,
  "Stocks Rise Pre-Bell as US, EU Strike Trade Deal; Investors Await Key Tech Earnings, Economic Data, Fed Policy Decision": 0.6,
  "Asia-Pacific Fast Food Market Forecast and Company Analysis Report 2025-2033 Featuring McDonald's, Yum!, Domino's, Wendy's, Jack in the Box, Starbucks, Papa John's, KFC, Corteva Agriscience": 0.5,
  "Saudi Arabia Data Center Market Overview and Company Analysis Report 2025-2033 Featuring Delta Electronics, Cisco Systems, Equinix, Fujitsu, General Electric, Hitachi, Schneider Electric, and Siemens": 0.5,
  "QuickLogic Unveils Aurora PRO: 50% Better Resource Utilization & 35% Faster Fmax": 0.8,
  "Latest News In AI Chips - AI Meets Blockchain Highlighted At Malaysia's Technological Innovation Event": 0.5,
  "Robust Demand Lifted Axon Enterprise (AXON) Shares to New Heights": 0.8,
  "IDEXX to Release Q2 Earnings: What's in Store for the Stock?": 0.2,
  "BlinkOps Raises $50 Million Series B to define new category of Cybersecurity Micro-Agents": 0.6,
  "Cognizant and Lineage Partner to Set Customer Experience Standard in the Cold Chain": 0.6,
  "An excellent week for CSX Corporation's (NASDAQ:CSX) institutional owners who own 78% as one-year returns inch higher": 0.8,
  "Palantir Leads S&P 500's Five Top AI Stocks In 2025": 0.8,
  "Taking A Look At Exelon Corporation's (NASDAQ:EXC) ROE": 0.1,
  "Zacks Investment Ideas feature highlights: Broadcom, Vertiv and NVIDIA": 0.5,
  "ISRG's Gross Margin Falls on Product Transition and Trade Pressures": -0.6,
  "Intel Cuts Workforce as New CEO Begins Turnaround Effort": -0.5,
  "PayPal Q2 2025 Earnings Preview: Checkout Share Faces Cost-Cut Test": 0.1,
  "4 Must-Buy Stocks as S&P 500 Continues to Reach New Milestones": 0.5,
  "EU Warns Temu on Safety of Products Sold on Its Platform": -0.5,
  "Dexcom Launches Revolutionary AI-Powered Meal Logging Feature Across Glucose Biosensing Portfolio": 0.8,
  "Intuit Launches New App Partner Program to Drive Growth for Third-Party Developers and Enhance Customer Experiences": 0.8,
  "Here's How Much a $1000 Investment in ON Semiconductor Corp. Made 10 Years Ago Would Be Worth Today": 0.5,
  "Five9 Gears Up to Report Q2 Earnings: What's in Store for the Stock?": 0.2,
  "ABNB Stock Price Prediction: Where Airbnb Could Be by 2025, 2026, and 2030": 0.5,
  "Digital Payment Update - Meriwest Credit Union Enhances Services With Zelle Integration": 0.5,
  "AMSC Gears Up to Report Q1 Earnings: What's in Store for the Stock?": 0.5,
  "Cisco Stock Downgraded. Analyst Wants Artificial Intelligence Revenue Numbers.": -0.5,
  "MercadoLibre, Inc. to Report Second Quarter 2025 Financial Results": 0.0,
  "Tines Appoints Heather Planishek as Chief Operating and Financial Officer": 0.5,
  "SAFE and Cisco Partner to Deliver Unified AI Risk Management with Business Impact Visibility": 0.5,
  "PayPal to let U.S. merchants accept payment in more than 100 cryptocurrencies": 0.8,
  "AIM ImmunoTech Reports Positive Mid-year Safety and Efficacy Data from Phase 2 Study Evaluating Ampligen® (rintatolimod) in Combination with AstraZeneca’s Imfinzi® (durvalumab) for the Treatment of Pancreatic Cancer": 0.8,
  "Intuitive Surgical, Inc. (ISRG) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Amgen Inc. (AMGN) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "How to Find Strong Medical Stocks Slated for Positive Earnings Surprises": 0.6,
  "Is Trending Stock Broadcom Inc. (AVGO) a Buy Now?": 0.2,
  "Here is What to Know Beyond Why Applied Materials, Inc. (AMAT) is a Trending Stock": 0.2,
  "Cisco Systems, Inc. (CSCO) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Intel Corporation (INTC) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "MicroStrategy Insiders Sold US$3.1m Of Shares Suggesting Hesitancy": -0.5,
  "SUI Joins Bitcoin, Ethereum With Its Own Treasury Company: Look Who's Building A $450 Million Reserve": 0.5,
  "US-EU trade deal, Big Tech earnings, Fed meeting: 3 Things": 0.2,
  "Roblox Stock Soars 79% in 3 Months: Lock in Gains or Hold Tight?": 0.5,
  "The Zacks Analyst Blog Highlights NVIDIA, Netflix, Goldman Sachs and AMREP": 0.0,
  "IDEXX Laboratories (IDXX) Rallied in Q2. Here’s Why": 0.6,
  "Is Roblox Stock a Buy, Sell, or Hold for July 2025?": 0.1,
  "Should You Grab This ‘Strong Buy’ Semiconductor Stock Ahead of Earnings?": 0.5,
  "Why Redwire Could Be One of the Most Undervalued Plays in Space, Defense, and AI Going Into 2026: $1B+ Is in Sight Sooner Than You Think - Redwire is quietly assembling the holy trinity of future tech: **Space infrastructure, AI-driven mission systems, and autonomous defense platforms**. After digging through SEC filings, DoD roadmaps, company presentations, earnings calls, RFPs and defense budget line-items, etc. I genuinely believe 2026 will be the turning point, after Edge autonomy": 0.8,
  "Copart (CPRT) Fell as It Missed Revenue Expectations": -0.8,
  "Company News for Jul 28, 2025": 0.0,
  "This chip name emerges as a key winner in U.S.-EU trade deal": 0.8,
  "Cantor outlines how to navigate the emerging Bitcoin treasury sector": 0.5,
  "Three things to watch on Monday": 0.0,
  "Is It Worth Investing in CrowdStrike (CRWD) Based on Wall Street's Bullish Views?": 0.5,
  "Baker Hughes (BKR) Reports Q2 Earnings: What Key Metrics Have to Say": 0.2,
  "Geopolitical Alert: Trump Warns Iran Not to Restart Nuclear Program Should We Watch Oil & Gas and Military Stocks? - Trump just spoke out and warned Iran not to restart its nuclear program. While this isn't the first time US-Iran relations have been strained, given his current favorability ratings in the 2024 election, this kind of statement could trigger some reaction in the market - especially in the energy and military sectors. Directions to watch:": 0.2,
  "Here's Why Cognizant (CTSH) is a Strong Value Stock": 0.8,
  "Nuclear Power Is Going Mainstream. These Stocks Stand to Benefit.": 0.5,
  "Here's Why Booking Holdings (BKNG) is a Strong Growth Stock": 0.8,
  "Nvidia Stock Rises. Watch This Figure From Microsoft, Meta, and Amazon Earnings.": 0.5,
  "Are You a Momentum Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Samsung to Make Tesla AI Chips in Multiyear Texas Deal": 0.5,
  "r/Stocks Daily Discussion Monday - Jul 28, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.0,
  "‘I Prep for Survival’: OpenAI CEO Sam Altman Worries About The ‘Nonzero’ Chance The World Will End From ‘a Lethal Synthetic Virus’": -0.6,
  "Cisco upside now largely priced in, Evercore ISI downgrades stock": -0.6,
  "NYPSC Approves Constellation Energy’s Acquisition of Calpine Corporation": 0.5,
  "Gilead Sciences stock falls amid reports of preventive health panel dismissal": -0.5,
  "ACI Learning Expands Access to Industry-Leading On-Demand Training Through OpenSesame Partnership": 0.5,
  "SSD Demand Aids Micron's NAND Growth: Can the Momentum Continue?": 0.5,
  "PUCO Adopts AEP Ohio Data Center Proposal to Protect Consumers": 0.5,
  "ComEd Announces New Improvements To The Itasca Substation’s Power Infrastructure": 0.5,
  "Before Figma Goes Public, Should You Double Down on Adobe or Bet on the Underdog?": 0.2,
  "Booking Holdings to Make Second Quarter 2025 Earnings Press Release Available on Company's Investor Relations Website on July 29": 0.0,
  "2 Top Dividend Stocks to Buy Right Now and Hold Forever": 0.5,
  "ON Semiconductor Corp. (ON) Expected to Beat Earnings Estimates: What to Know Ahead of Q2 Release": 0.5,
  "Axon Enterprise (AXON) Reports Next Week: Wall Street Expects Earnings Growth": 0.5,
  "BioMarin Pharmaceutical (BMRN) Reports Next Week: Wall Street Expects Earnings Growth": 0.6,
  "Diamondback Energy (FANG) Expected to Beat Earnings Estimates: Can the Stock Move Higher?": 0.5,
  "Ichor Holdings (ICHR) Reports Next Week: Wall Street Expects Earnings Growth": 0.5,
  "Idexx Laboratories (IDXX) Earnings Expected to Grow: Should You Buy?": 0.6,
  "Palantir Technologies Inc. (PLTR) Earnings Expected to Grow: Should You Buy?": 0.5,
  "Vertex Pharmaceuticals (VRTX) Reports Next Week: Wall Street Expects Earnings Growth": 0.5,
  "What You Need to Know Ahead of Autodesk’s Earnings Release": 0.1,
  "This Stock Doubled My Money – and I’m Buying More": 0.8,
  "Copart’s Quarterly Earnings Preview: What You Need to Know": 0.2,
  "Ether Treasuries Target Yield, but Risk Looms, Says Wall Street Broker Bernstein": 0.1,
  "EU trade deal: What to expect in markets & earnings this week": 0.5,
  "This is the Most Dangerous Week for Investors in 20 Years": -0.8,
  "3 No-Brainer Energy Stocks to Buy With $500 Right Now": 0.5,
  "Adobe's Q3 2025 Earnings: What to Expect": 0.0,
  "Analyst bullish on Texas Instruments on earnings lift as capex winds down": 0.8,
  "Biogen Gears Up to Report Q2 Earnings: Here's What to Expect": 0.5,
  "Form 8.3 - Aqua Acquisition Sub LLC (subsidiary of Qualcomm Incorporated)": 0.0,
  "Trump: “China Deal Is Close” Ahead of EU and Stockholm Trade Talks Tariffs, Semis, and Rare Earths on the Table - US President Donald Trump said on Sunday that an agreement with China was “basically” reached, although details remain unclear. His remarks came ahead of high-level talks between China and the US scheduled for Monday in Stockholm, with Chinese Vice Premier He Lifeng and US Treasury Secretary Scott Pritzker set to lead the discussions. Extension": 0.5,
  "BC-Most Active Stocks": 0.0,
  "CRISPR Therapeutics to Report Q2 Earnings: What's in the Cards?": 0.2,
  "Big Week for Jobs, Earnings and the Fed": 0.5,
  "How Microsoft can justify soaring CapEx in its earnings results": 0.2,
  "Little Kid TV, Big Money: How Children's Shows Became Streaming's Most Valuable Asset": 0.5,
  "Bitcoin Price Drifts, XRP Gains. BTC Could Hit $1 Million, Cantor Analysts Say.": 0.5,
  "Will Axon's AI-Driven Platform Continue to Enhance Community Safety?": 0.5,
  "AMD's U.S.-Made Chips Will Cost More -- and Lisa Su Says That's Fine": 0.2,
  "PayPal Rolls Out New Crypto Feature: Here's Why You Should Care": 0.6,
  "Defense stocks, Cisco, ChargePoint: Trending Tickers": 0.2,
  "BigBear.ai Deploys AI Solutions at LAX, DFW - Is Global Next?": 0.5,
  "PayPal Expands Crypto Payments for U.S. Merchants to Cut Cross-Border Fees": 0.8,
  "What Costco's Balance Sheet Says About Its Financial Strength": 0.0,
  "Lululemon Expands Global Footprint with First Italy Store in Milan": 0.8,
  "Intel gets a boost from AI-enabled PCs as its foundries flounder": 0.4,
  "Wells Fargo coverage: Bullish on Take-Two, cautious on EA": 0.5,
  "PayPal and Visa Earnings: A Closer Look": 0.0,
  "PayPal Reports Q2 Earnings on July 29. Is PYPL Stock a Buy, Sell, or, Hold?": 0.0,
  "Microsoft has to hit its earnings out of the park: Opening Bid top takeaway": 0.5,
  "Heavy-Duty Earnings Week Commences": 0.2,
  "Astrazeneca, Other US-Listed Pharma Companies Seen Insulated From New EU Tariff Deal, Barclays Says": 0.5,
  "Why Is the Dow Lagging? The Market Is Buying Risk, and Not Much Else.": -0.6,
  "Baker Hughes (BKR) Gets 16% Boost from Q2 Earnings, Dividend Declaration": 0.6,
  "Morgan Stanley makes bold S&P 500 projection as U.S. dollar weakens": 0.6,
  "What to Expect From Broadcom's Next Quarterly Earnings Report": 0.2,
  "Markets hope for one thing from US-China tariff talks: Another 90-day extension": 0.5,
  "PayPal Makes 100 Crypto Available for U.S. Merchant Payments": 0.5,
  "PayPal to allow businesses to accept more than 100 cryptocurrencies": 0.8,
  "KLAC Set to Report Q4 Earnings: How Should You Play the Stock?": 0.5,
  "Figma targets $18.8 billion valuation in US IPO after bumping up price range": 0.8,
  "EU admits it can’t guarantee $600B promise to Trump. The extra investments pledged under the trade deal would come from private companies. - https://www.politico.eu/article/eus-600bn-us-investment-will-come-exclusively-from-private-sector/ The European Union has admitted it doesn’t have the power to deliver on a promise to invest $600 billion in the United States economy, only hours after making the pledge at landmark trade talks in Scotland. That’s because the cash would come entirely from private sector investment over which Brussels has": -0.6,
  "PayPal Q2 Earnings Preview: Should You Buy the Stock Now or Wait?": 0.5,
  "Top Stock Movers Now: Nike, Cheniere Energy, Revvity, and More": 0.5,
  "Cushman & Wakefield Welcomes Conor Flannery as Executive Vice Chair in Silicon Valley": 0.5,
  "Why Rocket Lab (RKLB) Shares Are Sliding Today": -0.5,
  "Why Duolingo (DUOL) Stock Is Falling Today": -0.5,
  "IonQ Hires Quantum Veteran From JPMorgan": 0.5,
  "Strategy Announces No New Bitcoin Purchases—But Here's Who Bought 755 BTC": 0.2,
  "Warner Bros. Discovery Announces Post-Separation Company Names and Leadership Appointments": 0.5,
  "AMD stock jumps on 3 catalysts, Boeing faces potential strike": 0.2,
  "Why MicroStrategy (MSTR) Stock Is Up Today": 0.5,
  "Tesla, Samsung Sign $16.5 Billion Deal to Make AI Chips": 0.8,
  "Mondelēz CTO, CISO to depart": -0.5,
  "PayPal opens doors for U.S. merchants to accept 100 new assets": 0.6,
  "ARM to Post Q1 Earnings: Should the Stock be in Your Portfolio?": 0.2,
  "Old Dominion's Q2 Earnings Coming Up: What's in Store for the Stock?": 0.2,
  "Warner Bros to get studio business after split, Discovery to house news, sports brands": 0.1,
  "Cognizant to Report Q2 Earnings: What's in Store for the Stock?": 0.2,
  "Should You Buy, Sell, or Hold GE Healthcare Before Q2 Earnings?": 0.2,
  "Shopify Making 'Meaningful' Share Gains in Enterprise Ecommerce, UBS Says": 0.6,
  "AMD Stock Is Rising. Its AI Chip Business Is Improving, Says Analyst.": 0.6,
  "Is Qualcomm Stock a Smart Buy Before Q3 Earnings Release?": 0.5,
  "Warner Bros. Cable Arm to Be Named Discovery Global After Split": 0.1,
  "Paramount, Disney, Warner Bros. Discovery: Media earnings preview": 0.0,
  "DAT to Acquire the Convoy Platform from Flexport": 0.2,
  "Less than 2 years after Flexport bought Convoy’s tech stack, it’s being sold to DAT": -0.5,
  "DoorDash Hires Spotify Advertising Head as Chief Revenue Officer": 0.5,
  "BSY strongly overbought going into earnings - Earnings for BSY is in 9 days. I honestly didn't know that TradingView's RSI indicator starts changing colors when the RSI is above 70, BSY's RSI is currently at 85. The current price is 15% above the Volume Weighted Average Price (Earnings anchored). The current price is up about 35% QoQ. A bearish MACD crossover occurred on the daily chart about 3 days ago. There seems to be": -0.8,
  "The world’s 10 richest people: The wealthiest have $100 billion or more": 0.5,
  "Tesla, Samsung, energy stocks, & European semiconductors climb": 0.6,
  "Rita Gupta Of AMD Named 2025 Recipient Of Superwomen Of FMS Award": 0.5,
  "Palantir - concerned about upcoming earnings - I've been holding PLTR for a while, and it's absolutely exploded – I'm up roughly 10x on my initial investment. The problem is, it now makes up a really substantial percentage of my overall portfolio. With their next earnings report coming I'm getting a little nervous. The valuation seems incredibly high and I'm worried about a potential correction, especially after such a massive run-up. Should I trim some": -0.6,
  "Tariffs will likely raise toy prices, toymaker warns": -0.6,
  "Top Founder-Run Company Stocks That Are Outperforming the Market": 0.5,
  "Samsung Stock Surges. Why It Needed the Tesla AI Chip Deal So Much.": 0.8,
  "Figma’s Hot IPO Is This Week. Adobe Is Still Alive and Kickin’.": 0.5,
  "Warner Bros. Discovery Sets Leadership for Post-Split Companies": 0.5,
  "Sector Update: Health Care Stocks Softer Monday Afternoon": -0.5,
  "Google Will Soon Be Told How to End Its Monopoly. What That Means for Apple.": 0.1,
  "Sector Update: Tech Stocks Gain Monday Afternoon": 0.5,
  "DoD tests AI models that make it easy to switch from vendors like Palantir": 0.2,
  "YouTube vs Netflix: User-led 'open' platforms rise in popularity": 0.5,
  "ROKU up 71% since April, 5% today, earnings on 7/31 - How does everybody feel about the stock heading into earnings? They reported earnings in the heat of Liberation Day, I think they'll sound more bullish on the earnings call with the storm & dust settling. Positive read-through on streaming based on Netflix & Google's earnings calls (YouTube) Get more details on the Amazon & ROKU partnership": 0.6,
  "Tesla's Semiconductor Deal With Samsung Doesn't Bode Well for TSM, Intel, Wedbush Says": -0.6,
  "Why Are Super Micro (SMCI) Shares Soaring Today": 0.5,
  "Opendoor (OPEN) Stock Trades Down, Here Is Why": -0.5,
  "Morgan Stanley names tech stock winner from One Big Beautiful Bill Act": 0.6,
  "Equities Mixed Intraday as Focus Shifts From EU Deal to Earnings, Fed Decision": 0.2,
  "Starbucks Q3 Preview: Report Could Show Consumers Ditching Lattes For Living Rooms — Or Sipping Elsewhere": 0.2,
  "Nasdaq Reaches for Another Record as Bad Breadth Plagues S&P 500": -0.5,
  "Mid-Cap Index Funds Aren’t All Alike. Look Under the Hood.": 0.2,
  "Amazon disputes report that it raised prices of popular items since Trump took office": 0.2,
  "This Company Is Surging on Plans to Become the MicroStrategy of the BNB Crypto. Should You Buy Its Stock Now?": 0.6,
  "Amazon Q2 Earnings Preview: What to Expect From Upcoming Report": 0.5,
  "AMD Stock Jumps as AI Chip Prices Soar Ahead of Q2 Earnings": 0.8,
  "Bernstein upgrades Charter on improving cash outlook despite broadband headwinds": 0.6,
  "S&P 500 Rally Faces $11 Trillion Gauntlet of Big Tech Earnings": 0.2,
  "These four threats could ’upset’ bullish S&P 500 momentum: Sevens Report": -0.5,
  "AST is building a unique, hard-to-replicate satellite network to enable direct-to-device connectivity for any smartphone - AST has made a breakthrough by enabling traditional smartphones to connect to low Earth orbit (LEO) satellites without any modifications to the phone's hardware or software. As a result, any conventional smartphone can access voice, data and video services directly from space, breaking the complete dependence on terrestrial base stations. This is a radical paradigm shift for rural, remote": 0.8,
  "Nat-Gas Prices Fall on Forecasts for Cooler US Temps": -0.5,
  "One Buy-Rated Stock With an Unbreakable Moat That You Can’t Ignore": 0.6,
  "Meta Hires ChatGPT Co?Founder for AI Push": 0.5,
  "AMD Q2 Earnings Preview: What to Expect From Upcoming Report": 0.5,
  "Alphabet's Sundar Pichai Joins Billionaire Ranks--But Leaves $1 Billion on the Table": 0.1,
  "Amazon (AMZN) Stock Climb on Massive Price Target Hike From UBS": 0.8,
  "Huawei Unveils AI System to Challenge Nvidia's Flagship Model": 0.5,
  "Palantir Joins U.S. Corporate Giants as AI Hype Sends Stock Soaring": 0.8,
  "Starbucks Q3 Earnings: Can China's Recovery Perk Up a Lagging Stock?": 0.5,
  "1 Options Trade You Can Use to Protect Historic Gains in Red-Hot Palantir Stock": 0.6,
  "PayPal Taps $3?Trillion Crypto Market": 0.5,
  "Transitions in the Semiconductor Space": 0.0,
  "Sector Update: Consumer Stocks Mixed Late Afternoon": 0.0,
  "America’s $37 Trillion Debt Now Takes Venmo: Should Investors Be Worried?": -0.5,
  "Sector Update: Tech Stocks Advance Late Afternoon": 0.5,
  "Tech Earnings Create $11 Trillion Hurdle for S&P 500": -0.5,
  "How to avoid capital gains taxes with highly appreciated stocks": -0.5,
  "Wall Street on Edge: Big Tech's $11 Trillion Earnings Could Ignite--or Derail--the Market Rally": 0.5,
  "PayPal, Duolingo, Meta: Trending Tickers": 0.0,
  "These Are The 5 Best Stocks To Buy Now Or Watch": 0.5,
  "This Stock Smashes Nvidia, All Mag 7 Members — With A New Breakout Ahead": 0.5,
  "Cadence Reports Second Quarter 2025 Financial Results": 0.0,
  "US Equity Markets Mixed on US-EU Trade Deal; Fed Rate Decision, Flood of Earnings Loom": 0.1,
  "Josh Brown Highlights His New Best Industrial Stock Pick in 2025": 0.5,
  "Spotify set to report earnings as investor optimism meets cautious guidance": 0.5,
  "Hedge Funds Just Got Burned: Retail Traders Trigger $2.5B Short Squeeze in July": 0.5,
  "Microsoft Challenges Google's AI Search With 'Copilot Mode' for Edge": 0.5,
  "Tesla Inks $16.5 Billion Deal For AI With Samsung And Elon Musk Says This": 0.5,
  "Analyst Highlights ‘Game Changer’ Catalyst for Eli Lilly (LLY)": 0.8,
  "Cadence: Q2 Earnings Snapshot": 0.0,
  "Biotech stocks dip as Trump administration mulls patent fee overhaul": -0.5,
  "Apple (AAPL) Bull Says iPhone Will Be a ‘Great’ AI Catalyst – ‘We Feel Stock is Very Attractive’": 0.8,
  "Trump Locks $750B Energy Deal with EU--But the Numbers Don't Add Up": -0.5,
  "Josh Brown Gives Followers ‘Permission’ to Sell NVIDIA (NVDA) Shares – Here’s Why": 0.2,
  "Microsoft, Meta, Apple, Amazon: How to play Big Tech earnings": 0.2,
  "US-EU Trade Deal Excitement Lost - What just happened in the EU markets today? Last night when the trade deal was announced, EU markets jumped over 1%. Then the morning the EU market lost all those gains. I think the market has yet to price in the tariffs. The US is going from 2.5% average tariff rate to nearly 20% on Aug. 1st. The tariffs will be getting priced in next week and we will": -0.5,
  "Analyst Says He’s Buying Meta Platforms (META) Amid AI Monetization – ‘Margins Are Just Going Higher’": 0.8,
  "Starbucks set to report 6th straight US sales decline as CEO Brian Niccol continues turnaround efforts": -0.6,
  "These Stocks Moved the Most Today: Tesla, AMD, ASML, Nike, Revvity, Charter, and More": 0.2,
  "Tesla Picks Samsung for Its AI Chips. These Stocks Are Moving on the News.": 0.2,
  "Nvidia Partner, Rival Lead S&P 500 Stocks Monday": 0.5,
  "Why Gilead Sciences Stock Slipped Today": -0.5,
  "Stocks to Watch Monday: Cheniere, TSM, Nike, Tesla": 0.5,
  "Elon Musk and Tesla’s $30 Trillion AI Supersonic Tsunami": 0.5,
  "Albermarle Stock Drops 10%. The Lithium Rally Is ‘Transitory.’": -0.6,
  "Stock Market Today: Dow Dips As Microsoft Slips Ahead Of Earnings; Cathie Wood Loads Up On This Stock Amid 47% Plunge (Live Coverage)": -0.5,
  "Top Stock Reports for Microsoft, SAP & AMD": 0.0,
  "Analysts consider new Apple stock target price ahead of earnings": 0.5,
  "Heard on the Street Recap: Done Deal": 0.0,
  "Meta Names Chief Scientist for New AI Unit": 0.5,
  "Cadence’s (NASDAQ:CDNS) Q2 Sales Top Estimates, Stock Soars": 0.8,
  "X Premium Users Can Now Sign Up for its Coming Text-to-Video Option": 0.5,
  "The Stock Market Is Taking a Tougher Line on Earnings Misses": 0.1,
  "Google Just Kickstarted a New AI Spending Wave. Buy This Top-Rated Stock to Benefit.": 0.8,
  "Spooked By the Microsoft SharePoint Exploit? Here’s the Top-Rated Cybersecurity Stock to Buy for Portfolio Protection.": 0.5,
  "Chip design software provider Cadence raises annual sales forecast - https://www.reuters.com/technology/chip-design-software-provider-cadence-raises-annual-sales-forecast-2025-07-28/ > July 28 (Reuters) - Cadence Design Systems raised its sales forecast for the year on Monday, after the U.S. lifted export curbs on chip design software to China earlier this month, allowing the company to resume sales to the key market. > Shares of the San Jose, California-based company rose 7% in extended trading after rising about 10% this year.": 0.8,
  "AMD Hikes MI350 AI GPU Price by 70%": -0.6,
  "Tesla Just Signed a Chip Supply Deal with Samsung. What Does That Mean for TSLA Stock?": 0.5,
  "Cadence Design Systems Stock Jumps On Beat-And-Raise Earnings Report": 0.8,
  "Stocks Hold at Record, Dollar Jumps on Trade Hopes: Markets Wrap": 0.5,
  "Health Care Roundup: Market Talk": 0.0,
  "Why Super Micro Computer Rallied Today": 0.2,
  "Dow Jones Futures: Circle, Coinbase, CoreWeave, Nvidia, Tesla Are Key Movers": 0.5,
  "Charter Slows Pay-TV Losses, but Shares Dive on Internet Hit": -0.5,
  "Equities End Mixed as Markets Look Past EU Trade Deal; Fed Decision in Focus": 0.2,
  "AMD Raises AI Chip Price, Confident It Can Compete With Nvidia": 0.6,
  "Shareholders of UK fintech Wise vote to move main stock market listing to US - https://www.theguardian.com/business/2025/jul/28/shareholders-of-uk-fintech-wise-vote-to-move-main-stock-market-listing-to-us The UK online payments company Wise is to move its main stock market listing to the US after shareholders approved the move. Investors in Wise, one of the biggest financial technology businesses in the UK with a market value of about £11bn, voted on Monday in favour of a dual listing in the US in an attempt to attract": 0.2,
  "Cadence Design Systems (CDNS) Q2 Earnings and Revenues Top Estimates": 0.8,
  "Cadence lifts FY outlook after Q2 results top estimates; shares jump": 0.8,
  "Boeing Needs to Show Earnings Progress to Keep Stock Momentum": 0.5,
  "Cadence Design Systems Pleads Guilty to Export Violation, Will Pay $140.6 Million in Settlement": -0.8,
  "Podcast: Stock Indexes Closed Mixed After U.S.-EU Trade Deal": 0.2,
  "Watch These Microsoft Stock Price Levels as Tech Giant Set to Report Earnings": 0.2,
  "Earnings live: Whirlpool, Tilray stocks tumble, with Spotify earnings on deck": 0.1,
  "Lululemon Stock Has Rebounded. What to Expect From Earnings.": 0.5,
  "Spectrum suffers major loss as customers pull the plug on service": -0.8,
  "UPS’s Earnings Are Here. Growth Is Still Missing.": -0.5,
  "Shopify (SHOP) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Nvidia (NVDA) Outperforms Broader Market: What You Need to Know": 0.5,
  "Intuit (INTU) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "Why Applied Materials (AMAT) Outpaced the Stock Market Today": 0.5,
  "PDD Holdings Inc. Sponsored ADR (PDD) Stock Falls Amid Market Uptick: What Investors Need to Know": 0.1,
  "Broadcom Inc. (AVGO) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Cisco Systems (CSCO) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Why Tesla Stock Jumped Today": 0.5,
  "Amgen (AMGN) Stock Falls Amid Market Uptick: What Investors Need to Know": 0.1,
  "Warner Bros. Discovery (WBD) Laps the Stock Market: Here's Why": 0.5,
  "Gilead Sciences (GILD) Stock Dips While Market Gains: Key Facts": 0.1,
  "Marvell Technology (MRVL) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Thirsty for Dividend Income? 2 Beverage Companies That Qualify as Dividend Kings": 0.5,
  "Why Analog Devices (ADI) Outpaced the Stock Market Today": 0.5,
  "Down 33%, Is Chipotle a Buy Now?": -0.5,
  "Copart, Inc. (CPRT) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Tariff Deadline, Jobs Report, Tech Earnings: What to Watch This Week": 0.5,
  "August: Time to Unplug from Markets?": 0.1,
  "MSFT, META, AAPL, AMZN: One Chart Stands Above the Others": 0.5,
  "Google triggers turmoil for web businesses with AI overhaul": -0.6,
  "Google launches AI Mode in the UK amid ‘major shift’ in online search": 0.6,
  "I Asked ChatGPT What Elon Musk’s ‘America Party’ Means for My Taxes, Here’s What it Said": 0.1,
  "Baker Hughes nears $13.6 billion deal to buy Chart, edging out Flowserve, FT reports": 0.5,
  "Elon Musk Confirms Tesla As the Mystery Big-Tech That Signed $16.5 Billion Chip Contract With Samsung: 'I Will Walk The Line Personally' To Boost Progress (UPDATED)": 0.8,
  "Stock market today: Dow, S&P 500, Nasdaq futures climb as huge week of market-watched events rolls on": 0.5,
  "Waymo taps Avis to manage robotaxi fleet in Dallas": 0.5,
  "Analyst sets new shocking price target hot on tech stock": 0.5,
  "AMD options advice - I bought a few option on a lark while waiting for coffee back in May, nothing massive but first foray into options. Looking for advice on best way to handle it. Both are pretty deep itm Both 140 calls 1 expires in Dec 19 up 956% 5 expire June 18th next year up 464% Should I sell the Dec and just hang onto the other 5 until next year sometime?": 0.5,
  "Should You Buy Palantir Stock Before Aug. 4?": 0.2,
  "Netflix And Disney Quietly Use $545M-Backed Runway For AI Video — And It's Raising Big Questions In Hollywood": 0.5,
  "Is Synopsys Stock Your Ticket to Becoming a Millionaire?": 0.5,
  "2 No-Brainer Warren Buffett Stocks to Buy Right Now": 0.5,
  "Why Is Wall Street so Bullish on Nvidia? Here's the $4.8 Trillion Reason": 0.8,
  "If You Buy Alphabet With $10,000 in 2025, Will You Become a Millionaire in 10 Years?": 0.2,
  "Costco Is One of the Largest Consumer Goods Companies by Market Cap. But Is It a Buy?": 0.5,
  "AI data analyst startup Julius nabs $10M seed round": 0.5,
  "Samsung Electronics shares retreat after Tesla deal, as challenges remain": -0.5,
  "Palantir, the AI giant that preaches US dominance": 0.2,
  "Apple Shift Turns India Into World’s Top Maker of US Smartphones": 0.6,
  "Agoda Reveals First-Half 2025 Travel Insights: China, Malaysia, and South Korea Remain Top Visitors to Thailand": 0.5,
  "ADP (ADP) Reports Earnings Tomorrow: What To Expect": 0.0,
  "Nvidia orders 300,000 H20 chips from TSMC due to robust China demand, sources say": 0.6,
  "Exclusive-Nvidia orders 300,000 H20 chips from TSMC due to robust China demand, sources say": 0.5,
  "What To Expect From Verisk’s (VRSK) Q2 Earnings": 0.0,
  "GE HealthCare (GEHC) Reports Q2: Everything You Need To Know Ahead Of Earnings": 0.5,
  "Meta (META) To Report Earnings Tomorrow: Here Is What To Expect": 0.5,
  "Earnings To Watch: DexCom (DXCM) Reports Q2 Results Tomorrow": 0.2,
  "Old Dominion Freight Line (ODFL) Reports Q2: Everything You Need To Know Ahead Of Earnings": 0.5,
  "Kraft Heinz (KHC) Reports Q2: Everything You Need To Know Ahead Of Earnings": 0.2,
  "Microsoft Earnings: What To Look For From MSFT": 0.2,
  "Lam Research Earnings: What To Look For From LRCX": 0.2,
  "Qualcomm Earnings: What To Look For From QCOM": 0.0,
  "Altizon Completes Strategic Migration to Microsoft Azure, Unlocking AI-Driven Productivity for Global Manufacturers": 0.8,
  "What makes Google so low? - Google consistently posts massive profits and yet its PE is around 20, which is much lower than other big tech names that sit at 40+, Tesla with a PE near 180, and PLTR up in the 600s. If we go by valuation multiples alone, Google should easily be trading above $380. What's happening?": 0.5,
  "Journey towards making last student loan payments! - I’m using $300 for a fun play, and wanna know If I can turn that into $5K to finish paying off my student loan debt. Any recommendations on where to start? I know market is at an all time high so investing in expensive tech stocks doesn’t seem like a right option. What are some good under $10 stocks that I can look into?": 0.2,
  "DexCom (DXCM) Q2 Earnings Preview: What You Should Know Beyond the Headline Estimates": 0.5,
  "Why the Minibar Vanished: How Hotels Maximize Profit From Your Stay": -0.5,
  "Jim Cramer Notes “NVIDIA Stock Has Had Many Parabolic Moves”": 0.5,
  "Jim Cramer Says It’s “Heck of A Lot Easier to Justify Buying” Stocks Like Palantir": 0.6,
  "Jim Cramer While Discussing CrowdStrike: “I’ll See You at $1,000”": 0.6,
  "Jim Cramer Notes “Realty Income is for People Who are a Little Bit Older”": 0.2,
  "Jim Cramer on Intuitive Surgical: “I’m Inclined to Recommend the Stock”": 0.6,
  "Advanced Micro Devices (AMD) Partners with HUMAIN to Build a Global AI Infrastructure": 0.8,
  "AstraZeneca PLC (AZN) Announced Positive Results for its Phase 3 Trial of Gefurulimab": 0.8,
  "Tigermed Completes Acquisition of Japanese CRO Micron": 0.5,
  "Intel’s (INTC) Margins Under Watch Amid Delayed Product Ramps": -0.5,
  "Linde (LIN) Expected to Beat EPS for 26th Quarter, Says Bernstein": 0.6,
  "Truist Raises Price Target for Texas Instruments (TXN) Amid Tariff-Driven Q2 Surge": 0.6,
  "Citi Raises Netflix (NFLX) Price Target After Solid Q2 Results": 0.8,
  "Palantir (PLTR) Wins $100M U.S. Army Contract for Next-Gen Command and Control": 0.8,
  "MicroStrategy (MSTR) Stock Target Raised as Bitcoin Strategy Continues to Lead": 0.8,
  "Brewing Innovation: Univers and Starbucks China Redefine Green Retail from Store to Supplier": 0.6,
  "Form 8.3 - Qualcomm Incorporated": 0.0,
  "AstraZeneca beats second-quarter profit expectations, maintains outlook": 0.8,
  "DoorDash Target Raised to $275 as Analysts Bet on Growth Beyond Delivery": 0.8,
  "KeyBanc Lifts Shopify Price Target to $145": 0.5,
  "PepsiCo Gets Price Target Boost from JPMorgan, Neutral Rating Held": 0.5,
  "JPMorgan Holds Overweight on Keurig Dr Pepper Despite Tariff Clouds": 0.5,
  "UBS Nudges Monster Beverage Target Higher, Keeps Neutral Rating": 0.5,
  "Is Google's every Tech Company bigger competitor? - I just realized that Google is typically the primary or secondary threat for almost every major tech company I can think of. Think about the combined market cap of the competitors, is the market undervaluing Google? * Tesla – Waymo + Google AI * Apple – Android + Google Search * Microsoft – Google Workspace + Google Cloud + Google Search * Amazon – Google Shopping +": 0.2,
  "Ransomware Surges as Attempts Spike 146% Amid Aggressive Extortion Tactics": -0.8,
  "Cadence Design Systems Inc (CDNS) Q2 2025 Earnings Call Highlights: Strong AI-Driven Growth ...": 0.8
}