{
  "Linde PLC (LIN) Q2 2025 Earnings Call Highlights: Record EPS and Operating Margin Amidst ...": 0.8,
  "Undervalued and Profitable: 3 Artificial Intelligence (AI) Stocks for Buffett-Minded Investors": 0.5,
  "AstraZeneca Second Quarter 2025 Earnings: Revenues Beat Expectations, EPS Lags": 0.2,
  "Insiders are the top stockholders in PDD Holdings Inc. (NASDAQ:PDD), and the recent 7.1% drop might have disappointed them": -0.6,
  "The Smartest Artificial Intelligence (AI) Stocks to Buy With $1,000 Right Now": 0.8,
  "Wells Fargo Raises Arm Holdings (ARM) Price Target on AI Growth Momentum": 0.6,
  "Stifel Raises Price Target on Baker Hughes (BKR) After Strong Q2 2025 Earnings": 0.8,
  "3 Top Stocks to Buy With $1,000 in August": 0.5,
  "At US$222, Is Analog Devices, Inc. (NASDAQ:ADI) Worth Looking At Closely?": 0.2,
  "Workday (NASDAQ:WDAY) shareholders are still up 37% over 3 years despite pulling back 8.1% in the past week": 0.6,
  "2 Monster Stocks to Hold for the Next 5 Years": 0.5,
  "Mondelez International's (NASDAQ:MDLZ) Dividend Will Be Increased To $0.50": 0.8,
  "Exelon Second Quarter 2025 Earnings: EPS Beats Expectations, Revenues Lag": 0.2,
  "GE HealthCare Technologies Second Quarter 2025 Earnings: EPS Beats Expectations": 0.8,
  "Drugmakers are pouring billions of dollars into new US manufacturing. It still won’t achieve all of Trump’s tariff goals": 0.2,
  "Results: Biogen Inc. Exceeded Expectations And The Consensus Has Updated Its Estimates": 0.8,
  "Comcast takes drastic action as customers rapidly cut service": -0.8,
  "Old Dominion Freight Line (ODFL) Sees 10% Stock Drop Over Last Quarter": -0.7,
  "Berkshire Hathaway issues stern warning over Trump's tariffs as profits impacted — here's what investors need to know": -0.5,
  "AP Top Extended Financial Headlines at 11:35 p.m. EDT": 0.0,
  "AP Top Financial News at 11:35 p.m. EDT": 0.0,
  "2 Biotech Stocks That Could Soar 29% and 165% According to Wall Street's Top Analysts": 0.8,
  "The AI Boom Continues: 3 Top AI Stocks to Buy for the Rest of 2025": 0.6,
  "Cadence Design Systems Sees Insider Stock Selling": -0.5,
  "We Like O'Reilly Automotive's (NASDAQ:ORLY) Returns And Here's How They're Trending": 0.6,
  "If You Invested $10K In ASML Stock 10 Years Ago, How Much Would You Have Now?": 0.0,
  "Roper Technologies Second Quarter 2025 Earnings: EPS Beats Expectations": 0.8,
  "Linde Second Quarter 2025 Earnings: Revenues Beat Expectations, EPS Lags": 0.2,
  "Kraft Heinz (NASDAQ:KHC) Is Paying Out A Dividend Of $0.40": 0.2,
  "Institutional owners may ignore Fastenal Company's (NASDAQ:FAST) recent US$2.7b market cap decline as longer-term profits stay in the green": 0.5,
  "Is It Time To Consider Buying DexCom, Inc. (NASDAQ:DXCM)?": 0.5,
  "Boasting A 66% Return On Equity, Is Automatic Data Processing, Inc. (NASDAQ:ADP) A Top Quality Stock?": 0.6,
  "Regeneron Pharmaceuticals Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "Estimating The Intrinsic Value Of Xcel Energy Inc. (NASDAQ:XEL)": 0.1,
  "Why Drug Prices for Some Big Medicines Will Remain High for a Longer Time": -0.6,
  "Atlassian Insiders Sell US$17m Of Stock, Possibly Signalling Caution": -0.5,
  "Lam Research Full Year 2025 Earnings: EPS Beats Expectations": 0.8,
  "The Best Growth Stocks I'd Buy Right Now": 0.8,
  "Chart Industries (GTLS) Soars 15.7% on $13-Billion Merger, Impressive Earnings": 0.8,
  "Starbucks' problems may be too big to fix": -0.8,
  "4 Genius Artificial Intelligence (AI) Stocks to Buy in August": 0.6,
  "(Item 2.02) . Results of Operations and Financial Condition. On August 4, 2025, Vertex Pharmaceuticals Incorporated (the \"Company\") issued a press release in which it reported its consolidated financial results for the three and six months ended June 30, 2025. A copy of that press release is attached to this Current Report on Form 8-K as Exhibit 99.1 and is incorporated herein by reference. The information set forth in Exhibit 99.1 shall not be deemed to be\n\n(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On August 4, 2025, the Company announced the retirement of David Altshuler, Executive Vice President and Chief Scientific Officer, effective August 1, 2026.": 0.1,
  "(Item 8.01) . Other Events. On August 1, 2025, Xcel Energy Inc. (“Xcel Energy”) entered into an equity distribution agreement (the “Equity Distribution Agreement”) with (i) Barclays Capital Inc., BMO Capital Markets Corp., BNP Paribas Securities Corp., BNY Mellon Capital Markets, LLC, BofA Securities, Inc., CIBC World Markets Corp., Citigroup Global Markets Inc., Goldman Sachs & Co. LLC, Huntington Securities, Inc., Jefferies LLC, J.P. Morgan Securities LLC, KeyBanc Capital Markets Inc., Mizuho Securities USA LLC, Morgan Stanley": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On August 4, 2025, the Registrant issued a press release, a copy of which is attached hereto as Exhibit 99.1 and is incorporated herein by reference.": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. On August 4, 2025, Diamondback Energy, Inc. (the “Company”) issued a press release announcing financial and operating results for the second quarter ended June 30, 2025, including the second quarter 2025 base cash dividend (the “earnings release”). A copy of the earnings release is furnished to the Securities and Exchange Commission (the “SEC”) as Exhibit 99.1 to this Current Report on Form 8-K. The Company also issued a": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition On August 4, 2025, Axon Enterprise, Inc. (the “Company”) issued a shareholder letter regarding the Company’s financial results for the quarter ended June 30, 2025. The full text of the letter is attached hereto as Exhibit 99.1 and is incorporated herein by reference. The information pursuant to\n\n(Item 2.02) in this report on Form 8-K is being furnished and shall not be deemed filed for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that section, and such information shall not be deemed incorporated by reference into any of the Company’s filings under the Securities Act of 1933, as amended (the “Securities Act”), or the Exchange Act, except as expressly": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On August 4, 2025, IDEXX Laboratories, Inc. (the “Company”) announced its financial results for the quarter ended June 30, 2025. The full text of the press release issued in connection with the announcement is furnished as Exhibit 99.1 to this Current Report on Form 8-K. In accordance with general instructions to Form 8-K, the information in this Form 8-K and the Exhibit 99.1 attached hereto is being furnished under\n\n(Item 2.02) and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934 (the “Exchange Act”) or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933 or the Exchange Act, except as expressly set forth by specific reference in such a filing.\n\n(Item 2.02) shall be deemed to be furnished, and not filed. Exhibit No. Description of Exhibit 99.1 Press Release entitled “IDEXX Laboratories Announces Second Quarter Results,” issued by the Company on August 4, 2025. 104 Cover Page Interactive Data File (embedded within the Inline XBRL document) 1": 0.0,
  "(Item 2.02) . Results of Operation and Financial Condition. On August 4, 2025, ON Semiconductor Corporation announced in a news release its financial performance for the second quarter ended July 4, 2025 and other related material information (the “ Earnings Release ”). A copy of the Earnings Release is attached hereto as Exhibit 99.1 and incorporated herein by reference. The information in\n\n(Item 2.02) of this Current Report on Form 8-K, including Exhibit 99.1, is being furnished under\n\n(Item 2.02) and shall not be deemed to be “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “ Exchange Act ”), or otherwise subject to liability under that section, nor shall such information be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, regardless of any general incorporation language in such filing, except as shall be expressly set forth": 0.1,
  "(Item 2.02) - Results of Operations and Financial Condition On August 4, 2025, Palantir Technologies Inc. (including its subsidiaries, “Palantir,” or the “Company”) issued a press release announcing its financial results for the fiscal quarter ended June 30, 2025. A copy of the press release is attached as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated by reference herein. The information furnished under this\n\n(Item 2.02) and in the accompanying Exhibit 99.1 shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that section, nor incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, regardless of any general incorporation language in such filing, unless expressly incorporated by specific reference in such filing.": 0.0,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (e) As previously disclosed in its quarterly report on Form 10-Q for the three months ended March 31, 2025, the board of directors (the “ Board ”) of Tesla, Inc., a Texas corporation (the “ Company ”) established a special committee (the “ Special Committee ”) to consider certain compensation matters involving Elon Musk, the Company’s Chief": 0.1,
  "(Item 8.01) Other Events. ATM Updates On August 4, 2025, MicroStrategy Incorporated d/b/a Strategy (“Strategy” or the “Company”) announced updates with respect to its at-the-market offering programs: ATM Program Summary During Period July 28, 2025 to August 3, 2025 As of August 3, 2025 Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) Common ATM - - - $17,042.7 Securities Offered: Class A Common Stock, $0.001 par": 0.1,
  "American Consumers Are Getting Thrifty Again": 0.6,
  "3 Stocks That Could Be Easy Wealth Builders": 0.5,
  "Taiwan cultivates young overseas chip talent with summer camps, university courses": 0.5,
  "1 Growth Stock to Stash and 2 That Underwhelm": -0.5,
  "3 Market-Beating Stocks with Promising Prospects": 0.5,
  "3 Low-Volatility Stocks That Fall Short": -0.5,
  "3 Market-Beating Stocks to Consider Right Now": 0.5,
  "Building Automation System Market Set to Double by 2030 Amid Rising IoT Integration": 0.5,
  "HAZMAT Suits Market Forecast Report 2025-2030, with Profiles of 3M, DuPont de Nemours, Honeywell, Ansell, Dragerwerk, Kimberly-Clark, Lakeland Industries, Alpha Pro Tech, Halyard Health, and Kappler": 0.2,
  "The Zacks Analyst Blog Highlights Adobe, Disney, Intuit, Rollins and Johnson & Johnson": 0.5,
  "Cash Windfall From Trump’s Tax Law Is Starting to Show Up at Big Companies": 0.5,
  "Mach42™ Unveils Breakthrough AI Solution for Analog Circuit Analysis": 0.6,
  "Five Wisconsin businesses disclosed layoffs in July affecting 170 workers": -0.5,
  "Underground Pipe and Cable Locator Global Market Insights 2025, with Key Player Profiles for SPX, Vivax-Metrotech, Leica, Subsite, IPEK, IBAK, System Studies, Agilent, Shawcor, Roper, and Ridgid": 0.1,
  "Market Chatter: Union Pacific-Norfolk Southern Deal Faces Pushback From Rail Customers": -0.5,
  "Berkshire's Kraft Heinz Impairment May Pressure Earnings": -0.5,
  "5 Things to Know Before the Stock Market Opens": 0.0,
  "Manufacturing issues at Novo facility disrupt Regeneron drug review": -0.5,
  "This Week In AI Chips - CAST Unveils MCP Server Transforming Enterprise AI Solutions": 0.6,
  "Autodesk extends invitation to join financial results conference call": 0.5,
  "Armis Rapidly Surpasses $300M ARR as Demand For Cyber Exposure Management and Cyber-Physical Systems Security Soars": 0.8,
  "UP-NS merger puts intermodal giants on the wrong side of the map": -0.6,
  "Workday to Hold Annual Financial Analyst Day on September 16, 2025": 0.0,
  "Roper Technologies to present at Oppenheimer Technology Conference": 0.5,
  "Workday to Announce Fiscal 2026 Second Quarter Financial Results on August 21, 2025": 0.0,
  "AIM ImmunoTech Builds Positive Momentum and Reiterates Focus on Driving Ampligen® Clinical Development Toward Pancreatic Cancer Approval": 0.8,
  "Investors Heavily Search Comcast Corporation (CMCSA): Here is What You Need to Know": 0.5,
  "QUALCOMM Incorporated (QCOM) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Adobe Inc. (ADBE) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Should You Think About Buying Honeywell International Inc. (NASDAQ:HON) Now?": 0.2,
  "KLA Full Year 2025 Earnings: EPS Beats Expectations": 0.8,
  "QUALCOMM Third Quarter 2025 Earnings: EPS Beats Expectations": 0.8,
  "Marvell Technology, Inc. Announces Conference Call to Review Second Quarter of Fiscal Year 2026 Financial Results": 0.0,
  "Estimating The Fair Value Of Paychex, Inc. (NASDAQ:PAYX)": 0.5,
  "ON Semiconductor Corp. (ON) Q2 Earnings Miss Estimates": -0.7,
  "Cognizant (CTSH) International Revenue Performance Explored": 0.0,
  "Countdown to CDW (CDW) Q2 Earnings: A Look at Estimates Beyond Revenue and EPS": 0.2,
  "Don't Overlook Mondelez (MDLZ) International Revenue Trends While Assessing the Stock": 0.2,
  "Countdown to Atlassian (TEAM) Q4 Earnings: Wall Street Forecasts for Key Metrics": 0.2,
  "I&M, Google Filing to Support Reliability Through Demand Response Structure": 0.5,
  "PepsiCo: A Great Long-Term Value Play": 0.8,
  "Is Netflix Stock a Buy, Sell, or Hold in 2025?": 0.0,
  "The Nashville area is one of the top metro areas college grads are flocking to. Here's why": 0.6,
  "Are You a Value Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Berkshire Earnings Key Takeaways: Strong Profit, No Buybacks, and a Falling Stock": -0.5,
  "Are You a Growth Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Warren Buffett's Berkshire Hathaway Skids As Q2 Operating Profit Falls 4%": -0.5,
  "Micron Technology, Inc.'s (NASDAQ:MU) institutional investors lost 5.7% last week but have benefitted from longer-term gains": 0.5,
  "Even though NXP Semiconductors (NASDAQ:NXPI) has lost US$4.7b market cap in last 7 days, shareholders are still up 88% over 5 years": 0.5,
  "Xcel Energy Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "CDW Set to Report Q2 Earnings: Is a Beat in the Cards?": 0.5,
  "Constellation Energy (CEG) to Invest Billions in Pennsylvania": 0.8,
  "Former Coupa CPO Michael Van Keulen Joins Flywl as Strategic Advisor": 0.5,
  "CARDINALS AND SPECTRUM ANNOUNCE MARKETING PARTNERSHIP": 0.5,
  "ComEd, Metropolitan Mayors Caucus Announce 17 Northern Illinois Communities Complete Training to Become \"EV Ready\"": 0.5,
  "Broadvoice | GoContact Names New Chief Product Officer": 0.2,
  "“Libertarian” FCC Commissioner Was Believed to Be Uncomfortable with Paramount Deal: Exclusive": -0.5,
  "SNIA Announces Storage.AI": 0.2,
  "Wells Fargo cuts Lululemon target on margin pressure": -0.5,
  "4 Auto Stocks Likely to Outperform Q2 Earnings Estimates": 0.5,
  "Should You Buy, Sell, or Hold SkyWater Stock Before Q2 Earnings?": 0.0,
  "U.S. News & World Report Names Cintas One of the Best Companies to Work For 2025-2026": 0.8,
  "Will These 5 Pharma, Biotech Bigwigs Surpass Q2 Earnings Forecasts?": 0.5,
  "What Makes GE HealthCare (GEHC) a New Strong Buy Stock": 0.8,
  "Fastenal (FAST) Upgraded to Buy: Here's Why": 0.6,
  "Is MRVL Stock a Buy, Sell or Hold at a P/E Multiple of 7.15X?": 0.0,
  "Palantir's Army deal, ON Semi earnings, Opendoor jumps": 0.5,
  "AT&T Surges 46.8% in a Year: Should T Stock Be in Your Portfolio?": 0.6,
  "Why Alphabet Stock Popped on Monday": 0.5,
  "Fortinet Stock Before Q2 Earnings: Buy Now or Wait for Results?": 0.2,
  "US Equity Indexes Rebound in Midday Trading": 0.6,
  "Why onsemi (ON) Shares Are Sliding Today": -0.5,
  "Berkshire Hathaway's shares fall after $3.8 billion write-down, operating profit weakness": -0.7,
  "Figma sheds $11 billion in market value days after blockbuster IPO": -0.8,
  "Biogen Inc. (BIIB): A Bull Case Theory": 0.5,
  "US Equity Indexes Rebound, Treasury Yields Drop as Bets for September Fed Rate-Cut Continue to Surge": 0.6,
  "Sector Update: Health Care Stocks Advance Monday Afternoon": 0.5,
  "Diamondback CEO: US Shale Oil Remains Stunted by ‘Macro Uncertainty’": -0.5,
  "Legendary investor Vinod Khosla advises Gen Z to invest in this one skill because ChatGPT can teach you everything else": 0.5,
  "Ross Stores, Urban Outfitters, Zumiez, Camping World, and Kohl's Stocks Trade Up, What You Need To Know": 0.5,
  "PrideStaff Launches New Fort Worth (West) Office to Strengthen Workforce Solutions in North Texas": 0.6,
  "HireRight Appoints Jim Desmond as Chief Information Security Officer": 0.5,
  "Chipmaker Onsemi's CEO Warns of 'Cautious' Customer Behavior. The Stock Is Falling": -0.6,
  "‘Cannot do business in the state of California’: Gas prices could hit $8/gallon as two refineries shut down": -0.8,
  "Equity Markets Rise Intraday Following Friday's Decline": 0.5,
  "Nat-Gas Prices Tumble on Higher US Nat-Gas Production": -0.7,
  "Sector Update: Financial": 0.0,
  "Equity Markets Rise Even After Decline in June Factory Orders": 0.2,
  "U.S. Natural Gas Futures Settle Lower": -0.5,
  "Diamondback Energy, Inc. Announces Second Quarter 2025 Financial and Operating Results": 0.5,
  "Viper Energy, Inc., a Subsidiary of Diamondback Energy, Inc., Reports Second Quarter 2025 Financial and Operating Results": 0.5,
  "Letter to Stockholders Issued by Diamondback Energy, Inc": 0.0,
  "Citi Bullish on Semis Despite Slump. This Stock Is the Firm’s Top Pick.": 0.8,
  "Acadia Pharmaceuticals Appoints Scott Cenci as Chief Information and Data Officer": 0.5,
  "Data Center Spending Strength Bodes Well For Nvidia Stock": 0.8,
  "The Kraft Heinz Company (KHC): A Bull Case Theory": 0.5,
  "How Idexx Laboratories Is Riding The 'Puppy Boom' To New Highs": 0.8,
  "lululemon athletica inc. (LULU): A Bull Case Theory": 0.5,
  "MercadoLibre misses profit estimates as Brazil free-shipping boost hurts margins": -0.5,
  "US Equity Markets End Higher After EU Postpones Planned Tariffs on US Goods": 0.8,
  "Diamondback: Q2 Earnings Snapshot": 0.0,
  "These Stocks Moved the Most Today: Palantir, Tesla, Berkshire Hathaway, ON Semiconductor, Joby, D-Wave, and More": 0.5,
  "Mercado Libre Delivers Another Strong Performance in Q2'25, Reporting $6.8 billion Revenue and $825 million Income from Operations": 0.8,
  "Onco360® Has Been Selected as a Specialty Pharmacy Partner for LYNOZYFIC™ (linvoseltamab-gcpt)": 0.5,
  "Cellectis Reports Second Quarter 2025 Financial Results & Business Updates": 0.0,
  "ON Semiconductor Corporation (ON): A Bull Case Theory": 0.5,
  "Stock Market Today: Dow Rallies; Palantir Surges; Trump Says This On Sydney Sweeney Ad As American Eagle Soars": 0.5,
  "Equity Markets Close Higher After June Factory Orders Decline": 0.2,
  "SBA Communications raises annual revenue forecast on robust wireless carrier activity": 0.8,
  "Wall Street Rebounds After Friday's Equity Sell-Off; Traders Await More Earnings Reports": 0.5,
  "S&P 500 Gains and Losses Today: Retail Sector Stocks Rise Amid Rate Cut Hopes": 0.5,
  "Mobileye Global Inc. (MBLY): A Bull Case Theory": 0.5,
  "MercadoLibre slips 5% premarket as Brazil free-shipping changes weigh on margins": -0.6,
  "Coinbase, PayPal Press Forward With Stablecoin Rewards Despite GENIUS Prohibitions–Here's How": 0.5,
  "Diamondback Energy (FANG) Tops Q2 Earnings and Revenue Estimates": 0.8,
  "Berkshire Stock Was Hammered Monday. It’s Like 1999 Again.": -0.6,
  "MercadoLibre: Q2 Earnings Snapshot": 0.0,
  "Hims & Hers, ThredUp, MercadoLibre: After-hours trending stocks": 0.0,
  "PDD Holdings Inc. Sponsored ADR (PDD) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Intuit (INTU) Ascends But Remains Behind Market: Some Facts to Note": 0.1,
  "Palo Alto Networks (PANW) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Stocks to Watch Monday: Palantir, Hims & Hers, Vertex, Tesla": 0.2,
  "Why Netflix Stock Lost 13% in July": -0.6,
  "MercadoLibre (MELI) Q2 Earnings Miss Estimates": -0.5,
  "MercadoLibre (NASDAQ:MELI) Beats Q2 Sales Targets But Stock Drops": -0.5,
  "Intel's credit rating downgraded by Fitch on demand challenges": -0.7,
  "Why Lululemon Stock Lost 16% in July": -0.5,
  "MercadoLibre (MELI) Q2 Earnings: Taking a Look at Key Metrics Versus Estimates": 0.5,
  "SIGGRAPH 2025 Announces Keynote Presentations Featuring Top Technological Marvels Shaping Our Trajectory Toward a Better Future": 0.8,
  "(ITEM 5.02) DEPARTURE OF DIRECTORS OR CERTAIN OFFICERS; ELECTION OF DIRECTORS; APPOINTMENT OF CERTAIN OFFICERS; COMPENSATORY ARRANGEMENTS OF CERTAIN OFFICERS. On August 1, 2025, Charter Communications, Inc. (“Charter”) entered into an employment agreement (the “Agreement”) with Richard DiGeronimo, Charter’s President, Product and Technology. The Agreement, which is effective as of August 1, 2025, has a term ending August 1, 2027 (or upon an earlier termination of employment) and provides that Mr. DiGeronimo will continue to serve as": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (b) On July 31, 2025, Ellen Ochoa resigned from the Board of Directors, or the Board, of NVIDIA Corporation, or the Company, including as a member of the Nominating and Corporate Governance Committee of the Board, effective immediately. Dr. Ochoa’s resignation is for personal reasons and not because of any disagreement with the Company on any": -0.2,
  "(Item 2.02) Results of Operations and Financial Condition. On August 5, 2025, Advanced Micro Devices, Inc. (\"AMD\") announced its financial results for its second quarter of 2025 ended June 28, 2025 in a press release that is attached hereto as Exhibit 99.1. Attached hereto as Exhibit 99.2 is a presentation regarding AMD's second quarter of 2025. The attached Exhibits 99.1 and 99.2 include references to certain non-U.S. Generally Accepted Accounting Principles (“GAAP”) financial information and forward-looking financial\n\n(Item 2.02) “Results of Operations and Financial Condition” is incorporated into this": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. Second Quarter 2025 Earnings Press Release and Reconciliation of Non-GAAP Financial Measures On August 5, 2025 , the Company issued a press release announcing its unaudited results of operations for the three and six months ended June 30, 2025, and its unaudited financial position as of June 30, 2025. The full text of the press release is furnished as Exhibit 99.1 hereto. In its press release the Company included\n\n(Item 2.02) of this Current Report is not incorporated by reference into any filings of the Company made under the Securities Act of 1933, as amended, whether made before or after the date of this Current Report, regardless of any general incorporation language in the filing unless specifically stated so therein.": 0.1,
  "(Item 8.01) – Other Events. On August 5, 2025, T-Mobile US, Inc. (the “Company”), together with T-Mobile USA, Inc., its wholly-owned subsidiary (“T-Mobile USA”), settled the previously announced exchange offers and consent solicitations (the “Exchange Offers and Consent Solicitations”), in connection with the Company’s acquisition of certain assets from Array Digital Infrastructure, Inc. (formerly known as United States Cellular Corporation), which closed on August 1, 2025. Pursuant to the settlement of the Exchange Offers and Consent Solicitations,": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. Financial Results for the Quarter Ended June 30, 2025 On August 5, 2025, Marriott International, Inc. ( “ Marriott ” ) is issuing a press release reporting financial results for the quarter ended June 30, 2025. A copy of Marriott’s press release is attached as Exhibit 99 and incorporated by reference.": 0.0,
  "Ambiq Micro's IPO Could Signal the Next Wave of AI-Driven Chip Stocks": 0.6,
  "Earnings To Watch: CDW (CDW) Reports Q2 Results Tomorrow": 0.2,
  "3 Big Reasons to Love Lululemon (LULU)": 0.8,
  "Online scam uses fake ICE raids at Target and Walmart to steal personal data": -0.8,
  "Debashis Chatterjee Joins Ascendion Board to Shape the Future of AI-Powered Software Engineering": 0.6,
  "3 S&P 500 Stocks That Concern Us": -0.5,
  "2 Nasdaq 100 Stocks Worth Your Attention and 1 That Underwhelm": 0.2,
  "1 Large-Cap Stock to Own for Decades and 2 We Question": 0.2,
  "1 Nasdaq 100 Stock to Own for Decades and 2 We Find Risky": 0.2,
  "3 Russell 2000 Stocks We Approach with Caution": -0.5,
  "Starbucks sees a CX future in its coffeehouse roots. Is that enough?": 0.2,
  "IDEXX Laboratories Inc (IDXX) Q2 2025 Earnings Call Highlights: Strong Revenue and EPS Growth ...": 0.8,
  "Red Canary Research Reveals Sharp Rise in Cloud and Identity Threats, Exposing Critical Cybersecurity Risks": 0.5,
  "ON Semiconductor Corp (ON) Q2 2025 Earnings Call Highlights: Resilient Revenue Growth Amid ...": 0.5,
  "MercadoLibre Inc (MELI) Q2 2025 Earnings Call Highlights: Record Growth and Strategic Advancements": 0.8,
  "2 Soaring Growth Stocks That Could Climb Another 15% to 20%, According to Wall Street Analysts": 0.8,
  "Bull of the Day: Netflix, Inc. (NFLX)": 0.5,
  "Arm Holdings (ARM) Delivers ‘Respectable’ Quarter—But Investors Wanted More": 0.2,
  "Palo Alto’s (PANW) Bold CyberArk Acquisition Raises Eyebrows—and a Downgrade": -0.5,
  "Benchmark Stays Bullish on Qualcomm (QCOM) —Here’s Why": 0.8,
  "O’Reilly Automotive acquires Texas distribution center amid capacity constraints": 0.2,
  "Analysis: Sliding US rig count outpaces efficiency gains, threatening onshore oil output": -0.6,
  "Alibaba to Shut Costco-Like China Stores After Rivalry Heats Up": -0.6,
  "JD.com to launch five discount stores as competition intensifies": 0.2,
  "OpenTable: why UK Hotel Restaurants Are the New Culinary Hotspots": 0.6,
  "Is Wall Street Bullish or Bearish on Copart Stock?": 0.2,
  "1 Green Flag for Costco Stock (COST) Right Now": 0.6,
  "Nvidia (NVDA) Gets Vote of Confidence From Citi as AI Capex Set to Soar": 0.8,
  "Stock Index Futures Gain on Strong Earnings and Fed Rate-Cut Bets": 0.8,
  "CEG vs. AEP: Which Utility Is Best Positioned for Long-Term Growth? (Revised)": 0.2,
  "Is ASML Stock a Buy Now?": 0.0,
  "Berkshire Shares Tumble as Buffett Has Five Months Left at the Helm to Make a Big Deal": -0.5,
  "SOPHiA GENETICS expands collaboration with AstraZeneca using AI to improve breast cancer patient outcomes": 0.8,
  "Independent power producers hit back at utility critics over PJM price surge": 0.1,
  "ON Semiconductor Second Quarter 2025 Earnings: Revenues Beat Expectations, EPS Lags": 0.2,
  "President of Charter Communications Christopher Winfrey Buys 1.7% More Shares": 0.5,
  "Is Marvell Technology (NASDAQ:MRVL) A Risky Investment?": -0.5,
  "The past three years for Keurig Dr Pepper (NASDAQ:KDP) investors has not been profitable": -0.8,
  "Garmin announces collaborations with leading brands for Garmin Marathon Series": 0.5,
  "Adaptec® SmartRAID 4300 Series of Accelerators Deliver Scalable, Secure NVMe® RAID Storage Solutions": 0.6,
  "IDEXX Laboratories Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "3 Cheap Tech Stocks to Buy Right Now": 0.5,
  "Aurora begins nighttime driverless operations": 0.5,
  "EXCLUSIVE: Vivani Prioritizes Semaglutide-Based Implant After Promising Preclinical Data": 0.8,
  "Stocks Rise Pre-Bell Ahead of Latest Corporate Earnings; Investors Monitor Tariff Developments": 0.5,
  "ISRG's Ion Platform Sees Uptick in Utilization, Eyes Efficiency": 0.5,
  "Exploring 3 High Growth Tech Stocks In The US Market": 0.5,
  "PepsiCo (PEP) Slid on Concerns Over Slowing U.S. Consumption and Rising Competitive Pressure": -0.6,
  "Marriott International Narrows Guidance After Gains": 0.5,
  "Here’s Why Starbucks (SBUX) Retreated in Q2": 0.1,
  "Marriott earnings top estimates despite economic uncertainty": 0.8,
  "Aluminum can maker Ball Corp lifts annual profit forecast buoyed by strong global demand": 0.8,
  "Jack Selby Joins Keebeck Wealth Management's Advisory Board": 0.5,
  "Aviatrix® Appoints Willie Tejada as Cloud Native Security Fabric GM as Enterprises Shift Focus to Workload Protection": 0.5,
  "Cisco Reinvents Digital Resilience for the Agentic Era at Splunk .conf25": 0.5,
  "3 Stocks to Boost Your Portfolio as Semiconductor Sales Skyrocket": 0.8,
  "Some Investors May Be Worried About Copart's (NASDAQ:CPRT) Returns On Capital": -0.5,
  "CrowdStrike Extends AI Agent Security Across the SaaS Stack": 0.5,
  "Marriott International (MAR) Surpasses Q2 Earnings and Revenue Estimates": 0.8,
  "Palo Alto Networks Redefines Application Security with the Industry's Most Comprehensive Prevention-First ASPM": 0.6,
  "Pfizer, Caterpillar and Marriott: Market Movers": 0.0,
  "Silicon Laboratories (SLAB) Q2 Earnings and Revenues Surpass Estimates": 0.8,
  "Navitus Partners with Costco Pharmacy to Advance Drug Price Transparency": 0.5,
  "Companies Tout More Investments, Orders From Trump’s Tax Bill in Earnings Calls": 0.5,
  "Mission North Expands Financial Services Practice with New Leadership and Clients": 0.6,
  "Comcast Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "Netflix and Badger Meter have been highlighted as Zacks Bull and Bear of the Day": 0.2,
  "Here’s Why Baron Global Advantage Fund’s Estimate of MercadoLibre’s (MELI) Intrinsic Value Has Risen": 0.5,
  "NVIDIA Stock Jumps 59% in Three Months: Time to Hold or Exit?": 0.5,
  "Arm Stock: Are Investors Missing the Forest for the Trees?": 0.2,
  "Webflow Payment Gateways for Cannabis Seeds Set to Surge in 2025, Organic Payment Gateways Predicts": 0.5,
  "Attain, Kargo, and SmartCommerce Win ADWEEK’s 2025 Media Plan of the Year Award for Best Use of Insights": 0.6,
  "PayPal Holdings, Inc. (PYPL) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Starbucks Corporation (SBUX) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Here is What to Know Beyond Why MicroStrategy Incorporated (MSTR) is a Trending Stock": 0.2,
  "CrowdStrike (CRWD) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Tempus AI Targets Breast Cancer With Expanded Next - AI Platform": 0.5,
  "GlobalFoundries Navigates Weak Outlook As Mobile Device Revenue Declines": -0.6,
  "Europe Online Education Market Trends and Company Analysis Report 2025-2033 Featuring Coursera, Instructure, Adobe, Alphabet, Udemy, Pearsons, Stride, NetEase": 0.5,
  "Here’s Why Baron Global Advantage Fund’s Has Strong Conviction in NVIDIA (NVDA)": 0.6,
  "Coinbase, Circle, Metaplanet Stocks Tumble: What's Driving The Decline?": -0.6,
  "Cathie Wood is Buying Figma Stock with Both Hands. Should You Buy This Hot IPO, Too?": 0.6,
  "Palo Alto vs. Check Point: Which Cybersecurity Stock Has an Edge?": 0.2,
  "PepsiCo UK factory jobs at risk": -0.6,
  "Company News for Aug 5, 2025": 0.0,
  "Wall Street Analysts Think Synopsys (SNPS) Is a Good Investment: Is It?": 0.5,
  "Caterpillar tariff warning, Yum misses, Marriott cuts outlook": -0.5,
  "Waymo may be worth $200B+ using Tesla as benchmark—DA Davidson": 0.5,
  "Block downgraded, Wayfair upgraded: Wall Street's top analyst calls": 0.5,
  "Marriott’s (NASDAQ:MAR) Q2 Sales Beat Estimates": 0.8,
  "Why Lam Research (LRCX) is a Top Momentum Stock for the Long-Term": 0.6,
  "Stocks See Support from Strong Earnings and Rate Cut Speculation": 0.8,
  "Form 8.3 - QCOM US": 0.0,
  "Compared to Estimates, Marriott (MAR) Q2 Earnings: A Look at Key Metrics": 0.2,
  "Vertex Stock Tumbles After Strong Earnings. What’s Spooking Investors.": -0.6,
  "Not Even Warren Buffett Wins 'Em All—Recent Losses on Two Big Investments Prove It": -0.5,
  "Stablecoins, Assemble: Visa's Playbook Adds More Pages & Blockchains": 0.5,
  "Diamondback says it should be Permian's 'consolidator of choice' as oil outlook dims": 0.2,
  "Secure Access Service Edge (SASE) Market Company Evaluation Report 2025 | Palo Alto Networks, Fortinet, and Broadcom Lead with AI-Driven Security, Integrated Platforms, & Scalable Enterprise Solutions": 0.6,
  "Compared to Estimates, GlobalFoundries (GFS) Q2 Earnings: A Look at Key Metrics": 0.2,
  "AI for Sales and Marketing Company Evaluation Report 2025 | Salesforce, Google, and Adobe Lead with Advanced Personalization, Predictive Analytics, and Marketing Automation": 0.6,
  "MercadoLibre Q2 Earnings Miss Estimates, Revenues Rise Y/Y": 0.2,
  "HPE Unveils New AI-Driven Security and Advanced Data Protection Innovations at Black Hat USA 2025": 0.6,
  "Comcast Extends its High-Speed Internet Network and Brings Advanced Connectivity Services to Block 59 Redevelopment in Naperville": 0.6,
  "Comcast Deepens Roots in Bossier City with $19 Million Investment, Local Partnerships, and Expanded Internet Access": 0.8,
  "Marriott Stock Up as Q2 Earnings Beat Estimates, RevPAR Rises Y/Y": 0.8,
  "AMD and 3 More Chip Stocks to Watch That Aren’t Nvidia": 0.2,
  "US proposes new drone rules that could lead to Starbucks, Amazon deliveries": 0.5,
  "ON Semiconductor Q2 Shows 'Muted' Sales Recovery, Auto Weakness; BofA Says": -0.5,
  "These 3 CEOs Just Bought the Dip": 0.5,
  "VRTX Q2 Earnings Beat, Stock Down as Pain Drug Misses Study Goal": -0.5,
  "Top Stock Movers Now: Gartner, Axon Enterprise, Palantir, and More": 0.5,
  "FIVN or ADSK: Which Is the Better Value Stock Right Now?": 0.0,
  "Jim Cramer on Lam Research: “Let it Come in And Then Do Some Buying”": 0.6,
  "CRSP Stock Down on Huge Q2 Loss, Focus on Increasing Casgevy Adoption": -0.5,
  "MercadoLibre Q2: CFO talks tariff impacts & Brazil e-commerce": 0.2,
  "Microchip Set to Report Q1 Earnings: What's in Store for the Stock?": 0.2,
  "How To Put Marvell Technology Stock On An Iron Condor's Wings": 0.2,
  "Marriott Trims Its Full Year Outlook": -0.5,
  "Starbucks under pressure again as Brazilian tariffs hike coffee costs": -0.7,
  "Trump threatens 250pc tariffs on drug imports": -0.8,
  "Marriott CEO Highlights Luxury Spend Offset By Economic Uncertainty, Reduced Government And Business Travel": -0.5,
  "From ingredient costs to sagging demand, tariffs further pinch company earnings": -0.6,
  "Healthy Position In AI-driven Memory Market Aids Micron Technology (MU), Says Parnassus Investments": 0.6,
  "Susquehanna Reiterates Bullish Stance on QUALCOMM (QCOM) Stock": 0.8,
  "Argus Raises PT on NXP Semiconductors N.V. (NXPI) Stock, Maintains Buy": 0.6,
  "Constellation Energy Corporation Declares Dividend": 0.5,
  "VRTX: Vertex Shares Tank After Pain Drug Flop in Key Trial": -0.8,
  "Diamondback Eyes M&A as Permian's ‘Consolidator of Choice,’ CEO Says": 0.5,
  "Can $10,000 in O'Reilly Automotive Stock Turn Into $61,917 by 2035?": 0.2,
  "Figma (FIG) Drops 27% on Profit-Taking": -0.7,
  "DexCom (DXCM) Extends Losses on Day 5 Amid Leadership Change": -0.6,
  "ON Semiconductor (ON) Nosedives 15% as Cautious Market Weighs on Outlook": -0.8,
  "CEG's Q2 Earnings Coming Up: How Should Investors Play the Stock?": 0.5,
  "MercadoLibre Stock Pushes Higher, Shaking Off Q2 Earnings Miss": 0.6,
  "Qualcomm (QCOM) Delivers Solid Results—But Apple Headwinds Still Loom": 0.2,
  "Raymond James Reiterates Outperform on Arm Holdings (ARM), Raises PT to $165": 0.8,
  "Palo Alto Networks, Inc. (PANW): A Bull Case Theory": 0.5,
  "Nuclear Sector Earnings Show a Mixed Picture. Why One Stock Is Surging.": 0.2,
  "Macro Data, Trade Developments Leave Equities Mixed Intraday": 0.1,
  "Ellucian Awards Transact + CBORD Verified SaaS Badges for Eight Integrated Payment Solutions": 0.2,
  "MicroStrategy Stock Due for Short-Term Bounce": 0.5,
  "Best Stocks to Own: Workday Stock Could Add 8% in August": 0.8,
  "There’s a new 1099-K threshold: What you should know if you get paid via Venmo, Cash App or PayPal": 0.1,
  "Oil Falls as Possible Russia Air Truce Eases Crude Supply Risks": 0.2,
  "Why GlobalFoundries Sank Today": -0.5,
  "Top Stock Reports for Morgan Stanley, PepsiCo & Comcast": 0.0,
  "Equity Markets Lower After July Services Sector Data, June Trade Deficit": -0.5,
  "Why Vertex Pharmaceuticals (VRTX) Stock Is Trading Lower Today": -0.5,
  "AMGEN REPORTS SECOND QUARTER 2025 FINANCIAL RESULTS": 0.0,
  "Amgen profit rises, weight-loss data expected in 4th quarter": 0.5,
  "Resideo Announces Record Second Quarter 2025 Financial Results; Raises 2025 Outlook; Initiates Third Quarter 2025 Outlook": 0.8,
  "Datadog to Present at Upcoming Investor Conferences": 0.0,
  "CrowdStrike Announces Date of Fiscal Second Quarter 2026 Financial Results Conference Call": 0.0,
  "Axon Stock Skyrocketed on Tuesday. Here's Why Shares of the TASER Maker Popped.": 0.8,
  "Amgen: Q2 Earnings Snapshot": 0.0,
  "Companies Are Sounding Ebullient on Trump’s Tax Law. Tariffs Could Be a Killer.": 0.2,
  "Why Vertex Pharma Is Feeling The Pain Despite A Second-Quarter Beat": -0.5,
  "Axon Rallies On Earnings, After Joby, Defense Stocks Rise": 0.5,
  "US Equity Markets End Lower After Weak Economic Data, Tariff Remarks by Trump": -0.7,
  "Equity Markets Close Lower Amid July Slowdown in Services Sector, Trade Data": -0.5,
  "Amgen inches lower premarket despite second-quarter earnings beat": -0.2,
  "These Stocks Moved the Most Today: Palantir, Vertex, Hims & Hers, Coinbase, BP, and More": 0.2,
  "AMD reports weaker-than-expected earnings even as revenue tops estimates - For the current quarter, AMD expects sales of $8.7 billion, plus or minus $300 million, versus expectations of earnings of $8.3 billion. AMD reported net income during its fiscal second quarter of $872 million, or 54 cents per share, increasing from $265 million, or 16 cents per share in the year-ago period. Nvidia's overall sales rose 32% in the period from $5.84 billion a year": 0.2,
  "Amgen Posts Higher Profit, Revenue On Sales Growth Among Products": 0.5,
  "AMD bull and bear react to Q2 earnings": 0.1,
  "S&P 500 Gains and Losses Today: Gartner Stock Plunges; Palantir, Axon Surge After Earnings": 0.5,
  "Amgen (AMGN) Beats Q2 Earnings and Revenue Estimates": 0.8,
  "Stocks to Watch Recap: Palantir, Coinbase, Gartner, Pfizer": 0.0,
  "Equities Fall as ISM Data Spark Economic Concerns": -0.7,
  "Qualys (QLYS) Surpasses Q2 Earnings and Revenue Estimates": 0.8,
  "Amgen (AMGN) Q2 Earnings: Taking a Look at Key Metrics Versus Estimates": 0.2,
  "Stocks to Watch Afterhours: AMD, Amgen, Snap": 0.0,
  "Copart, Inc. (CPRT) Ascends While Market Falls: Some Facts to Note": 0.5,
  "Weekly Picks: ASML's Selloff Explained, WH's Global Expansion, and NVO's Market Mispricing": 0.2,
  "Amgen’s (NASDAQ:AMGN) Q2: Beats On Revenue": 0.5,
  "(Item 2.02) Results of Operations and Financial Condition. On August 6, 2025 , DoorDash, Inc. (\"DoorDash\") issued a press release announcing its financial results for the quarter ended June 30, 2025. A copy of the press release is attached as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated herein by reference.\n\n(Item 2.02) and": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On August 6, 2025, Fortinet, Inc. issued a press release reporting its financial results for the second quarter ended June 30, 2025. A copy of the press release is furnished herewith as Exhibit 99.1 and is incorporated herein by reference. This information shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or incorporated by reference in": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. CDW Corporation (the \"Company\") is furnishing under cover of this Current Report on Form 8-K a copy of its press release dated August 6, 2025 announcing its second quarter 2025 financial results. The press release is attached to this report as Exhibit 99.1 and incorporated herein by reference. The Company is furnishing this information in connection with its previously announced webcast conference call to be held on August\n\n(Item 2.02) of this Current Report on Form 8-K (including Exhibit 99.1) is being furnished and shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as expressly set forth by specific\n\n(Item 8.01) . Other Events. Quarterly Cash Dividend On August 6, 2025, the Company also announced that its Board of Directors has declared a quarterly cash dividend of $0.625 per common share to be paid on September 10, 2025 to all stockholders of record as of the close of business on August 25, 2025. A copy of the press release announcing the declaration of the quarterly cash dividend is attached to this report as Exhibit 99.2 and": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On August 6, 2025, Shopify Inc. (the \"Company\") issued a press release announcing its financial results for the quarter ended June 30, 2025. A copy of the press release is furnished as Exhibit 99.1 to this report. The information furnished with this\n\n(Item 2.02) , including Exhibit 99.1, shall not be deemed \"filed\" for the purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference into any other filing under the Securities Act of 1933, as amended, or the Exchange Act, except as expressly set forth by specific reference in such a filing.": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On August 6, 2025, Airbnb, Inc. (the “Company”) issued a Shareholder Letter (the “Letter”) announcing its financial results for the second quarter ended June 30, 2025. In the Letter, the Company also announced that it would be holding a conference call on August 6, 2025 at 1:30 p.m. PT / 4:30 p.m. ET to discuss its financial results for the second quarter ended June 30, 2025. A copy\n\n(Item 2.02) of this Form 8-K, including Exhibit 99.1 attached hereto, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference into any other filing under the Securities Act of 1933, as amended, or the Exchange Act, regardless of any general incorporation language in such filing, except as": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition On August 6, 2025, the Company issued a press release announcing its financial results for the quarter ended June 30, 2025. A copy of the press release is attached as Exhibit 99.1 to this current report on Form 8-K and is incorporated by reference herein. The information in this\n\n(Item 2.02) of this current report on Form 8-K and Exhibit 99.1 attached hereto shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”) or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, regardless of any general incorporation language in such filing.": 0.0,
  "What is apples long term plan? - Don’t get me wrong, I don’t think Apple is going anywhere. They aren’t going to become the next Cisco or something. However, I am starting to get worried. Apple is going no where, however, the hype for their products is just dwindling. Gen Z kids are definitely addicted to Apple, but let’s be real, they are perfectly fine having a 3-4 year old IPhone and AirPods. While I": -0.5,
  "This Arm-Backed Chipmaker Just Soared 98% on Day One -- Should You Buy the Hype?": 0.6,
  "An All-Inclusive Resort for $900 a Night? I Put One to the Test": 0.2,
  "Lam Research Corporation (LRCX): A Bull Case Theory": 0.5,
  "Trump says pharma tariffs to start small, then soar to 250%": -0.6,
  "Atlassian (TEAM) Q2 Earnings: What To Expect": 0.0,
  "Datadog Earnings: What To Look For From DDOG": 0.2,
  "Microchip Technology (MCHP) Q2 Earnings: What To Expect": 0.2,
  "If Tomatoes are a Fruit, is Ketchup a Smoothie? HEINZ and Smoothie King Weigh In with First-Ever Tomato Ketchup Smoothie": 0.5,
  "3 Reasons We Love Cintas (CTAS)": 0.5,
  "2 Reasons to Avoid PANW and 1 Stock to Buy Instead": -0.5,
  "3 Nasdaq 100 Stocks with Exciting Potential": 0.6,
  "2 Unpopular Stocks That Deserve Some Love and 1 We Question": 0.2,
  "1 S&P 500 Stock for Long-Term Investors and 2 We Brush Off": 0.2,
  "2 S&P 500 Stocks to Target This Week and 1 That Underwhelm": 0.2,
  "3 S&P 500 Stocks with Open Questions": 0.0,
  "3 Healthcare Stocks We Find Risky": -0.8,
  "3 S&P 500 Stocks We Approach with Caution": -0.5,
  "Do Wall Street Analysts Like Texas Instruments Stock?": 0.2,
  "Novo Nordisk Reports 16% Sales Increase, 25% Rise in Operating Profit for H1 2025; Lowers Full-Year Sales Outlook - Novo Nordisk A/S has reported a 16% increase in sales measured in Danish kroner and an 18% rise at constant exchange rates (CER), reaching DKK 154.9 billion for the first half of 2025. The company's operating profit has also seen a significant increase of 25% in Danish kroner and 29% at CER, amounting to DKK 72.2": 0.8,
  "Coca-Cola Europacific Partners Plc Announces Results for The Six Months Ended 27 June 2025": 0.1,
  "Peter Schiff Says Gold Outperformed Bitcoin, Michael Saylor's Strategy Since Trump's Win — Here Is The Bigger Picture": 0.2,
  "Amgen Inc (AMGN) Q2 2025 Earnings Call Highlights: Strong Revenue Growth and Robust Pipeline ...": 0.8,
  "Glencore to Keep London Listing After Dropping New York Plans": 0.5,
  "Leveraged Bearish Strategy ETF Surges 19%, Signals Dour Outlook for MSTR and Bitcoin": -0.8,
  "8 Undervalued Stocks for a Rocky Market": 0.2,
  "Could Buying Costco Today Set You Up for Life?": 0.5,
  "Satellite Phased Array Antenna Market Growth Trends, Competitive Strategies and Forecasts 2025-2033 Featuring ALCAN Systems, ViaSat, C-COM Satellite Systems, and Honeywell International": 0.2,
  "Cancer Antibody Drug Conjugates Market Research 2025-2031 | Pfizer, AstraZeneca, and Biotechs Like Miracogen Advance Cancer ADCs with Strategic Acquisitions and Innovative Pipelines": 0.6,
  "Zacks Investment Ideas feature highlights: MSCI, Charter Communications and Healthpeak Properties": 0.0,
  "7 Reasons Why Vertex Pharmaceuticals Is a No-Brainer Stock to Buy on the Dip": 0.8,
  "Palantir Is Now a $400 Billion-Plus Company": 0.8,
  "From Hyatt to Marriott: LA lifestyle hotel undergoes brand conversion": 0.2,
  "The Zacks Analyst Blog Highlights Morgan Stanley, PepsiCo, Comcast and Gencor": 0.0,
  "Vertex’s Journavx successor culled after falling short in Phase II trial": -0.6,
  "S&P Futures Gain With Focus on Earnings and Fed Speak": 0.5,
  "US Health Department Ending Federal mRNA Vaccine Development": -0.5,
  "Vertex Pharmaceuticals Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "OMass Therapeutics Appoints Carol A. Schafer as Non-Executive Director and Chair of the Audit Committee": 0.5,
  "Compugen Reports Second Quarter 2025 Results": 0.0,
  "CDW Reports Second Quarter 2025 Earnings": 0.0,
  "Diamondback Energy Second Quarter 2025 Earnings: Revenues Beat Expectations, EPS Lags": 0.2,
  "CDW Declares Quarterly Cash Dividend of $0.625 Per Share": 0.5,
  "CDW: Q2 Earnings Snapshot": 0.0,
  "Starbucks’ stock is being pummeled by Trump’s coffee tariffs while the rest of the market soars": -0.7,
  "Enlight Renewable Energy Ltd. (ENLT) Lags Q2 Earnings Estimates": -0.5,
  "Qualcomm (QCOM) Holds ‘Overweight’ Rating—Here’s What’s Keeping Investors Confident": 0.8,
  "GlobalFoundries Second Quarter 2025 Earnings: EPS Beats Expectations": 0.8,
  "Why a Company You’ve Never Heard of Is One of the Best Nasdaq-100 Stocks of the Year": 0.5,
  "Buy Axon, avoid Byrna: Good Buy or Goodbye": 0.5,
  "Morgan Stanley Reiterates Bullish $510 Target on Adobe (ADBE) Amid GenAI Momentum": 0.8,
  "AI Chips Today - Arteris FlexGen Powers AMD's Next-Gen AI Chip Designs": 0.8,
  "COST Stock Price Prediction: Where Costco Could Be by 2025, 2026, and 2030": 0.5,
  "Coffee, Chips, and Credit Cards": 0.0,
  "The Current Inflation Rate Is 2.7%. Here's How That Could Affect This Leading Retail Stock.": 0.2,
  "Has Analog Devices, Inc.'s (NASDAQ:ADI) Impressive Stock Performance Got Anything to Do With Its Fundamentals?": 0.2,
  "Mondelez International, Inc.'s (NASDAQ:MDLZ) Intrinsic Value Is Potentially 98% Above Its Share Price": 0.8,
  "Dayforce beats quarterly revenue estimates on steady software demand": 0.8,
  "Dow Jones Futures Rise As AMD, Shopify Lead Big Earnings Movers": 0.6,
  "CrowdStrike Signal Delivers the Next Evolution of AI-Powered Threat Detection": 0.8,
  "CrowdStrike Launches New Services to Secure AI Systems and Operationalize AI in the SOC": 0.5,
  "Will Choosing Analog Devices (ADI) Prove to Be a Wise Investment Decision?": 0.5,
  "Marriott International Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "AI, Robotics Are Reshaping the Future of Hospitality": 0.5,
  "Commerce Media Has Entered a New Era and IAB's Connected Commerce Summit Is Where It's Being Defined": 0.6,
  "Clinical Progress in Rare Disease Signals Long-Term Revenue Potential for Innovators": 0.8,
  "Exchange-Traded Funds, Equity Futures Higher Pre-Bell Wednesday Amid Wave of Corporate Earnings": 0.5,
  "Valiantys appoints Dimitri Spyridopoulos as Chief Strategy Officer and Nathan Chantrenne as Chief AI Officer, doubling down on AI-driven growth": 0.8,
  "BDO USA Named a Workday Partner, Enhancing Finance and HR Service Offerings": 0.6,
  "CSX Executive Vice President and Chief Commercial Officer to Address Deutsche Bank’s 2025 Transportation Conference": 0.0,
  "T-Mobile Expands Home and Small Business Internet Plans with More Built-In Benefits": 0.6,
  "Should You Buy the Post-Earnings Dip in PayPal Stock or Cash Out in PYPL Here?": 0.2,
  "Here is What to Know Beyond Why Synopsys, Inc. (SNPS) is a Trending Stock": 0.2,
  "Investors Heavily Search Booking Holdings Inc. (BKNG): Here is What You Need to Know": 0.5,
  "ASML Holding N.V. (ASML) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Is Now The Time To Look At Buying Workday, Inc. (NASDAQ:WDAY)?": 0.5,
  "Calculating The Fair Value Of Exelon Corporation (NASDAQ:EXC)": 0.1,
  "Datadog Q2 Preview: Can AI Upside Offset Slower Cloud Growth?": 0.2,
  "Is the Options Market Predicting a Spike in Ross Stores Stock?": 0.2,
  "Marriott International and La Tablée Des Chefs Combat Food Insecurity with Announcement of 2025 Ready-To-Cook Soups Goal": 0.6,
  "Brokers Suggest Investing in MercadoLibre (MELI): Read This Before Placing a Bet": 0.5,
  "CDW (NASDAQ:CDW) Reports Upbeat Q2": 0.8,
  "Snap downgraded, Leidos upgraded: Wall Street's top analyst calls": 0.5,
  "This Company Looks Like a Dividend Champion in the Making and It Could Announce Another Dividend Hike Next Month": 0.8,
  "Shopify stock soars 20% on rosy guidance as CFO says tariff hit ‘did not materialize’ - Shopify shares soared 20% Wednesday after the company topped analysts’ estimates for the second quarter, and gave rosy guidance for the third quarter. Here’s how the company did, compared with estimates from analysts polled by LSEG: * **Earnings per share:** 35 cents adj. vs. 29 cents * **Revenue:** $2.68 billion vs. $2.55 billion Second-quarter sales surged 31% year over": 0.8,
  "'Walk Out of a Meeting'—Elon Musk's Rule That Defines Billionaire Success": 0.5,
  "Uber beats on revenue, announces $20 billion stock buyback - Uber reported second-quarter results on Wednesday that beat on revenue and announced the authorization of a $20 billion stock buyback. Here’s how the company did versus analysts’ estimates compiled by LSEG: * **Earnings per share:** 63 cents vs. 63 cents expected. * **Revenue:** $12.65 billion vs. $12.46 billion expected. Here are the key segment numbers: * **Mobility (gross bookings):** $23.76 billion, up 18% year over": 0.8,
  "Disney earnings top expectations as streaming, parks offset TV headwinds - Disney reported results for its fiscal third quarter on Wednesday – posting earnings that topped expectations but revenue that came in just shy of analyst projections – as the company’s streaming business grew and its theme parks saw higher spending from consumers. CFO Hugh Johnston credited the quarter in part to the success of Disney’s streaming unit, anchored by its flagship service, Disney+. “Just": 0.6,
  "McDonald’s sees U.S. sales rebound, but concerns about low-income consumers linger - McDonald’s on Wednesday reported quarterly earnings and revenue that topped analysts’ expectations as buzzy promotions helped its U.S. restaurants rebound. Despite the chain’s improved performance this quarter, executives are still worried about the economic health of the low-income consumer. McDonald’s is working with its U.S. franchisees on ways to make its core menu items more affordable, beyond the $5 meal deal it rolled": 0.2,
  "Why This 1 Momentum Stock Could Be a Great Addition to Your Portfolio": 0.8,
  "Why Idexx Laboratories (IDXX) is a Top Momentum Stock for the Long-Term": 0.6,
  "Amgen's Q2 Earnings & Sales Beat Estimates, 2025 View Raised Slightly": 0.8,
  "These Were the 2 Best-Performing Stocks in the Nasdaq-100 in July 2025": 0.5,
  "Newly proposed drone rules could boost US retail delivery options": 0.8,
  "CrowdStrike Stock Plunges 13% in a Month: Time to Hold or Exit?": -0.6,
  "Trump, Apple to Announce Fresh $100 Billion US Investment - President Donald Trump will announce that Apple Inc. will commit to spend another $100 billion on domestic manufacturing, the latest pledge by the tech giant to increase US production of its products as it seeks to avoid punishing tariffs on its flagship iPhones. The announcement at the White House on Wednesday includes a new manufacturing program designed to bring more of Apple’s supply chain to": 0.8,
  "Netflix Stock Hasn’t Gone Anywhere in 3 Months. How Should You Play NFLX Here?": 0.0,
  "Are Wall Street Analysts Predicting CrowdStrike Stock Will Climb or Sink?": 0.2,
  "CDW's Q2 Earnings Top, Revenues Up Y/Y on Strong Core & Global Demand": 0.8,
  "Taiwan Semiconductor Stock Soars 18% YTD: Time to Hold or Book Profit?": 0.5,
  "T-Mobile Stock: Is Wall Street Bullish or Bearish?": 0.1,
  "3 No-Brainer Artificial Intelligence (AI) Stocks to Buy Right Now": 0.5,
  "ASML vs. AMAT: Which Semiconductor Equipment Leader Is a Better Buy?": 0.5,
  "Market Chatter: Intel CEO's Links to Chinese Firms Reportedly Questioned by US Senator": -0.5,
  "$RDDT - bullish or bearish? - Hello, I am a bit late to the party because I haven’t been looking at markets and earnings lately - woke up to quite a big surprise in my portfolio. Because holy f**k, Reddit is starting to grow net income and free cash flow very nicely, starting to display some characteristics of a Peter Lynch fast-grower. Also while I was checking the numbers on the balance sheet; I thought": 0.8,
  "The market's crypto treasury craze has peaked, Mike Novogratz says": 0.5,
  "Figma at 300x Earnings: Bubble Hype or the Next Great Compounder?": 0.2,
  "Don’t Waste Time on These 4 Brands’ Stocks — Buy These 4 Brands Instead": -0.5,
  "Match Group Q2 Earnings Miss Estimates, Revenues Remain Flat Y/Y": -0.5,
  "Pricing Power vs. Volume Pressure: What's Driving PepsiCo Now?": 0.2,
  "Absolute Security and CrowdStrike Expand Partnership to Deliver Resilience to CrowdStrike Customers": 0.5,
  "MSTR Q2 Earnings Beat Estimates, Revenues Jump Y/Y, Shares Up": 0.8,
  "Strength in Aerospace Technologies Unit Drives Honeywell: Can It Sustain?": 0.5,
  "Tom Lee: Ethereum Is Having A '2017 Bitcoin Moment', Could Hit $15,000 By End Of 2025": 0.8,
  "PYPL or MA: Which Is the Better Value Stock Right Now?": 0.2,
  "Ultragenyx's Q2 Loss Narrower Than Expected, Revenues Rise Y/Y": 0.8,
  "Disney’s ESPN to Buy NFL Network, Other Assets in Stock Swap": 0.5,
  "July earnings update: Boeing, UnitedHealth Group, Starbucks, Coca-Cola and BlackRock": 0.0,
  "Think, Move, and Play Like a Superstar in EA SPORTS™ NHL® 26, Powered by Official NHL Edge Data": 0.5,
  "What does everyone think about JOBY? - Joby had a recent acquisition and seems to be the leader in the emerging eVTOL industry. What does everyone think? Do you guys hold any other eVTOL stocks like ACHR? Wondering on if it would be a good idea to buy one in my portfolio. Thanks!": 0.5,
  "Blue chips in favour ahead of likely Bank of England interest rates cut": 0.5,
  "Vertex Pharmaceuticals (VRTX) Hits New All-Time Low on Failed Clinical Trial": -0.8,
  "Coffee prices showing marked jolt in advance of trade war tariffs with Brazil": -0.6,
  "Disney Scores Earnings Beat and 2 Big ESPN Deals": 0.8,
  "Southwest Airlines Takes Off with Priceline: More Flights, More Smiles, Same Great Fares, Now Available Directly on Priceline": 0.8,
  "Podcast: Tough Times Come for Big Food": -0.5,
  "Teva’s Ajovy becomes first migraine prevention drug approved for children": 0.8,
  "Why Is Resideo (REZI) Stock Soaring Today": 0.5,
  "Here's A Conservative Way To Take Advantage Of Bullish Axon Stock": 0.5,
  "What stocks would you recommend for long-term (5-10 years)? - Hi everyone, I’m looking to build a portfolio for long-term investing (around 5-10 years). What stocks or sectors do you think are good picks to hold for the long run? Looking forward to your suggestions! My list right now is Microsoft | Amazon | Alphabet | ASML | Uber | Thermo Fisher | Visa | BYD , Xiaomi | Rolls-Royce | Pepsi | Waste Management": 0.5,
  "StoneCo Gears Up to Report Q2 Earnings: What's in the Offing?": 0.5,
  "Tom Lee Believes Strategy Could Become The Biggest Company If Bitcoin Hits $1 Million: Michael Saylor Is 'Changing The Reality' Of The Stock Market": 0.6,
  "Why the S&P 500 May Get a New Member Soon": 0.2,
  "T-Mobile tackles SOHO market with security solution": 0.5,
  "Dutch Bros position, earnings today - Dutch bros is one of the best managed and fastest growing chains in the country. Each location earns about the same as a Starbucks, but costs around 50% of the price to build. With hybrid and work from home, people don’t want to go sit in a coffee shop and work anymore, they can just pick up a coffee and go home. It’s also clear that people are open": 0.8,
  "Amgen Stock Sinks As Market Eyes MariTide's Next Move": -0.5,
  "When does PE ratio NOT matter? - Case in point is Palantir stock. I refuse to believe that folks who are buying this stock now did not know that it is running at a ridiculous pe ratio of 675. At least most would know. And most folks on this sub have repeatedly mentioned that it is a 400B market cap company with revenue of just 1B, and pe ratio is 675 and hence, we should": -0.5,
  "Cadence Design Systems' (NASDAQ:CDNS) Soft Earnings Are Actually Better Than They Appear": 0.5,
  "Electronic Arts Stock Earns RS Rating Upgrade": 0.5,
  "ADP Declares Regular Quarterly Dividend": 0.0,
  "Would tomorrow's unemployment data have an impact given how revisions tanked the market and other catalysts that could affect SPY? - I'm assuming since the jobs revisions had an actual affect on the market then unemployment should follow suit given that should correlate with them. Then there's the issue with tariffs, but I would assume he's going to extend again so no point in arguing that. What I am concerned about as well is next": 0.1,
  "Why Oracle Stock and 2 Other Software Plays Are Struggling Even as Tech Shares Rally": -0.5,
  "Staples and Discretionary Stocks Are Soaring Together. That's Not Supposed to Happen.": 0.2,
  "NRG Energy, Amgen, Arista Networks: Trending Tickers": 0.0,
  "Amazon’s Zoox robotaxi unit clears regulatory hurdle, safety probe - Amazon’s Zoox has cleared a key regulatory hurdle, paving the way for demonstrations of its self-driving robotaxis. The National Highway Traffic Safety Administration said Wednesday that it granted Zoox an exemption from some requirements, a first for U.S.-built vehicles under a recently expanded program. “Transportation innovators can be confident in getting speedy review of their vehicles and, as appropriate, exemption from Federal Motor Vehicle Safety": 0.6,
  "IonQ Announces Second Quarter Financial Results": 0.0,
  "AppLovin Announces Second Quarter 2025 Financial Results": 0.0,
  "Arcus Biosciences Reports Second-Quarter 2025 Financial Results and Provides a Pipeline Update": 0.5,
  "Thoughts on HWM? - This stocks been on my radar for a while now. Im thinking of taking a decent position. Thoughts? Anything im missing? Q2 revenue was $2.05 billion, up 9% year-over-year. This was driven by commercial aerospace revenue, which grew 8%. Adjusted earnings per share (EPS) was $0.91, a 36% increase from the previous year, and beat analyst forecasts. The company increased its quarterly common stock dividend by 20% to $0.12 per share": 0.8,
  "Meta, Microsoft, Google And AppLovin Lead This Breakout Watch": 0.5,
  "Top Analyst Reports for Walmart, BlackRock & Texas Instruments": 0.0,
  "Costco Wholesale Corporation Reports July Sales Results": 0.0,
  "Why S&P 500 Stock Amgen Stumbled Despite Its Beat-And-Raise Quarter": -0.5,
  "AppLovin: Q2 Earnings Snapshot": 0.0,
  "BREAKING NEWS: Japan not to be exempt from extra reciprocal tariff: White House - >The US is to impose an additional 15% tariff on Japanese imports. US tariff on Japan regardless of existing rates So take this with a grain of salt, but also remember that a random X account posted that the tariffs will be paused for 90-days, and it came true. But seems like it move the Japanese Yen. Source: [https://english.kyodonews.net/articles/-/58762?words=tariff](https://english.kyodonews.net/articles/-/58762?words=tariff)": -0.6,
  "Retail Stocks Jumped. Thank Shopify’s Earnings.": 0.8,
  "Applied Materials Joins Apple and Texas Instruments in Strengthening U.S. Chip Manufacturing": 0.8,
  "AppLovin Logs Higher Profit, Sales in Second Quarter": 0.5,
  "Apple Announces $100 Billion US Investment Ahead of Trump Event": 0.8,
  "Heartflow’s IPO: worth attention? - With Heartflow (HTFL)’s IPO coning up on Friday, I’m surprised how little talk it has generated. Who has an opinion on this? What price it might see, whether or not the various economic news between now and then (especially on Friday itself). Considering the meteoric rise of Figma and its subsequent collapse, I have concerns about investing in this IPO, despite shares being available on E*Trade. Who would invest in": -0.5,
  "McDonald's Q2 review & how to invest in the restaurant sector": 0.5,
  "Applovin shares fall despite better-than-expected Q2 results, guidance": -0.2,
  "Apple announces additional $100 billion in US investment, following Trump iPhone tariff threat": 0.5,
  "Applovin, DraftKings, E.l.f. Beauty: After-hours trending stocks": 0.0,
  "Fortinet forecasts third-quarter sales below estimates as trade uncertainty weighs": -0.5,
  "AppLovin Reports Solid Earnings. The Stock Is Down.": -0.5,
  "PayPal Casinos 2025: Exploring Why High 5 Casino Is Frequently Cited Among the Best PayPal Casino Platforms": 0.6,
  "AppLovin (NASDAQ:APP) Misses Q2 Sales Targets": -0.5,
  "GlobalFoundries Expands Partnership with Apple to Advance Wireless Connectivity and Power Management, Reinforcing U.S. Chip Manufacturing Leadership": 0.8,
  "BREAKING: Trump says there will be a 100% tariff on all semiconductors entering the US - TRUMP ON TARIFFS: SAYS U.S. WILL IMPOSE “VERY LARGE TARIFF” ON CHIPS AND SEMICONDUCTORS. WE WILL BE PUTTING IN 100% TARIFF ON ALL CHIPS. NOTES THERE WILL BE NO CHARGE FOR COMPANIES BUILDING OR COMMITTING INVESTMENT IN THE UNITED STATES.": -0.8,
  "Next big energy plays? - I've been watching the Energy sector with a lot of interest recently. I got in early on NNE and LTBR with significant gains to date, but I think there are a lot of other stocks that could still explode with this administration and current policy moves. Other stocks on that I'm keeping an eye on include CCJ, BEP, UEC, and NRG. Anyone else thinking about going in on this sector?": 0.6,
  "Adobe Systems (ADBE) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Marvell Technology (MRVL) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Why CrowdStrike Holdings (CRWD) Outpaced the Stock Market Today": 0.5,
  "Baillie Gifford's Strategic Moves: Shopify Inc. Sees a Significant Reduction": -0.5,
  "Here’s Americans’ Favorite Tax-Prep Service. It Isn’t the Biggest.": 0.2,
  "Autodesk (ADSK) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Warner Bros. earnings, Fed talk, jobless claims: What to Watch": 0.0,
  "Trump announces 100% chip tariff as Apple ups U.S. investment": 0.5,
  "Jim Cramer Calls Out Intel's $18.8 Billion Foundry Loss Despite Subsidies: 'We Sell Your Stock'": -0.6,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On August 7, 2025, Gary Moore and Emiko Higashi notified the Board of Directors (the “Board”) of KLA Corporation (the “Company”) of their respective decision to retire from the Board and the applicable committees of the Board, effective at the Company’s 2025 annual meeting of stockholders (the “Annual Meeting”). Each of Mr. Moore’s and Ms. Higashi’s retirements\n\n(Item 8.01) Other Events. On August 7, 2025, the Company issued a press release announcing that the Company’s Board declared a cash dividend of $1.90 per share on the Company’s common stock. Such dividend shall be payable on September 3, 2025 to stockholders of record as of the close of business on August 18, 2025. A copy of the press release is attached to this Current Report on Form 8-K as Exhibit 99.1.": 0.5,
  "(Item 2.02) Results of Operations and Financial Condition On August 7, 2025, Warner Bros. Discovery, Inc. (\"we,\" “Warner Bros. Discovery” or the “Company”) released its earnings for the quarter ended June 30, 2025. A copy of Warner Bros. Discovery's earnings press release is furnished herewith as Exhibit 99.1 and is incorporated herein by reference. The information in this\n\n(Item 2.02) , including Exhibit 99.1 attached hereto, is being furnished pursuant to\n\n(Item 2.02) and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liability of such section, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended (the \"Securities Act\"), or the Exchange Act, except as shall be expressly set forth by specific reference in such filing.": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (b) David Strauss, Executive Vice President-Chief Human Resources Officer, has announced that he will retire from Linde effective March 31, 2026, after serving 35 years with Linde. His role as an executive officer of Linde plc will terminate effective September 1, 2025. Desiree Bacher, who currently serves as Senior Vice President-Communications, AI, & Corporate Procurement, has": -0.2,
  "(Item 2.02) . Results of Operations and Financial Condition The information pursuant to\n\n(Item 2.02) in this report on Form 8-K is being furnished as contemplated by General Instruction B(2) to Form 8-K and shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of that Section. On August 7, 2025, we announced the results of our operations for the first quarter of fiscal year 2026. The complete release is attached to this report as": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition. On August 7, 2025, Datadog, Inc. (the “Company”) issued a press release announcing its financial results for the quarter ended June 30, 2025. A copy of the press release is furnished as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated herein by reference. The information contained in this\n\n(Item 2.02) , including Exhibit 99.1 hereto, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference in any filing made by the Company under the Securities Act of 1933, as amended, or the Exchange Act, regardless of any general incorporation language in such filings, unless expressly incorporated": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. On August 7, 2025, Atlassian Corporation (the “ Company ”) issued a press release announcing its results for the quarter and fiscal year ended June 30, 2025 (the “ Press Release ”). A copy of the Press Release is attached as Exhibit 99.1 to this current report on Form 8-K and is incorporated by reference herein. The Company also published a letter to its shareholders announcing its financial\n\n(Item 2.02) , including Exhibit 99.1 and Exhibit 99.2, is being furnished and shall not be deemed “filed” for the purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “ Exchange Act ”), or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference into any filing made by the Company under the Securities Act of 1933, as amended, or the Exchange Act, except as shall\n\n(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On August 7, 2025, the Company announced that Anu Bharadwaj will be stepping down from the role of President, effective as of December 31, 2025, following almost twelve years with the Company.": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On August 7, 2025 , Gilead Sciences, Inc., a Delaware corporation (“Gilead”), issued a press release announcing its financial results for the quarter ended June 30, 2025. A copy of the press release is filed as Exhibit 99.1 to this report. Gilead has presented certain financial information in accordance with U.S. generally accepted accounting principles (“GAAP”) and also on a non-GAAP basis. Management believes this non-GAAP information is useful\n\n(Item 2.02) and": 0.2,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On August 4, 2025, the Company announced that Russ Miller, Senior Executive Vice President, COO - U.S. and Mexico Operations, will retire effective February 2026. Caton Frates, Executive Vice President, COO Southwest Division, will be appointed Senior Executive Vice President, Warehouse Operations - U.S. and Mexico, effective February 2026.": 0.2,
  "(Item 2.02) . Results of Operations and Financial Condition Section 7 - Regulation FD": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. On August 7, 2025, Monster Beverage Corporation (the “Company”) issued a press release relating to its financial results for the second quarter ended June 30, 2025, a copy of which is furnished as Exhibit 99.1 hereto. The press release did not include certain financial statements, related footnotes and certain other financial information that will be filed with the Securities and Exchange Commission as part of the Company’s Quarterly": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On August 7, 2025, The Trade Desk, Inc. (the “Company”) issued a press release announcing its financial results for the quarter ended June 30, 2025. A copy of the press release is furnished as Exhibit 99.1 to this Current Report on Form 8-K. The information in this Current Report on Form 8-K and Exhibit 99.1 attached hereto is intended to be furnished and shall not be deemed “filed” for\n\n(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (d) On August 2, 2025, the Company’s Board of Directors (the “Board”) appointed Omar Tawakol to the Board as a Class II director, effective August 11, 2025. Mr. Tawakol was appointed to a newly created vacancy on the Board resulting from an increase in the size of the Board from seven (7) directors to eight (8) directors.": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. The Trade Desk, Inc. (the “Company”) and Laura Schenkein, the Company’s chief financial officer, have mutually agreed that Ms. Schenkein will transition out of the position of chief financial officer effective as of August 21, 2025 as part of a plan to depart the Company by the end of the year. Ms. Schenkein will remain with the": -0.2,
  "(Item 2.02) Results of Operations and Financial Condition On August 7, 2025 , Take-Two Interactive Software, Inc. (the “Company”) issued a press release announcing the financial results of the Company for its first fiscal quarter ended June 30, 2025. A copy of the press release is attached to this Current Report as Exhibit 99.1 and is incorporated by reference herein. The information included in this Current Report on Form 8-K, including Exhibit 99.1 hereto, that is furnished\n\n(Item 2.02) shall not be deemed to be “filed” for the purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of that section or Sections 11 and 12(a)(2) of the Securities Act of 1933, as amended. In addition, the information included in this Current Report on Form 8-K, including Exhibit 99.1 hereto, that is furnished pursuant to this\n\n(Item 2.02) shall not be incorporated by reference into any filing of the Company, whether made before or after the date hereof, regardless of any general incorporation language in such filing, unless expressly incorporated by specific reference into such filing.": 0.0,
  "Axon Enterprise (AXON) Vs Palantir Technologies (PLTR): Which is the Better Investment?": 0.5,
  "S&P 500 may get a new member soon! Which company do you think would make it into the index? - Paramount Global (PARA) could be on the chopping block if the S&P 500’s managers decide its impending merger with Skydance Media makes it too small for the benchmark large-cap index. Paramount’s current market capitalization of about $8 billion is one of the lowest in the index, and well below the $22 billion S&P Global requires": -0.5,
  "Apple Expands 18-Year-Old iPhone Glass Deal in Bid to Avoid Trump Tariffs": 0.5,
  "Costco Wholesale Corporation (COST)’s A Short Term Disappointment With Long Term Potential, Says Jim Cramer": 0.2,
  "PayPal Holdings, Inc. (PYPL)’s Figures Share Key Insights For The Economy, Says Jim Cramer": 0.5,
  "Comcast Corporation (CMCSA) Should Have Pivoted To Cybersecurity, Says Jim Cramer": 0.2,
  "Arm Holdings plc (ARM) Had To Guide Up, Says Jim Cramer": 0.5,
  "Argus Raised the Firm’s PT on Lam Research Corporation (LRCX), Kept a Buy Rating": 0.6,
  "Goldman Sachs Raised the Firm’s PT on Synopsys (SNPS), Kept a Buy Rating": 0.5,
  "Oppenheimer Raised the Firm’s PT on KLA Corporation (KLAC), Kept an Outperform Rating": 0.6,
  "Barclays Lowers Price Target on MercadoLibre Stock from $3,100 to $3,000, Keeps Overweight Rating": 0.2,
  "LLY thoughts - LLY has its earnings tomorrow morning and judging from the past performance of this stock it has enormous potential going up or down. Regardless if you get a option correct there is huge gain. Has anyone been watching the stock? Would love some opinions. Im planning to go in big tomorrow right after market open just need to flip a coin on call or put.": 0.6,
  "Trump Not Moving Markets - Let’s talk about the lies Trump spews daily and how they don’t effect the markets anymore. I watched Trump embarrass Apple CEO Tim Cook today. After the cringe gift where Cook’s hand is visibly shaking Trump stands up at the mic and shamelessly says that there is no inflation and all of these companies/countries are investing hundreds of billions into the U.S.. Shortly after that he talks about how he’s": -0.6,
  "Trump Eyes 100% Chips Tariff, Exempting Firms That Invest in US": 0.2,
  "Q2 Earnings Highs And Lows: Intuitive Surgical (NASDAQ:ISRG) Vs The Rest Of The Surgical Equipment & Consumables - Specialty Stocks": 0.2,
  "3 Reasons FAST is Risky and 1 Stock to Buy Instead": -0.5,
  "2 Large-Cap Stocks to Keep an Eye On and 1 We Find Risky": 0.2,
  "1 Safe-and-Steady Stock on Our Buy List and 2 We Turn Down": 0.2,
  "2 Nasdaq 100 Stocks Worth Investigating and 1 Facing Headwinds": 0.2,
  "2 S&P 500 Stocks to Keep an Eye On and 1 Facing Challenges": 0.0,
  "2 Profitable Stocks with Promising Prospects and 1 We Brush Off": 0.2,
  "1 S&P 500 Stock for Long-Term Investors and 2 We Question": 0.0,
  "AI Accounting Just Got Smarter: Better Business Advice Breaks Down QuickBooks' Task-Focused Agents": 0.6,
  "Amgen (AMGN) Completes US$60,594 Million Share Buyback After 14 Years": 0.5,
  "Electronic Arts (EA) Unveils NHL 26 Featuring Tkachuk Family On Deluxe Cover": 0.5,
  "Vertex Pharmaceuticals (VRTX) Reports Strong Q2 2025 Revenue Growth with US$2,965 Million": 0.8,
  "T-Mobile US (TMUS) Expands 5G Plans With New Perks And Cyber Security Features": 0.6,
  "Kraft Heinz (KHC) Launches Limited Edition Ketchup Smoothie With Smoothie King": 0.2,
  "Axon Enterprise (AXON) Sees Q2 Revenue Rise To US$669 Million": 0.8,
  "DoorDash (DASH) Turns Profit With Q2 Sales Reaching US$3,284 Million": 0.8,
  "Holiday Inn owner IHG's profit rises, notes easing pressures after US slowdown": 0.5,
  "Wall Street Says Datadog (DDOG) Is One of Two Key Winners in Observability": 0.8,
  "Coca-Cola Europacific Partners PLC (CCEP) (H1 2025) Earnings Call Highlights: Strong Profit ...": 0.8,
  "Deliveroo sales and orders surge as customers come back for more": 0.8,
  "Palo Alto Networks (PANW) Previews Application Security Module for Cortex Cloud": 0.5,
  "CrowdStrike (CRWD) Unveils AI Agent Monitoring via ChatGPT Enterprise API": 0.5,
  "Ensurge Micropower ASA appoints Shauna McIntyre as new CEO to lead commercial scale-up": 0.5,
  "100% tariffs on semiconductor chips bullish for ASML (Other equipment makers) - Orange man has recently announced that there would be a 100% tariffs on semiconductor/chips. Companies who make considerable investments to start plants in the US will be exempt. Everywhere I look I see them only mentioning semiconductors and or chips. This wording makes me strongly believe that semiconductor equipment is exempt. **Previous with the 15% EU tariffs semiconductor equipment was exempt** and I": 0.6,
  "Intel CEO Lip-Bu Tan Questioned by US Senator About China Investments - US Senator Tom Cotton has put Intel CEO Lip-Bu Tan on the hot seat, asking the board to explain how the new CEO's long-running financial ties to Chinese tech firms square with the company's critical position in the US semiconductor supply chain. In a letter to Intel Chair Frank Yeary, released on Wednesday, Cotton cites a probe that found Tan, through his venture": -0.6,
  "Deliveroo slips back into loss on DoorDash takeover costs": -0.5,
  "Ross Stores Stock Outlook: Is Wall Street Bullish or Bearish?": 0.1,
  "Barrick Mining and Whirlpool have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Inside AstraZeneca’s long-game strategy in lung cancer": 0.5,
  "Insuretech massive beats ROOT($2074+ PT) & LMND(up 36%) - The insure tech sector seems to be ramping up with massive beats across the board. It is one of the sectors that are being benefited from AI, with better efficiencies and risk selection. LMND is up 36% since it recorded a strong quarter beating rev estimates of $160.8 versus $164.1m revenue. It also beat EPS estimates of -.8 vs -.6 EPS actual. ROOT reported earlier today": 0.8,
  "Are Wall Street Analysts Predicting PACCAR Stock Will Climb or Sink?": 0.2,
  "The Best Stocks to Invest $1,000 In Right Now": 0.5,
  "how my investment strategy evolved with a financial cushion - For the past year, I’ve been working on building my financial cushion, focusing on cutting expenses, automating savings and investing in index funds. Now that I have about 8 months of living expenses saved up, plus a small portfolio generating some passive income, I’ve been reflecting on how it’s changed my approach to investing Before I would have been more inclined to chase hot stocks": 0.6,
  "Japan tech giant SoftBank Group sees better fortunes on surging AI stocks": 0.8,
  "Trending tickers: Apple, Shopify, Duolingo, Airbnb, Deliveroo": 0.0,
  "MiTAC Computing Partners with Industry Leaders on Open AI Server Solutions at OCP APAC Summit 2025": 0.6,
  "Disney’s Thriving Parks Are Buying It Time to Figure Out Streaming": 0.5,
  "r/Stocks Daily Discussion & Options Trading Thursday - Aug 07, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why": 0.2,
  "Inside Dexcom’s strategy to stay ahead in the $13.6bn CGM market": 0.5,
  "Apple Launches $100 Billion American Manufacturing Program": 0.8,
  "Is ASML a Buy?": 0.0,
  "Shopify’s blowout quarter showed consumers are buying through the trade war": 0.8,
  "The Zacks Analyst Blog Highlights Walmart, BlackRock, Texas Instruments, Perma-Pipe and MIND Technology": 0.2,
  "Airbnb dips as slower growth outlook renews fears of travel demand slowdown": -0.7,
  "Apple leads surge in global tech shares after Trump tariff relief": 0.8,
  "Social Buzz: Wallstreetbets Stocks Mostly Advancing Premarket Thursday; Opendoor Technologies, Apple to Advance": 0.6,
  "Novo’s Wegovy, Eli’s Mounjaro sales for July double in India, Reuters says, NOVO Up 10% - Sales of Novo Nordisk’s Wegovy and Eli Lilly’s Mounjaro doubled in India in July compared to June, Rishika Sadam and Kashish Tandon of Reuters reports, citing research firm Pharmarack. Demand for anti-obesity drugs has been on an upswing in the country": 0.6,
  "EU Says Its U.S. Chip Exports Will Be Covered by 15% Tariff Deal": -0.2,
  "Apple Raises US Investment to $600 Billion as Trump Eyes 100% Chip Tariffs": 0.2,
  "CrowdStrike expands AI Security Services portfolio": 0.5,
  "Constellation Reports Second Quarter 2025 Results": 0.0,
  "Honeywell illegally forced US worker in China to retire, lawsuit alleges": -0.8,
  "Morgan Stanley downgrades Coca-Cola bottler CCEP on ’balanced risk-reward’ profile": -0.2,
  "Baker Hughes Completes Acquisition of Continental Disc Corporation": 0.5,
  "Warner Bros. Discovery Reports Second Quarter 2025 Results": 0.0,
  "IT'S OFFICIAL CANADA - NESTEA® RTD IS HERE": 0.6,
  "Datadog Announces Second Quarter 2025 Financial Results": 0.0,
  "Millennials have abandoned these 7 boomer habits that made them the richest generation yet — plus what they do instead": 0.5,
  "Investing in Palo Alto Networks (NASDAQ:PANW) five years ago would have delivered you a 297% gain": 0.8,
  "Microchip Technology (NASDAQ:MCHP) Will Be Looking To Turn Around Its Returns": 0.5,
  "Calculating The Fair Value Of Autodesk, Inc. (NASDAQ:ADSK)": 0.1,
  "Warner Bros. Discovery: Q2 Earnings Snapshot": 0.0,
  "Datadog: Q2 Earnings Snapshot": 0.0,
  "Fact or Fiction: Figma, the Stock Market's Latest Monster IPO, Is Overvalued": -0.5,
  "This Artificial Intelligence Stock Plays an Important Role in Chip Production, but It's Down 14% in 12 Months. Could It Be a Bargain Buy?": 0.2,
  "Datadog Q2 Adjusted Earnings, Revenue Rise; Raises 2025 Guidance": 0.8,
  "You should consider these 3 stock picks, portfolio manager says": 0.2,
  "Constellation Energy beats forecasts on top and bottom lines, shares rise": 0.8,
  "RFK Jr’s mRNA funding halt signals “shift in US public health”": 0.5,
  "Baker Hughes (BKR) Slid Due to Macro Economic Uncertainty": -0.6,
  "Datadog forecasts upbeat third-quarter results on increased cloud security adoption": 0.8,
  "Datadog Earnings Beat. Software Stock Jumps Amid OpenAI, Amazon Worries.": 0.5,
  "Stocks Gain Pre-Bell as Trump's Sweeping New Tariffs Take Effect; Investors Assess Apple's $600 Billion US Investment Plan": 0.5,
  "Datadog shares soar as Q2 earnings beats expectations, guidance raised": 0.8,
  "Up 40% on RBLX - but is this just the beginning of Roblox becoming the YouTube of immersive worlds? - I'm currently up about 40% on RBLX. It's one of the best performers in my portfolio this year. That said, I'm starting to wonder if the valuation is getting ahead of itself… or maybe the market is just correctly pricing it as a long-term compounder now that it's clearly moved beyond being “just a kids’": 0.5,
  "Warner Bros Discovery subscribers top estimates amid ongoing breakup": 0.5,
  "Datadog Stock Is Rising on Earnings Beat. What to Know.": 0.5,
  "Greenhouse Software Welcomes New Chief Technology Officer, Sagar Patel": 0.5,
  "Zscaler to Host Fourth Quarter Fiscal Year 2025 Earnings Conference Call": 0.0,
  "Netlist Reports Second Quarter 2025 Results": 0.0,
  "Scale Computing and Veeam Now Delivering Integrated, Secure, and Scalable Virtualization and Data Protection": 0.6,
  "Constellation Energy Corporation (CEG) Tops Q2 Earnings and Revenue Estimates": 0.8,
  "Netflix, Inc. (NASDAQ:NFLX) Stock Has Shown Weakness Lately But Financials Look Strong: Should Prospective Shareholders Make The Leap?": 0.5,
  "Should You Be Excited About CSX Corporation's (NASDAQ:CSX) 25% Return On Equity?": 0.6,
  "Looking For Yields: WEC Energy, Mondelez International, And Southern Are Consistent Moneymakers": 0.6,
  "Alexion, AstraZeneca Rare Disease reaches an agreement with the pan-Canadian Pharmaceutical Alliance (pCPA) for Ultomiris for the treatment of adults with neuromyelitis optica spectrum disorder (NMOSD) and adults with generalized myasthenia gravis (gMG)": 0.5,
  "Dow Jones Futures Rise On Trump Move, Google, Tesla Eye Buy Points; DoorDash, AppLovin Earnings Late": 0.5,
  "Warner Bros. Discovery (WBD) Surpasses Q2 Earnings Estimates": 0.8,
  "Earnings in Focus: Market Movers": 0.0,
  "Should You be Confident in Atlassian’s (TEAM) Long-Term Growth Drivers?": 0.2,
  "Liberty Media Corporation Reports Second Quarter 2025 Financial Results": 0.0,
  "Datadog (DDOG) Surpasses Q2 Earnings and Revenue Estimates": 0.8,
  "Trump calls for Intel CEO’s resignation, stock falls": -0.5,
  "Intel CEO responds after Trump calls for resignation": 0.1,
  "Littelfuse names Dr. Karim Hamed Senior Vice President and General Manager, Semiconductor Business": 0.5,
  "Here's How Much a $1000 Investment in Axon Enterprise Made 10 Years Ago Would Be Worth Today": 0.5,
  "Intel Stock Slips as Trump Says CEO 'Must Resign, Immediately'": -0.8,
  "E-Commerce Update - Retail Media Networks Surge Transforming Shopper Engagement": 0.5,
  "JPMorgan says Apple delivered ’masterclass’ in managing geopolitics": 0.8,
  "Grain, automotive keep U.S. rail traffic ahead of 2024": 0.5,
  "People looking at Archer (ACHR) now… what’s your actual thesis? - So Archer Aviation just got a price target bump from JPMorgan from $9 to $10 but they still kept it at neutral. Stock popped a few percent on that, but trading volume was weak I’ve been watching this one for a while but still not sure if we’re actually at a good entry or just chasing hype The legal situation is partly cleaned up": 0.1,
  "Duolingo Shares Surge on Strong Q2 Results Despite AI Backlash - Duolingo’s second-quarter 2025 results were strong: revenue grew 41 % compared with last year, paid subscribers rose 46 % and the company logged its highest profit ever. Because of this, Duolingo raised its outlook for the rest of 2025. https://finance.yahoo.com/news/duolingo-surges-user-growth-ai-204545840.html https://investors.duolingo.com/news-releases/news-release-details/duolingo-reports-41-revenue-growth-46-subscription-revenue": 0.8,
  "Nova Ltd. (NVMI) Q2 Earnings and Revenues Beat Estimates": 0.8,
  "Samba TV Report Finds Advertiser Confidence is Up with 68% of Top 100 Brands Accelerating TV Advertising in First Half of 2025": 0.8,
  "Mobile Access Made Easy: Transact + CBORD and ASSA ABLOY Partner to Improve Campus Security and the Student Experience": 0.6,
  "Want Better Returns? Don't Ignore These 2 Retail-Wholesale Stocks Set to Beat Earnings": 0.8,
  "Is Trending Stock Intuit Inc. (INTU) a Buy Now?": 0.2,
  "Constellation Energy Q2 Earnings Beat Estimates, Revenues Rise Y/Y": 0.8,
  "Bitcoin, crypto stocks rally as Trump signs executive order opening 401(k) plans to alternative assets": 0.8,
  "Cavallo Expands SalesPad eCommerce Capabilities to Strengthen Omnichannel Distribution Support": 0.5,
  "EU Says Chip Exports to U.S. Will Have 15% Tariff Ceiling Despite New Levies": 0.2,
  "Warner Bros. Discovery Tops Revenue Estimates, Swings to Profit": 0.8,
  "We Think Biogen's (NASDAQ:BIIB) Profit Is Only A Baseline For What They Can Achieve": 0.6,
  "Food Lion Feeds Provides More than 28 Million Meals to Combat Child Hunger": 0.8,
  "DoorDash Stock Outlook: Is Wall Street Bullish or Bearish?": 0.2,
  "Patriot.TV Viewership and Stock Performance Surge Amid Industry Shift and Legacy Media Decline - Investors Take Notice under JD Ruckers Leadership": 0.6,
  "Company News for Aug 7, 2025": 0.0,
  "IDEXX Laboratories, Inc. Just Beat Earnings Expectations: Here's What Analysts Think Will Happen Next": 0.5,
  "Continuing claims for unemployment benefits hit highest level since November 2021 - Americans filing for unemployment insurance on an ongoing basis reached the highest level since November 2021 during the end of July. In the week ending July 26, 1.974 million continuing claims were filed, up from 1.936 million the week prior and the highest level seen since November 2021, according to data from the Department of Labor released Thursday morning. Economists see an increase": -0.7,
  "Earnings Growth & Price Strength Make Axon Enterprise (AXON) a Stock to Watch": 0.8,
  "Is Zscaler (ZS) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Is Marvell (MRVL) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Warner Bros. Discovery (WBD) Reports Q2 Earnings: What Key Metrics Have to Say": 0.2,
  "Airbnb (ABNB) Reports Q2 Earnings: What Key Metrics Have to Say": 0.2,
  "Compared to Estimates, CDW (CDW) Q2 Earnings: A Look at Key Metrics": 0.2,
  "Nebius (NBIS) Reports Second Quarter Financial Results and Raises ARR Guidance for 2025 - The NBIS speculative growth story is coming to fruition as they deliver another strong quarter. The core business is staying on track to meet lofty ARR targets and cash flow is looking great given the capital intensive nature of the business. Their new partnership with Cloudflare signals their sales team is delivering on securing business partners to maximize their additional cloud": 0.8,
  "Duolingo, Fortinet, Celsius: Trending Tickers": 0.0,
  "Looking for Aerospace Stocks? The Zacks Rank Can Help You Find Winners": 0.5,
  "Is Axon Enterprise (AXON) Outperforming Other Aerospace Stocks This Year?": 0.2,
  "Why Workday (WDAY) is a Top Growth Stock for the Long-Term": 0.8,
  "Here's Why Adobe Systems (ADBE) is a Strong Growth Stock": 0.8,
  "Airbnb Growth Accelerates As Q2 Earnings Beat. Why The Stock Is Falling Anyway.": 0.1,
  "Tax implication on ITM expired call option - Hey guys, I tried to search on the net and did not find the exact answer I need. let's say I buy a call option strike price $10. And when it expires the stock is at $15. So the brokerage assign it and I then bought 100 shares of the stock at $10, and assuming I have the cash to buy and I hold onto the newly": -0.2,
  "Eli Lilly downgraded, Lyft upgraded: Wall Street's top analyst calls": 0.2,
  "Cyient Semiconductors Enters Strategic Channel Partnership with GlobalFoundries": 0.6,
  "Elad Gil — one of tech’s sharpest minds — on early bets, breakout growth, and what’s coming next at TechCrunch Disrupt 2025": 0.6,
  "Can the Firefly IPO... Fly? (DD on $FLY) - # I love IPOs!!!!!!!!!! The last IPO I thought was amazing was Figma [(it's been a week lol).](https://www.reddit.com/r/stocks/comments/1ma8fm5/figuring_out_the_figma_ipo_dd_on_fig/) Firefly is opening today and there is, to put it lightly, hype. **Can Firefly Fly? You would not believe your eyes, etc etc.** Firefly Aerospace Inc. is a Texas-based space and defense technology founded in 2017 that provides \"end-to-end mission solutions for government and commercial clients\". They **design,": 0.6,
  "Stocks Rally on Positive Tariff News ad Rate Cut Hopes": 0.8,
  "Google Is Ditching CrowdStrike Stock. Should You?": 0.1,
  "Warner Bros. Discovery Stock Slides. The Box Office Is Back, But TV Is Still a Worry.": -0.5,
  "These 3 Technology Stocks Are Money-Printing Machines": 0.8,
  "Law Enforcement Software Market worth $32.96 billion by 2030 | MarketsandMarkets™": 0.5,
  "Fortinet Stock Tumbles 25% After Earnings Beat. Why It Caught a Downgrade.": -0.6,
  "Influenza Vaccine Market Research Report 2025-2030 Featuring GSK, Abbott, Pfizer, AstraZeneca, Sanofi, Moderna, CSL, Emergent BioSolutions, BIKEN, Serum Institute of India, Sinovac, GC Biopharma": 0.2,
  "Form 8.3 - Qualcomm Inc": 0.0,
  "Shopify (SHOP) Surges 22% on 3rd Day as Earnings Impress": 0.8,
  "Bitcoin, crypto stocks rally ahead of Trump order opening 401(k) plans to alternative assets - https://finance.yahoo.com/news/bitcoin-crypto-stocks-rally-ahead-of-trump-order-opening-401k-plans-to-alternative-assets-130149290.html > Major cryptocurrencies and crypto-related stocks were rallying early Thursday ahead of President Trump's expected signing of an executive order that would allow alternative assets like cryptocurrencies and private equity into the retirement accounts of millions of Americans. > President Trump's executive order, expected to be signed around 12:00 p.m. ET on Thursday, according to Reuters, will direct the": 0.6,
  "Nvidia Stock Gains. Why It’s Shrugging Off Chip Tariffs.": 0.5,
  "Bitmine (BMNR) Jumps 15% on Becoming Largest ETH Holder": 0.8,
  "Analysts weigh implications of Section 232 semiconductor tariffs": 0.0,
  "Baker Hughes Stock: Is Wall Street Bullish or Bearish?": 0.2,
  "Warner Bros. Discovery Unexpectedly Swings to Second-Quarter Profit Amid Better-Than-Expected Subscriber Growth": 0.8,
  "US Vehicle Auction Market Trends 2025-2030 Featuring Openlane, Copart, ACV, RB Global, E Automotive, eBay, COX Automotive, Capital, Cars & Bids, A Better Bid Car, AutoBidMaster, Barrett-Jackson": 0.0,
  "Nvidia, AI Bets Lift SoftBank To Profit After Brutal Year-Ago Loss": 0.6,
  "Airbnb Tops Q2 Estimates, But Here’s Why ABNB Stock Isn’t a Buy": -0.5,
  "How Airbnb's $200M investment could weigh on profit margins": -0.5,
  "Why Micron Stock Popped Today": 0.5,
  "Suddenly the Dow Is Down. Blame Healthcare Stocks.": -0.5,
  "Krispy Kreme Unveils Turnaround Plan With US Stake Cut, Global Re-Franchising": 0.5,
  "Applied Materials Stock: Is Wall Street Bullish or Bearish?": 0.5,
  "lululemon Navigates FX Swings & Demand Shifts: Can It Stay Nimble?": 0.2,
  "Crocs Sinks Most Since March 2020 on Tariffs, Cautious Consumers": -0.6,
  "DoorDash Stock Hits All-Time High on Record-Setting Results": 0.8,
  "Warner Bros. Discovery Hits Profit Turnaround, Thanks To Theaters, Not TV": 0.5,
  "DoorDash Stock Eyes Record High As Food Delivery Proves A Consumer 'Staple'": 0.8,
  "Vistra Jumps While Constellation Energy Stalls. Why the Power Giants Split.": 0.2,
  "Airbnb Stock Drops. Why Wall Street Is Cautious About Its Experiences Relaunch.": -0.6,
  "Analysts cut Fortinet rating shares as firewall refresh catalyst fizzles out": -0.6,
  "What's up with mid cap tech stocks today? - HUBS down 6% (after +7% pre market) despite OK quarter, DDOG slightly down after very strong quarter (pre market was up to 12% today). IOT, S, FROG,... all down even though valuation seems pretty reasonable and earnings expected on track. Nasdaq is on the other hand in plus though, so shouldn't be macro I think. Seems weird, any thoughts?": -0.2,
  "Shopify Surges in Q2 With 31% Growth, Driven by International, Enterprise Gains, Morgan Stanley Says": 0.8,
  "AI agents aren’t the ‘new Google,’ says Airbnb CEO": 0.1,
  "Trump Calls for Intel CEO to Resign, Stock Drops": -0.7,
  "LNW vs. TTWO: Which Stock Is the Better Value Option?": 0.2,
  "AVGO Expands Data Center Portfolio With Jericho4: Hold the Stock?": 0.2,
  "AppLovin Stock Gains 13% After Earnings. Why That’s Not a Big Deal.": 0.2,
  "Top Stock Movers Now: DoorDash, Fortinet, Eli Lilly, and More": 0.5,
  "Fortinet's Firewall Refresh Cycle No Longer a Near-Term Catalyst, Morgan Stanley Says": -0.5,
  "DASH Q2 Earnings Beat Estimates, Revenues Increase Y/Y, Shares Rise": 0.8,
  "Top Midday Stories: Trump Calls for Intel CEO's Resignation; Eli Lilly Shares Fall After Obesity Drug Trial Results": -0.5,
  "Uber in talks with banks, private equity firms to fund Waymo expansion - Uber (UBER.N), opens new tab is in talks with private equity firms and banks to secure funds to build its robotaxi business, CEO Dara Khosrowshahi said, as the ride-hailing giant bets on a mass roll-out of the nascent and much-scrutinized technology. Uber, which offers robotaxis from Alphabet (GOOGL.O), opens new tab-owned Waymo, has been strengthening its foothold in the self-driving taxi industry": 0.2,
  "I think the market overreacted to CROX earnings - Hello, here are some key takeaways from their earnings: Today theyre trading at about 80$ a share, 4.4B market cap. Down over 20% in reaction today, so here are some numbers they reported Returned over 200M to shareholders, over 100M in debt pay down and share buybacks each Revenue grew 3% to 1149M, non-GAAP EPS up 5% to 4.23 47% of their revenue is international (not": 0.2,
  "Nvidia, chip stocks jump after Trump says some chipmakers exempt from 100% semiconductor tariff": 0.8,
  "Why Ross Stores (ROST) Could Beat Earnings Estimates Again": 0.5,
  "Warner Bros. Discovery Q2 Earnings Beat Estimates, Revenues Rise Y/Y": 0.8,
  "Shopify Q2 Earnings Beat Estimates, Revenues Jump Y/Y, Shares Rise": 0.8,
  "TSX Down 125 Points at Midday With Most Sectors Lower": -0.6,
  "ABNB Q2 Earnings Beat Estimates, Revenues Rise Y/Y, Shares Drop": 0.2,
  "Why Axon (AXON) Might be Well Poised for a Surge": 0.6,
  "This week in 5 numbers: The price tag of employee referral programs": 0.0,
  "‘You’re welcome': Biden's antitrust chief points to Figma IPO as vindication of his policy": 0.5,
  "Leerink Partners Raised the Firm’s PT on Intuitive Surgical (ISRG), Kept a Buy Rating": 0.5,
  "Cognizant Partners with WRITER to Accelerate Secure AI Adoption for Enterprises": 0.6,
  "Micron Technology (MU) Launched a New Memory Chip for Space Application": 0.5,
  "Loop Capital Markets Reiterated a Buy Rating on AppLovin Corporation (APP), Kept the PT Unchanged": 0.6,
  "New Street Lifts Netflix (NFLX) PT to $1,210 Amid Strong Performance, Ad Growth": 0.8,
  "Argus Research Raises Lam Research (LRCX) PT to $120 After Strong Q2 Performance": 0.8,
  "Shareholder warns Apple's $100 billion investment is more optics than impact": -0.5,
  "WBD earnings top estimates, but it's not a buy yet, analyst says": 0.1,
  "Autodesk Channel Feedback Points to H2 Rebound After Q2 Slowdown, Oppenheimer Says": 0.5,
  "Marriott International Declares Quarterly Cash Dividend and Increases Share Buyback Authorization": 0.5,
  "Jim Cramer on Netflix: “It’s a Very Highly Valued Stock”": 0.5,
  "Constellation Energy stock: Catalysts that could power it higher": 0.6,
  "IGEL Expands Zero Trust Capabilities with Zscaler Client Connector on IGEL App Portal": 0.5,
  "Nuclear Stocks CEG and VST Power the AI Boom": 0.5,
  "Workday Rising to Feature Star-Studded Lineup With Brené Brown, Duran Duran, and Microsoft": 0.8,
  "Palo Alto Networks Stock Got Hammered After CyberArk Deal. Earnings Offer a Chance at Redemption.": 0.2,
  "Equities Fall Intraday as Markets Weigh Earnings": -0.5,
  "Why AppLovin Stock Popped Today": 0.5,
  "MoonPay Now Live in Mercury App": 0.5,
  "Is Berkshire Hathaway Stock a Buy, Sell, or Hold After Earnings?": 0.2,
  "Datadog (NASDAQ:DDOG) Delivers Strong Q2 Numbers, Full-Year Outlook Exceeds Expectations": 0.8,
  "Warner Bros. Discovery (NASDAQ:WBD) Reports Q2 In Line With Expectations But Stock Drops": -0.5,
  "buildOn Welcomes Three New Members to National Board of Directors": 0.5,
  "What's the next unicorn stock you have full conviction of? - As per title, I would like to hear what you guys are strongly betting on for the next 4-5 years? As in, if you could throw 50-100k into one stock and let it sit, what stock would that be and why? I understand fully that statistically it's safer to go with the broader market ETF way for obvious reasons, as it's hard to beat": 0.2,
  "Question I couldn't find in the wiki - So... A couple years in playing on RH with a pretty small amount total, I feel pretty ok about figuring out what I want to buy and why, and how much, etc (sort of, ha). I just can't figure out when to sell... I have a hard time when something is doing well, and the analysis is saying everywhere \"buy\" or even \"hold\" to sell it, even": 0.2,
  "Celsius Stock Jumps on Earnings Beat. The Alani Nu Deal Is Paying Off.": 0.8,
  "VKTX rumours - Hey guys, Viking Therapeutics (VKTX) just jumped about 8% today due to growing rumors that Pfizer might be eyeing them for a potential acquisition. Pfizer reportedly hired Morgan Stanley as an advisor, signaling serious talks could be underway. VKTX has promising GLP-1 drugs, which Pfizer needs after dropping their own candidate. While nothing’s confirmed yet, the market is buzzing because an acquisition could mean a significant premium on VKTX’s stock price. Are": 0.8,
  "Update: Fortinet Shares Fall After Morgan Stanley, Rosenblatt Downgrades": -0.7,
  "DoorDash's Strong Growth Signals Ambitious Long-Term Trajectory": 0.8,
  "Nat-Gas Prices Erase Early Gains as US Weather Forecasts Cool": 0.2,
  "Paxos reaches $48m settlement with NYDFS over Binance, AML failures": -0.5,
  "Roper Technologies, Inc. (ROP): A Bull Case Theory": 0.5,
  "Why CrowdStrike (CRWD) Shares Are Plunging Today": -0.7,
  "Why Zscaler (ZS) Stock Is Nosediving": -0.8,
  "Why didn’t costco (COST) price pullback after their ex-dividend date? - Why didn’t Costco’s stock (COST) drop after the ex-dividend date (Aug 1st)? Normally, you’d expect a dip roughly equal to the dividend payout, but the price barely moved down and went up instead. Was it offset by strong earnings sentiment, buyback effects, or just high demand keeping the stock elevated? Or is the market just ignoring dividend adjustments for stocks like this now?": 0.2,
  "Equity Markets Mixed Amid Speculation on Semiconductor Tariffs": 0.1,
  "Fortinet Falls On Q2 Results. Investors 'Confused' On Firewall Refresh. Cybersecurity Stocks Sell Off.": -0.6,
  "Buy the Spike in AppLovin Stock after Q2 earnings?": 0.2,
  "Duolingo, Eli Lilly, Airbnb: Trending Tickers": 0.0,
  "The Trade Desk Appoints Omar Tawakol to Board of Directors": 0.5,
  "Back to School, Forward to the Future: How Smart Tech and Sustainable Connectivity Empower Students to Thrive on the Go\"": 0.8,
  "90-day extension of US-China tariff truce is likely, US Commerce Secretary Lutnick says - White House has yet to confirm moving the deadline, now set for next week, though Beijing officials say agreement was reached. A 90-day extension of a US-China tariff truce is likely, US Commerce Secretary Howard Lutnick said on Thursday, the most concrete signal from the US side about moving the deadline since bilateral talks concluded in Stockholm last week. “I think": 0.5,
  "Ross Stores, Inc. Announces Second Quarter 2025 Earnings Release and Conference Call": 0.0,
  "Apple Stock Rallies on Trump’s Plan for ‘Make in America’ Tariff Exemptions": 0.8,
  "NVidia: when would you sell? - If you own NVidia what signals are you watching that would make you sell / trim your position? Say if X, Y and Z happens then I'll take some profits or close my position. Is that something you've considered and if not, why not? I don't personally own NVidia, I'm just curious on when people that have managed to ride the stock price all the way to here will": 0.1,
  "Regeneron Announces Investor Conference Presentations": 0.0,
  "Atlassian Announces Fourth Quarter and Fiscal Year 2025 Results": 0.0,
  "Atlassian and Google Cloud Partner to Bring AI-Powered Productivity to Millions of Users Worldwide": 0.8,
  "Take-Two Interactive Software, Inc. Reports Results for Fiscal First Quarter 2026": 0.1,
  "S&P 500 Nuclear Leaders Report Earnings As Stock Market Nuke Fever Spreads": 0.2,
  "US Equity Markets Mixed as Investors Parse President Trump's Tariff Remarks on Semiconductor Imports": 0.1,
  "The RMR Group Announces $1.0 Billion Refinancing of Vertex Pharmaceuticals’ Headquarters in Boston Seaport District": 0.5,
  "Microchip Technology Announces Quarterly Cash Dividend on Common Stock of 45.5 Cents Per Share": 0.5,
  "Microchip Technology Announces Financial Results for First Quarter of Fiscal Year 2026": 0.5,
  "Monster Beverage: Q2 Earnings Snapshot": 0.0,
  "TSX Closer: The Index Falls Off a Record on Profit Taking and Concerns Over Canada's Economic Outlook": -0.6,
  "Equity Markets Close Mixed Amid Trump's Semiconductors Tariffs, Jobless Claims Data": 0.1,
  "Take-Two Boosts Outlook Ahead of Next ‘Grand Theft Auto’ Release": 0.8,
  "Instacart tops estimates, issues upbeat outlook - Instacart earnings topped estimates and the grocery delivery company issued strong guidance. Here’s how the company did versus LSEG estimates: * **Earnings:** 41 cents per share vs. 38 cents expected * **Revenues:** $914 million vs. $896 million expected “We delivered another strong quarter, reinforcing the essential role we play in helping families save time, money, and effort putting food on the table,” wrote outgoing CEO Fidji Simo in": 0.8,
  "These Stocks Moved the Most Today: Eli Lilly, Fortinet, AppLovin, Sunrun, Airbnb, Duolingo, and More": 0.5,
  "Tyson Foods Names Microsoft Executive to Board of Directors": 0.5,
  "Take-Two Interactive Software Raises Fiscal-Year Outlook on Improved First-Quarter Results": 0.8,
  "Microchip Tech: Fiscal Q1 Earnings Snapshot": 0.0,
  "Take-Two lifts annual bookings forecast on 'Mafia', 'Borderlands' launches": 0.5,
  "Stocks to Watch Recap: Eli Lilly, Firefly, DoorDash, TSMC": 0.5,
  "Stocks Close Mixed after Higher Bond Yields and Tariff News": -0.5,
  "Atlassian: Fiscal Q4 Earnings Snapshot": 0.0,
  "Block shares pop 11% on full-year guidance boost - Block shares jumped in extended trading on Thursday after the fintech company increased its forecast for the year. Here is how the company did, compared to analysts’ consensus estimates from LSEG. * **Earnings per share:** 62 cents adjusted vs. 69 cents expected Block doesn’t report a revenue figure, but said gross profit rose 14% from a year earlier to $2.54 billion, beating analyst estimates of $2.46": 0.8,
  "Pinterest stock falls 10% after earnings miss - Pinterest shares were down more than 10% on Thursday after the company reported second-quarter earnings that missed on earnings per share. Here’s how the company did, compared to analysts’ consensus estimates from LSEG: * **Earnings per share**: $0.33 cents Adj. vs. $0.35 cents expected * **Revenue**: $998 million vs. $975 million expected Sales in Pinterest’s second quarter grew 17% year-over-year while net income was $38.76 million, up": -0.6,
  "Take-Two: Fiscal Q1 Earnings Snapshot": 0.0,
  "Cisco: Investing in AI & Digital Innovation for India's Farming Future": 0.8,
  "Atlassian beats Q4 estimates on strong cloud growth, 2026 guide in-line": 0.6,
  "Take-Two Tops June-Quarter Targets, Touts Ambitious Game Pipeline": 0.8,
  "Roper Technologies Prices Public Offering Of $500 Million Senior Unsecured Notes Due 2028, $500 Million Senior Unsecured Notes Due 2030, $1 Billion Senior Unsecured Notes Due 2035": 0.0,
  "Trump’s tariff threat puts semiconductors on display": 0.1,
  "Take-Two shares rise on strong net bookings, upbeat forecast ahead of new GTA": 0.8,
  "Wall Street Wavers as Tariffs Take Effect, Earnings Cycle Continues": 0.1,
  "SmartCentres Real Estate Investment Trust Releases Second Quarter Results for 2025": 0.0,
  "Traditional media 'turning the corner': Streaming sector playbook": 0.5,
  "Gilead Earnings Beat Estimates, But All Eyes Are On New HIV Shot": 0.5,
  "Mondelēz 2024 Snacking Made Right Report: Energy": 0.2,
  "KLA Declares Regular Cash Dividend": 0.2,
  "Pinterest Q2 profit miss, Block Q2 revenue miss, Take-Two Q1 beat": -0.33,
  "APP: Oppenheimer Calls AppLovin a 'Top Pick' -- Shares Jump to New High": 0.8,
  "S&P 500 Gains and Losses Today: Apple Stock Climbs; Eli Lilly Slumps After Disappointing Trial Results": 0.2,
  "Monster Beverage (MNST) Tops Q2 Earnings and Revenue Estimates": 0.8,
  "Atlassian’s (NASDAQ:TEAM) Q2 Sales Top Estimates But Quarterly Revenue Guidance Slightly Misses Expectations": 0.2,
  "Applied Optoelectronics (AAOI) Reports Q2 Loss, Misses Revenue Estimates": -0.7,
  "Microchip Technology (MCHP) Q1 Earnings and Revenues Surpass Estimates": 0.8,
  "I’m seriously considering consolidating my entire portfolio into Apple (AAPL) - So here’s what I’m wrestling with: Why shouldn’t I sell my Amazon and AMD positions and go all-in on Apple? ( I already got some apple shares ) Am I overlooking some major risk with Apple that others see? Is this level of concentration just asking for trouble or is it conviction? Apple feels “boring,” but is boring what wins? Would I regret not": 0.5,
  "T-Mobile Is Using 5G, Drones and AI to Help First Responders": 0.6,
  "Gilead Sciences (GILD) Tops Q2 Earnings and Revenue Estimates": 0.8,
  "Atlassian (TEAM) Q4 Earnings and Revenues Top Estimates": 0.8,
  "Take-Two’s (NASDAQ:TTWO) Q2: Beats On Revenue, Full-Year Outlook Exceeds Expectations": 0.8,
  "Atlassian forecasts downbeat quarterly revenue": -0.7,
  "Workday (WDAY) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Lululemon (LULU) Dips More Than Broader Market: What You Should Know": -0.5,
  "Why the Market Dipped But Micron (MU) Gained Today": 0.2,
  "Why Zscaler (ZS) Dipped More Than Broader Market Today": -0.5,
  "President Trump Rocks Chip Stocks With Tariff Talk, Intel Comments": 0.5,
  "Tech, Media & Telecom Roundup: Market Talk": 0.0,
  "Take-Two Interactive (TTWO) Beats Q1 Earnings and Revenue Estimates": 0.8,
  "Microchip Tech beats Q1 net sales, profit estimates": 0.8,
  "Analog Devices (ADI) Ascends While Market Falls: Some Facts to Note": 0.5,
  "Microchip Tech (MCHP) Q1 Earnings: How Key Metrics Compare to Wall Street Estimates": 0.5,
  "Pemex plan disappoints suppliers awaiting billions in overdue payments": -0.6,
  "AppLovin Stock Jump 12% On Outlook Driven Catalysts": 0.8,
  "QuinStreet (QNST) Q4 Earnings Lag Estimates": -0.5,
  "Tesla shuts down Dojo, the AI training supercomputer that Musk said would be key to full self-driving": -0.8,
  "Atlassian (TEAM) Reports Q4 Earnings: What Key Metrics Have to Say": 0.2,
  "Take-Two (TTWO) Reports Q1 Earnings: What Key Metrics Have to Say": 0.2,
  "Tesla disbands Dojo Supercomputer Team, Bloomberg Reports - https://www.reuters.com/business/autos-transportation/tesla-disbands-dojo-supercomputer-team-bloomberg-news-reports-2025-08-07/ Ahem, calls! Tesla Inc. is disbanding its Dojo supercomputer team and its leader will depart the company, according to people familiar with the matter, upending the automaker’s effort to develop in-house chips for driverless technology. Peter Bannon, who was heading up Dojo, is leaving and Chief Executive Officer Elon Musk has ordered the effort to be shut down, according to the people, who asked not to": -0.6,
  "Do CEOs pay to go on with Kramer on Fast Money? - His interviews are suspiciously soft...as of a PR person coordinated the questions and Kramer is over the top positive. Never questioning them too much. I just assume it's a paid interview. Any truth to this?": -0.6,
  "Dividend Watch: 3 Companies Boosting Payouts": 0.5,
  "Gilead (GILD) Q2 Earnings: Taking a Look at Key Metrics Versus Estimates": 0.2,
  "nLight (LASR) Tops Q2 Earnings and Revenue Estimates": 0.8,
  "Paramount Skydance - What is the potential? - Can someone help explain the business model? I know very little about it, but it was a huge merger and as someone with a little bit to blow on the future potential, I’m weighing whether or not there’s room for significant growth? Not looking for advice, just an explanation at how this merger makes sense towards creating more value.": 0.2,
  "Verisk Analytics, Inc. Prices Offering of Senior Notes": 0.0,
  "Fast-growing coffee chain is coming for Starbucks' crown": 0.8,
  "$60k into $HIMS at $50.75, Will I Survive the Ride? - Well, easily the best stock for upside potential out there. I doubled down on HIMS at $50.75 after catching that \\~20% pullback. I’m all-in because I believe in the company’s global ambitions, they’re expanding in Asia and Latin America, and the ZAVA acquisition is straight-up bullish. So now I’m wondering: What price targets should I aim for? How low could it realistically drop from": 0.6,
  "SoftBank Shares Surge to Record on AI-Fueled Profit Recovery": 0.8,
  "TSMC Secrets Leak Puts Japan’s Tokyo Electron on Hot Seat": -0.5,
  "Go with the Flow: Agoda's Curated Guide to Asia's Hidden Riverside Destinations": 0.5,
  "Can the Tech AI economy save us? - I’m very curious to hear what everyone thinks here because on one hand you have AI and data center growth booming. On the other Main Street consumer products and company’s with physical goods struggling. Many parts of that economy are taking impacts to tariffs …automotive, industrial, consumer staples etc. Can things keep growing when we have a massive disparity here? Seems like an over concentration in technology": -0.6,
  "Any thoughts on Bullish IPO? - Just saw that Bullish, a crypto-focused exchange backed by Peter Thiel’s Founders Fund, is planning to IPO on August 13 under the ticker BLSH, with a price range of 28 to 31 dollars per share. They are targeting a valuation in the $4 billion range and plan to raise a little over $600 million. Financials seem mixed. They were profitable last year, but Q1 of this year showed a": 0.2,
  "What the analysts got wrong about Eli Lilly's oral GLP... - So LLY just got rekt today because their oral GLP showed lower than expected % body weight loss of 12%... Lilly says that the results are actually as good as you're gonna get in an oral GLP... so why is there a difference of expectation? DOSING.... It's well known that GLP drugs have a dose dependent efficacy AND adverse effect profile... simply put, the": -0.5,
  "SOFI joins the MSCI ACWI equity index. - SoFi adds a whole new spectrum for the MSCI ACWI (All Country World Index) equity index by being the most diversified Fintech Bank that thrived in multiple macro environments. * SoFi is the only Fintech bank that combines a Charter bank, a Financial technology payment processing platform, and Cyberbank Core capabilities. A great portion of its revenue is from fee services. * The upcoming probable interest rate": 0.6,
  "Q2 Earnings Roundup: DoorDash (NASDAQ:DASH) And The Rest Of The Gig Economy Segment": 0.2,
  "Comcast’s (CMCSA) $19M Expansion Brings Speed and Support to Bossier City": 0.6,
  "BMO Capital Lifts PT on Regeneron Pharmaceuticals (REGN) Stock, Keeps Outperform": 0.6,
  "Jim Cramer on Target: “You’re Free to Buy It”": 0.5,
  "2 Reasons to Watch BKNG and 1 to Stay Cautious": 0.5,
  "Canadian stock market benefits the most from Trump's tariffs - Even with Trump's tariffs on Canada, Canada still has one of the smallest average effective tariff rate compared to other countries due to CUSMA/USMCA exception. This will help Canada withstand the downsides of Trump's tariffs. I predict Canada's stock market to greatly outperform other indices. The TSX Composite Index is already up 11.50% YTD, but it has the potential to go higher as tariffs start": 0.8,
  "How Quantum Computing Could Upend Bitcoin": 0.1,
  "TSMC’s July Sales Grow 26% on Sustained Demand for AI Chips": 0.8,
  "Netflix Stock: Is Wall Street Bullish or Bearish?": 0.2,
  "What Are Wall Street Analysts' Target Price for Xcel Energy Stock?": 0.0,
  "Dutch Bros Stock Is Steaming Hot. Could It Be the Next Starbucks?": 0.8,
  "Constellation Energy Corp (CEG) Q2 2025 Earnings Call Highlights: Strong Financial Performance ...": 0.8,
  "Zacks Investment Ideas feature highlights: Constellation Energy, Vistra and Meta Platforms": 0.5,
  "Palo Alto Networks Stock: Is Wall Street Bullish or Bearish?": 0.2,
  "Monster Beverage Corp (MNST) Q2 2025 Earnings Call Highlights: Record Sales and Strategic ...": 0.8,
  "Zacks Investment Ideas feature highlights: AppLovin": 0.2,
  "Atlassian Corp (TEAM) Q4 2025 Earnings Call Highlights: Record Deals and AI Growth Propel ...": 0.6,
  "Prediction: This Dividend Stock Will Beat the Market Over the Next 5 Years": 0.6,
  "Intel CEO Dogged by Decades of China Chip Bets, Board Work": -0.5,
  "Think You Know Costco? Here's 1 Little-Known Fact You Can't Overlook.": 0.5,
  "These Are the 5 Most Popular Stablecoins in 2025. Will That Change in 2026?": 0.0,
  "Monster’s (NASDAQ:MNST) Q2 Sales Beat Estimates, Stock Soars": 0.8,
  "Microchip Technology (NASDAQ:MCHP) Posts Better-Than-Expected Sales In Q2 But Stock Drops": -0.5,
  "Best AI Marketing Tools (2025): QuickBooks to Launch Campaign Automation via Mailchimp, Named Top Marketing Solution by Better Business Advice": 0.8,
  "r/Stocks Daily Discussion & Fundamentals Friday Aug 08, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is": 0.5,
  "Tesla reportedly dissolves Dojo supercomputer team": -0.8,
  "Intel boss hits back at ‘misinformation’ after Trump attacks China links": -0.5,
  "CFOs On the Move: Week ending Aug. 8": 0.0,
  "Pepsi: Turnaround in the Making?": 0.5,
  "Have $1,000? These 2 Stocks Could Be Bargain Buys for 2025 and Beyond": 0.5,
  "Smart Gas Meter Market Research and Global Forecast Report 2025-2030 with Apator, Diehl Stiftung, Honeywell International, Itron, and Landis+Gyr Leading": 0.5,
  "DoorDash Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "Ecommerce Platform Market Analysis and Global Forecast Report 2025-2030 | Omnichannel Retailing to Drive Demand, Internet Penetration and Smartphones Fuel Adoption": 0.5,
  "Monster Beverage Second-Quarter Results Top Views Amid Immaterial Tariff Impact": 0.8,
  "Should You Double Down on These 3 Dow Jones Dividend Stocks Near All-Time Highs?": 0.5,
  "Additional Considerations Required While Assessing Xcel Energy's (NASDAQ:XEL) Strong Earnings": 0.5,
  "4 chip stocks well positioned for Trump's 100% tariff threat": 0.5,
  "Results: Advanced Micro Devices, Inc. Confounded Analyst Expectations With A Surprise Profit": 0.8,
  "July in Review: 11 Top Technology Press Releases": 0.0,
  "TSX posts biggest weekly gain since September as corporate earnings impress": 0.8,
  "5 Top Stocks to Buy in August": 0.0,
  "Accumulating bitcoin a risky digital rush by companies?": -0.5,
  "Fortinet Second Quarter 2025 Earnings: EPS Beats Expectations": 0.8,
  "Novo Nordisk is a top pick - Winner in Obesity treatment market - Hello Guys, as a european investor I am surprised by the huge crash the Novo Nordisk shares had to go through and now is the time to buy the huge dip. For a long time Novo Nordisk was the most valuable company in Europe, but due to their not excellent Q2 2025 numbers and competition in the obesity treatment market they suffered": 0.2,
  "Nicotine Is Hot, Beer Is Not. What Vice Stocks Say About America’s Guilty Pleasures.": 0.2,
  "A Closer Look At Honeywell International Inc.'s (NASDAQ:HON) Impressive ROE": 0.8,
  "This Top Global Tech Fund Manager Shares His 'Secret Sauce'": 0.5,
  "Edge AI Hardware Market Research Report 2025-2030 | Opportunities Expand with Generative AI Optimization, On-Device Visual Processors, and 5G-Enabled Ultra-Low Latency Applications": 0.6,
  "AppLovin Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "Earnings, Tariff Outlook Lift Wall Street Pre-Bell; Asia Mixed, Europe Up": 0.5,
  "ZETA just dropped a 70% FCF surge, margin expansion, and a platform play that’s actually working, why isn’t anyone talking about this - **TL;DR: They’re scaling efficiently, FCF is surging, margins are tightening, and the platform play is working. Not many SaaS names are executing like this right now.** Edit: changed the fcf and ebitda figures so that they are all on the same period basis Zeta just posted one of its strongest quarters yet,": 0.8,
  "Sonder Secures New Funding, Amends Marriott Agreement": 0.5,
  "Stocks Rise Pre-Bell as Traders Assess Trump's Nomination for New Fed Governor": 0.5,
  "Apple is back on Trump's good side. The cost? $600 billion.": -0.6,
  "Airbnb, Inc. Just Beat EPS By 9.5%: Here's What Analysts Think Will Happen Next": 0.5,
  "This Week In AI Chips - DEEPX Baidu Partnership Advances Global AI Integration": 0.8,
  "US High Growth Tech Stocks To Watch In August 2025": 0.5,
  "Texas Instruments Incorporated (TXN) Surged Along with Market Sentiment": 0.8,
  "Do Wall Street Analysts Like Skyworks Solutions Stock?": 0.2,
  "What Makes Adobe (ADBE) a Lucrative Investment?": 0.6,
  "I’m 300 shares deep in UNH at a cost basis of $255 - I plan to hold for approx five years. My bet is they will be higher in 5 years time. I will be selling covered calls with 2-3 month expirations dates approx 20% above market price throughout. That is all.": 0.6,
  "Financially motivated cluster a key player in ToolShell exploitation": -0.5,
  "Large Chainlink Bag Holders Swell as Oracle Company Creates LINK Reserve": 0.5,
  "NXP Semiconductors (NASDAQ:NXPI) Might Have The Makings Of A Multi-Bagger": 0.8,
  "Why Phillips 66, PepsiCo, And Regions Financial Are Winners For Passive Income": 0.5,
  "Define Your Risk On Broadcom Stock By Using A Bull Put Spread": 0.2,
  "Here’s Why Diamondback Energy (FANG) Slid in Q2": -0.5,
  "Golds soars, Fed latest and Intel CEO's Trump response: 3 Things": 0.2,
  "California bakery paid extra $100K to DoorDash after being double-billed for 8 years — how to avoid delivery overcharges": -0.7,
  "Investors Parse, Look Ahead to Earnings Announcements as US Futures Rise Friday Pre-Bell": 0.5,
  "The New Era of Real Estate Sales: Why Voice AI Is Reshaping the U.S. Market": 0.5,
  "Take-Two soars after forecast signals mobile gaming rebound": 0.8,
  "Is it down? – NordVPN launches a page and service status checker based on user reports": 0.2,
  "Is Warren Buffett About To Dump The Highest-Yielding Dividend Stock In Berkshire Hathaway's Portfolio?": -0.5,
  "Are Intel Options Traders Expecting the Chip Stock to Collapse This August?": -0.5,
  "AWAKE Caffeinated Chocolate Makes Delicious Debut in U.S. Costco Warehouses": 0.8,
  "META: Meta Strikes $29 Billion AI Data Center Deal with PIMCO": 0.5,
  "Intel CEO responds after Trump calls for his resignation": 0.1,
  "Intel CEO Says He Has Board’s Support After Trump Calls to Step Down": 0.2,
  "Is Wall Street Bullish or Bearish on Constellation Energy Stock?": 0.5,
  "Exchange-Traded Funds, Equity Futures Higher Pre-Bell Friday Ahead of Fed Board Changes": 0.5,
  "How to Find Strong Computer and Technology Stocks Slated for Positive Earnings Surprises": 0.8,
  "Here is What to Know Beyond Why Intuitive Surgical, Inc. (ISRG) is a Trending Stock": 0.1,
  "Here is What to Know Beyond Why Broadcom Inc. (AVGO) is a Trending Stock": 0.2,
  "Cisco Systems, Inc. (CSCO) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Investors Heavily Search Applied Materials, Inc. (AMAT): Here is What You Need to Know": 0.5,
  "Investors Heavily Search Axon Enterprise, Inc (AXON): Here is What You Need to Know": 0.5,
  "Stocks making big moves this week: AMD, Tesla, Amentum, Sprout Social, and 8x8": 0.5,
  "Semiconductor industry reacts to tariff plans; Trump targets Intel CEO": -0.5,
  "Homes.com Report: Moderate Home Price Appreciation Continued in July. Nationally, the Median Home Price Was up 2.1% From a Year Ago.": 0.5,
  "Ethereum pops above $4,000 to make new 2025 high as Ripple, Chainlink lead altcoin rally": 0.8,
  "Trump Reminds CEOs Who the Ultimate Boss Is": 0.2,
  "Wall Street Set to Open Slightly Higher Friday as Investors Pore Over Earnings Results": 0.5,
  "Enovix Establishes R&D Center of Excellence in India to Accelerate AI-2™ Platform Development": 0.5,
  "What Analyst Projections for Key Metrics Reveal About Cisco (CSCO) Q4 Earnings": 0.2,
  "United States Soup Market Trends and Growth Analysis Report 2025-2033 | Premium and Plant-Based Soups Drive Expansion Amidst Evolving Consumer Preferences": 0.6,
  "Tesla disbanding Dojo supercomputer efforts is positive for these 2 chip stocks": 0.6,
  "GILD Stock Rises on Q2 Earnings and Sales Beat, '25 View Up": 0.8,
  "Breaking down Metaplanet’s play-by-play imitation of Strategy": 0.0,
  "Computer-aided Engineering (CAE) Market Surges to $19.96 billion by 2030 - Dominated by Ansys (US), Autodesk (US), Dassault Systèmes (France)": 0.6,
  "Is It Worth Investing in Shopify (SHOP) Based on Wall Street's Bullish Views?": 0.5,
  "MicroStrategy (MSTR) Is Considered a Good Investment by Brokers: Is That True?": 0.2,
  "Atlassian Q4 Earnings Surpass Expectations, Revenues Rise Y/Y": 0.8,
  "Trump Attacks Intel CEO Lip-Bu Tan: What to Know": -0.8,
  "Netflix revenues hit record high amid BBC licence fee exodus": 0.5,
  "PepsiCo (PEP) Crossed Above the 20-Day Moving Average: What That Means for Investors": 0.2,
  "Trade Desk downgraded, Instacart upgraded: Wall Street's top analyst calls": 0.2,
  "Coca-Cola Europacific Partners First Half 2025 Earnings: EPS: €1.99 (vs €1.73 in 1H 2024)": 0.5,
  "Tradr Readies Leveraged Single-Stock ETFs on ALAB and DDOG": 0.1,
  "Here's Why Idexx Laboratories (IDXX) is a Strong Growth Stock": 0.8,
  "Factbox-Before Intel, which CEOs drew Trump's ire?": 0.0,
  "Under Armour, Tesla, Wendy's: Trending Tickers": 0.0,
  "Datadog Q2 Earnings Surpass Estimates, Revenues Increase Y/Y": 0.8,
  "Tesla Disbands Dojo Supercomputer Team, Unwinding Key AI Effort": -0.8,
  "How Intel’s CEO Helped Create China’s Chip Industry": 0.5,
  "Mafia: The Old Country Now Available Worldwide": 0.5,
  "When Should You Buy Starbucks Corporation (NASDAQ:SBUX)?": 0.0,
  "Stocks Supported by Robust Earnings and Rate Cut Hopes": 0.8,
  "Tax Management Software Market Surges to USD 25.4 Billion by 2033, Propelled by 10.5% CAGR - Verified Market Reports®": 0.8,
  "Stock Market Rises In Range; Palantir, AMD, Shopify Lead Huge Earnings Movers: Weekly Review": 0.6,
  "PepsiCo Stock: Is Wall Street Bullish or Bearish?": 0.2,
  "Market Minute 8-8-25- Gold Flirts with Fresh Highs Amid Tariff Turmoil": 0.5,
  "Trade Desk Faces Increasing Competition From Amazon DSP, Wedbush Says": -0.5,
  "BBAI, ASTS, ACHR & OKLO are all announcing their earning report after the bell on Monday. Which of these companies is going to rise most? - All four of these companies are incredibly popular on Reddit right now, and you really can’t visit a single investing sub Reddit without hearing about at least one of them. Of these four, which is most likely to make a huge jump come Tuesday morning? Each and every one": 0.6,
  "Meta acquires AI audio startup WaveForms": 0.5,
  "Form 8.3 - Aqua Acquisition Sub LLC (subsidiary of Qualcomm Incorporated)": 0.0,
  "BC-Most Active Stocks": 0.0,
  "Sezzle Is Up 7,000% Since Bottoming in 2023. The Question Is Why": 0.5,
  "Microsoft Stock Heads for the Clouds After Q4 Earnings. Is It Too Late to Buy MSFT Here?": 0.5,
  "Are Wall Street Analysts Predicting American Electric Power Stock Will Climb or Sink?": 0.1,
  "Competitive pressures emerging for The Trade Desk, Wedbush cuts rating": -0.6,
  "Meta Expands Aggressively on Data Centers": 0.5,
  "Amgen's Repatha, Evenity & Blincyto Drive Sales This Earnings Season": 0.5,
  "Reason to worry the Fed won't cut rates after all": -0.6,
  "Stocks to watch next week: CoreWeave, Cisco, Aviva, Entain and Persimmon": 0.0,
  "3 Crypto-Centric Stocks to Grab Before Bitcoin's Next Rally": 0.5,
  "Cisco Stock Shows Strength Ahead Of Earnings; Fast-Growing IPOs CoreWeave, Circle Internet Set To Report": 0.6,
  "Gilead Sciences Lifts Annual Outlook As Yeztugo Launch Nears": 0.6,
  "Pinterest Stock Slides After Q2 Earnings. Here's What's Weighing On The Social Media Stock.": -0.5,
  "Intel CEO Pushes Back Against Trump's Call to Resign": -0.5,
  "Take-Two Interactive 'Well Diversified' With IP Across Categories, Wedbush Says": 0.5,
  "Expedia Posted Strong Earnings. What Wall Street Is Saying About the Stock.": 0.5,
  "The Trade Desk stock crashes, falls 38% as growth slows, company replaces CFO": -0.8,
  "CoreWeave Faces a Wave of Doubt. Rival Nebius Is Helping Lift the Mood.": 0.5,
  "Form 8.3 - Qualcomm Incorporated": 0.0,
  "How do 3x shares work, they don't seem to be 3x - I bought some 3x amd and 3x nvidia shares to see what happens but they aren't doing 3x what the original stock is doing. In the last 24hrs nvda has gone up 1.23% but the 3x has gone up 2.46 which is 2x? In the last 24hrs amd has gone up 0.42% but the 3x has gone down 1%? The 3x i got": 0.1,
  "Intellia Q2 Loss Narrower Than Expected, Pipeline Progress in Focus": 0.5,
  "Comcast Brings High-Speed Internet and Lift Zone to McDuffie County, Celebrates with Laptop Giveaway and Block Party": 0.6,
  "Stocks Rally on Positive Earnings and Hopes for an End to Russia-Ukraine War": 0.8,
  "Trade Desk Stock Crashes 38% After Earnings. What’s Causing the Selloff.": -0.8,
  "Warner Bros. Stock Slides After Analysts Flag Second-Half Challenges": -0.6,
  "Deep Learning Market in the US 2025-2029 | Industry-specific Solutions, AI Adoption, and Increased Startup Entry Fuel Growth": 0.6,
  "Airbnb charts AI-first path as it expands customer service agent": 0.1,
  "Airbnb Stock Just Went on Sale. Here’s How to (Safely) Trade the Post-Earnings Dive with Options.": 0.2,
  "Gilead Sciences Expected to See 3% Growth in Annual HIV Product Sales, Truist Says": 0.5,
  "Airbnb embraces a paradox: CEO Brian Chesky says hotels are the future": 0.2,
  "Stock Conversation - Is it appropriate to talk about investments and stocks with people? Not too long ago I was with some friends and I brought up stocks and investments. The conversation got quiet and basically ended. Fast forward a couple of drinks and two of my friends ended up calling me an asshole acting like I was flaunting my wealth and riches when I hadn’t even discussed how much I had invested. I tried": -0.5,
  "Under fire from Trump over China ties, Intel’s Tan counters resignation calls": -0.5,
  "Top Midday Stories: Trade Desk CEO Says Tariffs Impacting Key Clients; UK Regulator Approves Boeing's Acquisition of Spirit AeroSystems": 0.2,
  "Why ETHZilla is skipping Michael Saylor’s favourite crypto treasury ploy: Leverage": 0.1,
  "Monster Beverage Q2 Upside, July Sales Growth Back Morgan Stanley's Guide for Revenue Outperformance, Analysts Say": 0.5,
  "Saylor Says Bitcoin Is a Better Investment Than Gold": 0.8,
  "GFS vs. LSCC: Which Stock Is the Better Value Option?": 0.2,
  "BZLFY vs. MDLZ: Which Stock Is the Better Value Option?": 0.2,
  "Why is Trump calling on the CEO of Intel to resign?": -0.5,
  "Ramit Sethi Lays Out the Most Common Money Traps—And How To Dodge Them Before It's Too Late": 0.5,
  "Microchip Q1 Earnings Beat Estimates, Sales Down Y/Y, Shares Drop": -0.2,
  "U.S. Electric Vehicles Are At A Crossroad; Trump's Budget Ends Incentives, China Remains All-In": 0.2,
  "Can China Momentum Balance Starbucks' U.S. Comps Challenges?": 0.1,
  "Why Tesla Stock's Sideways Movement Truly Matters": 0.0,
  "AI chips startup CEO: Intel has to fix systemic issues to get back on track": -0.5,
  "Apartments.com Releases Multifamily Rent Growth Report for July 2025": 0.0,
  "MBR to GPT: Secure Boot Becomes Key for Windows 11, AAA Games, and Pro-Grade Apps": 0.5,
  "DASH Q2 Benefits From Strong Marketplace GOV: Time to Buy the Stock?": 0.6,
  "Is Gen X Nostalgia Just Trauma-Bonding?": -0.5,
  "OpenAI priced GPT-5 so low, it may spark a price war": 0.2,
  "You don’t own enough Google- Another “Google is undervalued” post - OpenAI just released their frontier model and suffice to say… it flopped. People are waiting with bated breath to see what Google has cooked up. They already released Genie 3, which nobody is even close to yet on world models. I think it will be trivial for them to surpass or at least catch up to OpenAI on the intelligence front for frontier LMM.": 0.2,
  "Microchip Technology Faces Higher Revenue Bar than Peers, Morgan Stanley Says": 0.1,
  "Alphabet Rises 11% in a Month: Buy, Sell or Hold the GOOGL Stock?": 0.2,
  "Monster (MNST) Shares Skyrocket, What You Need To Know": 0.5,
  "Tesla (TSLA) Stock Trades Up, Here Is Why": 0.5,
  "Why Is Gilead Sciences (GILD) Stock Rocketing Higher Today": 0.6,
  "Why The Trade Desk (TTD) Stock Is Trading Lower Today": -0.5,
  "Gilead’s Yeztugo sales “ahead of expectations” following launch": 0.8,
  "Should Cisco Stock Be in Your Portfolio Pre-Q4 Earnings?": 0.2,
  "Is Idexx (IDXX) a Solid Growth Stock? 3 Reasons to Think \"Yes\"": 0.6,
  "Piper Sandler gets bullish on Monster Beverage, sees sustainable growth ahead": 0.8,
  "Ex-Tesla HR pros allege they were ‘penalized and pushed out’ for reporting bias": -0.8,
  "The Tech Tariffs Arrive. Why 100% Levies Had 0% Impact.": 0.0,
  "Monster Beverage Leverages Functional, Zero-Sugar Innovations To Capture Energy Drink Market Growth": 0.8,
  "The day after Trump called Intel’s chief ‘conflicted,’ former directors call for a new company, a new board, and a new CEO": -0.5,
  "Pinterest Stock Gets Multiple Price Target Hikes. Shares Tumble on Earnings Miss.": -0.5,
  "Netflix's $6 Billion UK Spend Pays Off With Strong Growth, Membership Gains": 0.8,
  "Oil, Gas Rigs Still Near 3-Year Low Despite Weekly Bump": 0.1,
  "Tariffs Be Damned. Stocks Flirt With a New Record High.": 0.8,
  "NASA and Google are building an AI medical assistant to keep Mars-bound astronauts healthy": 0.8,
  "US Equity Indexes Rise Amid Trump's Efforts to Secure Ukraine-Russia Peace Deal; Gold Hits New Record": 0.8,
  "Intuit (INTU) Revolutionizes Small Business Finance With Advanced AI Accounting Tools": 0.8,
  "Trade Desk nosedives, Twilio weak outlook, FuboTV revenue beat": -0.5,
  "Microsoft (MSFT) Expands Integration Potential with Intermedia for Unified Communication Management": 0.5,
  "Microchip Technology (MCHP) Reports Dividend Declaration Despite US$19 Million Quarterly Loss": -0.5,
  "PepsiCo (PEP) Unveils 7UP Pink Lemonade To Enhance Moods With Colourful UK Campaign": 0.6,
  "Kraken exec says tokenized stocks will let you ‘buy coffee with Tesla’": 0.5,
  "CrowdStrike (CRWD) Launches AI Security Services to Protect and Power the Future of SOCs": 0.6,
  "KLA (KLAC) Announces US$1.90 Dividend as Board Members Retire": 0.5,
  "Palantir (PLTR) Stock Soars on 2Q Blowout—But Is It Too Expensive to Buy Now?": 0.5,
  "Sector Update: Tech Stocks Rise in Afternoon Trading": 0.5,
  "Does CPI Reflect True Inflation? Some on Wall Street Have Doubts.": -0.5,
  "AMD’s AI Growth Story Gains Steam—Barclays Sees Room for More Upside": 0.8,
  "NVIDIA (NVDA) Gets Overweight Rating as AI Capex Stays Strong Into 2026": 0.6,
  "Intel CEO fires back at Trump's demand to resign": -0.5,
  "Elon Musk Has New Distractions on His Plate as Boring Company Drama Rages. What Does That Mean for Tesla Stock?": -0.5,
  "Diamondback Energy Narrows Production Guidance as Net Income Dips in Q2": -0.5,
  "Deutsche Bank Reiterates Buy on Microsoft (MSFT)—AI Driving Double-Digit Efficiency Gains": 0.8,
  "Constellation Energy (CEG) Completes Buyback as Earnings Show Mixed Results": 0.1,
  "Amazon (AMZN) AWS Unveils Amazon EVS—A New Way to Run VMware Workloads in the Cloud": 0.5,
  "Palantir Technologies (PLTR) Expands FedStart Program with Unstructured to Enhance Compliance Efficiency": 0.5,
  "BofA Reiterates Buy on Alphabet (GOOGL) as Gemini Gains Traction and KPIs Hold Steady": 0.6,
  "Compared to Estimates, Datadog (DDOG) Q2 Earnings: A Look at Key Metrics": 0.2,
  "Datadog (DDOG) Reports Q2 Earnings: Sales Rise to US$827 Million, Net Income Declines": -0.5,
  "Atlassian (TEAM) Announces Leadership Change, Earnings Rise, & Google Cloud Partnership": 0.6,
  "GoDaddy (GDDY) Reports Revenue Growth and Share Buyback Completion (US$138 Million)": 0.5,
  "Monster Beverage Q2 Earnings Beat, Higher Sales Across Most Segments Aid": 0.8,
  "The Stock Market Is Still Holding on So Far. Big Tech Is Supercharging the Rally.": 0.8,
  "Top Midday Decliners": -0.5,
  "Compared to Estimates, Monster Beverage (MNST) Q2 Earnings: A Look at Key Metrics": 0.2,
  "Why Trade Desk (TTD) Stock Is Plummeting Today": -0.7,
  "Top analyst sends Apple CEO blunt message about its future": -0.5,
  "Tariff fog looms over US auto sector as semiconductor rules remain unclear": -0.5,
  "Intel CEO Has Hard Task, Bokeh's Forrest Says": 0.1,
  "Former Googlers’ AI startup OpenArt now creates ‘brain rot’ videos in just one click": -0.6,
  "Meta, Robby Starbuck Settle AI Defamation Lawsuit": 0.2,
  "Microchip Beats Q2 Estimates but Shares Sink 5% on Tepid Outlook": -0.5,
  "Inflation Data, China Tariff Deadline: What to Watch in the Coming Week": 0.2,
  "CPI report incoming 8/12 Tuesday. Possibility Trump names a new head of BLS during the weekend and tamper the CPI data to his favor? - He did say he will be picking a new guy for BLS this week. High chance it's a puppet who'll do anything Trump will ask. In this case it's reports on inflation. Which, if indeed the report says inflation is high it ruins the chance for rate cut in September": -0.8,
  "Meta Picks Pimco, Blue Owl for $29B Data Center Deal": 0.5,
  "New gold tariffs are in effect. Will Costco gold bars be affected?": 0.0,
  "Equities Rise Intraday as Markets Parse Earnings, Fed Official's Comments": 0.5,
  "Tesla, Palantir, Alphabet Surge as AI Buzz Lifts Tech Giants": 0.8,
  "Intel's new CEO had 3 major problems to tackle. This week Trump added a new one.": -0.5,
  "Should You Buy the 40% Post-Earnings Plunge in The Trade Desk Stock?": 0.2,
  "Advanced Micro Devices, Inc. (AMD): Data Center Revenue May Have Been Disappointing, Says Jim Cramer": -0.5,
  "Discussing Some of the Season's Hottest Earnings Reports": 0.5,
  "Intel Corporation (INTC): I Don’t Know If The Balance Sheet Is Sustainable, Says Jim Cramer": -0.5,
  "3 Unprofitable Stocks with Warning Signs": -0.7,
  "1 Cash-Producing Stock with Exciting Potential and 2 We Turn Down": 0.6,
  "2 Cash-Producing Stocks for Long-Term Investors and 1 We Brush Off": 0.2,
  "Oil Rig Count Rises by 1; Crude Set for Weekly Losses Ahead of Potential Trump-Putin Meeting": -0.5,
  "Honeywell (HON): Buy, Sell, or Hold Post Q2 Earnings?": 0.2,
  "RIP, Microsoft Lens, a simple little app that’s getting replaced by AI": -0.7,
  "Cisco Stock, Monster Hit New Highs And Flash This Signal": 0.6,
  "2 Reasons PANW is Risky and 1 Stock to Buy Instead": -0.5,
  "2 Mega-Cap Stocks with Impressive Fundamentals and 1 Facing Headwinds": 0.5,
  "2 Unpopular Stocks That Should Get More Attention and 1 Facing Headwinds": 0.5,
  "Truck sales in the second quarter might have been the worst performing metric of all": -0.8,
  "3 Market-Beating Stocks with Solid Fundamentals": 0.6,
  "Microsoft Corporation (MSFT)’s Azure Growth Slowdown Would Mean Amazon “Doesn’t Look Stupid,” Says Jim Cramer": 0.2,
  "Final Countdown: San Francisco Set to Host B2B’s Boldest Voices at Marketers Connect": 0.5,
  "Sector Update: Consumer Stocks Advance Late Afternoon": 0.5,
  "Amazon.com, Inc. (AMZN) Needs To Open Its Wallet To NVIDIA, Says Jim Cramer": 0.2,
  "Crowdstrike Is A Better Investment than Palo Alto Networks - **Crowdstrike (CRWD) $422 Palo Alto Networks, (PANW) $168** Given how well other cybersecurity companies have done, PANW has been an under performer, gaining just 10% in the past year, but with a stellar record of a 286% gain in 5, and 481% in 10 years. Currently, the stock remains subdued with the acquisition of CyberArk, and unless there are other catalysts announced on earnings date": 0.2,
  "Equity Markets Rise After Corporate Earnings; Fed's Musalem Sees Labor, Inflation Risks": 0.5,
  "Tesla Disbands Dojo Supercomputer Team": -0.8,
  "Cantor Reiterates Neutral on Rivian (RIVN) Amid Weak Delivery Guidance and Margin Pressure": -0.5,
  "Arista Networks (ANET) Gets $145 Price Target as Meta and Microsoft Boost Capex": 0.5,
  "Figma’s $21 Billion Drop Returns Stock to Earth After IPO Frenzy": -0.5,
  "Despite Strong Q2, Palantir (PLTR) Faces Valuation Doubts from Wall Street": -0.5,
  "Microsoft, Palantir Get Analyst Attention": 0.5,
  "Top Funds Pour More Money Into This Stock Than Into Nvidia, Palantir": 0.5,
  "AMD (AMD) Gains Steam in AI Compute—Analyst Hikes Target to $190": 0.8,
  "Step Aside, Nvidia And Palantir. Top Funds Get Fired Up About This Stock.": 0.5,
  "Trade Desk Stock Plunges On Small Revenue Beat, Rising Amazon Competition": -0.6,
  "Sector Update: Tech Stocks Higher Late Afternoon": 0.5,
  "Alphabet (GOOGL) Needs a Breakup to Unlock Full Value, Says DA Davidson": 0.5,
  "Gilead Surges 8%, Flirting With A Breakout, On Growing Enthusiasm For HIV PrEP": 0.8,
  "S&P 500 Finishes Week Near Highs as Nasdaq Notches Record Close. Wall Street Tuned Out Noise From Washington.": 0.8,
  "Microsoft (MSFT) Gets $650 Target as OpenAI Ties Boost Azure’s AI Lead": 0.6,
  "Meta (META) Downgraded as Growth Is Priced In—But AI Bets Still Impress": 0.2,
  "Tesla Dojo Supercomputer Is No More As Elon Musk Shifts Chips Strategy": -0.6,
  "Amazon (AMZN) Gets $272 Target as OpenAI Models Launch on AWS": 0.5,
  "Apple Stock Retakes Key Level After Dodging Tariff Bullet": 0.6,
  "Nvidia Stock Notches New Record. 2 Reasons for the Rally.": 0.8,
  "US Equity Markets Rise, Nasdaq Climbs to Record After Week Packed With Corporate Earnings": 0.8,
  "How major US stock indexes fared Friday, 8/8/2025": 0.0,
  "Tesla Is Suffering Dojo Brain Drain. Why the Stock Went Up.": 0.2,
  "Capital Compounders for Investors": 0.0,
  "How Apple's 'made-in-America' strategy led to big market gains": 0.8,
  "MP Materials Stock Soars Even Higher on Earnings. The Future Looks Bright, Too.": 0.8,
  "These Stocks Moved the Most Today: Trade Desk, Expedia, SoundHound, Pinterest, Gilead, Peloton, and More": 0.2,
  "Equity Markets Close Higher After Earnings, Fed's Musalem Inflation, Labor Remarks": 0.5,
  "Top Stock Reports for JPMorgan Chase, Chevron & Shopify": 0.5,
  "IBD Stock Of The Day Google Stock Gains Traction Ahead Of Antitrust Remedy Ruling": 0.5,
  "Video game sector: Tariff impacts, GTA 6 release, EA outlook": 0.2,
  "Stock Market Today: Dow Gains, Nasdaq At New High As Apple Rallies; SoundHound Spikes Up On AI Demand": 0.8,
  "S&P 500 Advances on Week Amid Gains in Information Technology, Consumer Discretionary": 0.5,
  "Wedbush Thinks Palantir Is Speeding to $1 Trillion. Should You Buy PLTR Stock Now?": 0.5,
  "S&P 500 Posts Best Week Since June": 0.8,
  "3 No-Brainer Artificial Intelligence (AI) Stocks to Buy Now and Hold Forever": 0.8,
  "The list of major companies laying off staff this year includes Nextdoor, Intel, Scale AI, Morgan Stanley, and more": -0.5,
  "Earnings live: SoundHound AI stock soars, The Trade Desk tanks as Q2 earnings season starts winding down": 0.2,
  "US Equity Indexes Rise This Week as Earnings Beat Consensus While Fed Rate Cut Probability Runs High": 0.8,
  "Stocks to Watch Recap: Apple, Tesla, Firefly, Block": 0.0,
  "The Score: Apple, Palantir, Intel and More Stocks That Defined the Week": 0.5,
  "Analysts think this TSX juggernaut has another 25% upside": 0.8,
  "Gold futures hit record on US tariff shock; mixed day for stocks": 0.2,
  "Is Nvidia Stock Likely to Rally After Aug. 27?": 0.2,
  "Nasdaq Hits Fresh High as Wall Street Posts Best Week Since June": 0.8,
  "After Skyrocketing Over 3,000% in 5 Years, Can MicroStrategy Stock Continue to Rise Higher?": 0.8,
  "S&P 500 Gains and Losses Today: Apple Stock Extends Its Rise; The Trade Desk Craters After Earnings": 0.2,
  "Is Apple Stock a Buy After Appeasing President Trump?": 0.2,
  "Apple's $704 Billion Decade-Long Buybacks Exceed Market Cap Of All But 13 Companies Worldwide": 0.8,
  "Stock Market Week Ahead: Ford's 'Model T' Moment, China Leaders, Aerospace Innovators": 0.5,
  "Nvidia (NVDA) Laps the Stock Market: Here's Why": 0.5,
  "LG Display (LPL) future? - Historically speaking, LG has been at the lowest in 15 years this year. I bought a few hundred shares at $2.46/e that are now in the $4/e~ range I've considered liquidating. That being said I see LG appliances, AC units everywhere these days despite the company not showing profit. And I know Tesla just struck a deal with LG, so there is room for growth. Is this a hold for": 0.5,
  "US licenses Nvidia to export chips to China, official says": 0.5,
  "Meta’s $29 Billion Deal Marks Key Moment for Private Credit": 0.5,
  "CBMJ (Patriot.TV) Stock Rockets: +296.48% Since July 6, +127.49% This Week, and +63.64% Today": 1.0,
  "'If You Want To Bribe Trump, Bring Gold—Not Bitcoin'. An Economist Claims Apple Got Tariff Relief On Semiconductors For Cheap": -0.5,
  "Nasdaq posts record closing high with tech gains, rate cut optimism": 0.8,
  "The Paramount Merger Was a Bad Deal for Old Shareholders. Buying the Stock Is a Good Bet for New Ones.": 0.2,
  "FlyJets CEO On Rising Private Jet Rentals": 0.5,
  "Circle earnings, CPI, comments from Fed's Bostic: What to Watch": 0.1,
  "Compared to Estimates, Diamondback (FANG) Q2 Earnings: A Look at Key Metrics": 0.2,
  "Inflation Is Rising, Growth Is Slowing, Stocks Are Bubbly. What Could Go Wrong?": -0.6,
  "Shorting on a Margin-ed account. Pay any Interest? - So if you place your account in a Margin-able position and you want to Short Sell some equities. Do you pay Interest to Borrow those shares? Sure I know if I borrow money to Buy Long other position I pay Interest, But if you short? curious... Does anyone do this? What do you short?": -0.2,
  "Ad Tech Company Trade Desk Downgraded as Amazon, AI Reshape Digital Market": -0.5,
  "Tesla Robotaxi scores permit to run ride-hailing service in Texas - Tesla has been granted a permit to run a ride-hailing business in Texas, allowing the electric vehicle maker to compete against companies including Uber and Lyft. Tesla Robotaxi LLC is licensed to operate a “transportation network company” until August 6, 2026, according to a listing on the website of the Texas Department of Licensing and Regulation, or TDLR. The permit was issued this week.": 0.6,
  "Spending for Executive Protection Is on the Rise": 0.5,
  "These Were the 5 Biggest Companies in 2010, and Here Are the 5 Biggest Companies Now": 0.0,
  "I Tried To Buy 1,000 Shares Of The Figma IPO...Here's What Happened": 0.1,
  "Trump Administration Issues Licenses for Nvidia Chip Going to China": 0.1,
  "ETFs Show Strongest Inflows of 2025 in July. 2025 is on track to mark a second consecutive year of $1 trillion-plus inflows. - ETF investors ramped up purchases of ETFs in July, adding just under $116 billion to U.S.-listed exchange-traded funds, the biggest monthly total of the year so far. The surge brings year-to-date net inflows to $672.8 billion, translating to an average of $96 billion per month. At that pace, 2025 is on track": 0.8,
  "Question from someone who is considering ULTY - I ask this question in all sincerity. I am looking for investments paying a strong yield. If I bought 100k of ulty on Jan 2 at 9.04 a share, today it would be worth 66, 712 dollars. The weekly distributions would be $29,589. The total would be $96,312. A decline of about 3.5%. Almost any other investment would be better. Why would I choose this investment?": -0.5,
  "Oreos Inside Reese’s. Reese’s Inside Oreos. It’s the Manhattan Project of Snacks.": 0.6,
  "If You Invested $10K In Micron Technology Stock 10 Years Ago, How Much Would You Have Now?": 0.0,
  "Dow Jones Futures: Apple Drives Nasdaq To High; Google, Tesla Flash Buy Signals": 0.8,
  "How are stocks priced to demand? - To clarify my question is basically how much does a stock’s price increase when there’s for example 100 buyers and 99 sellers. Obviously the stock price would go up but by what amount? i’ve looked this up on google but didn’t find any conclusive answer.": -0.2,
  "RDDT - which advertisers are paying $$$ ?? - I made money shorting RDDT after the first record high. Now I want to do it again but their earnings report is stupefying to me. How can they be pulling in that much dough from advertisers? I never even notice ads on here. I can't believe advertisers would pay a lot to RDDT in the apparent belief that redditors are going to turn into big time": -0.2,
  "Wells Fargo Lowers Lululemon (LULU) PT to $225, Cites US, China Concerns": -0.5,
  "Shopify Inc Stock - Shop Inc (NASDAQ: SHOP) skyrocketed 20%+ after earnings a few days ago due to a surprise EPS beat and more importantly, them saying that the Trump tariffs will not have noticeable effects on them. However, it is greatly overvalued, with inflation on the rise due to tariffs and a slowing economy, I believe SHOP is gonna crash hard. It crashed hard in 2021 during post-COVID inflation. SHOP is very sensitive to": -0.6,
  "Will the NFL Bring the Magic Back to Disney Stock?": 0.5,
  "China's Tariffs will be Lowered - I predict that Trump will extend the current China-US pause. This just seems obvious, a 145% tariff on China would be a trade embargo. But the bigger speculation I have is that Trump will lower China's 30% once China makes a \"deal\". I think if China just pledges a crazy large amount of \"investments\", this'll give Trump enough of an ego boost. Trump will then lower China's tariffs and": 0.6,
  "Made a huge mistake investing a lot into ETFs - As a first time investor, I made the mistake of investing 30k at 37 years old into VOO around November 2024. I was DCAing about 5k per month and had hit about 50k before the market crashed in April. Unfortunately, I did not have a lot of cash on the sidelines and I wanted to build an emergency fund, so I did just that. I": -0.6,
  "What Amazon's Latest Earnings Mean for Long-Term Investors": 0.5
}