{
  "Morgan Stanley Raises CSX Price Target Amid Positive Freight Outlook": 0.8,
  "Why Analysts See Biogen’s Story Shifting Toward Undervalued Growth Potential": 0.6,
  "Victoria's Secret and Flower Foods have been highlighted as Zacks Bull and Bear of the Day": 0.2,
  "2 Stock-Split Stocks With Up to 135% Upside in 2026, According to Select Wall Street Analysts": 0.8,
  "US retailers buy up real estate again as market tightens": 0.5,
  "Earnings update: Zoom, Virgin Galactic, Nvidia, Warner Bros Discovery and more": 0.0,
  "Trending tickers: Oracle, Coca-Cola, Adobe, Synopsys and Nextdoor": 0.0,
  "Did Diverging Earnings Forecasts and Zacks Rank Just Shift Texas Instruments' (TXN) Investment Narrative?": 0.1,
  "Cognizant Unveils Artificial Intelligence Lab and Cognizant Moment™ Studio in Bengaluru": 0.5,
  "Automatic Data Processing (NASDAQ:ADP) Is Increasing Its Dividend To $1.70": 0.5,
  "onsemi and FORVIA HELLA Extend Strategic Collaboration with Next-Generation Power Technology": 0.6,
  "Return Trends At Analog Devices (NASDAQ:ADI) Aren't Appealing": -0.6,
  "Roper Technologies (NASDAQ:ROP) investors are sitting on a loss of 19% if they invested a year ago": -0.6,
  "Those who invested in PDD Holdings (NASDAQ:PDD) three years ago are up 32%": 0.5,
  "Investors say Elon Musk's SpaceX trading debut will be 'craziest IPO' ever": 0.8,
  "Woolworths partners DoorDash to extend fast grocery delivery": 0.5,
  "Buy Stocks on the Dip? Here’s a Better Strategy.": 0.1,
  "3 Stocks That May Be Priced Below Their Estimated Value In December 2025": 0.5,
  "High Growth Tech Stocks In The US Market With Potential": 0.8,
  "With 80% ownership of the shares, Palo Alto Networks, Inc. (NASDAQ:PANW) is heavily dominated by institutional owners": 0.2,
  "Calculating The Fair Value Of NXP Semiconductors N.V. (NASDAQ:NXPI)": 0.1,
  "Tempus AI's Strategic Push to Expand Beyond Oncology": 0.5,
  "Trade Desk (TTD): Reassessing Valuation After a Steep Share Price Reset": 0.5,
  "Assessing Lam Research (LRCX) Valuation After a 132% Year-to-Date Surge": 0.5,
  "Is Autodesk Stock Still Attractive Around $300 After Recent Choppy Trading?": 0.2,
  "Stocks Down Pre-Bell as Oracle Results Dampen Fed Rate Cut Rally": -0.5,
  "FCC Approves AT&T Inc. (T) Deal to Buy Wireless Spectrum License": 0.5,
  "Arcellx, Inc. (ACLX) Makes Progress on Multiple Myeloma Treatment": 0.6,
  "Synopsys Stock Gives Back Post-Earnings Gains. Why Timing Is Everything.": -0.5,
  "Xcel Energy to Provide Personalized Energy Services to Customers Using Oracle Platform": 0.5,
  "Amgen Insiders Sell US$15m Of Stock, Possibly Signalling Caution": -0.5,
  "Do Fundamentals Have Any Role To Play In Driving Workday, Inc.'s (NASDAQ:WDAY) Stock Up Recently?": 0.2,
  "Top Utility Stock Portland General Electric Checks All The Boxes": 0.8,
  "Does Take-Two’s 134.7% Three Year Surge Still Leave Room for Further Returns?": 0.2,
  "How Adding Indra Nooyi To The Board At Honeywell International (HON) Has Changed Its Investment Story": 0.5,
  "Palo Alto Networks (PANW) Plays a Role in Safeguarding the Modern Digital Economy. Here’s How": 0.5,
  "Nvidia Loves This AI Stock — And So Does Wall Street": 0.6,
  "Can Intuitive Surgical Weather GLP-1 Drag on Bariatric Surgery?": 0.1,
  "Guidehouse Delivers Workday Transformation for City of Garland": 0.5,
  "Intuit Inc. (INTU) Is a Trending Stock: Facts to Know Before Betting on It": 0.2,
  "Axon Enterprise, Inc (AXON) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Here is What to Know Beyond Why Airbnb, Inc. (ABNB) is a Trending Stock": 0.2,
  "Starbucks Workers Union Says Month-Long Strike Expands to 36 More Stores": 0.5,
  "PTC Arena AI Engine to Transform PLM & QMS With Intelligent Automation": 0.5,
  "Has the Strong 2025 Rally in Ross Stores Already Priced In Future Growth Potential": 0.1,
  "Does TTD Have the Financial Strength to Fuel Its Next Growth Phase?": 0.2,
  "Lam Research Corporation (LRCX) Soars to 52-Week High, Time to Cash Out?": 0.2,
  "Ross Stores, Inc. (ROST) Hit a 52 Week High, Can the Run Continue?": 0.5,
  "Here Are Thursday’s Top Wall Street Analyst Research Calls: American Eagle Outfitters, Ferrari, Intuitive Surgical, Roku, PayPal, Synopsis, Visa, and More": 0.2,
  "How ITRI's AMI Essentials is Driving Tucson's Water Conservation": 0.5,
  "Wall Street Analysts See Ross Stores (ROST) as a Buy: Should You Invest?": 0.5,
  "This Nuclear Play Trades at 61% Premium Despite Earnings Falling 22% This Quarter": -0.6,
  "PayPal downgraded, Roku upgraded: Wall Street's top analyst calls": 0.2,
  "Why Cognizant (CTSH) is a Top Growth Stock for the Long-Term": 0.8,
  "LVT Appoints Three C-Suite Executives to Support Rapid Company Growth": 0.6,
  "Paychex Pays 3.65% and Added $4.2 Billion in Debt but the Dividend Looks Safe": 0.2,
  "ISRG Gets FDA Clearance to Use da Vinci SP Robot for General Surgeries": 0.8,
  "How New Long-Term AI Police Tech Contracts Could Shape Axon Enterprise’s (AXON) Investment Story": 0.5,
  "Is Monster Beverage's Pricing Strategy a Catalyst for Margin Growth?": 0.5,
  "Joachim Kunkel Joins Quadric Board of Directors": 0.5,
  "Thatch and ADP Simplify Small Business Healthcare with Seamless ICHRA Integration via RUN Powered by ADP": 0.5,
  "SkyMirr’s Sky5G Router Achieves Certification on T-Mobile’s Network and T-Priority": 0.5,
  "Fed Rate Cut Fuels Crypto Christmas Rally? XRP Price Forecast: Can it Break the $10 Mark?": 0.5,
  "Why Is Amdocs (DOX) Up 1.3% Since Last Earnings Report?": 0.2,
  "2026 Comeback Picks: 3 S&P Laggards Poised to Break Out": 0.5,
  "FE or AEP: Which Is the Better Value Stock Right Now?": 0.2,
  "Why Nvidia (NVDA) Stock Is Down Today": -0.5,
  "Marvell Stock Ownership At A Discount Obtainable With Cash-Secured Put": 0.2,
  "Datadog Stock Gains 27% in 6 Months: Is it Worth Holding for Now?": 0.5,
  "Top 3 Winter Stocks With Solid Growth Opportunities": 0.6,
  "CleanHaus Launches AI-Agent and Scheduling Tool Designed to Simplify Short-Term Rental Operations": 0.8,
  "/C O R R E C T I O N -- Pillar Biosciences, Inc./": 0.0,
  "It's a 'tale of 2 markets' for chipmakers: Synopsys CEO": 0.2,
  "Mondelēz International Declares Regular Quarterly Dividend of $0.50 per share": 0.5,
  "ComEd Livens Expanded High Voltage Substation at Wilton Center, Built to Enable Largest Cluster of Wind and Solar Projects in Illinois": 0.6,
  "3 Dividend Stocks to Double Up on Right Now": 0.5,
  "This AI Stock Has 45% Upside Potential and No One Is Talking About It Yet": 0.6,
  "Intuit (INTU) Sees Positive Analyst Sentiment Following Strong Fiscal Q1 2026 Results": 0.8,
  "Datadog (DDOG) Sees Bullish Analyst Stance Amid Strong AI and Observability Momentum Despite Recent Stock Pullback": 0.8,
  "Same-Day Delivery Arms Race Escalates as DoorDash, Uber Court Retailers": 0.1,
  "Global Telecom Engineering Announces Successful 2025 Certification of TITAN5000, TITAN5100, and TITAN5400 Across All Major U.S. Carriers": 0.8,
  "MercadoLibre (MELI) Stock Is Up, What You Need To Know": 0.5,
  "The Quantum Fleet: Investing in the New Quantum Standard": 0.5,
  "Sector Update: Consumer Stocks Rise Late Afternoon": 0.5,
  "Fastenal Joins Red Cross Disaster Responder Program": 0.5,
  "How the Narrative Surrounding Intuit Is Changing After the OpenAI Deal and Credit Karma Momentum": 0.5,
  "Himax, Intel, Marvell Technology, Allegro MicroSystems, and IPG Photonics Stocks Trade Down, What You Need To Know": -0.5,
  "Beyond the Magnificent 7: Meet 3 of Tech’s Rising Stars": 0.5,
  "Todd M. Schneider joins PPG board of directors": 0.2,
  "Reddit’s Top AI Stocks: Why Traders Are Backing IBM and ASML Over other AI Plays": 0.5,
  "Homes.com Report: National home price appreciation strengthens in November": 0.6,
  "Synopsys CEO on Earnings, Nvidia Investment": 0.0,
  "Broadcom, Oracle, Adobe: AI-Related Earnings in Spotlight": 0.5,
  "Is Axon Enterprise Still Attractive After Its Huge Multi Year Share Price Surge?": 0.2,
  "Lululemon (LULU) Tops Q3 Earnings and Revenue Estimates": 0.8,
  "Broadcom Inc. (AVGO) Beats Q4 Earnings and Revenue Estimates": 0.8,
  "Leading Multiple Myeloma Results Unveiled at ASH 2025: Paradigm-Shifting Data Redefines Treatment Landscape | DelveInsight": 0.5,
  "Highlights from Fortune Brainstorm AI San Francisco": 0.0,
  "The Chip Boom Is Back: 3 Stocks Positioned for Huge Gains": 0.8,
  "Tech stocks tumble amid renewed AI worries on Wall Street": -0.6,
  "2 Cheap Tech Stocks to Buy Right Now": 0.5,
  "3 Recently Downgraded Stocks to Avoid in 2026": -0.5,
  "FDA APPROVES UPLIZNA® FOR ADULTS WITH GENERALIZED MYASTHENIA GRAVIS": 1.0,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (c) Kevin D. Baney, 55, will be promoted to President of the Company effective January 1, 2026. Mr. Baney has served as the Company’s Executive Vice President since January 2025. He has worked at the Company for 31 years and has held positions of increasing responsibility throughout PACCAR, including as Senior Vice President and as Vice President\n\n(Item 8.01) . Other Events John N. Rich will be promoted to Executive Vice President and Chief Technology Officer effective January 1, 2026. Mr. Rich has served as the Company’s Senior Vice President and Chief Technology Officer since January 2024 and as Vice President and Chief Technology Officer from 2021 through 2023. Previously, he worked for 30 years at Ford Motor Company in positions of increasing responsibility, including Director of Autonomous Vehicles and Technology and Executive Director": 0.5,
  "(Item 8.01) Other Events. On December 12, 2025, Marvell Technology, Inc. (the “Company”) announced that its Board of Directors had declared the payment of its quarterly dividend of $0.06 per share to be paid on January 29, 2026 to all stockholders of record as of January 9, 2026. A copy of the press release is furnished herewith as Exhibit 99.1 and is incorporated by reference herein. The payment of future quarterly cash dividends is subject to, among": 0.2,
  "(ITEM 5.02) DEPARTURE OF DIRECTORS OR CERTAIN OFFICERS; ELECTION OF DIRECTORS; APPOINTMENT OF CERTAIN OFFICERS; COMPENSATORY ARRANGEMENTS OF CERTAIN OFFICERS. On December 11, 2025, David C. Merritt, a director of Charter Communications, Inc. (the “Company”), informed the Board of Directors (the “Board”) of his intention to retire from the Board, effective January 26, 2026. Mr. Merritt’s resignation as a director is not the result of any dispute or disagreement with the Company on any matter relating to": -0.5,
  "(Item 8.01) Other Events. As previously disclosed, on July 17, 2025, the parties to the stockholder derivative action in the Delaware Court of Chancery, captioned In re Facebook Inc. Derivative Litigation , Consolidated C.A. 2018-0307-KSJM (Del. Ch.) (the \"Matter\"), agreed to a settlement in principle to resolve all claims in the Matter, which is subject to court approval. On December 5, 2025, the Court of Chancery entered a Scheduling Order pursuant to which a settlement hearing will": 0.1,
  "Trump Warner Bros. Meddling Pushes Limits of Executive Power": -0.5,
  "Why Analysts Think Qualcomm’s Story Is Shifting With New AI Deals And Mixed Wall Street Targets": 0.2,
  "Cities of Stories: Agoda's Guide to Asia's Architectural and Cultural Marvels": 0.8,
  "Bank of America makes a surprise call on Nvidia backed stock": 0.5,
  "Spotting Winners: Mondelez (NASDAQ:MDLZ) And Shelf-Stable Food Stocks In Q3": 0.5,
  "3 Growth Stocks to Stash": 0.0,
  "1 Volatile Stock Worth Your Attention and 2 We Avoid": 0.2,
  "1 S&P 500 Stock to Target This Week and 2 We Brush Off": 0.2,
  "3 Large-Cap Stocks That Fall Short": -0.5,
  "1 S&P 500 Stock to Target This Week and 2 We Question": 0.2,
  "3 Low-Volatility Stocks with Questionable Fundamentals": -0.5,
  "1 of Wall Street’s Favorite Stock Worth Investigating and 2 We Find Risky": 0.5,
  "3 Market-Beating Stocks for Long-Term Investors": 0.5,
  "A Look at Take-Two Interactive (TTWO) Valuation After a Strong Run and Recent Share Price Pullback": 0.2,
  "How Investors Are Reacting To CSX (CSX) Early Network Upgrades And Efficiency Push": 0.2,
  "3 Brilliant Growth Stocks to Buy Now and Hold for the Long Term": 0.8,
  "Agoda Earns 2025 Great Place To Work Certification™": 0.8,
  "2 Brilliant Growth Stocks to Buy Before They Soar 75% and 150% in 2026, According to Certain Wall Street Analysts": 0.8,
  "Siemens and GF partner on AI-driven semiconductor manufacture": 0.5,
  "Building Information Market to Soar from $9.03B in 2025 to $15.42B by 2030, Driven by Digital Transformation": 0.8,
  "Analysts flag risks for Strategy at Nasdaq 100 index reshuffle": -0.5,
  "What Xcel Energy Inc.'s (NASDAQ:XEL) ROE Can Tell Us": 0.1,
  "Are Strong Financial Prospects The Force That Is Driving The Momentum In Cadence Design Systems, Inc.'s NASDAQ:CDNS) Stock?": 0.5,
  "Did Atlassian’s AWS Marketplace Push and AI Tie‑Up Just Shift TEAM’s Investment Narrative?": 0.2,
  "Bull of the Day: Monster Beverage (MNST)": 0.5,
  "The Zacks Analyst Blog Highlights ICICI Bank, Taiwan Semiconductor, MercadoLibre and NVIDIA": 0.5,
  "The Zacks Analyst Blog Highlights Caterpillar, Shopify, Qualcomm, Waterstone Financial and Tucows": 0.5,
  "Tech Wariness Undercuts Wall Street Pre-Bell; Asia, Europe Up": 0.2,
  "Krystal Biotech And 2 Other Growth Stocks Insiders Are Betting On": 0.5,
  "Arcus cancels work on Gilead-partnered cancer combo after trial setback": -0.6,
  "ARM Stock Just Broke Below This Key Support Level. Should You Buy the Dip or Stay Away?": -0.5,
  "Keurig Dr Pepper's (NASDAQ:KDP) earnings trajectory could turn positive as the stock advances 3.1% this past week": 0.6,
  "YouTube Now Allows U.S. Content Creators to Get Paid in PayPal’s Stablecoin: Fortune": 0.5,
  "Is Electronic Arts (EA) Still Fairly Valued After Its Recent Share Price Rally?": 0.2,
  "The Weekly Closeout: Consumers lean on BNPL and Walmart gets excited about Anthropologie": 0.5,
  "Applied Materials Announces Cash Dividend": 0.5,
  "AstraZeneca (AZN) At the Center of Serious Analyst Attention": 0.5,
  "ASML Holding (ASML)’s Sales to China Discussed in Report as Firm Asserts Compliance With Export Laws": 0.2,
  "Texas Instruments (TXN) Fell Due to the Persistent Doubt Around Tariffs": -0.5,
  "2 AI Nuclear Energy Stocks to Buy Now Before they Soar like GEV": 0.5,
  "Is Old Dominion Freight Line, Inc.'s (NASDAQ:ODFL) Stock's Recent Performance Being Led By Its Attractive Financial Prospects?": 0.5,
  "Should Siemens AI Push Into GlobalFoundries Fabs Reshape Its Automation Story For (XTRA:SIE) Investors?": 0.2,
  "Will Intuit (INTU) Benefit from AI?": 0.5,
  "Here's How AMGN Benefits From FDA Nod to Uplizna in Myasthenia Gravis": 0.5,
  "Here's How Much a $1000 Investment in Lam Research Made 10 Years Ago Would Be Worth Today": 0.5,
  "Here's How Much You'd Have If You Invested $1000 in Atlassian a Decade Ago": 0.5,
  "Is the Options Market Predicting a Spike in Fortinet Stock?": 0.2,
  "Constellation Wins Platts Global Energy Award for Crane Clean Energy Center Restart": 0.6,
  "Morgan Stanley Keeps An Equal Weight Rating On KLA Corporation (KLAC)": 0.0,
  "Citi Analyst Is Bullish On ASML Holding N.V. (ASML)": 0.6,
  "Bernstein Analyst Reaffirms Buy Rating On Lam Research Corporation (LRCX)": 0.6,
  "Exchange-Traded Funds Lower, Equity Futures Mixed Pre-Bell Friday as Broadcom Results Deepen Fears": -0.5,
  "Here is What to Know Beyond Why Zscaler, Inc. (ZS) is a Trending Stock": 0.2,
  "Is Most-Watched Stock Intuitive Surgical, Inc. (ISRG) Worth Betting on Now?": 0.2,
  "Investors Heavily Search Vertex Pharmaceuticals Incorporated (VRTX): Here is What You Need to Know": 0.5,
  "Applied Materials, Inc. (AMAT) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Oracle Fallout Keeps Tech Sector Under Strain as US Equity Futures Trade Mixed Pre-Bell": 0.0,
  "Monster Beverage and Bassett Furniture have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Janus Henderson Forty Fund Sold Marvell Technology (MRVL) Due to Lack of Earnings Visibility": -0.5,
  "Strength in Technology Enabled Products Drives Roper: Can It Sustain?": 0.6,
  "How Fast Shifting Analyst Views Are Reshaping Fastenal’s Valuation Story": 0.5,
  "His Former Employer Ran A Shopify Store Under His Social Security Number. Now, The IRS Says He Owes $180K, And Dave Ramsey Goes Ballistic": -0.6,
  "MercadoLibre (MELI) Fell in Q3 Due to Competition Concerns": -0.6,
  "Is Workday Stock Underperforming the Nasdaq?": -0.5,
  "Regeneron (REGN) Just Flashed Golden Cross Signal: Do You Buy?": 0.2,
  "Are You a Value Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "CrowdStrike Stock Rises 51% YTD: Time to Hold or Book Profits?": 0.5,
  "Does Marvell (MRVL) Have the Potential to Rally 28.26% as Wall Street Analysts Expect?": 0.5,
  "TJX Stock Up 30% in 2025: What's the Smart Move for 2026?": 0.5,
  "What these 4 founders did differently to stand out in the crowded protein market": 0.5,
  "My Top-10 Portfolio Holdings for 2026": 0.0,
  "ASML Earns “Top Pick” Status From BofA, Citi Reaffirms Buy Rating": 0.8,
  "Stifel Sees Marvell (MRVL) Well Positioned Across the AI Data-Center Stack": 0.8,
  "GlobalFoundries interim CFO takes permanent seat": 0.5,
  "Tracking the Changing Narrative for CDW After Mixed Results and Macro Headwinds": 0.1,
  "Kymera's Eczema Drug Gets Fast Track Designation in the United States": 0.5,
  "Synopsys Q4 Earnings Surpass Estimates, Revenues Rise Y/Y": 0.8,
  "Qualcomm Just Got Called an AI Loser—So Why Is It Rallying?": 0.2,
  "Should Investors Hold Old Dominion Stock Despite Its Higher Valuation?": 0.2,
  "APP Stock Surges 89% in 6 Months: Hold for a Pullback or Buy?": 0.5,
  "Assessing Keurig Dr Pepper’s Valuation After Recent Share Price Rebound in 2025": 0.5,
  "SOXS May Pay a 20% Dividend, But It Lost 87% Betting Against Nvidia | SOXS NVDA Pays a 20% Dividend, But lost 87% ofBet Against NVIDIA, and Lost 87%": -0.6,
  "Oracle denies report on OpenAI data center delays": 0.1,
  "Inside ASML's $430 Billion AI Monopoly: The Chipmaker Even Nvidia Can't Live Without": 0.8,
  "CIB vs. HON: Which Stock Is the Better Value Option?": 0.0,
  "DoorDash E-Commerce Growth Picks Up: A Sign for More Upside?": 0.6,
  "Ross Stores (ROST) Is Up 0.86% in One Week: What You Should Know": 0.6,
  "Save the Date: 2nd Princeton CorpGov Forum with Economics Department May 21, 2026": 0.0,
  "Will Cintas (CTAS) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "T-Mobile quietly makes drastic decision after losing customers": -0.6,
  "Insiders Favor These 3 Prominent Growth Companies": 0.5,
  "QCOM Expands Into AI Video Intelligence Market: Will it Drive Growth?": 0.5,
  "How Marriott Is Sharpening Luxury Strategy and Gearing Up for W Hotel Debut in Saudi Arabia": 0.5,
  "2 Healthcare Stocks to Buy Ahead of the New Year": 0.5,
  "Is GE HealthCare Still Attractive After Its Recent Share Price Climb and AI Momentum?": 0.2,
  "Constellation Energy (CEG): Is the Clean Power Leader Still Undervalued After Its Strong Multi‑Year Share Price Run?": 0.5,
  "Weighing Atlassian’s 2024 Slide Against Cloud Growth and AI Expansion Prospects": 0.2,
  "US Drillers Add Oil Rigs As Analysts Warn of Incoming Glut": -0.6,
  "Kellanova Stock Is No More. Should Consumer Packaged Goods Fans Buy Shares of This Blue-Chip Stock Instead?": 0.2,
  "Fermi Stock Heads for Worst Day on Record as AI-Energy Company Loses Funding Commitment From First Major Tenant": -0.8,
  "ASML Is the Silent Monopoly Behind the Entire Tech Industry, but Is It a Buy Right Now?": 0.2,
  "Oil Rig Count Rises by 1; Crude Set for Weekly Drop Amid Oversupply Concerns": -0.6,
  "Rosenblatt Remains Cautious on Workday (WDAY) Amid Market Saturation and Intensifying Competition": -0.6,
  "CrowdStrike Stock Can't Catch a Break—Even After a Blowout Quarter": -0.6,
  "Marvell Technology, Inc. Declares Quarterly Dividend Payment": 0.0,
  "Why Arcus Biosciences Just Reversed Its 287% Eight-Month Winning Streak": -0.5,
  "Why Zscaler Stock Could Be Ready to Bounce After a 30% Selloff": 0.5,
  "S&P 500 Posts Weekly Decline, Led by Communication Services, Tech": -0.5,
  "This GE Spinoff Is Beating the S&P 500, Nvidia—and Bitcoin. Here’s How.": 0.5,
  "Rumble, Crane NXT, Arlo Technologies, CDW, and Insight Enterprises Shares Are Falling, What You Need To Know": -0.5,
  "Staley Capital Advisers Dumps 59,000 Shares of Mercury Systems": -0.5,
  "ASML (ASML) Dips More Than Broader Market: What You Should Know": -0.2,
  "PepsiCo (PEP) Ascends While Market Falls: Some Facts to Note": 0.5,
  "Why Lam Research (LRCX) Dipped More Than Broader Market Today": -0.5,
  "Qualcomm (QCOM) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "What to Watch With PepsiCo (PEP) Stock in 2026": 0.1,
  "Here's Why Paccar (PCAR) Fell More Than Broader Market": -0.5,
  "Synopsys Sees Bullish Shift as Ansys Integration Drives Growth": 0.8,
  "My 3 Favorite Stocks to Buy Right Now": 0.0,
  "A comprehensive list of 2025 tech layoffs": -0.5,
  "Basin rig count down two as prices fall": -0.6,
  "Bitcoin hoarding company Strategy remains in Nasdaq 100": 0.2,
  "Costco issues urgent recall on nuts": -0.7,
  "The Motley Fool Interviews MercadoLibre Senior Vice President Leandro Cuccioli": 0.5,
  "Wedbush Cuts The Trade Desk, Inc. (TTD)’s Price Target To $40, Keeps Neutral Rating": -0.5,
  "Analysts See 25% Upside To Copart, Inc. (CPRT) Despite Cautious View": 0.5,
  "Verisk Analytics, Inc. (VRSK) a Moderate Buy, Per Wall Street Consensus": 0.5,
  "Lululemon Stock Surges on CEO Shift. Why Investors Are Cheering the Change.": 0.8,
  "Charter Communications Insiders Placed Bullish Bets Worth US$1.10m": 0.6,
  "Lululemon Stock Is a Buy After CEO Exit": 0.6,
  "4 Signs Your Startup Is Fundable, According To Top Investors": 0.5,
  "MarketBeat Week in Review – 12/8 - 12/12": 0.0,
  "Is There An Opportunity With Baker Hughes Company's (NASDAQ:BKR) 33% Undervaluation?": 0.5,
  "Lululemon (LULU) Soars 9.6% on Upbeat Outlook, Leadership Reshuffle": 0.8,
  "The total return for T-Mobile US (NASDAQ:TMUS) investors has risen faster than earnings growth over the last five years": 0.6,
  "Here's Why We Think Exelon (NASDAQ:EXC) Is Well Worth Watching": 0.6,
  "Is It Too Late to Consider CrowdStrike After Its Huge Multi Year Share Price Surge": 0.2,
  "We Think That There Are Issues Underlying Marvell Technology's (NASDAQ:MRVL) Earnings": -0.5,
  "This Could Be One of the Best Gen AI Stocks to Buy for 2026, According to Wall Street": 0.8,
  "3 Growth Stocks to Buy and Hold Forever": 0.5,
  "Is Now the Moment to Reassess Trade Desk After a 69% Slide in 2025?": -0.6,
  "How Investors Are Reacting To Vertex Pharmaceuticals (VRTX) Pediatric CASGEVY Data And Accelerated FDA Review": 0.2,
  "2 Reasons to Buy Regeneron Stock Like There's No Tomorrow": 0.8,
  "Jim Cramer on Marriott: “Love This Stock”": 0.8,
  "Jim Cramer on Airbnb: “I Don’t Feel Like Sticking My Neck Out at This Very Moment”": -0.5,
  "Jim Cramer Calls Booking Holdings the “Superior Operator” Compared to Expedia": 0.8,
  "Jim Cramer Notes “Expedia’s the Cheaper Stock” Compared to Booking": 0.5,
  "Jim Cramer Says “I Like Old Dominion”": 0.6,
  "Jim Cramer on DexCom: “It’s Too Rich a Stock”": -0.5,
  "Jim Cramer on MercadoLibre: “That is Such a Good Company”": 0.8,
  "Jim Cramer on Cisco: “This Company’s at the Heart of the AI Revolution”": 0.6,
  "Author David Bach reveals how you become a millionaire": 0.5,
  "How Recent Shifts in AI and Demand Are Rewriting the Story for Cognizant": 0.5,
  "Private Markets: Musk’s SpaceX targets 2026 IPO at valuation of $1.5T": 0.8,
  "Jim Cramer on Dow Inc.: “It Could Have Another Point or Two, But That’s All”": 0.2,
  "JPMorgan Says This 1 Chip Stock Is a Strong Buy Now... And It’s Not What You Think It Is": 0.6,
  "Should Cisco’s Expanding AI Data Center Role and ESOP Issuance Require Action From Cisco Systems (CSCO) Investors?": 0.1,
  "Is Earlier Yescarta Use in Lymphoma Altering The Investment Case For Gilead Sciences (GILD)?": 0.1,
  "Airbnb (ABNB): Is the Travel Platform Still Undervalued After Its Recent Share Price Rebound?": 0.2,
  "Is Vertex Pharmaceuticals Fairly Priced After Recent Gains and Expanding Pipeline in 2025?": 0.2,
  "Food delivery app accused of secretly manipulating prices": -0.8,
  "Cisco Systems, Inc. (CSCO) Shares Hit a record high For The First Time In Over 25 Years, Bloomberg Reports": 0.8,
  "Is There Still Value in Palo Alto Networks After Its Strong Multi Year Rally?": 0.2,
  "Should NVIDIA’s US$2 Billion AI Partnership And Synopsys’ Strong Q4 Results Require Action From Synopsys (SNPS) Investors?": 0.2,
  "Here’s How MercadoLibre Gets to $3,000 Per Share in 2026": 0.5,
  "AI data center boom could be bad news for other infrastructure projects": -0.6,
  "My Top 3 Healthcare Stocks to Buy in 2026": 0.0,
  "A Once-in-a-Decade Investment Opportunity: 1 Vanguard Index Fund to Buy for the AI Boom": 0.8,
  "ASML (ENXTAM:ASML) Valuation Check After Strong 90-Day Share Price Rally": 0.5,
  "Is Mondelez a Long Term Opportunity After Recent Share Price Weakness?": 0.5,
  "Weekly Stock Market News: FED rate, natural gas, Lululemon, Oracle, Broadcom": 0.0,
  "The Publicity War Between AT&T and T-Mobile Is Getting Ugly": -0.6,
  "lululemon athletica (LULU) Is Up 7.9% After Raised 2025 Outlook, Bigger Buyback, CEO Transition – Has The Bull Case Changed?": 0.6,
  "The Eerie Parallels Between AI Mania and the Dot-Com Bubble": -0.5,
  "MercadoLibre (MELI) to Use Digit Robots in Texas Warehouse": 0.5,
  "Analysts Stay Bullish on Intuit (INTU) After Strong Q1 Results": 0.8,
  "Citizens Keeps Market Outperform on Shopify (SHOP) After Winter ’26 Edition": 0.5,
  "Will Adding Cintas CEO Todd Schneider to the Board Shift PPG Industries' (PPG) Governance Priorities?": 0.1,
  "ON Semiconductor (ON): Reassessing Valuation After a 17% One-Month Share Price Rebound": 0.5,
  "Will Leadership Shuffle And Special Dividend Shift PACCAR's (PCAR) Capital Allocation Narrative?": 0.2,
  "Does Forbes ‘Best Companies’ Nod Really Strengthen Cintas’ Culture-Driven Edge for Investors (CTAS)?": 0.1,
  "Kymera Had a Big Week. This Secretive Hedge Fund Bought $172 Million of Its Stock.": 0.8,
  "3 S&P 500 Stocks That Could Soar 49% or More in 2026, According to Wall Street": 0.6,
  "Does Monster Beverage (NASDAQ:MNST) Deserve A Spot On Your Watchlist?": 0.2,
  "Assessing ASML After Its 54% YTD Surge and Ongoing AI Lithography Optimism": 0.5,
  "Trump's Fed pick comes into focus, economic data backlog clears: What to watch this week": 0.2,
  "Should You Buy Shares of Intuitive Surgical in December?": 0.2,
  "Amgen's (NASDAQ:AMGN) Shareholders Will Receive A Bigger Dividend Than Last Year": 0.8,
  "One Applied Materials Insider Raised Their Stake In The Previous Year": 0.2,
  "Possible Bearish Signals With IDEXX Laboratories Insiders Disposing Stock": -0.6,
  "Marvell’s (MRVL) Stock Pops After Q3 Earnings – Time to Buy?": 0.5,
  "The Nvidia Blackwell vs. Google TPU Battle Explained – AI’s Biggest 2026 Showdown": 0.5,
  "Nasdaq Slides as Broadcom Forecasts Shake AI Trade": -0.5,
  "Forget the 2.8% Social Security Increase. These Aristocrats Pay You 4% to 7% More Annually": 0.5,
  "Corporate America is scrambling to hire energy traders as the AI boom pressures electricity costs": 0.2,
  "DC judge delivers smackdown to Airbnb squatter after ruling she has no tenancy. Homeowner rights finally defended?": 0.6,
  "Bank of America Calls Synopsys (SNPS) a Lower-Beta AI Play With Catch-Up Potential": 0.5,
  "AppLovin (APP) Positioned for Ad Growth Beyond Gaming, Says Jefferies": 0.5,
  "2 Dividend Stocks to Double Up on Right Now": 0.5,
  "(Item 1.01) Entry into a Material Definitive Agreement. On December 12, 2025, GE HealthCare Technologies Inc. (the “Company”) entered into a three-year senior unsecured term loan credit facility (the “Term Loan Credit Agreement”) among the Company, JPMorgan Chase Bank, N.A., as administrative agent, and the lenders named therein. Pursuant to the Term Loan Credit Agreement, the lenders thereunder have committed to make an unsecured term loan in an aggregate amount of $750 million (the “Term Loan”), which\n\n(Item 1.01) of this Current Report on Form 8-K is incorporated by reference into this\n\n(Item 8.01) Other Events. On December 15, 2025, the Company issued $600,000,000 aggregate principal amount of 4.150% Senior Notes due December 15, 2028 (the “2028 Notes”) and $650,000,000 aggregate principal amount of 4.950% Senior Notes due December 15, 2035 (the “2035 Notes” and, together with the 2028 Notes, the “Notes”) pursuant to its effective shelf registration statement on Form S-3 (File No. 333-280584). The Company intends to use the net proceeds from the offering of the Notes,": 0.1,
  "(Item 8.01) . Other Events. On December 15, 2025, Xcel Energy Inc., a Minnesota corporation (“Xcel Energy”), issued a press release announcing the commencement of three separate offers (the “Offers”) to purchase for cash up to $345,000,000 aggregate principal amount of certain outstanding first mortgage bonds issued by Northern States Power Company, a Minnesota corporation and a wholly owned subsidiary of Xcel Energy. The Offers are being made pursuant to, and are subject to the satisfaction or": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On December 15, 2025, PepsiCo, Inc. announced that Steven Williams, Chief Executive Officer, North America, will transition to the role of Executive Vice President & Vice Chairman, Global Chief Commercial Officer & Corporate Affairs, effective December 28, 2025.": -0.2,
  "(Item 8.01) Other Events. ATM Update On December 15, 2025, Strategy Inc (\"Strategy\") announced an update with respect to sales made under its at-the-market offering program (\"ATM\") of the following securities: During Period December 8, 2025 to December 14, 2025 As of December 14, 2025 Security Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) STRF Stock 163,306 $ 16.3 $ 18.0 $ 1,619.3 10.00% Series A": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Appointment of Chief Accounting Officer On December 12, 2025, the Board of Directors of Advanced Micro Devices, Inc. (\"AMD\") appointed Emily Ellis, 43, as AMD’s Corporate Vice President, Chief Accounting Officer and principal accounting officer effective as of December 15, 2025. Mrs. Ellis previously served as Vice President Controller at Palo Alto Networks, Inc. since March 2024.": 0.2,
  "(Item 8.01) Other Events. As previously disclosed, on September 28, 2025, Electronic Arts Inc. (“ Electronic Arts ” or the “ Company ”) entered into an Agreement and Plan of Merger (the “ Merger Agreement ”) by and among the Company, Oak-Eagle AcquireCo, Inc., a Delaware corporation (“ Parent ”), and Oak-Eagle MergerCo, Inc., a Delaware corporation and wholly owned subsidiary of Parent (“ Merger Sub ”), pursuant to and subject to the terms and conditions of": 0.1,
  "Expanded AI Alliances With OpenAI and Others Could Be A Game Changer For Accenture (ACN)": 0.5,
  "How New Deals and Diverging Analyst Views Are Rewriting the Story for AstraZeneca": 0.5,
  "How the Narrative Surrounding Ross Stores Is Shifting After Strong Q3 and Higher Targets": 0.6,
  "What is your exit strategy for $NVDA? - I know a lot of people see NVDA as a “never sell” kind of stock, especially with how strong it’s been the past few years. It’s obviously been a big winner for many, and it feels like it still has room to run with AI and data center demand. But I’m curious, at what point do you actually take some profit or rotate into something else? Maybe": 0.2,
  "Q3 Earnings Highlights: Paychex (NASDAQ:PAYX) Vs The Rest Of The HR Software Stocks": 0.2,
  "Beverages, Alcohol, and Tobacco Stocks Q3 Highlights: PepsiCo (NASDAQ:PEP)": 0.2,
  "CrowdStrike (CRWD): 3 Reasons We Love This Stock": 0.6,
  "3 Reasons to Avoid ON and 1 Stock to Buy Instead": -0.5,
  "Can Anaergia’s (TSX:ANRG) PepsiCo Biomethane Deal Redefine Its Waste-to-Energy Investment Narrative?": 0.5,
  "How The Pending Palo Alto Deal Is Rewriting The Story Behind CyberArk Software’s Valuation": 0.5,
  "1 Software Stock to Own for Decades and 2 We Question": 0.0,
  "2 Growth Stocks to Stash and 1 We Find Risky": 0.2,
  "1 Dow Jones Stock Worth Your Attention and 2 We Brush Off": 0.2,
  "3 Internet Stocks to Keep an Eye On": 0.0,
  "3 Mid-Cap Stocks We Find Risky": -0.7,
  "1 Semiconductor Stock for Long-Term Investors and 2 That Underwhelm": -0.5,
  "1 Nasdaq 100 Stock with Exciting Potential and 2 We Question": 0.5,
  "1 Profitable Stock to Target This Week and 2 Facing Challenges": 0.2,
  "2 Safe-and-Steady Stocks to Consider Right Now and 1 Facing Headwinds": 0.2,
  "3 Volatile Stocks That Fall Short": -0.6,
  "2 Profitable Stocks Worth Investigating and 1 We Avoid": 0.0,
  "1 Cash-Producing Stock to Target This Week and 2 Facing Challenges": 0.2,
  "2 Cash-Producing Stocks to Consider Right Now and 1 Facing Headwinds": 0.2,
  "Festive Fares: Agoda Reveals Asia's Most Affordable Year-End Flight Routes for Holiday Travelers": 0.8,
  "Heard on the Street Friday Recap: Tech Fears Are Back": -0.5,
  "Warner Bros., Oracle, Campbell’s, Lululemon: Stocks That Defined Last Week": 0.5,
  "Wall Street's 2026 Outlook and 4 Brilliant Stocks to Buy With $2,500 Right Now": 0.5,
  "Arm China, AI start-up RabbitPre among mainland Chinese tech firms expanding in Hong Kong": 0.5,
  "The Forever Portfolio: 3 Stocks to Buy in 2026 and Hold Forever": 0.5,
  "Cisco CFO highlights rival’s integration as M&A lesson: Trial Balance": 0.1,
  "Zacks Market Edge Highlights: NVIDIA, Newmont, Atlassian, Genpact and Zoom Communications": 0.2,
  "Zacks Investment Ideas feature highlights: GE Vernova, Constellation Energy, Nvidia, NextEra and Meta": 0.5,
  "Is It Time To Consider Buying Analog Devices, Inc. (NASDAQ:ADI)?": 0.2,
  "Returns On Capital At Roper Technologies (NASDAQ:ROP) Have Stalled": -0.5,
  "ServiceNow's $7 Billion Power Move: The Cyber Deal That Could Rewrite Its Future": 0.8,
  "US Equity Investors to Focus on Labor, Inflation Data This Week Alongside Micron Technology's Results": 0.2,
  "AvePoint Leads These 3 High Growth Stocks Backed By Insiders": 0.5,
  "3 High Growth Tech Stocks To Watch In The US Market": 0.5,
  "These 3 stocks are 'potential AI losers into 2026': Wedbush": -0.5,
  "Opendoor Names President and CFO to Accelerate Next Chapter": 0.5,
  "Soverli Raises $2.6M Pre-Seed to Bring Secure and Convenient Digital Freedom to Every Smartphone": 0.8,
  "Estimating The Intrinsic Value Of Honeywell International Inc. (NASDAQ:HON)": 0.1,
  "Texas Instruments (NASDAQ:TXN) shareholders have earned a 4.9% CAGR over the last five years": 0.6,
  "Workday (NASDAQ:WDAY) Might Have The Makings Of A Multi-Bagger": 0.8,
  "200% Surge? These 6 Stocks Just Crashed the Nasdaq 100 Party": -0.6,
  "Suppliers look to leverage EIS tech for EV battery management": 0.5,
  "Regeneron (REGN) Is Up 5.4% After New Myeloma Data And Gene Writing Tie-Up With Tessera": 0.6,
  "Stocks Rise Pre-Bell as Traders Await Key Inflation, Labor Data": 0.5,
  "Why BofA are buyers of weakness in this sector": 0.5,
  "JPMorgan Chase Just Recommended Buying PepsiCo in 2026. Here Are the Tailwinds Buoying the Stock.": 0.6,
  "The Best Dividend Stocks for Retirement Portfolios in 2026": 0.5,
  "Opendoor sticks with insider for CFO, hires Coinbase vet for president": 0.5,
  "KeyBanc downgrades Adobe and ServiceNow on AI risks": -0.5,
  "ASML reports transactions under its current share buyback program": 0.0,
  "Temu Expands Marketplace Access for Small Businesses with New App for Shopify Merchants": 0.6,
  "Matan Companies Signs 161,500 SF Lease with MCPS at 750 Progress Way in Gaithersburg, MD": 0.2,
  "The New York Stock Exchange Leads with Seven of the 10 Largest IPOs in 2025, Paves Way for Digital Currency Public Market Debuts": 0.8,
  "Boasting A 20% Return On Equity, Is NXP Semiconductors N.V. (NASDAQ:NXPI) A Top Quality Stock?": 0.5,
  "Is Lululemon Back? What's Driving the Stock's Strong Gains This Month?": 0.5,
  "TimesSquare U.S. Focus Growth Strategy Sold CrowdStrike Holdings (CRWD) Due to Market Cap Considerations": 0.1,
  "Verisk Analytics (VRSK) Surged Following Better Than Expected Results": 0.8,
  "Employment, Industry Pricing, And Costing Challenges Hit Cintas Corp (CTAS) in Q3": -0.5,
  "ASML Holding Stock Trades Near 52-Week High: Is It Still Worth Buying?": 0.5,
  "CrowdStrike Announces the General Availability of Falcon AI Detection and Response to Secure the New AI Attack Surface": 0.5,
  "Build a Stronger 2026 Portfolio With These 5 Dividend Aristocrats": 0.5,
  "AI-Fueled Demand to Boost Micron Technology's DRAM Revenues in Q1": 0.8,
  "Positive Momentum Lifted O’Reilly Automotive (ORLY) in Q3": 0.8,
  "Gilead’s Investigational Single-Tablet Regimen of Bictegravir and Lenacapavir for HIV Treatment Meets Primary Endpoint in Phase 3 ARTISTRY-2 Trial": 0.8,
  "Here's How Much a $1000 Investment in Analog Devices Made 10 Years Ago Would Be Worth Today": 0.5,
  "Nvidia and AMD Brace for Surging AI Demand in 2026": 0.5,
  "Goldman Sachs double-downgrades Texas Instruments, cuts Arm despite AI tailwinds": -0.5,
  "Comcast Completes Network Expansion in Litchfield County, Delivering High-Speed Internet to Nearly 22,000 Homes and Businesses": 0.8,
  "Freshworks to Deepen its IT Service and Operations Portfolio with Acquisition of FireHydrant’s AI-Native Incident Management and Reliability Platform": 0.5,
  "Hesai Recognized as the Only Lidar Company on Morgan Stanley's \"Humanoid Tech 25\" of Global Robotics Leaders": 0.8,
  "Paychex Identifies Top Regulatory Trends to Watch in 2026": 0.2,
  "Is Trending Stock AppLovin Corporation (APP) a Buy Now?": 0.2,
  "Here is What to Know Beyond Why Adobe Inc. (ADBE) is a Trending Stock": 0.2,
  "Shopify Inc. (SHOP) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Warner Bros. Is Blockbuster Finale to $4.5 Trillion M&A Haul": 0.5,
  "Amazon and 9 More Stocks to Buy for 2026": 0.5,
  "BROS vs. KDP: Which Coffee Stock Is Better Positioned for 2026?": 0.2,
  "Sector Update: Tech Stocks Advance Pre-Bell Monday": 0.5,
  "IEUR Is One Of The Best Performing ETFs No One Knows About (Crushed VOO and SPY)": 0.8,
  "Western Digital stock rises after inclusion in Nasdaq-100 Index": 0.8,
  "Xcel Energy Announces Cash Tender Offers for Certain Outstanding First Mortgage Bonds Issued by Northern States Power Company (a Minnesota corporation)": 0.1,
  "Lululemon (LULU) International Revenue Performance Explored": 0.2,
  "Cintas (CTAS) Q2 Earnings on the Horizon: Analysts' Insights on Key Performance Measures": 0.2,
  "Here Are Monday’s Top Wall Street Analyst Research Calls: Bristol-Myers Squibb, GE Vernova, KLA Corp., Klaviyo, Las Vegas Sands, ServiceNow, and More": 0.2,
  "Wolfe downgrades AT&T amid a wait and see approach": -0.5,
  "Wall Street Bulls Look Optimistic About Analog Devices (ADI): Should You Buy?": 0.8,
  "One Telecom Giant Raised Its Dividend for the 19th Year While Its Rival Splurged on a Massive Spectrum Deal": 0.5,
  "Intuit (INTU) Fell as Guidance Fell Short of Expectations": -0.6,
  "Company News for Dec 15, 2025": 0.0,
  "Here's Why GE HealthCare Technologies (GEHC) is a Strong Value Stock": 0.8,
  "iRobot files for bankruptcy, ServiceNow to acquire Armis for $7B": -0.5,
  "Intel shares rise on tech strength and acquisition talks": 0.8,
  "Palantir CIO Jim Siders leaves to become head of Thrive Capital’s new IT services business - Thrive Capital has brought in Palantir’s CIO Jim Siders to become CEO of Shield Technology Partners, a firm focused on acquiring stakes in IT services businesses and helping them scale. Shield’s model isn’t just financial backing it aims to plug portfolio companies into stronger technology, engineering talent, and operational support to accelerate growth. The firm currently works with seven": 0.6,
  "Is Host Hotels & Resorts Stock Underperforming the Nasdaq?": -0.5,
  "r/Stocks Daily Discussion Monday - Dec 15, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.2,
  "Global Biometric Payment Cards Market Intelligence Report 2025-2030 Featuring 25 Players Including BNP Paribas, IDEX Biometrics, Infineon Technologies, NXP Semiconductors, Visa, Zwipe": 0.5,
  "RCUS Stock Down on Decision to Discontinue GILD Partnered Study": -0.8,
  "PANW vs. CRWD: Which Cybersecurity Stock Has an Edge Right Now?": 0.2,
  "AMAT Gains From Traction in WFE Products: A Sign of More Upside?": 0.6,
  "Lululemon Set to Exit Nasdaq 100 as Index Adds New Members": 0.1,
  "What New Catalysts Are Shaping the Narrative for O'Reilly Automotive Stock Now": 0.2,
  "3 Companies Turning Big Cash Flow Into Bigger Shareholder Gains": 0.5,
  "FTNT's Premium Valuation Raises Concerns: Buy, Sell or Hold the Stock?": -0.5,
  "Meetings are not work, says Southwest Airlines CEO—and he’s taking action, by blocking his calendar every afternoon from Wednesday to Friday": 0.5,
  "Shopify Shares Rise 42% in a Year: Will the Rally Continue in 2026?": 0.6,
  "Intel Nears $1.6 Billion Deal to Buy AI Chip Startup SambaNova": 0.8,
  "Do you think it's time to consider letting go of NVDA - Honestly, I've held it for over 3 years, and I do think it could reach $250 in the next year. But recent data suggests that even with the market reopening, it hasn’t really made a big move. So in the next six months, the returns might not be huge, and it takes up a large portion of my portfolio. Do you think I": -0.5,
  "Honeywell, GE Vernova and 5 More Trendy Industrial Plays With AI Ties": 0.5,
  "Intel CEO deals spark controversy, debate": 0.1,
  "The 3 Best Chip Stocks to Buy for 2026, According to an Analyst": 0.5,
  "Judge grants motion to reconsider ex-Starbucks CFO as defendant in ‘Triple Shot’ case": 0.2,
  "SPECTRUM'S WORKFORCE INVESTMENTS DRIVE CAREER GROWTH AND A MORE SKILLED FRONTLINE TEAM": 0.8,
  "Intel's $1.6 Billion AI Gamble That Could Reshape Its Comeback Story": 0.8,
  "Mobileye Is Laying Off Staff. Is It Game Over for the Self-Driving Car Stock?": -0.6,
  "Jefferies lifts KLA to Buy on AI-led leading-edge and packaging demand": 0.6,
  "DAKT or KLAC: Which Is the Better Value Stock Right Now?": 0.2,
  "Positioning for 2026, Which Stocks Could Lead Early in the Year - As we head into 2026, i see the stock market entering a phase of cautious optimism. Inflationary pressures have eased compared to the last two years, and central banks are signaling a more balanced stance. This creates room for value investors to look beyond defensive plays and start identifying sectors with sustainable growth. The broader market may still face volatility, but opportunities exist": 0.6,
  "Telemundo Launches 'Tu Momento. Tu Jugada.' - a Nationwide Initiative Inspiring Future Leaders Through Sport and Community": 0.8,
  "Intel Corp (INTC) Q1 2025 Earnings Call Highlights: Surpassing Expectations Amidst Challenges": 0.8,
  "US cable MVNOs look to improve multiline and premium traction as mobile share grows": 0.5,
  "Better Artificial Intelligence Stock: ASML vs. TSMC": 0.5,
  "MicroStrategy retains place in key index despite delisting threats": 0.2,
  "Surging Earnings Estimates Signal Upside for Synopsys (SNPS) Stock": 0.8,
  "Highlighting December 2025's Growth Leaders With Insider Ownership": 0.5,
  "Texas Instruments Stock Slips. It Caught a Rare Downgrade From Goldman Sachs.": -0.5,
  "US High Growth Tech Stocks to Watch": 0.0,
  "This S&P 500 Stock Has Wall Street Wagging Its Tail": 0.6,
  "The 4 Stages of Investing To Build Wealth, According to Codie Sanchez": 0.2,
  "Can Labor Unions Recover? Two Experts Square Off": 0.0,
  "Streetwise | Is This the Dot-Com Bubble All Over Again?": 0.1,
  "Shopify (SHOP) Valuation Check After Strong Year-to-Date Share Price Gains": 0.5,
  "OpenAI hires veteran Google executive as corporate development VP": 0.5,
  "The 5 stocks dragging down the Dow in 2025": -0.5,
  "Spain orders Airbnb to pull thousands of unlicensed property ads": -0.8,
  "How Stronger WFE Cycle Expectations Are Shaping Applied Materials’s Valuation Story": 0.5,
  "How Recent Analyst Shifts Are Shaping The Story Behind Cintas’s Valuation": 0.5,
  "Is Starbucks’ Expansion Amid Strikes and New Dividend Altering The Investment Case For Starbucks (SBUX)?": 0.1,
  "‘We are now firmly back in a good is bad/bad is good regime’: Weak job data may lead to more rate cuts and boost stocks, Morgan Stanley economist says": 0.6,
  "Equities Fall Intraday Ahead of This Week's Key Data": -0.5,
  "KLA Corporation (KLAC) Stock Is Up, What You Need To Know": 0.5,
  "Lam Research (LRCX) Stock Is Up, What You Need To Know": 0.5,
  "ENHERTU® Plus Pertuzumab Approved in the U.S. as First New Treatment in More Than a Decade for First-Line Treatment of Patients with HER2 Positive Metastatic Breast Cancer": 1.0,
  "T‑Mobile Marks $20M Milestone in Hometown Grants, Reaching 450 Communities": 0.5,
  "Workday, Qualys, RingCentral, Sprout Social, and DigitalOcean Shares Are Falling, What You Need To Know": -0.5,
  "These Experts Have 6 Top Internet Stock Picks Lined Up for Next Year": 0.5,
  "Quantum Computing Enablers to Win in 2026: AMD, ORCL & More": 0.6,
  "Why Costco Stock Dropped Today": -0.5,
  "Recent Shifts Are Rewriting the Growth and Valuation Story for Texas Instruments": 0.5,
  "Market Chatter: Cognizant, Other Multinational Staffing Firms Impacted by New H-1B Visa Fee": -0.5,
  "Is This 53-Year-Dividend-Streak Stock Due for a 20% Breakout?": 0.2,
  "Sector Update: Tech Stocks Fall Late Afternoon": -0.5,
  "Sector Update: Health Care Stocks Gain Late Afternoon": 0.5,
  "Analyst Upgrades Casino Leader. Hotel Chains Upgraded On World Cup.": 0.5,
  "CoStar (CSGP) Stock Trades Down, Here Is Why": -0.5,
  "Mars buys Kellanova, Goldman Sachs makes bullish hotel calls": 0.5,
  "Alger Russell Innovation Index Updates for Fourth Quarter 2025": 0.0,
  "KLA Stock Nears Buy Point As Chip Gear Maker Upgraded": 0.6,
  "Stock Market Today: Dow Dips Amid Ukraine-Russia Progress; Trump Eyes This Fed Move (Live Coverage)": 0.1,
  "ENHERTU® (fam-trastuzumab deruxtecan-nxki) plus pertuzumab approved in the US as first new treatment in a decade for the 1st-line treatment of patients with HER2-positive metastatic breast cancer": 0.8,
  "Five Flattened Stocks -- The Biggest Losers of 2025": -0.7,
  "/C O R R E C T I O N -- Marriott International, Inc./": 0.0,
  "Top Stock Picks for Week of December 15, 2025": 0.0,
  "Equities Fall Ahead of November Employment Report": -0.5,
  "Can Adobe’s Recent Rebound and AI Momentum Justify Its Current 2025 Valuation?": 0.2,
  "Intel appoints Trump economic adviser as head of government affairs": -0.5,
  "Stock Market Today, Dec. 15: Nvidia Gains on Reports of Strong H200 Demand From China": 0.6,
  "'Battlefield' maker EA forecasts softer 2026 bookings amid slow spending, crowded holiday slate": -0.5,
  "Paypal (PYPL) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "Why the Market Dipped But Take-Two Interactive (TTWO) Gained Today": 0.2,
  "Amgen (AMGN) Rises As Market Takes a Dip: Key Facts": 0.2,
  "Ford Takes $19.5 Billion Hit in Detroit’s Biggest EV Bust - Automaker is shifting to hybrid gas-and-electric vehicles - Ford Motor said Monday it expected to take about $19.5 billion in charges, mainly tied to its electric-vehicle business, a massive hit as the automaker retrenches in the face of sinking EV demand. The sum is among the largest impairments taken by a company and marks the U.S. auto industry’s biggest reckoning to date that it": -0.8,
  "Is It Time To Reassess Intuit After Its Recent AI Innovation Push?": 0.5,
  "Stock Market Today, Dec. 15: Broadcom Slides After AI Margin Concerns Weigh on Stock": -0.6,
  "Honeywell International Inc. (HON) Rises As Market Takes a Dip: Key Facts": 0.5,
  "Astrazeneca (AZN) Rises As Market Takes a Dip: Key Facts": 0.5,
  "PayPal Applies to Establish Bank": 0.1,
  "Stock Market Today, Dec. 15: U.S Stocks Ease as Investors Wait for Rate Clarity": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Executive Leadership Changes On December 15, 2025, the Board of Directors (the “Board”) of The Kraft Heinz Company (the “Company”) appointed Steve Cahillane to serve as the Company’s Chief Executive Officer and as a member of the Board, in either case, effective as of January 1, 2026. Mr. Cahillane Bio Steve Cahillane, 60, served as President": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (b) On December 10, 2025, Kornelis (Neil) Smit, a member of the Board of Directors (the “Board”) of QUALCOMM Incorporated (the “Company”), informed the Board that he will be retiring from the Board effective as of the Company’s 2026 Annual Meeting of Stockholders. Mr. Smit will conclude his time on the Board after nearly 8 years": -0.2,
  "PayPal, issuer of PYUSD, applies for Utah industrial bank license": 0.2,
  "Does MercadoLibre Still Offer Value After Recent Fintech and Logistics Expansion?": 0.2,
  "Intuit (INTU) Valuation Check After Strong Q1 Beat, AI Expansion and Mixed Small Business Outlook": 0.2,
  "Costco (COST) Valuation Check After Roth Capital Sell Downgrade and Competitive Pressure Concerns": -0.5,
  "Intel Is Eyeing an AI Acquisition. Its Track Record Isn't Great.": -0.6,
  "AT&T cuts controversial policy to seal billion-dollar acquisition": 0.5,
  "The November ADP Jobs report is worse than you think, and a sign of what's to come - Plenty of articles have came out reporting on the 32,000 reduction in US private employment that ADP reported. This seems bad, but the reality is far worse. If you look at the employment changes by employer size, employers with less than 50 workers employ 120,000 less in November, whereas employers with >=50 workers 90,000 more, nearly cancelling": -0.8,
  "PayPal Moves to Set Up Utah-Chartered Bank to Bolster Payments and Lending": 0.5,
  "Costco reveals a new approach that could reshape the chain": 0.5,
  "Is It Too Late To Consider DoorDash After Its 341% Three Year Surge?": 0.2,
  "Starbucks (SBUX) Valuation Check as Niccol’s Overhaul, Barista Strike and China Push Reshape Investor Expectations": 0.2,
  "Reassessing Arm After Recent Share Price Slide and Growing AI Licensing Momentum": 0.5,
  "Q3 Rundown: Intuit (NASDAQ:INTU) Vs Other Finance and HR Software Stocks": 0.1,
  "Wall Street Maintains a Positive Outlook on Intuit Inc. (INTU)": 0.8,
  "Bernstein Reiterates a Buy Rating on Adobe Inc (ADBE)": 0.6,
  "Barclays Reiterates Buy on Autodesk, Inc. (ADSK), Keeps the PT": 0.5,
  "Wall Street Maintains a Positive Outlook on Datadog, Inc. (DDOG)": 0.8,
  "Workday, Inc. (WDAY) Down More Than 7.85% Since Q3 2026 Results, Here’s What You Need to Know": -0.6,
  "3 Reasons We Love Shopify (SHOP)": 0.8,
  "Evaluating Constellation Energy (CEG) Stock's Actual Performance": 0.1,
  "PYUSD Stablecoin Issuer PayPal Seeks State-Chartered Bank License": 0.2,
  "Cisco (CSCO): Reassessing Valuation After a 37% One-Year Share Price Climb": 0.5,
  "Has Kraft Heinz’s 2025 Share Slump Created a Long Term Value Opportunity?": 0.2,
  "3 Low-Volatility Stocks That Concern Us": -0.5,
  "2 Large-Cap Stocks on Our Buy List and 1 We Find Risky": 0.2,
  "2 Large-Cap Stocks to Consider Right Now and 1 Facing Headwinds": 0.2,
  "Jim Cramer on Cintas: “That’s a Terrific Barometer of the Mood of Small Business”": 0.6,
  "Analysts Offer Mixed Views on Cognizant (CTSH) as AI Strategy Gains Momentum": 0.2,
  "Jim Cramer Highlights Paychex’s Role in Managing Payouts": 0.5,
  "Cryptocurrencies, White House's Tech Force, and Immunome: Stock Market News": 0.2,
  "Best Stock to Buy Right Now: Costco vs. Dollar Tree": 0.5,
  "How Amgen’s New CD19-Targeted gMG Approval At Amgen (AMGN) Has Changed Its Investment Story": 0.2,
  "How Verisk’s Cyber Data Tie-Ups and AccuLynx Deal At Verisk Analytics (VRSK) Have Changed Its Investment Story": 0.2,
  "Is It Too Late To Consider Intuitive Surgical After Its Strong Multi Year Share Price Run?": 0.2,
  "Has Cintas Shares’ Long Run Left Limited Upside After 5 Year 126.8% Surge?": -0.5,
  "Hong Kong Opens Its Doors to the World's Digital Visionaries as SIGGRAPH Asia 2025 Kicks Off": 0.8,
  "Possible Stock Splits in 2026: 2 Unstoppable Stocks Up 337% and 1,780% in 2 Years to Buy Now, According to Wall Street": 0.8,
  "Costco's Momentum Continues. Is It Time to Buy the Stock?": 0.5,
  "Cognizant enters five-year IT services agreement with ERIKS": 0.5,
  "Kraft Heinz names former Kellanova leader as CEO": 0.5,
  "Will Leadership Shift and New Perks Strategy Change T-Mobile US' (TMUS) 5G Growth Narrative?": 0.2,
  "Zacks.com featured highlights include TE Connectivity, Enersys, Donaldson, Lam Research and Leidos": 0.2,
  "Trending tickers: Ford, PayPal, AMC Robotics, Korea Zinc and Rolls-Royce": 0.0,
  "US Stock Market Today: S&P 500 Futures Climb Amid Mixed Manufacturing, Housing Signals": 0.5,
  "FDA ‘proactively’ hands J&J a voucher; Pfizer issues 2026 forecasts": 0.1,
  "r/Stocks Daily Discussion & Technicals Tuesday - Dec 16, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on technical analysis (TA), but if TA is not your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly": 0.2,
  "Intel Names Trump Economic Adviser to Lead Government Affairs": 0.1,
  "Burghley Capital: Adobe Reports Record Q4": 0.5,
  "FTC claimed Walmart got unfair pricing advantages from PepsiCo": -0.6,
  "Cisco's AI Boom: Boon or Bubble?": 0.1,
  "Institutional shareholders may be less affected by Cadence Design Systems, Inc.'s (NASDAQ:CDNS) pullback last week after a year of 2.3% returns": 0.5,
  "Will Lumentum (LITE) Board Refresh Sharpen Its AI Cloud Optics Strategy?": 0.5,
  "Maersk, Hapag-Lloyd drop US East Coast city from trans-Atlantic services": -0.5,
  "Biggest US Power Auction Set to Deepen Affordability Concerns": -0.7,
  "Bull of the Day: Marvell Technology (MRVL)": 0.5,
  "PayPal's Big Banking Play: Can Trump's Deregulated Wall Street Make It Happen?": 0.2,
  "Spotlighting Bridgewater Bancshares And 2 Other Growth Stocks With Strong Insider Ownership": 0.6,
  "3 Stocks Estimated To Be Trading At Discounts Of Up To 21.1%": 0.5,
  "Stock Markets Are Suffering Amid Bubble Fears. Why Ford’s EV Pivot Offers Hope.": 0.5,
  "The Kraft Heinz Company Names Steve Cahillane Chief Executive Officer": 0.5,
  "Tyler Young, Industrials Investment Executive, Named CD&R Partner": 0.5,
  "OmniTRAX CEO Dean Piacente Announces Retirement, Shifts Focus to Company's East Region Growth Strategy as OmniTRAX Board Member": 0.5,
  "Pfizer Adds to Its Big Bet on Weight Loss Drugs": 0.5,
  "Duluth Holdings (DLTH) Reports Q3 Loss, Misses Revenue Estimates": -0.7,
  "PepsiCo rejigs exec team to “accelerate growth”": 0.5,
  "Here’s What Boosted ASML Holding N.V. (ASML) in Q3": 0.5,
  "Jefferies maps 2026 software winners and laggards as AI fears ease": 0.5,
  "3 Dividend-Paying Artificial Intelligence Stocks to Buy in 2026": 0.5,
  "Home Screen Ads Boost Advertiser Outcomes According to Xumo Report": 0.5,
  "DataLane Secures $27M to Deliver Identity Graph of 20M Local Businesses": 0.5,
  "Synergy CHC Corp. (NASDAQ: SNYR) Appoints Pedro Colmenares as Director of Sales & Marketing for Mexico & Latin America": 0.5,
  "G-P Joins Workday Agent Partner Network": 0.5,
  "Baker Hughes, Hunt Oil Sign Framework to Extend Life of Mature Oil Fields": 0.5,
  "Tom McCarthy joins Prezent AI to bring AI-powered Communication Coaching Avatars to Enterprise Professionals": 0.5,
  "Beyond Oil Strengthens Leadership With Appointments of Giora Bardea and Daniel Birnbaum to Advisory Board": 0.6,
  "An Insider At Old Dominion Freight Line Lowered Their Holding Recently": -0.5,
  "Top 6 chip stocks to buy for 2026, according to this semiconductor analyst": 0.5,
  "ADP National Employment Report Preliminary Estimate November 29, 2025": 0.0,
  "Palo Alto Networks Report Reveals AI Is Driving a Massive Cloud Attack Surface Expansion": -0.7,
  "Dux Launches from Stealth With $9M Seed Round to Bring Agentic Exposure Management to Modern Cyber Defense": 0.5,
  "Kraft Heinz hires ex-Kellanova chief as new CEO": 0.5,
  "Is Costco Stock a Buy, Hold or Sell After Its Q1 Earnings Report?": 0.2,
  "GILD's Bictegravir and Lenacapavir Regimen for HIV Meets Primary Goal": 0.8,
  "Charlotte, Tampa Among CoStar’s List of Top-Performing Retail Markets in 2025": 0.6,
  "Infragistics Makes Ignite UI Open Source": 0.5,
  "Fortinet Delivers Isolated Infrastructure Acceleration for the AI Factory with NVIDIA": 0.5,
  "Eastman, AstraZeneca, Kraft Heinz, and P&G Recognized with OMP Supply Chain Awards": 0.5,
  "Datadog, Inc. (DDOG) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Investors Heavily Search Cadence Design Systems, Inc. (CDNS): Here is What You Need to Know": 0.5,
  "Investors Heavily Search QUALCOMM Incorporated (QCOM): Here is What You Need to Know": 0.5,
  "PDD Holdings Inc. Sponsored ADR (PDD) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Here Are Tuesday’s Top Wall Street Analyst Research Calls: Allstate, Chubb Ltd., Eli Lilly, KLA Corp., Lockheed Martin, MongoDB, Roku, and More": 0.5,
  "3 Healthcare Giants Just Raised Dividends—Here’s Who Pays the Most": 0.5,
  "Klarna's Agentic Shift: When AI Goes Shopping, KLAR Will be the Guide": 0.5,
  "Jobs data came in mixed, SPY still range bound - The November unemployment rate, delayed due to the government shutdown, rose to 4.6%, compared to the expected and previous reading of 4.4%. This marks a four year high. Nonfarm payrolls increased by 64K in November, exceeding the market forecast of 50K. The revised October figure showed a loss of 105K jobs, significantly worse than the previously reported gain of 108K in September. Following the data": -0.2,
  "5 High-Risk, High-Reward Biotech Breakthrough Stocks to Watch in 2026": 0.5,
  "AI Push to Drive Adobe's Prospects in 2026: Buy or Hold the Stock?": 0.5,
  "Kraft Heinz taps new CEO, PayPal files for US bank charter": 0.5,
  "Big Tech at key supports market direction hinges on MSFT, NVDA, AAPL - Yesterday, the S&P 500 rebounded after hitting 6801 for the second consecutive day, stubbornly holding above the key short term support level of 6800 we highlighted at the beginning of the month. However, the rebound was extremely weak. If the market can pull back to the pre market SPY level around 682 within the first half hour of trading, a rebound will": 0.2,
  "Strength in Software & Services Unit Drives Axon: Can It Sustain?": 0.5,
  "Cisco Trades Near 52-Week High: Buy, Sell or Hold the Stock in 2026?": 0.2,
  "Trinity Hills Valley, S.A. Signs Franchise Agreement with Marriott International for Tribute Portfolio Hotel and Residences at Surf Lagoon-Anchored Resort in Panama": 0.5,
  "Is PepsiCo's Innovation Pipeline Strong Enough to Reaccelerate Growth?": 0.2,
  "Walmart & 2 More Blue Chip Retail Stocks to Watch Heading Into 2026": 0.5,
  "Is Union Pacific’s Proposed Merger the Best Way to Speed Up Deliveries?": 0.2,
  "Costco downgraded, Dollar General upgraded: Wall Street’s top analyst calls": 0.2,
  "ACM Research (ACMR): Valuation Check After Ultra Lith Baker Delivery and Intel Process Tool Validation": 0.2,
  "Trump Trade: Infosys to be impacted by Trump’s $100K H-1B worker fee": -0.6,
  "Is ASML Holdings a Buy?": 0.0,
  "EMJ's Jackson pursues crypto treasury strategy with reverse merger (Dec. 16)": 0.1,
  "Comcast Spinoff Versant Debuts at Modest Valuation, a Signal for a Warner Bros. Sale": 0.2,
  "MRVL Strengthens AI Connectivity Stack: More Upside Ahead?": 0.6,
  "AI boom seen lifting chipmaking equipment sales 9% to $126 billion in 2026": 0.6,
  "1 Growth Stock I'd Buy Before PDD In 2026": 0.2,
  "BC-Most Active Stocks": 0.0,
  "Fermi (FRMI) Nosedives 15% as Partner Withdraws from Deal": -0.8,
  "Kraft Heinz Picks New CEO Ahead of Split": 0.5,
  "ATL's hospitality could make millions during World Cup. Want a piece?": 0.5,
  "3 Nuclear Energy Stocks to Buy Before 2026": 0.5,
  "LightHeaded Helmets Debuts First-of-Its-Kind Luxury Memorabilia as Official Sponsor of the 2026 Madden Bowl and EA SPORTS™ College Football 26": 0.8,
  "A year on from ‘drill, baby, drill’, why are there fewer oil rigs in the US?": -0.5,
  "AZN, Daiichi's Enhertu Gets FDA Nod for First-Line Breast Cancer": 0.5,
  "Bitcoin bounces from Monday's worst levels, but sub-$80,000 may come next, analyst says": 0.2,
  "13 Investment Must Reads for This Week (Dec. 16, 2025)": 0.0,
  "With fewer than 12 trading days left in the year, which stocks are worth keeping an eye on, and which ones could get off to a strong start i - Time is running out as the market digests a slew of major news. I've selected 4 stocks I believe warrant short-term attention and have potential for strong early-year performance, along with brief rationale and key risks: NVDA: H200 export approval to China (requiring U.S. revenue": 0.2,
  "How Analysts See the Story Behind Electronic Arts Shifting After the Take Private Offer": 0.2,
  "KindlyMD Bitcoin Treasury Faces Nasdaq Delisting As It Plunges Below $1 — Can It Survive Like MSTR?": -0.6,
  "Should Jefferies’ Downgrade and Earnings Reassessment Require Action From Automatic Data Processing (ADP) Investors?": 0.1,
  "Western Digital’s Nasdaq-100 Entry Caps Its AI-Driven Comeback": 0.6,
  "Premarket Movers: Strategy is One of the Biggest Standout Winners": 0.8,
  "PayPal's Strong Free Cash Flow and Margins Could Push PYPL +17% Stock Higher": 0.8,
  "Can Fortinet Stock Sustain Momentum With Strong Unified SIEM Adoption?": 0.5,
  "Can Intel's AI Focus Restore Its Competitive Edge & Boost Shares?": 0.5,
  "Nvidia and Broadcom Are Wall Street's Top Chip Picks for 2026": 0.6,
  "SKIL vs. APP: Which Stock Is the Better Value Option?": 0.2,
  "Tesla’s valuation keeps climbing but the story feels more complicated - Tesla’s market cap has pushed up toward ~$1.6T as analysts raise price targets, largely tied to optimism around robotaxis and autonomy. The narrative hasn’t changed much: long-term optionality from autonomy versus near-term pressure from slowing sales, vandalism issues, and margin compression. What’s interesting is how little the market seems to care about current delivery softness compared to future possibilities. EU approval for Model Y": 0.2,
  "Microsoft keeps spending big on AI, but usage trends raise questions - Microsoft continues to double down on AI infrastructure, including a massive Nvidia cloud contract and a multi-year investment commitment in India. From a balance sheet and execution standpoint, nothing here is surprising MSFT can afford to play offense longer than almost anyone. What stands out is a recent survey suggesting AI platform usage may be slowing, at least marginally. That doesn’t mean the": 0.2,
  "Amazon’s quieter moves may matter more than headline AI spending - Amazon announced two lower-profile partnerships: one with Mill Industries to reduce food waste at Whole Foods, and another with Slope to offer credit lines to sellers using Amazon’s internal data. Neither is flashy, but both reinforce how Amazon strengthens its ecosystem. Reducing waste improves margins and optics, while embedded financing makes third-party sellers more dependent on the platform. This feels less like experimentation and": 0.5,
  "BIC: Evolution of Société BIC’s Board of Directors composition": 0.0,
  "Big day of headlines for Nvidia chips, China, acquisitions, and renewed bull case - Nvidia had a pretty packed news cycle today, and taken together it helps explain why sentiment around the stock remains resilient despite all the macro and valuation noise. On the policy side, Nvidia reportedly received approval to sell advanced chips into China, albeit with the U.S. government taking a sizable cut of the revenue. While the margin impact matters, access to": 0.8,
  "Billionaire David Tepper Sells These 5 Stocks to Buy This 1 Stock": 0.2,
  "AVGO, NFLX, or HOOD - Wanting to add some diversity to my port. Majority of my my brokerage is in VOO. Own some GOOG, SOFI and PLTR. Was lucky to be early to SOFI and PLTR. Not expecting to get rich on any of these, kind of just want to track something different. Leaning towards HOOD or NFLX. AVGO is just intriguing with the little dip, although I know it has had a great year": 0.5,
  "Pepsi Worked to Keep Prices Higher at Retailers to Protect Walmart, FTC Found": -0.5,
  "U.S. crude oil drops below $55 a barrel, hits lowest level since early 2021 - Oil has been under steady pressure this year, and it doesn’t seem to be coming from just one factor. OPEC+ has been adding supply back into the market faster than many expected after years of disciplined output cuts, and that extra production is starting to show up in inventories and price action. At the same time, the geopolitical risk premium": -0.6,
  "Top Midday Stories: Pfizer Falls Following 2026 Outlook; Netflix-iHeartMedia Exclusive Deal; Apple's Possible iPhone Lineup Expansion": 0.5,
  "Does ADP’s Recent Share Price Weakness Present a Long Term Opportunity in 2025?": 0.2,
  "Instagram TV app coming to Amazon Fire streaming device - Meta announced that it’s starting tests of an Instagram app designed specifically for TV screens in the U.S., launching first on Amazon’s Fire TV devices. The app will focus heavily on Reels, essentially bringing Instagram’s short-form video feed into a living-room format. According to Instagram VP of Product Tessa Lyons, this is just the first step. Meta plans to expand the TV app to other": 0.6,
  "Assessing Workday After Recent Pullback and Strong Enterprise Cloud Expansion in 2025": 0.5,
  "Oracle looks oversold. Not a moonshot. Mispriced relative to fundamentals, data moat, and prior technical support. - Oracle has been sold off hard and in my view this is an oversold situation rather than a broken business. The stock has taken a sharp hit after earnings due to aggressive AI related capex and debt concerns, but the reaction looks excessive relative to what actually changed. First, I fully acknowledge the risk. Oracle is spending heavily.": 0.6,
  "Robotaxis in 2025: Waymo plots global expansion as Zoox, Tesla roll to the starting line - Waymo quietly extended its lead in the robotaxi space in 2025 and is now operating, testing, or preparing launches across 26 markets in the U.S. and abroad. At this point, it’s the only player running large-scale, fully driverless commercial services in multiple cities, which gives it a meaningful real-world data advantage. Amazon’s Zoox is taking a different approach, starting": 0.6,
  "Earnings Estimates Moving Higher for Analog Devices (ADI): Time to Buy?": 0.6,
  "Kraft Heinz taps former Kellogg chief as its CEO as it prepares to split into 2 companies": 0.5,
  "Zscaler shares ’now too attractive to ignore’ – Mizuho": 0.6,
  "Kraft Heinz Chooses New CEO for Breakup. Can He Fix a Broken Stock?": -0.5,
  "3 Growth Companies With High Insider Ownership And Earnings Growth Up To 110%": 0.6,
  "Discover December 2025's Top Stocks Estimated Below Intrinsic Value": 0.2,
  "ARM Stock Declines 13% in a Year: Should You Buy the Dip?": 0.2,
  "AVGO has fallen so sharply, but I see a massive rebound to $400! Stop looking at those junk AI stocks; AVGO is the real AI arms dealer! - Did AVGO's stock performance scare you? A perfectly good AI stock, and it dropped over 15% after the earnings report! Those analysts say it's because of profit margin dilution to hell with profit margins! This is panic selling, and it's a gift for those of us who": 0.2,
  "KLA (KLAC): Assessing Valuation After a 2.61% Daily Gain and Strong Year-to-Date Rally": 0.6,
  "Biotech Leader Stoke Therapeutics Offers Multiple Entries As Revenue Surges 117%": 0.8,
  "It’s Quiet Out There": 0.5,
  "Update: Xcel Energy Sued by Texas Attorney General for Allegedly Causing Smokehouse Creek Fire": -0.8,
  "These 3 Dividend ETFs Outperformed Every Market Crash Since 2000": 0.8,
  "FSD software could be what breaks both Tesla and the automotive industry - Basically we are all familiar with the sayings that the early bird gets the worm and the second mouse gets the cheese. I want to point that I am not entirely sure whether Tesla is fighting for a worm or cheese here. FSD will change the world but not in a way most people think. The gig work automation and the replacement": 0.1,
  "Short term investments as a stepping stone to long term ones? - Hi all, I’m super early in my investing journey and want to approach this in a structured way rather than just jumping in blindly. My current goal is to use very short term trading as a temporary strategy to build additional capital, with the intention of then moving all of those funds into long term, lower risk investments. I’m fully aware that day": 0.5,
  "Chip Stocks Are In a Bubble. Here’s More Good News.": 0.2,
  "Earnings season workflow: calendar + live call synthesis in one place - If you track more than a handful of tickers, earnings season turns into tab chaos fast. I recently started using Perplexity Finance because it has an Earnings hub with a calendar view and instant synthesis of earnings calls while they’re happening. A simple way to use it: Before the call: “What are the 5 questions the market cares about this quarter?” During: “Summarize": 0.6,
  "Sector Update: Energy Stocks Decline Tuesday Afternoon": -0.5,
  "NRC Renews Operating Licenses for Clinton & Dresden; Constellation Investing $370 Million in State-of-the-Art Upgrades to Keep These Illinois Nuclear Facilities Online, Meet Rising Power Demand and Support Economic Growth": 0.8,
  "Rolling Out Relief: Operation Homefront and CSX Ease Transportation and Housing Burden for Military Families Across 26 States": 0.8,
  "Square and Thrive Expand Partnership to Simplify Multi-Channel Inventory Management for Retailers": 0.6,
  "JPMorgan Lifts AEP Price Target Following Utility Sector Model Update": 0.5,
  "Buying the dip while sitting on support... - I decided to put some money in BSM today at $13.64. Here is the chart… [https://share.trendspider.com/chart/BSM/64338x8ogh](https://share.trendspider.com/chart/BSM/64338x8ogh) The recent volatility is offered a good entry point, which appears to be a text book Wave 4 in our Elliott Wave analysis. Wave 4 and Wave 2 generally travel the same distance, so we may still see shares fall to about $13.55 before Wave 5 starts. Keep in mind, Wave": 0.5,
  "Xcel Energy Uses Oracle Platform for Personalized Customer Service": 0.5,
  "How A Sharp Jump In US H‑1B Visa Fees At Cognizant (CTSH) Has Changed Its Investment Story": 0.2,
  "Amgen (AMGN) Price Target Trimmed at Morgan Stanley as Policy Risks Ease": 0.5,
  "Does Paychex’s AI-First Pivot and Margin Pressure Reshape Its Acquisition Story for PAYX?": 0.1,
  "Honeywell (HON): Valuation Check After Indra Nooyi Joins the Board of Directors": 0.2,
  "PepsiCo (PEP) Gets Price Target Lift at Barclays as 2026 Outlook Comes Into Focus": 0.5,
  "AI Runs on Power—And Constellation Energy Controls the Switch": 0.2,
  "Boston Pizza Royalties Fund (BPF) should be interesting to people this week. Dividends, and probably a quick pop in a down market. - For all of you looking for options in a tough market this week - here is your santa rally. Look at boston pizza income fund. Their ex-dividend day is Dec 19 so you will get a dividend regardless, but there will be a quick run up prior. Good metrics, price-to-earnings ratio is": 0.6,
  "WSJ: Why everyone got Trump’s tariffs wrong - https://www.msn.com/en-us/money/markets/why-everyone-got-trump-s-tariffs-wrong/ar-AA1SlnTr > In the days following “Liberation Day,” the contrast between Trump’s optimism and more dire predictions from trade experts and economists was stark. > > As businesses and consumers tried to make sense of the mixed messages, the president doubled down on promises he’d made during his 2024 presidential campaign. “The markets are going to boom, the stock [market] is going to boom, the country is": 0.2,
  "UBS Lifts Analog Devices (ADI) Target, Keeps Buy Rating": 0.6,
  "Costco (COST) Target Lowered at Truist on Valuation Concerns": -0.5,
  "T-Mobile launches free offer for customers after major loss": 0.2,
  "As Christmas approaches and market volatility intensifies, how can we maintain rational investing? - As Christmas approaches, markets typically experience reduced trading volume and heightened volatility, prompting investors to exercise caution. Recent market movements may be influenced by holiday sentiment and year-end adjustments, so avoid excessive trading. It is advisable to maintain light positions, focus on long-term investment opportunities, and steer clear of short-term emotional fluctuations. What are your thoughts?": 0.5,
  "These Are The 5 Best Stocks To Buy Now Or Watch": 0.5,
  "Nasdaq moves to make trading nearly 24 hours. Why some on Wall Street say that’s a bad idea - Nasdaq says it plans to file with the SEC to allow U.S. stocks and ETFs to trade almost around the clock, five days a week, starting as early as the second half of 2026. The proposal would stretch trading to 23 hours per weekday, splitting the market into a long “day session” (4 a.m.–8 p.m. ET),": 0.1,
  "AMD Shares Dip as Analyst Initiates Neutral View Amid Shifts in China Chip Rules": -0.5,
  "QuantumScape and 2 Stocks Set for Earnings Acceleration in 2026": 0.5,
  "How Investors May Respond To KLA (KLAC) Analyst Upgrades Tied To AI‑Driven Chipmaking Demand": 0.2,
  "75-year-old fast food chain closing 200 restaurants, fights to survive": -0.6,
  "Did MicroStrategy Make Its Worst Bitcoin Purchase of 2025?": -0.6,
  "Software Stocks Have Taken a Beating This Year. Here’s What’s Ahead.": -0.5,
  "U.S. government to recruit workforce from popular crypto exchanges": 0.2,
  "Pfizer outlook, Humana leadership shake-up, Kraft Heinz's new CEO": 0.0,
  "Discount Retailers to Continue Outperforming Department Stores, UBS Says": 0.8,
  "Bitcoin's massive underperformance to stocks in Q4 bodes well for January, says K33's Lunde": 0.5,
  "Port Of Los Angeles 'Feeling OK' About 2026 After 'Roller Coaster' First Year Of Trump's Trade War": 0.4,
  "Tesla stock hits record as Wall Street rallies around robotaxi hype despite slow EV sales - Tesla’s stock just set a new record, breaking past its previous all-time high from almost exactly a year ago. The rally comes after a wild 12 months for shareholders including a brutal 36% drop in Q1, the stock’s worst quarterly performance since 2022. What’s driving the rebound now seems to be renewed optimism around Tesla’s long-promised robotaxi vision. Investors": 0.6,
  "Bitcoin is dragging down digital asset treasuries, like Strategy": -0.6,
  "Why Comcast (CMCSA) Stock Is Up Today": 0.5,
  "Why Microchip Technology (MCHP) Stock Is Down Today": -0.5,
  "Kraft Heinz gets a new CEO ahead of company split: Can Steve Cahillane turn around the ailing food giant?": 0.2,
  "Exodus joins stablecoin race with MoonPay-backed digital dollar": 0.5,
  "Broadcom Stock Got Stomped. Why It’s Still J.P. Morgan’s Top Chip Pick.": 0.5,
  "Nvidia Stock Walks the Fine Line of AI Bubble Fears": -0.5,
  "Top Stock Reports for Amazon.com, Toyota Motor & Intuit": 0.5,
  "Okay after some constructive criticism on the last post here is my new portfolio. Thoughts? - ETFS: 62% VOOG. 37% VBR. 10% VXUS. 10% XLV. 5% Crypto:10% BTC. 10% Individual picks 23% AMZN. 5% COST. 5% NFLX. 5% JPM. 5% NVDA 3% Speculative 5% OKLO 3% NXE2% I have 50k to invest and I want to make sure I’m not messing up. here is my rationale: I made sure a heavy position in my portfolio": 0.2,
  "Financial Services Roundup: Market Talk": 0.0,
  "AI Partnerships Versus Slowing HCM Growth Might Change The Case For Investing In Workday (WDAY)": 0.2,
  "AI-era cyberattacks are 'so dangerous,' CrowdStrike pres. explains": 0.2,
  "TSLA's epic surge: With its core business collapsing, why did its stock price reach a new all-time high of $491.5? - TSLA surged against the market trend today, reaching a new all-time high of $491.5, while Elon Musk's net worth soared to over $670 billion. This stands in stark contrast to the company's core business struggles, including a nearly 40% drop in European sales and institutional forecasts of declining Q4 deliveries. The truth is: Wall": -0.6,
  "Fortinet (FTNT) Gains As Market Dips: What You Should Know": 0.5,
  "Is Constellation Energy Stock a Buy Now?": 0.2,
  "Stock Market Today, Dec. 16: Comcast Jumps on Activist Investor Speculation": 0.5,
  "Tata and Infosys to Bear Brunt of Trump’s $100,000 H-1B Worker Fee": -0.5,
  "Datadog (DDOG) Valuation Check After a 24% One-Month Share Price Slide": -0.5,
  "Does PayPal’s Sharpened Payments Strategy Signal a Rebound After a 75% Five Year Slide?": 0.5,
  "Has Thomson Reuters Pullback Created an Opportunity for Long Term Investors in 2025?": 0.5,
  "According to sources Warner Bros. may reject Paramount's $108.4 billion acquisition offer and instead support Netflix in the bidding war - December 16 (Reuters) Warner Bros. Discovery's board of directors may announce its decision on Paramount Sky Dance's $108.4 billion acquisition offer as early as Wednesday, according to people familiar with the matter. The board is expected to recommend shareholders vote against the bid. The renewed acceptance of Netflix's acquisition offer marks the latest development": 0.5,
  "Kraft Heinz names former Kellogg CEO to helm Chicago packaged food giant ahead of planned split next year": 0.5,
  "MRVL, AMZN and MSFT: Breaking Down the Wall Street Controversy": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (d) Election of New Director On December 17, 2025, the Board of Directors (the “Board”) of Xcel Energy Inc. (“Xcel Energy”) elected Maria Demaree, 57, to begin serving on the Board effective immediately. Ms. Demaree was appointed to serve on the Board’s Audit Committee and Operations, Nuclear, Environmental and Safety Committee. The Board determined that Ms.": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On December 17, 2025 , Micron Technology, Inc. (the \"Company\", \"we\" or \"our\") announced the financial results for our first quarter of fiscal 2026 ended November 27, 2025. The full text of the press release issued in connection with the announcement is attached as Exhibit 99.1 to this Current Report on Form 8-K. The information in\n\n(Item 2.02) and Exhibit 99.1 of this Current Report on Form 8-K shall not be deemed \"filed\" for the purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), or otherwise subject to the liabilities of that section. The information in\n\n(Item 2.02) and Exhibit 99.1 of this Current Report on Form 8-K shall not be incorporated by reference into any filing or other document pursuant to the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such filing or document.": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Amendment and Restatement of the Cisco Systems, Inc. 2005 Stock Incentive Plan At the Annual Meeting of Stockholders (the “Meeting”) of Cisco Systems, Inc. (“Cisco”) held on December 16, 2025, Cisco’s stockholders approved the amendment and restatement of the Cisco Systems, Inc. 2005 Stock Incentive Plan (as amended and restated, the “Amended Stock Plan”). The Amended\n\n(Item 5.07) . Submission of Matters to a Vote of Security Holders. At the Meeting, Cisco’s stockholders voted on the following five proposals and cast their votes as follows: Proposal 1: To elect nine members of the Board: Nominee For Against Abstained Broker Non-Votes Michael D. Capellas 2,664,285,240 230,015,669 4,601,262 426,487,003 Mark Garrett 2,823,986,851 70,328,089 4,587,231 426,487,003 John D. Harris II 2,873,216,583 20,988,282 4,697,306 426,487,003 Dr. Kristina M. Johnson 2,808,353,781 86,251,768 4,296,622 426,487,003 Sarah Rae Murphy 2,886,367,216": 0.1,
  "(Item 8.01) . Other Events On December 17, 2025, Constellation Energy Corporation (the Company) learned the results of the PJM capacity auction for the 2027-2028 planning year. Each of the Company's power plants located in the PJM market cleared in the auction. The cleared volumes for RTO and MAAC include winter-only resources. Capacity revenues for nuclear units are included in the gross receipts calculation for the Production Tax Credit. The auction results take effect June 1, 2027.": 0.1,
  "Stock Market Today, Dec. 16: Energy Stocks Slide as Oil Drops to Multi-Year Lows": -0.8,
  "Popular Bitcoin company receives Nasdaq delisting notice": -0.7,
  "Review & Preview: A Data Washout": -0.5,
  "Forget the $1.50 Hot Dogs. Have You Tried a Costco Vacation?": 0.2,
  "DXYZ ticker play. - What’s everyone think of this for a spacex and starlink pre ipo play? Any other suggestions? I’d like to be in space x, but pre ipo limits options. I’ll admit, to get to this ticker I read a marketing pitch, so I just picked one with SpaceX exposure. Would love ideas on options to get on board.": 0.2,
  "The list of major companies laying off staff this year includes Verizon, IBM, Amazon, Starbucks, American Airlines, and more": -0.5,
  "Morningstar research inside Perplexity Finance is a nice shortcut - For US equities, Perplexity Finance added a Research tab that includes access to Morningstar analyst research on some equity pages. Workflow idea: Read the Morningstar view. Then ask: “Summarize the moat, key risks, and what could break the thesis in 12 months. Put it in a 10-bullet memo.” Do you use analyst research as a starting point or avoid it entirely?": 0.6,
  "Corrections & Amplifications": 0.0,
  "How AI Driven Upgrades Are Rewriting the Story for KLA": 0.5,
  "Reassessing Thomson Reuters (TSX:TRI) Valuation After Its Recent Share Price Slide": 0.2,
  "What are you bagholding? - I’ll go first. I’m still stuck with FUBO and RVSN. Bought them way too high, they just kept dropping, and I’ve been holding on ever since. Haven’t sold, not really sure why. Maybe part of me is still hoping they’ll bounce back. What about you? What bags are you still carrying, and what’s keeping you from hitting that sell button?": -0.6,
  "MetaX soars 700% in debut as China AI chips push lures investors": 0.8,
  "Stock Market News: New York City gets casinos, Palantir and Databricks": 0.2,
  "Cintas (CTAS) Q4 Earnings: What To Expect": 0.0,
  "Im just so confused about tesla stock - Can anyone explain why hedge funds are adding positoon at 470? Im so confused.. I never even seen company like apple or Google ever sit at that kind of valuation even when it was growing. Wtf is going on?": -0.8,
  "Airbnb (ABNB) Is Up 5.3% After Analyst Upgrade Highlights Bookings Rebound Amid Spain Fine": 0.6,
  "Spotting Winners: Keurig Dr Pepper (NASDAQ:KDP) And Beverages, Alcohol, and Tobacco Stocks In Q3": 0.5,
  "PayPal Casinos USA: High 5 Casino's Easy PayPal Solutions": 0.5,
  "Why Is The Crypto Market Up Today?": 0.2,
  "Reassessing Workday (WDAY) Valuation After Earnings Beat and Sharp Post-Results Share Price Drop": 0.2,
  "Has Electronic Arts Stock Run Too Far After Its 40% 2025 Rally?": -0.5,
  "2 S&P 500 Stocks on Our Buy List and 1 We Turn Down": 0.2,
  "1 Large-Cap Stock Worth Your Attention and 2 Facing Challenges": 0.2,
  "2 S&P 500 Stocks with Promising Prospects and 1 We Ignore": 0.5,
  "2 Mega-Cap Stocks with Exciting Potential and 1 We Find Risky": 0.5,
  "3 S&P 500 Stocks with Questionable Fundamentals": -0.5,
  "5 Insightful Analyst Questions From Adobe’s Q4 Earnings Call": 0.5,
  "GE HealthCare and Indonesia’s Ministry of Health to expand access to quality care through the provision of 300+ advanced CT scanners": 0.8,
  "Why Analysts Have High Hopes For Booking Holdings Inc. (BKNG)": 0.6,
  "JDE Peet’s transfers shares to participants under its employee incentive plans": 0.2,
  "Should Nvidia Worry About AMD and Google Breathing Down Its Neck in 2026?": -0.5,
  "Is Marriott (MAR) Quietly Repositioning Its Brand With Luxury Experiences And Franchised Expansion?": 0.5,
  "Bitcoin trades near key price safety net that Strategy already breached": -0.5,
  "Freedom Capital Reiterates Buy on Zscaler (ZS) After Strong Q1 Results": 0.8,
  "Retailers Are Pushing Store Brands. Why Wings and French Macarons Are Big Money Makers.": 0.5,
  "Analysts See Adobe’s (ADBE) Story “Rebased” After Better-Than-Expected Quarter": 0.6,
  "2 Things That Can Lead to a Shopify (SHOP) Stock Rally in 2026": 0.2,
  "William Blair Reiterates Outperform on ARM, Citing Long-Term AI Tailwinds": 0.8,
  "Hong Kong Disneyland Crowned as Most-Searched Activity on Agoda in 2025": 0.8,
  "r/Stocks Daily Discussion Wednesday - Dec 17, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.2,
  "Will the Bubble Burst on Artificial Intelligence (AI) Stocks Nvidia and Palantir in 2026? History Weighs in and Offers a Big Clue.": 0.1,
  "The Zacks Analyst Blog Amazon, Toyota, Intuit, Eastman and Armanino": 0.0,
  "Blood Glucose Monitor Market Set to Reach USD 25.4 Billion by 2030 with a CAGR of 9.1%": 0.5,
  "AMD chief Lisa Su commits to 'deeper' China investments in meeting with industry minister": 0.5,
  "The New Tech Dividend King Poised for Explosive Growth": 0.8,
  "Zacks.com featured highlights include QuantumScape, Adobe and Silicon Laboratories": 0.2,
  "US Stock Market Today: S&P 500 Futures Edge Higher as Global Rate Cut Hopes Build": 0.8,
  "Bitcoin to Be ‘Hardened’ by Quantum Computing, Says Michael Saylor — Warnings Surge": 0.2,
  "Accenture and Palantir set up business group for AI and data solutions": 0.5,
  "Why Charter Communications, Inc. (NASDAQ:CHTR) Could Be Worth Watching": 0.5,
  "Insiders At Palo Alto Networks Sold US$5.0m In Stock, Alluding To Potential Weakness": -0.6,
  "Estimating The Intrinsic Value Of Marvell Technology, Inc. (NASDAQ:MRVL)": 0.2,
  "Tesla's Robotaxi progress gives investors proof of the AI dream": 0.8,
  "'Big Short' investor Michael Burry has broken his silence. Here's what he's revealed in 7 weeks of speaking freely.": 0.2,
  "Blue Bottle Fever? China’s Luckin Coffee Weighs Offer for California Chain": 0.2,
  "Three Insider-Favored Growth Companies To Watch": 0.5,
  "AI Chips Update - AlphaTON Capital Expands AI Capabilities With NVIDIA B300 Integration": 0.6,
  "3 Stocks Estimated To Be Trading At Discounts Of 23.8% To 35.3%": 0.5,
  "US High Growth Tech Stocks To Watch December 2025": 0.5,
  "Cintas' Q2 2026 Earnings: What to Expect": 0.0,
  "2 High-Flying AI Stocks I'd Sell Before 2026 Arrives": -0.6,
  "Baker Hughes to Supply Advanced Artificial Lift Solutions to Enhance Production in Kuwait Oil Company Fields": 0.6,
  "Nuvectis Pharma Announces the Initiation of the Phase 1b Study of NXP900 in Combination with Osimertinib in Patients with NSCLC": 0.5,
  "Compugen Monetizes Portion of Rilvegostomig Future Royalties to AstraZeneca for Up to $90 Million": 0.8,
  "How to Buy CSCO for a 2.5% Discount, or Achieve a 19% Annual Return": 0.5,
  "Is CoStar Group Fairly Priced After a 30% Five Year Share Price Slide?": -0.5,
  "Old Dominion price target raised to $173 from $160 at Stifel": 0.5,
  "Renowned AI Expert Xi Chen Joins Compass Lexecon": 0.5,
  "S&P 500 Stocks: These 2 Lagging Retailers Become Leaders In December": 0.5,
  "PayPal moves to establish US bank, expanding deposits and loans": 0.5,
  "SOL Strategies: The Premier Public Play on the Solana Economy – Initiation Report": 0.5,
  "Nvidia vs AMD: Which AI Chipmaker Will Lead the Next Decade of Compute?": 0.5,
  "2025 in Review: South Korea's Leading AI Innovator Marks Breakout Year After U.S. Launch": 0.8,
  "Is Exelon (NASDAQ:EXC) Using Too Much Debt?": -0.5,
  "Dow Jones Futures Rise, Nasdaq Eyes Key Level; Tesla, Amazon, Defense Firms In Focus": 0.5,
  "Electronics firm Jabil forecasts upbeat annual results on booming data center demand": 0.8,
  "PayPal plans to launch bank serving small businesses around the US": 0.5,
  "Mondelez International, Inc. (MDLZ) Makes Jefferies’ Preferred Picks List in Food Sector": 0.5,
  "Palantir Technologies (NASDAQ: PLTR) Stock Price Prediction for 2025: Where Will It Be in 1 Year": 0.2,
  "Form 8.3 - Qualcomm Incorporated": 0.0,
  "Here’s Why Platinum International Technology Fund Increased Its Stake in Intuitive Surgical (ISRG)": 0.5,
  "Here’s What Hit Intuitive Surgical (ISRG) in Q3": 0.0,
  "Shopify (SHOP) Surged Following the Earnings Release": 0.8,
  "What Makes Axon Enterprise (AXON) a Strong Investment?": 0.6,
  "Airbnb is ’an increasingly attractive brand monetization story’ says RBC": 0.6,
  "Fortinet vs. Cisco: Which Cybersecurity Leader Has the Edge Now?": 0.5,
  "Can AI-Driven Foundry Demand Drive LRCX's Systems Revenue Growth?": 0.2,
  "Here Are Wednesday’s Top Wall Street Analyst Research Calls: Ally Financial, CyberArk, Fortinet, Robinhood Markets, Salesforce, ServiceNow, Procter & Gamble, and More": 0.5,
  "Archive Intel Adds Microsoft Dynamics 365 as Integration Partner, Enabling Automatic Contact Whitelisting for MS Ecosystem Users": 0.6,
  "From the Boardroom to the Community: Cause Strategy Partners Launches Global Expansion to Fuel the Next Generation of Nonprofit Leaders": 0.5,
  "Vaso Corporation Announces Fifth Extension of Sales Representation Agreement with GE HealthCare": 0.5,
  "Marriott International Celebrates 100 Signings for City Express by Marriott in the U.S. and Canada": 0.6,
  "Fortinet and Arista Networks Announce Joint Secure AI Data Center Solution": 0.5,
  "Athletic Brewing Company Relaunches \"Athletic January\" Campaign, Making Modern Moderation More Accessible": 0.5,
  "Megan Hannigan Joins FS Vector as Managing Principal on Government Relations": 0.5,
  "Investors Heavily Search Amgen Inc. (AMGN): Here is What You Need to Know": 0.5,
  "Starbucks Corporation (SBUX) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "ON Semiconductor Corporation (ON) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Here is What to Know Beyond Why lululemon athletica inc. (LULU) is a Trending Stock": 0.2,
  "Can Apple close the AI gap in 2026? Morgan Stanley weighs in": 0.2,
  "Amazon & OpenAI, Micron earnings, oil prices rebound: 3 Things": 0.2,
  "Booking Holdings (BKNG): Valuation Check After Strong Q3 2025 Results and New viagogo Partnership": 0.6,
  "How China built its ‘Manhattan Project’ to rival the West in AI chips": 0.5,
  "Do You Believe in the Growth Potential of Adobe (ADBE)?": 0.5,
  "Comparably Announces 2025 Best Compensation, Best CEO’s and Best Company Culture Awards": 0.5,
  "Marvell Technology Looks Undervalued as Artificial Intelligence Spending Surges": 0.8,
  "WBD urges shareholders to reject Paramount bid, Medline IPO": -0.5,
  "The stock market is being powered by 10 stocks that are fueling AI bubble fears": -0.6,
  "Gas Detection Market Forecast to Reach USD 5.18 Billion by 2030: Market Insights and Growth Drivers": 0.5,
  "Spotify initiated, Airbnb upgraded: Wall Street's top analyst calls": 0.5,
  "Can Falcon Flex Become CrowdStrike's Most Important Growth Engine?": 0.5,
  "Here's Why Take-Two Interactive (TTWO) is a Strong Growth Stock": 0.8,
  "The current period presents a relatively favorable strategic window. - Since the April lows, major U.S. stock indices have staged a significant rebound: the S&P 500 has risen approximately 37%, while the Nasdaq 100 has gained about 51%, with overall levels approaching historical highs. Notably, despite the substantial expansion in index gains, the three month implied volatility of S&P 500 constituents remains only slightly below the actual volatility over the same period. This indicates that": 0.8,
  "Advice - TLN - I started investing a little over a year ago. I opened a small position in Talen energy and slowly acquired 2.6 shares at $265 avg cost basis. As of recently, I’ve dug more into their stretched valuation and last quarters results (as best I can with the brain I have) and am trying to weigh that against some the positives (AWS contract, acquisitions in Ohio, share buy backs etc). I am": 0.2,
  "Memory chip prices could pressure smartphone shipments in 2026: RPT": -0.5,
  "OpenAI In Talks To Get $10 Billion Amazon Investment, Use Its Chips: The Information": 0.5,
  "HRSoft Joins the Workday Partner Program, Expanding Compensation Capabilities for Financial-Services Organizations": 0.5,
  "Company News for Dec 17, 2025": 0.0,
  "1 Reason I'm Never Selling Palantir Stock": 0.5,
  "Tax Provision Software Reimagined: PowerPlan Launches New Cloud Solution": 0.5,
  "Sterling Organization Acquires Bristol Plaza, a Premier Grocery-Anchored Shopping Center in Hartford, CT MSA, for $44 Million": 0.6,
  "Megadeal wave propels global M&A to near-record high in 2025": 0.8,
  "PARAMOUNT AFFIRMS COMMITMENT TO SUPERIOR $30 PER SHARE ALL-CASH OFFER FOR WARNER BROS. DISCOVERY": 0.6,
  "Exclusive-Google works to erode Nvidia's software advantage with Meta's help": 0.2,
  "Why Sam Altman Sees Apple and Not Google as its Top AI Rival": 0.2,
  "Generative AI is supercharging hackers' abilities": 0.6,
  "PayPal's Big Step: Is the Launch of PayPal Bank a Game Changer?": 0.5,
  "Fortinet (FTNT): Reassessing Valuation After A Mixed Share Price Performance This Year": 0.1,
  "Warner Bros. urges shareholders to accept Netflix bid over Paramount's": 0.2,
  "Warner Bros. Discovery rejects Paramount Skydance's hostile bid - Warner Bros. Discovery urged shareholders on Wednesday to reject Paramount Skydance's $108.4 billion hostile takeover bid, stating the offer posed “significant risks and costs” to the company while Netflix's earlier proposal held greater value. Multiple companies have previously competed for Warner Bros. Discovery, which owns numerous classic films including Casablanca and the Harry Potter series. On December 5, Netflix agreed to acquire a portion of Warner": 0.2,
  "Amazon in Talks Over $10 Billion OpenAI Move: Report. That’s Bad for Nvidia, Broadcom.": -0.6,
  "Form 8.3": 0.0,
  "Can The Trade Desk's OpenPath Transform the Digital Ad Supply Chain?": 0.5,
  "Visionary Marketing Executive Kristine Kobe Joins S4 Capital's Monks as EVP, Global Client Leader": 0.8,
  "Palo Alto ’well positioned as a long-term share consolidator’ says JPMorgan": 0.6,
  "ORCL vs. RAM/GPUs - Has anybody paid attention to the fact that stock prices of data center providers (ORCL, CRWV) are falling while RAM prices are rising, and NVDA is slashing gaming GPU orders? Short (or limit) MU and NVDA?": -0.6,
  "Nvidia Slips As 'Little Dragons' Company Soars On Debut; Is Nvidia A Buy Now?": 0.2,
  "Is Meta Stock Primed for a Comeback in 2026?": 0.5,
  "Nvidia Faces Competition on All Sides. The Stock Is Down.": -0.8,
  "Should You Buy Meta Platforms Stock Before 2026?": 0.2,
  "Has GOOG fallen below $300? Is now a good time to buy the dip and add to positions? - Alphabet opened down nearly 3% today and has now fallen below the $300 mark. I've held Google shares for quite some time and remain highly bullish on GOOG, so minor fluctuations like this don't affect my outlook. In fact, I see this as a favorable opportunity. Do you think now is a good time to buy": 0.8,
  "Can Datadog's Strong Enterprise Base Drive the Next Growth Phase?": 0.5,
  "Billionaire With 30 Years of 30% CAGR Gains Dumped Nvidia, Palantir, and Eli Lilly": -0.5,
  "Markets Await More Economic Data": 0.0,
  "Palantir’s New Government Wins and Accenture Alliance Might Change The Case For Investing In PLTR": 0.5,
  "Is Fortinet Fairly Priced After a Choppy Year and Modest DCF Upside?": 0.1,
  "IT Hardware Sector Faces Cyclical Challenges in 2026, Opportunities Remain, Morgan Stanley Says": 0.5,
  "Take a look at Boston Pizza. $BPF. Ex dividend date the 19th with an extra one if you hold on 21st - For all of you looking for options in a tough market this week - here is your santa rally. Look at boston pizza income fund. Their ex-dividend day is Dec 19 so you will get a dividend regardless, but there will be a quick run up prior. Good metrics, price-to-earnings ratio is relatively": 0.6,
  "Google teams with Meta’s PyTorch to chip away at Nvidia’s moat, Reuters says": 0.2,
  "Netflix Stock Climbs on Fresh Warner Bros. Takeover Reports": 0.8,
  "My Surprising Top \"Magnificent Seven\" Stock Pick for 2026": 0.5,
  "Micron's Make-or-Break Moment: Can AI Hype Justify a 176% Surge?": 0.5,
  "What's next for META? - Three years ago I purchased META. After two rounds of increases, it now accounts for nearly 24% of my portfolio. It's been rebounding these past few days, and I'm wondering if this is a good time to gradually sell off some shares, or if I should continue holding and wait for it to break new highs.": 0.2,
  "Oracle stock dips 6% on report Blue Owl Capital won’t back $10 billion data center - * Oracle stock slid after a report that Blue Owl Capital won’t back a $10 billion data center for OpenAI. * The cloud company later said that the project remains “on schedule” but that Blue Owl was out of funding talks. * Oracle has $248 billion in lease commitments for data centers and cloud capacity commitments over the next": -0.6,
  "Services Rides on Apple TV and Arcade: What's Ahead for Apple Stock?": 0.2,
  "Brawls, Raids, and Layoffs: Inside PDD's Explosive Clash with Regulators": -0.7,
  "Warner Bros accuses Paramount of misleading investors as it rejects $108bn bid": -0.8,
  "Top Midday Stories: Warner Bros. Board Maintains Support of Netflix Offer; Amazon Reportedly in Talks to Invest $10 Billion in OpenAI": 0.5,
  "Is Robinhood going to cannibalize it's self with it's massive push with betting? - If you're an investor with Hood you know the whole prediction markets/betting has been a surge for the stock so far this year. The price has jumped up and the annualized revenue rate looks encouraging so far. With Hood's large user base it is positioning itself as a power fintech player. But I can't help to think that this might not": -0.5,
  "China's MetaX IPO Soars 700%, Threatening Nvidia and AMD Dominance": 0.5,
  "China's $6.5B Chip Shock: Ex-AMD Exec's Startup Skyrockets 755% in Market Frenzy": 0.8,
  "Airbnb Seen as 'Attractive' Brand Monetization Story, RBC Says": 0.6,
  "What to know about bidding war between Netflix and Paramount for Warner Bros.": 0.2,
  "Michael Saylor Says Quantum Computing Will Strengthen Bitcoin": 0.5,
  "Meta Rolls Out Cross-App Age Verification System to Address Child Safety Rules": 0.6,
  "Crypto stocks pare gains as bitcoin retreats from $90,000 rally": -0.5,
  "Apple Plans Major iPhone Expansion as Global Sales Accelerate": 0.8,
  "AppLovin Seen as Dominant in Mobile Ads as Wedbush Highlights Unity's Turnaround": 0.6,
  "Fortinet Gets J.P. Morgan Downgrade on Rising Competition": -0.5,
  "This BlackRock ETF Could Soar 24,000%, According to Billionaire Michael Saylor": 0.8,
  "Why Affirm Jumped 12% Yesterday — Does the Rally Have Legs?": 0.5,
  "Here's Why You Should Hold DexCom Stock in Your Portfolio for Now": 0.5,
  "Comcast (CMCSA) Grows 5% on Connecticut Expansion": 0.6,
  "All You Need to Know About Cognizant (CTSH) Rating Upgrade to Buy": 0.6,
  "What kind of portfolio can handle the current market? - I’ve only recently registered on Reddit, and I’m here for one thing to improve my investment portfolio. If you think there are any good options that could be part of my portfolio, I’d really appreciate your suggestions. My current long term stocks are NVDA, META, and LLY": 0.5,
  "GEHC Expands Healthcare Access Through Indonesia MoH Partnership Deal": 0.5,
  "A Subpar Year for Software Stocks. 3 Charts Point to a Turnaround.": 0.5,
  "AppLovin Continues to Lead in Mobile Game Advertising, Unity Software Stabilizes, Wedbush Says": 0.5,
  "Warner Bros. Board Poised to Back Netflix as Paramount's $108 Billion Bid Falters": 0.5,
  "Assessing American Electric Power After Its Strong 2024 Rally and Dividend Outlook": 0.5,
  "ALAB Benefits From Strong Connectivity Demand: A Sign for More Upside?": 0.6,
  "Paychex Gears Up to Report Q2 Earnings: What's in Store?": 0.2,
  "Why is Oracle, Nvidia, and Coreweave dropping is this due to the AI Bubble popping? I’m really scared about all of this - The recent drops in Oracle, Nvidia, and CoreWeave is so freaking scary. What is happening right now is more accurately described as a market correction driven by shifting expectations. AI is junk right now under current tech. Investors who previously pushed AI-related stocks higher based on future potential are now demanding clearer,": -0.6,
  "Shares of Chinese chipmaker MetaX soar nearly 700% in blockbuster Shanghai debut - Shares of Chinese chipmaker MetaX Integrated Circuits soared nearly 700% in their market debut in Shanghai on Wednesday, after the company raised nearly $600 million in its initial public offering. Shares, which were priced at 104.66 yuan in the IPO, closed at 829 yuan on debut, marking a 692% jump. Similar to Moore Threads, which saw a robust debut at the start": 0.8,
  "Jim Cramer on Netflix (NFLX)’s Potential Deal With Warner Bros.: “They Don’t Need That”": -0.5,
  "The Case for Sending Nvidia’s Chips to China - ‘Leadership is about controlling the platform on which others build, not hoarding end products,’ writes Aaron Ginn. Your editorial “Trump Says Chips Ahoy to Xi Jinping” (Dec. 11) asks why the president would allow Nvidia to sell advanced chips to China, as if the choice were between guarding a fortress and handing over the keys. The question instead is whether we benefit from forcing Beijing to": 0.2,
  "Oracle, Google CEO Sundar Pichai, Cognizant, and Figma Lead Top Honors as AI Cloud, Model Innovation, and Autonomous Apps Dominate Constellation Research's 2025 Enterprise Awards": 0.6,
  "Nasdaq Slides. Why AI Stocks Are Falling Again.": -0.5,
  "Jim Cramer Says T-Mobile (TMUS) Is “Part of the Musk Radiation Zone”": -0.5,
  "Oracle stock sinks as reported AI data center snag puts rising debt in focus": -0.6,
  "3 Growth Companies With High Insider Ownership And 13% Revenue Growth": 0.6,
  "Jim Cramer on Costco (COST): “I Didn’t Like Everything I Heard”": -0.5,
  "December 2025's Top Stocks Estimated Below Intrinsic Value": 0.2,
  "Exploring Three High Growth Tech Stocks In The US Market": 0.5,
  "Stock Market Today: Oracle Credit Controversy Causes Tech Selloff, Sending Nasdaq and S&P 500 Spiraling": -0.8,
  "IRS Takes a New Shot at Meta’s Foreign Tax Strategy": -0.5,
  "JOYY - I LOVE cash rich stock - From catalyst standpoint, the company is a cash rich tech company trading near net cash, JOYY is returning capital via dividends and buybacks. IOS/market expectations: Ad growth, third party demand or IOS expansion can be a short term sentiment drivers. The disconnection between their fundamentals and price action is interesting. Liquidity is also solid, the stock show their ability to make quick muilti day moves when the": 0.6,
  "Cognizant Stock Rallies on Strong AI Push, Expanding Clientele": 0.8,
  "The AI Power Trade Is Getting Tricky. Stocks to Consider in 2026.": 0.2,
  "2025 Was a Defining Year for Palantir. Here Are 3 Takeaways Investors Must Know Before Entering 2026.": 0.5,
  "Republican lawmakers decry Intel's testing of Chinese-linked tools after Reuters report": -0.5,
  "Assessing Xcel Energy’s Valuation After Recent Pullback and Grid Modernization Push": 0.5,
  "Conduit Power to Develop 200 MW of Distributed Generation in ERCOT; Secures Diamondback Energy and Granite Ridge Resources as Financial Partners": 0.5,
  "If Amazon's $10 billion investment partnership with OpenAI materializes, OpenAI's valuation will exceed $500 billion. - If this agreement is finalized, is now a good time to increase holdings? The new core agreement deepens last month's $38 billion/7 year cloud services deal, incorporating OpenAI's adoption of Amazon's proprietary Trainium AI chips. Both parties will also explore collaboration in e-commerce which, admittedly, was within my expectations. For both parties, OpenAI can alleviate over $100 billion in": 0.8,
  "Oracle denies report, says data center funding is on track": 0.5,
  "Chip Leader Rides AI Boom Wave; Stock Vaults 62%": 0.5,
  "Warner Bros. Urges Shareholders to Reject Paramount Bid. Netflix Stock Is Rising.": 0.5,
  "Amazon shakes up AI team as veteran Prasad leaves, DeSantis promoted": 0.2,
  "Amazon taps veteran Peter DeSantis to lead AI, chip and quantum push": 0.5,
  "Amazon Names New AI Chief Amid Battle to Take on Tech Rivals": 0.5,
  "Investors Love Warren Buffett, So Why Aren’t They Listening to His Warning?": 0.5,
  "Warner Bros. Discovery advises shareholders to reject Paramount’s offer. But the battle isn’t over": 0.1,
  "Siemens unveils lineup for CES 2026 keynote": 0.2,
  "MicroStrategy Gets to Stay in the Nasdaq-100. Does It Deserve to Stay in Your Portfolio Too?": 0.5,
  "Sector Update: Tech Stocks Fall Wednesday Afternoon": -0.5,
  "Honeywell (HON) Positioned for Earnings Momentum Into FY26, Says Evercore": 0.6,
  "Affirm Stock Is Popping on News of Amazon Contract Renewal. How Much Higher Can AFRM Go?": 0.6,
  "Sector Update: Consumer Stocks Mixed Wednesday Afternoon": 0.0,
  "Gold Hits Record as Bitcoin, AI Stocks Slide": -0.5,
  "Airbnb Passed, Expedia Pounced: Inside Tiqets’ Long Road to a Sale: Scoop": 0.2,
  "T-Mobile rolls out a free perk for loyal customers": 0.8,
  "Equity Markets Fall Intraday as Tech Sector Slides": -0.7,
  "Does AEP’s US$72 Billion Grid Expansion And Data Center Focus Change The Bull Case For AEP?": 0.2,
  "Has Analog Devices’ 110% Five Year Surge Left Much Upside at $278?": 0.2,
  "Technology Sell-Off Pushes US Equity Indexes Lower": -0.5,
  "Nebius is a steal at this price, change my mind - I’m currently averaged at $96 on Nebius and I definitely wish I’d waited a bit longer to build my position. At these levels though, I genuinely think the stock is massively undervalued. A lot of the recent decline feels driven by bad sentiment driven by bad sentiment and a broader sell off after Oracle’s earnings. At current pricing, this looks like one of the": 0.8,
  "HSBC Turns More Bullish on Amgen (AMGN) into 2026": 0.6,
  "Netflix co-CEO faces the $100 billion question: ‘Why are you doing this deal?’": -0.5,
  "Amazon Names New AI Group Leader Amid Battle With Microsoft, Google": 0.1,
  "CEO of Roomba maker iRobot says previous management was ‘in denial’": -0.6,
  "ASML stock dips 6% as Reuters reports that China has EUV technology - [https://www.reuters.com/world/china/how-china-built-its-manhattan-project-rival-west-ai-chips-2025-12-17/](https://www.reuters.com/world/china/how-china-built-its-manhattan-project-rival-west-ai-chips-2025-12-17/) In a high-security Shenzhen laboratory, Chinese scientists have built what Washington has spent years trying to prevent: a prototype of a machine capable of producing the cutting-edge semiconductor chips that power [artificial intelligence](https://tech.yahoo.com/ai/), [smartphones](https://tech.yahoo.com/phones/) and weapons central to Western military dominance, Reuters has learned.": -0.8,
  "Beneficial Weather in West Africa Weighs on Cocoa Prices": -0.7,
  "Want Decades of Passive Income? Buy This ETF and Hold It Forever.": 0.5,
  "ChatGPT Thinks AMD Stock Will Close At This Price By The End of 2025": 0.2,
  "AI-Development Spending Is Huge. Why Few Organizations Are Using It.": -0.5,
  "TopDawg Joins the Amazon Service Provider Network with New U.S. Dropshipping Integration": 0.5,
  "Dear BlackBerry Stock Fans, Mark Your Calendars for December 18": 0.5,
  "Should You Buy Palantir Before a Potential Stock Split?": 0.2,
  "ChatGPT Thinks Datadog Stock Will Close At This Price By The End of 2025": 0.2,
  "Social Media Victims Law Center Lawsuit Alleges Meta Prioritized Engagement Over Child Safety in Instagram Sextortion Deaths": -0.8,
  "ChatGPT Thinks Broadcom Stock Will Close At This Price By The End of 2025": 0.2,
  "Is Softbank stable against devaluation of their assets? - I have been trying to dig through Softbank's balance sheet, but for me this is rather opaque, so would be happy if someone could shed light on the real risk here. Looking at the annual report (I disclaim that I might make errors copying), on the 25th of March they had (page 102): 45 trillion yen in assets, 31 trillion yen in liabilities. Now, in other": -0.5,
  "Experts say Amazon is playing the long game with its potential $10 billion OpenAI deal: ‘ChatGPT is still seen as the Kleenex of AI’": 0.5,
  "ChatGPT Thinks Palantir Stock Will Close At This Price In The Next 60 Days": 0.2,
  "3 AI Stocks Showing Strong Momentum Heading Into 2026": 0.8,
  "Comcast to Host Fourth Quarter and Full Year 2025 Earnings Conference Call": 0.0,
  "ChatGPT Thinks CrowdStrike Stock Will Close At This Price In The Next 60 Days": 0.2,
  "NORWEGIAN CRUISE LINE® UNVEILS SUN-SOAKED WINTER 2027/28 DEPLOYMENT AND BRINGS BACK FREE AT SEA PLUS™ BY POPULAR DEMAND DELIVERING PREMIUM OFFERINGS": 0.6,
  "Axon Enterprise (AXON): Revisiting Valuation After Prepared Acquisition and Strong Public-Safety Growth Narrative": 0.6,
  "How Recent Developments Are Reshaping The CSX Investment Story": 0.5,
  "AI stocks slide as $10bn data centre funding falls through": -0.8,
  "Strategy Inc (MSTR) Sees Fresh Action From Analysts": 0.2,
  "Better AI Stock: ASML vs. Nvidia": 0.5,
  "Xcel Energy Inc. Board Declares Dividend on Common Stock": 0.5,
  "Global stocks have out performed the S&P nearly 2-fold in 2025 - According to Stoculator: For VEU: If you have Invested **$1,000** in **Vanguard FTSE All-World ex-US Index Fund** on **January 01, 2025** you would now have: $1296.14 For SPY: If you have Invested **$1,000** in **SPDR S&P 500 ETF Trust** on **January 01, 2025** you would now have: $1160.05 When you reprice in dollars you notice this trend. In light of today's downturn, are": 0.5,
  "Why Alphabet (GOOGL) Shares Are Falling Today": -0.5,
  "Why Paramount (PSKY) Stock Is Falling Today": -0.5,
  "Thoughts on Chinese EV companies or Chinese EV battery companies? - What is the general consensus right now of investing in Chinese EV companies? I have been watching BYD and XPeng and they look promising but I am aware of the huge competition in this this industry in China which makes me think profit margins could be squeezed and all these companies are fighting over who can sell the cheapest car. Does BYD look the": -0.5,
  "Upland Software, Palantir Technologies, Zeta Global, Qualys, and C3.ai Stocks Trade Down, What You Need To Know": -0.5,
  "NVIDIA (NVDA) has fallen more than 20% over the past 45 days. Is it truly “overvalued,” or is this merely a price re-evaluation? - Over the past 45 days, Nvidia's stock price has dropped more than 20%. Suddenly, everyone is saying it's “clearly overvalued.” But the real question is: Is this truly a valuation issue? Or is the market simply recalibrating expectations after a significant rally? I want to hear genuine perspectives, not hindsight analysis.": 0.2,
  "China killed $IRBT, without import restrictions it would kill $TSLA, what makes you think China won't kill US AI companies in the future? - IRobot lost a near monopoly on robot vacuums in a span of 5 years, to Chinese companies like Roborock, Ecovacs and Dreame. They were out innovated, out iterated, and despite lower prices consumers chose Chinese vacuum robots. We're seeing Chinese cars come to the forefront as well, Xiaomi, BYD, XPeng, NIO": -0.8,
  "How to trade cash-secured puts: Options playbook": 0.0,
  "US Equity Indexes Head Lower Amid Sell-Off in Technology": -0.7,
  "T-Mobile to Host Capital Markets Day Update as Part of its Q4 and Full Year 2025 Earnings Call, Now on February 11, 2026": 0.0,
  "Stock market today: Dow, S&P 500, Nasdaq sink as Oracle stock gets hit over AI funding worries": -0.6,
  "Bank of America sets AI stocks to buy list for 2026": 0.5,
  "Xcel Energy Elects Maria Demaree to Board of Directors": 0.5,
  "Warner Bros. chose Netflix over Paramount — again. Now what?": 0.1,
  "This Tech Play Smokes Google, Nvidia, And All Mag 7 Stocks Year To Date": 0.6,
  "Evaluating Qualcomm (QCOM)’s Valuation After Its Recent Multi-Month Share Price Gains": 0.5,
  "Postal service plans to open last-mile delivery network to more shippers in money-raising move": 0.5,
  "Micron pops as Q1 results, guidance blow past estimates - Micron Technology (MU) shares rose over 6% in after hours trading on Wednesday after the memory chipmaker reported first quarter fiscal results and guidance that significantly exceeded Wall Street expectations. For the fiscal quarter ending 27 November, Micron posted adjusted earnings per share of $4.78, with revenue surging 57% year on year to $14.34 billion. Adjusted operating profit reached $6.42 billion, while cash flow from": 0.8,
  "TE Connectivity declares quarterly dividend": 0.0,
  "Micron stock pops after blowing past Q1, guidance estimates": 0.8,
  "3 Best Tech ETF Picks for 2026": 0.5,
  "Warner Bros. Discovery Rejects Paramount's $108 Billion Bid. Here's One Reason Why.": -0.5,
  "Top Analyst Reports for Alphabet, Tesla & Sony": 0.0,
  "Rocket Lab Schedules 20th Launch of 2025": 0.5,
  "Tech Slide Weighs on Nasdaq; Oil Prices Gain": -0.2,
  "Tesla Stock Is Diving. It Isn’t Because of California.": -0.5,
  "ProsperOps Achieves Microsoft Azure IP Co-Sell Status": 0.5,
  "Apple Seen Moving From AI Laggard To Leader In 2026": 0.8,
  "These Stocks Moved the Most Today: Tesla, Paramount Skydance, Medline, Oracle, Lennar, Micron, Hut 8, and More": 0.0,
  "Micron Q1 Preview: Record Quarter Predicted By Analyst — 'We Recommend Owning The Stock'": 0.8,
  "Where do I vote for the Warner Bros. Discovery and Paramount vs. Netflix deal? - I've tried to follow information about the voting process that was supposed to happen but I still can't find any information. Where or how would I vote for Netflix or Paramount as a shareholder of Warner Bros. Discovery? Warner Bros. Discovery board doesn't seem to want to share that info out of respect for the Netflix deal, but a voting": -0.5,
  "Waymo Is Raising $15B. Why Tesla Has the Robo-Taxi Advantage.": 0.2,
  "Oscars Will Move to YouTube Starting in 2029": 0.2,
  "Who matters in the battle for Warner Bros?": 0.0,
  "Prediction: These 2 AI Darlings Will Be Worth $5 Trillion or More in 2026": 0.8,
  "Palantir, IBD Stock Of The Day, Forging Lower Buy Point After December Gains": 0.5,
  "Micron Technology Beats First-Quarter Views as Cloud Memory Revenue Doubles": 0.8,
  "Bitcoin Slides As Strategy's Buying Power Runs Low On Fuel": -0.5,
  "US Equity Indexes Slump as Oracle's Sell-Off Knocks Out Technology": -0.6,
  "Salesforce and Other AI Stocks That Can Catch Up to the Pack": 0.5,
  "Why Tesla Stock Sank 4.6% Today": -0.6,
  "Nasdaq tumbles on renewed angst over AI building boom": -0.6,
  "A Surprising Automaker Aims to Challenge Tesla -- Is It a Real Threat or Just Noise?": 0.2,
  "Stock Market Today: Nasdaq, S&P 500 Close Below Critical Levels; Oracle, Other AI Players Sell Off (Live Coverage)": -0.6,
  "How many different stocks do you own? How many is too many? - I have meta, nvdia, netflix, reddit, microsoft, and google. I have limit order on spotify as well. I'm not sure if this is too much, especially with all of them (minus netflix) being tech related? majority of money is in VOO & QQQ then Nvdia & Meta. The other stocks are a few shares (5-10). I'm new to stocks so excuse the": -0.2,
  "Micron shares surge amid sharply higher revenue forecasts on AI-led memory demand": 0.8,
  "Micron Crushes Earnings. The Stock Is Rising.": 0.8,
  "Tech, Media & Telecom Roundup: Market Talk": 0.0,
  "DoorDash Launches Grocery Shopping App Within ChatGPT": 0.2,
  "Nasdaq Composite Logs Worst Day in Nearly 4 Weeks Amid Tech Selloff": -0.7,
  "Is Alphabet Still Attractive After Its Strong 2025 Rally and AI Growth Push?": 0.5,
  "American Electric Power (AEP): Reassessing Valuation After a Recent Pause in Share Price Momentum": 0.2,
  "Amgen (AMGN) Valuation Check After FDA Expansion of UPLIZNA in Generalized Myasthenia Gravis": 0.5,
  "HSBC Downgrades Biogen Inc. (BIIB) to Reduce Despite Pipeline Progress": -0.5,
  "Micron (MU) Q1 Earnings and Revenues Top Estimates": 0.8,
  "Micron Gives Upbeat Forecast Amid AI Boom": 0.8,
  "AI-Themed Stocks Take More Hits, Sending Nasdaq Lower": -0.5,
  "Crypto is officially on the holiday shopping list, new survey shows": 0.5,
  "Stock Market Today, Dec. 17: Tesla Shares Fall After California Moves to Restrict Autopilot Branding": -0.6,
  "The 5 biggest brand moments from 2025 investors couldn't ignore": 0.5,
  "Not All AI Stocks Are Falling These Days. Micron Is Rising on Strong Earnings": 0.6,
  "Elon Musk is worth a record $648 billion — and his wealth gain this year exceeds Bernard Arnault's entire fortune": 0.5,
  "Stock Market Today, Dec. 17: AI Concentration Fears Weigh on Markets": -0.6,
  "Stock Market Today, Dec. 17: Broadcom Drops on  China AI Chip Breakthrough and AI Buildout Uncertainty": -0.6,
  "Saylor hints at potential Morgan Stanley partnership amid delisting fiasco": 0.5,
  "Heard on the Street Recap: Another AI Selloff": -0.5,
  "Electricity Auction Highlights Soaring Prices, Reliability Worries": -0.6,
  "Why Micron Stock Is Soaring in After-Hours Trading": 0.8,
  "Tesla (TSLA) Dips More Than Broader Market: What You Should Know": -0.5,
  "Why Alphabet Inc. (GOOG) Dipped More Than Broader Market Today": -0.5,
  "Alphabet (GOOGL) Falls More Steeply Than Broader Market: What Investors Need to Know": -0.5,
  "Intel (INTC) Dips More Than Broader Market: What You Should Know": -0.5,
  "Stocks to Watch Wednesday Recap: Netflix, Paramount, Micron, Lennar": 0.0,
  "Prediction: This AI Stock Could Be the Next $4 Trillion Company in 2026": 0.8,
  "Texas Instruments (TXN) Declines More Than Market: Some Information for Investors": -0.5,
  "Vertex Pharmaceuticals (VRTX) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Why the Market Dipped But Comcast (CMCSA) Gained Today": 0.2,
  "Gilead Sciences (GILD) Increases Despite Market Slip: Here's What You Need to Know": 0.5,
  "ON Semiconductor Corp. (ON) Suffers a Larger Drop Than the General Market: Key Insights": -0.5,
  "KLA (KLAC) Dips More Than Broader Market: What You Should Know": -0.2,
  "Micron Logs Sales Jump, Sees Further Growth as AI Demand Outpaces Supply": 0.6,
  "Apple TV adds key feature Netflix dropped": 0.5,
  "Stock market today: Dow, S&P 500, Nasdaq futures rise as Micron boosts tech after sell-off, CPI report looms": 0.5,
  "Micron (MU) Q1 2026 Earnings Call Transcript": 0.0,
  "Markets Sell Off -0.5% to -1.8% Ahead of Inflation Rate Thursday": -0.7,
  "The Bull Case For Applied Materials (AMAT) Could Change Following Steady Dividend Amid AI Weakness": 0.5,
  "Here's Why NXP Semiconductors (NXPI) Fell More Than Broader Market": -0.5,
  "Could This AI Chip Stock Make a Major Comeback by the End of the Year?": 0.5,
  "$ADBE is undervalued.. like a lot - Adobe operates with nearly 90% gross margins very little debt - the company could pay off all of its debt with just one year of free cash flow revenue growth of around 10–11% a year trading roughly 50% below its all-time highs despite said growth The AI threat is just overstated, with nearly all professionals using their service Am I missing something?": 0.8,
  "Micron (MU) Reports Q1 Earnings: What Key Metrics Have to Say": 0.2,
  "Stock Market Today, Dec. 17: Comcast Jumps Again on Activist Investor Buzz and Versant Spinoff": 0.5,
  "DoorDash Teams Up With OpenAI to Offer Grocery Shopping in ChatGPT": 0.5,
  "Nvidia’s China chip problem isn’t what most investors think": 0.1,
  "SK hynix First to Complete Intel Data Center Certification for 32Gb Die-based 256GB Server DDR5 RDIMM": 0.5,
  "Bupa Hong Kong has selected Cognizant to deliver an AI-driven BPaaS solution to transform health insurance claims": 0.6,
  "How Tesla stock has more than doubled to a fresh record high after a brutal bear market": 0.8,
  "Carvana Stock/Business Future - Well at least the near future anyway.. Carvana’s business is going in the garbage. That’s coming from a share holder and a customer 3 times. I’ve referred them to a few friends and my son as well and it’s getting extremely bad. In the beginning I bought a car for my wife, I was laid up from surgery and I wanted to suprise her with a vehicle. I did everything from": -0.6,
  "Exclusive-Amazon, Walmart shareholder pushes firms to report impact of Trump's immigration policies": 0.1,
  "Looking at the Changing Narrative for Shopify After Q3 Earnings and New AI Partnerships": 0.5,
  "How Indonesia’s SIHREN CT Deal And New Financing At GEHC Have Changed Its Investment Story": 0.5,
  "Biogen (BIIB): Reassessing Valuation After a Recent 3-Month Share Price Rebound": 0.5,
  "Bill Gates, Ken Fisher Rake In $1.7 Billion From Dow Stock That Trounced Nvidia": 0.5,
  "Elliott Builds Over $1 Billion Stake in Lululemon": 0.5,
  "I'm looking for a app/site that tracks my portfolio on a third monitor - Pretty much the title. I was hoping someone knew about an app or a site that would show my portfolio in a typical stock graph format that I could put on my third monitor to look at during the day. I don't mind paying or doing manual entry. I'm using multiple platforms and want to consolidate it and not worry about": 0.2,
  "Apple announces changes to iOS in Japan": 0.0,
  "Ubitus Receives Major METI Investment Grant, Investing JPY 17 Billion to Build Japan’s Top AI GPU Center": 0.8,
  "Fortinet’s AI Data Center Partnerships Versus J.P. Morgan Downgrade Might Change The Case For Investing In Fortinet (FTNT)": 0.2,
  "Does Tencent’s AI Reshuffle And New Nvidia Access Change The Bull Case For Tencent (SEHK:700)?": 0.2,
  "Alphabet's $100 Billion War Chest Vs. Oracle's Debt Spiral: The AI Arms Race Hits Wall Street": 0.5,
  "AI fuels blue-collar productivity boom across manufacturing, Palantir technology chief tells Fox Business": 0.6,
  "Alerts, story withdrawn after Nvidia says Fox Business interview with Huang was last month": -0.5,
  "Fermi denies report that Amazon was prospective tenant in stalled project": 0.1,
  "Prediction: These 2 Stocks Will Be the First to Join the $5 Trillion Market Cap Club in 2026": 0.5,
  "Warner Demands Larry Ellison’s Personal Guarantee in Paramount Bid": -0.5,
  "Costco sees major shift in member behavior": 0.5,
  "Does Gilead Still Offer Value After Its 2025 Surge and Pipeline Progress?": 0.2,
  "Looking at the Narrative for GE HealthCare as Margin Execution and Tech Upside Reshape Expectations": 0.5,
  "3 Reasons to Buy Costco Stock Like There's No Tomorrow": 0.6,
  "Nvidia Vs. Alphabet: Which Could Be The World's Biggest Company By End-2026?": 0.5,
  "KIOXIA SSDs Achieve Compatibility with Microchip’s Adaptec® SmartRAID 4300 Series RAID Storage Accelerator": 0.5,
  "What’s the best lesson you have learned in 2025? - As we near the end of 2025, I’ve been thinking a lot about how this year has played out for me as an investor. Between the ups and downs of the AI hype cycle, the volatility in crypto, and the broader market swings, I’ve had to adjust my strategy more than once. If I had to pick one lesson that stood out, it would be": 0.2,
  "Earnings To Watch: Paychex (PAYX) Reports Q4 Results Tomorrow": 0.2,
  "Is T-Mobile (TMUS) Undervalued After Recent Share Price Weakness? A Closer Look at Its Valuation": 0.5,
  "Asia Market Open: Bitcoin Edges Lower As Asia Follows Wall Street’s Tech Rout": -0.5,
  "2 Dirt Cheap Stocks to Buy With $1,000 Right Now": 0.5,
  "Billionaire Investor Adds To Nvidia Position As AI Conviction Builds": 0.8,
  "I think there is a major effort to artificially influence USAR stock to realize a short position - Multiple platforms that are giving a negative outlook seem to carry a party line the new deal with a Korean zinc processor and production company somehow affects USAR and its main interest the Round Top mine. But zinc is only a minor piece in the 17 rare earth elements that make up its ore deposits. From what": -0.6,
  "2 Artificial Intelligence (AI) Stocks That Could Soon Join the $1 Trillion Club": 0.5,
  "Dow Jones Futures: Micron Jumps On Earnings After Oracle Leads AI Stock Sell-Off": 0.5,
  "What Are 3 of the Best AI Stocks to Hold for the Next 10 Years?": 0.5,
  "Is Microsoft (MSFT) Fairly Valued After Its Recent 6% Pullback?": 0.2,
  "Gilead Sciences (GILD) Valuation After Positive Phase 3 Data for Its Bictegravir–Lenacapavir HIV Regimen": 0.6,
  "Micron Technology (MU) Is Down 12.7% After Record AI-Driven Earnings and Bullish Revenue Guidance - What's Changed": 0.2,
  "3 Ultra-Safe Vanguard ETFs to Buy, Even if There's a Stock Market Sell-Off in 2026": 0.5,
  "AP Top Financial News at 1:48 a.m. EST": 0.0,
  "Micron Technology Inc (MU) Q1 2026 Earnings Call Highlights: Record Revenue and Strong Growth ...": 0.8,
  "From “I finally get options” to “I donated $55k to the market” in one year - Alright, story time. I’m not a trader. Never have been. I’m that boring long-term investor who buys strong companies with real fundamentals when they’re trading at a discount, then just… sits there… like a fossil… and watches compounding do its thing. My style is: • Find great businesses (especially tech / AI / “the future is now” stuff) •": 0.6,
  "What would you do in this situation? - Long story short I'm about to come into about 15k USD I dont want to stick it in an index fund because to be honest that's just boring and the gains will be minimal, I want to play around with it but also dont want to do ultra risky things like daytrade with it I was thinking of using it to sell cash secured puts/covered calls on": 0.2,
  "Is Lululemon’s Rebounding Share Price Now Aligned With Its Fundamentals in 2025?": 0.2,
  "Broadcom Has Beaten the Market for 6 Straight Years. Can It Continue to Outperform in 2026?": 0.6,
  "Nebius Group (NBIS) and Former Bitcoin Miners Initiated as Key AI/HPC Power Providers by JMP, Poised for Value Unlock Amid Scarcity and Strong GPU Cluster Pricing": 0.6,
  "Stifel Expects Meaningful Upside for Micron (MU) Results and Guidance Driven by Stronger AI Demand and Memory Price Rally": 0.8,
  "Broadcom (AVGO) Soars Past Expectations with Blockbuster Results, Forecasts $8.2B AI Revenue Driven by XPUs and Networking": 0.8,
  "Nvidia’s (NVDA) AI Dominance Faces Headwinds from Project Volatility, Gaming Cycles, and Power Concerns": -0.6,
  "JPMorgan Bullish on ‘MAG7’ Tech Group, Expects Strong Revenue Growth for Internet Sector in 2026": 0.8,
  "Is Amazon.com (AMZN) One of the Top AI and Technology Stocks to Buy According to Hedge Funds?": 0.5,
  "Microsoft (MSFT) Pledges to Invest $17.5 billion in AI and Cloud Computing in India": 0.8,
  "TD Cowen Maintains Buy Rating on Meta Platforms (META) Stock": 0.6,
  "Alphabet (GOOGL)’s Google Signs a Solar Power Agreement in Malaysia, Reports Bloomberg": 0.5,
  "NVIDIA (NVDA) Evaluates Adding Production Capacity for Powerful H200 AI Chips": 0.5,
  "Broadcom (AVGO) Posts Financial Results for Q4 2025 and FY 2025": 0.2,
  "Evercore ISI Raises PT on Apple (AAPL) Stock": 0.5,
  "Oracle (ORCL) Announces Q2 2026 Financial Results": 0.0,
  "Benchmark Raises PT on AppLovin (APP) Stock": 0.5,
  "Walmart and 2 More American Icons Are About to Get New Leadership. Trust the Process.": 0.5,
  "Analysts Reaffirm Buy Ratings on Amazon.com, Inc. (AMZN) with Price Targets up to $300": 0.8,
  "UBS Asserts Buy Stance on NVIDIA Corporation (NVDA) Despite China H200 Chips Demand Concerns": 0.5,
  "Citizens Touts Alphabet Inc. (GOOGL) Waymo’s Technology Licensing Push as Truist Securities Echoes Ad Revenue Growth": 0.2,
  "Meta Platforms, Inc. (META) Boasts Significant Upside Potential Despite Morgan Stanley Price Target Cut": 0.8,
  "Is Microsoft Corporation (MSFT) One of Billionaire David Tepper’s Top Stock Picks Heading into 2026?": 0.2,
  "PDD Holdings Inc. (PDD) is a Buy on Robust Temu Business and Europe Growth": 0.6,
  "Citizens Downplays Waymo and Tesla Competition Pressure on Uber Technologies, Inc. (UBER), Asserts Market Perform Stance": 0.2,
  "What defensive stocks are best setup to benefit from a rising conflict with Venezuela? - Please let me know what y’all think about this announcement by Trump on the Venezuela situation tomorrow; as I am not well versed in the defense sector. I am currently looking at RCAT and LMT, but is it more worth it to look at oil? Or is defense easier to navigate in this type of event?": 0.2,
  "With all the bubble talk, here's some optimistic data - I'm not going to lie, I'm a little uneasy about this market. P/E ratio is high. Unemployment rate is rising. Stocks have been pretty weak in Q4. High beta stocks have gotten demolished. Buffet's cash pile is at an ATH. Aswath Damodaran is suggesting investors buy collectibles to diversify. The S&P has returned over 20% two years in a row followed by \\~15% so far": -0.5,
  "I don't know if this is the right flair, but I really feel there may be potential for big trouble in the background that's yet to been seen. - There are some signs that we could be near the peak. My worries are growing -today was a huge warning, right after Friday, and we still have not yet seen a serious drop be priced in. Meaning, it's not unlikely the small haha down days may": -0.8,
  "Undervalued Strong Bulls - Everyday i go through every ticker in the stock market on thinkorswim and I find the best charts that’s have solidly upward channels over 10 years and are on a current low point in that channel. They have to be predictable and set to move upwards in the near term to reach fair value in their historical channel. Here are by far the best. TROX just moved 32% up yesterday. This": 0.8
}