{
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On June 23, 2025, Zscaler, Inc. (the “ Company ”) announced the departure of Syam Nair, the Chief Technology Officer of the Company, with such departure to be effective on July 4, 2025. In connection with Mr. Nair’s departure, the Company expects Mr. Nair to receive certain benefits under the Company’s Change of Control and Severance Policy,": -0.5,
  "(ITEM 5.07) . Submission of Matters to a Vote of Security Holders On June 18, 2025 , Keurig Dr Pepper Inc. (the \"Company\") held its Annual Meeting of Stockholders. The matters voted upon at the Annual Meeting of Stockholders and the results are set forth below: Proposal 1: Election of Directors The Company's stockholders approved the election of the following directors to hold office for a one-year term and until their respective successors shall have been duly": 0.2,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. On June 17, 2025, Biogen Inc. (the “Company”) held its 2025 Annual Meeting of Stockholders (the “Annual Meeting”). The final voting results for the Annual Meeting are as follows: 1. Stockholders elected eleven nominees to the Board of Directors to serve for a one-year term extending until the 2026 annual meeting of stockholders and their successors are duly elected and qualified, with the votes cast as": 0.1,
  "Old Dominion Freight Line, Inc. (ODFL): A Bull Case Theory": 0.5,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers . Board of Directors On June 24, 2025, the Board of Directors (the “Board”) of PayPal Holdings, Inc. (the “Company”) appointed Deirdre Stanley as a new member of the Company’s Board, effective June 24, 2025. Ms. Stanley is the former Executive Vice President and General Counsel of The Estée Lauder Companies, Inc. Ms. Stanley fills a": 0.2,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On June 22, 2025, Elinor Mertz was appointed to the Board of Directors (the “Board”) of Netflix, Inc. (the “Company”) effective immediately, for a term expiring at the Company's 2026 annual meeting of stockholders, or until her earlier resignation or removal. Ms. Mertz was also appointed to serve on the Audit Committee of the Board (the “Audit\n\n(Item 5.02) .\n\n(Item 8.01) Other Events. As previously disclosed by the Company in a Current Report on Form 8-K filed with the Securities and Exchange Commission on June 6, 2025, Mr. Jay Hoag did not receive a majority of votes cast in his election to the Board, and in accordance with the Company’s director resignation policy, Mr. Hoag offered his resignation, conditioned upon Board acceptance. Pursuant to the Company’s director resignation policy, the Nominating and Governance Committee (the “Nominating": 0.1,
  "(Item 8.01) . Other Event On June 24, 2025, Warner Bros. Discovery, Inc. (the “Company”) issued a press release announcing the early participation results of the previously announced tender offers (the “Tender Offers”) by its wholly owned subsidiaries, Discovery Communications, LLC (“DCL”), WarnerMedia Holdings, Inc. (“WMH”), Warner Media, LLC (“WML”) and Historic TW, Inc. (together with DCL, WMH and WML, the “Issuers”), pursuant to which the Issuers offered to purchase for cash substantially all of their outstanding": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On June 25, 2025 , Micron Technology, Inc. (the \"Company\", \"we\" or \"our\") announced the financial results for our third quarter of fiscal 2025 ended May 29, 2025. The full text of the press release issued in connection with the announcement is attached as Exhibit 99.1 to this Current Report on Form 8-K. The information in\n\n(Item 2.02) and Exhibit 99.1 of this Current Report on Form 8-K shall not be deemed \"filed\" for the purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), or otherwise subject to the liabilities of that section. The information in\n\n(Item 2.02) and Exhibit 99.1 of this Current Report on Form 8-K shall not be incorporated by reference into any filing or other document pursuant to the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such filing or document.": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition On June 25, 2025, Paychex, Inc. (the \"Company\") issued a press release (the \"Press Release\") reporting its financial results for the three and twelve months ended May 31, 2025. A copy of the Press Release is attached as Exhibit 99.1 to this Current Report on Form 8-K. The information provided pursuant to this\n\n(Item 2.02) , including Exhibit 99.1, is being \"furnished\" herewith and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities under such section, nor shall the information be deemed to be incorporated by reference into any filing of the Company under the Securities Act of 1933, as amended, or the Exchange Act, except to the extent specifically provided": 0.0,
  "Are Medical Stocks Lagging  atai Life Sciences (ATAI) This Year?": 0.1,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders On June 24, 2025, DoorDash, Inc. (the “Company”) held its 2025 annual meeting of stockholders (the “Annual Meeting”). The stockholders of the Company voted on the following four proposals at the Annual Meeting, each of which is more fully described in the Company’s definitive proxy statement filed with the Securities and Exchange Commission on April 29, 2025: 1. To elect four Class II directors to serve": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On June 25, 2025, the Board of Directors (the “Board”) of Starbucks Corporation (the “Company”) increased the number of directors of the Company from nine to 11 and appointed Marissa Mayer and Dambisa F. Moyo to serve as directors on the Board, effective immediately. The Board expects to appoint Ms. Mayer and Dr. Moyo to one or": 0.1,
  "(Item 1.01) . Entry into a Material Definitive Agreement Bridge Loan Agreement On June 26, 2025, WarnerMedia Holdings, Inc. (“WMH”), a wholly-owned subsidiary of Warner Bros. Discovery, Inc. (the “Company”), entered into that certain Non-Investment Grade Leveraged Bridge Loan Agreement (the “Bridge Loan Agreement”) among WMH, as borrower, the Company, as parent guarantor, the lenders from time to time party thereto, and JPMorgan Chase Bank, N.A., as administrative agent and collateral agent, with respect to an 18-month\n\n(Item 1.01) of this Current Report on Form 8-K is incorporated by reference into this": 0.1,
  "Morning Movers: General Mills dips following fourth quarter report": -0.5,
  "Here's Why Paychex (PAYX) is a Strong Growth Stock": 0.8,
  "Here's Why Verisk Analytics (VRSK) is a Strong Growth Stock": 0.8,
  "Paychex (PAYX) Slashes 9.4% on Dismal Earnings": -0.8,
  "Paychex shares recoup a bit; CEO comments about economy; analysts weigh in": 0.2,
  "(Item 1.01) Entry into a Material Definitive Agreement. On June 27, 2025, Automatic Data Processing, Inc., a Delaware corporation (the “Company”), entered into a $4.55 billion 364-Day Credit Agreement (the “364-Day Facility”) and a $2.5 billion Five-Year Credit Agreement (the “Five-Year Facility,” and together with the 364-Day Facility, the “New Facilities”) with a group of lenders (the “Lenders”). The Five-Year Facility contains an accordion feature under which the aggregate commitment can be increased by $500 million to\n\n(Item 1.01) is hereby incorporated by reference into this": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On June 26, 2025, at the Annual Meeting of Stockholders (the “Annual Meeting”) of CoStar Group, Inc. (the “Company” or “our”), the stockholders of the Company, upon the recommendation of the Board of Directors of the Company (the “Board”), approved the CoStar Group, Inc. 2025 Stock Incentive Plan (the “2025 Plan”), which was approved by the\n\n(Item 5.07) . Submission of Matters to a Vote of Security Holders. The following items, which are more fully described in our Proxy Statement, were submitted to a vote of the stockholders of the Company at the Annual Meeting. The final voting results are as follows: 1. Each of the following nominees were elected to our Board to serve until the Company’s 2026 Annual Meeting of Stockholders or until his or her successor is elected and qualified:": 0.1,
  "With A Return On Equity Of 9.8%, Has Exelon Corporation's (NASDAQ:EXC) Management Done Well?": 0.4,
  "Jim Cramer Expresses Shock Over Paychex Stock’s 9% Decline": -0.7,
  "Old Dominion Freight Line, Inc. (NASDAQ:ODFL) institutional owners may be pleased with recent gains after 6.8% loss over the past year": 0.4,
  "(Item 1.01) Entry into a Material Definitive Agreement. Ross Stores, Inc. (the “Company”) entered into a new, senior unsecured revolving Credit Agreement (the “2025 Credit Facility”) on June 27, 2025 (the “Effective Date”) with the lenders named therein, providing the Company with up to $1.3 billion in borrowing availability, on terms and conditions as described below. Bank of America, N.A., is administrative agent, a swing line lender and a letter of credit issuer, and Wells Fargo Bank,": 0.1,
  "(Item 1.01) Entry into a Material Definitive Agreement. Fourth Supplemental Indenture On June 30, 2025, Marvell Technology, Inc. (the “Company”) completed a public offering of $500,000,000 aggregate principal amount of its 4.750% Senior Notes due 2030 (the “2030 Notes”) and $500,000,000 aggregate principal amount of its 5.450% Senior Notes due 2035 (the “2035 Notes” and, together with the 2030 Notes, the “Notes”). The Notes were offered and sold pursuant to the Company’s shelf registration statement on Form\n\n(Item 8.01) Other Events. The Notes were offered pursuant to an underwriting agreement, dated June 23, 2025 (the “Underwriting Agreement”), among the Company and J.P. Morgan Securities LLC, BofA Securities, Inc. and Wells Fargo Securities, LLC, as representatives of the several underwriters identified on Schedule 1 thereto (collectively, the “Underwriters”). The Company sold the 2030 Notes to the Underwriters at a price of 99.304% of the principal amount thereof, and the Underwriters offered the 2030 Notes to": 0.1,
  "(Item 8.01) . Other Events 2025 South Dakota Electric Rate Case On June 30, 2025, Northern States Power Company, a Minnesota corporation and a wholly owned subsidiary of Xcel Energy Inc. (“NSP-Minnesota”), filed a request with the South Dakota Public Utilities Commission for a net annual electric rate increase of $44 million (15%). The filing is based on a 2024 historic test year, a requested return on equity of 10.3%, rate base of approximately $1.2 billion and": 0.1,
  "Circle initiated, Disney upgraded: Wall Street's top analyst calls": 0.6,
  "Wall Street Set to Close Strong a Turbulent 1H 2025": 0.6,
  "Citi upgrades Linde on project wins and productivity gains": 0.6,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders. On June 25, 2025, at the 2025 Annual Meeting of Stockholders of NVIDIA Corporation, or the 2025 Annual Meeting, the following proposals were adopted or rejected by the margin indicated. 1. Stockholders approved the election of each of our thirteen (13) director nominees to hold office until the 2026 Annual Meeting of Stockholders of NVIDIA Corporation and until his or her successor is elected or": 0.1,
  "(Item 1.01) Entry into a Material Definitive Agreement On June 30, 2025, AppLovin Corporation (“AppLovin”) and Tripledot (“Purchaser Parent”) entered into an amendment (the “Amendment”) to that certain Purchase Agreement, dated as of May 7, 2025 by and among AppLovin, its subsidiaries Morocco, Inc. and AppLovin GmbH (collectively with AppLovin, the “Sellers”), Purchaser Parent, and its subsidiaries Eton Games, Inc. (“Eton”) and Tripledot Group Holdings Limited (collectively, with Purchaser Parent, the “Purchasers”), (as amended, the “Purchase Agreement”,\n\n(Item 8.01) Other Events On June 30, 2025, AppLovin and the Sellers completed the Closing under the Purchase Agreement. At Closing, AppLovin transferred the equity interests of certain of its wholly owned subsidiaries that are engaged in AppLovin’s mobile gaming business to the Purchasers for consideration consisting of (i) $400.0 million in cash consideration, subject to closing adjustments, and (ii) equity consideration comprised of ordinary shares of Purchaser Parent representing approximately 20% of the fully-diluted equity capitalization": 0.5,
  "3 Low-Volatility Stocks in Hot Water": -0.5,
  "What Makes Copart (CPRT) a Lucrative Investment?": 0.6,
  "Economic Data Deluge This Week": 0.2,
  "Can Gaming Become the Next Revenue Pillar for Netflix Stock?": 0.5,
  "How DexCom, Insulet, and Amedisys Might Be Affected by Medicare Cuts": -0.5,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On June 29, 2025, the independent members of the Board of Directors and the Compensation and Management Development Committee of Starbucks Corporation (the “Company”, “we”, or “our”) approved a “Back to Starbucks” grant of performance-based restricted stock units (“PRSUs”) for each of the Company’s continuing named executive officers. This equity award is 100% performance based, with targets": 0.2,
  "(Item 2.02) Results of Operations and Financial Condition. On July 2, 2025, Tesla, Inc. published the press release which is attached hereto as Exhibit 99.1 and is incorporated herein by reference. This information is intended to be furnished under\n\n(Item 2.02) of Form 8-K and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “ Exchange Act ”), or incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act as shall be expressly set forth by specific reference in such a filing .": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On June 27, 2025, the Board of Directors (the “ Board ”) of Advanced Micro Devices, Inc. (the “ Company ”) and the Compensation and Leadership Resources Committee of the Board (the “ Committee ”), as applicable, approved the following changes to the compensation of certain members of the Company’s executive team: Base Salary Increases Effective": 0.1,
  "(Item 8.01) – Other Events. On July 2, 2025, T-Mobile US, Inc. (the “Company”), together with T-Mobile USA, Inc., its wholly-owned subsidiary (“T-Mobile USA”), issued a press release announcing the extension of the Exchange Offers and Consent Solicitations (as defined below). The Exchange Offers and Consent Solicitations, which were previously scheduled to expire at 5:00 p.m., New York City time, on July 1, 2025, will now expire at 5:00 p.m., New York City time, on August 1,": 0.1,
  "Q1 Earnings Highs And Lows: Ross Stores (NASDAQ:ROST) Vs The Rest Of The Discount Retailer Stocks": 0.2,
  "What to Expect From CoStar Group's Q2 2025 Earnings Report": 0.0,
  "Apple upgraded, Adobe downgraded: Wall Street's top analyst calls": 0.2,
  "Will Verisk Analytics (VRSK) Benefit from Its Defensive Qualities?": 0.2,
  "ROST vs. DLTR: Which Retail-Discount Stock is the Better Buy Now?": 0.5,
  "3 Reasons Growth Investors Will Love DexCom (DXCM)": 0.5,
  "Equities Mostly Rise Intraday After US-Vietnam Trade Deal; Tesla Advances": 0.6,
  "Nasdaq, S&P 500 Notch New Record Highs Following US-Vietnam Deal; Tesla Rebounds": 0.8,
  "Diamondback Energy (FANG) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "(Item 1.01) Entry into a Material Definitive Agreement. Indenture and Notes On July 3, 2025, Zscaler, Inc. (“Zscaler” or the “Company”) issued an aggregate of $1.725 billion principal amount of its 0.00% Convertible Senior Notes due 2028 (the “Notes”) pursuant to an Indenture, dated July 3, 2025 (the “Indenture”), between Zscaler and U.S. Bank Trust Company, National Association, as trustee (the “Trustee”). The Notes will not bear regular interest and the principal amount of the Notes will\n\n(Item 1.01) of this Current Report on Form 8-K is incorporated herein by reference.\n\n(Item 1.01) of this Current Report on Form 8-K is incorporated herein by reference. The Notes were sold to the Initial Purchasers pursuant to the Purchase Agreement (as defined below) in reliance on the exemption from the registration requirements provided by Section 4(a)(2) of the Securities Act of 1933, as amended (the “Securities Act”) and the Notes were resold to persons reasonably believed to be qualified institutional buyers as defined in, and in reliance on, Rule 144A\n\n(Item 8.01) . Other Events. Purchase Agreement On June 30, 2025, Zscaler entered into a purchase agreement with Citigroup Global Markets Inc., Goldman Sachs & Co. LLC, Barclays Capital Inc., and Deutsche Bank Securities Inc., as representatives of the several initial purchasers named therein (the “Initial Purchasers”) (the “Purchase Agreement”), relating to the sale by Zscaler of the Notes to persons reasonably believed to be qualified institutional buyers pursuant to Rule 144A under the Securities Act. Zscaler": 0.1,
  "(Item 8.01) . Other Events. As previously reported, on May 23, 2025, the Bureau of Industry and Security (“BIS”), U.S. Department of Commerce, informed Cadence Design Systems, Inc. (“Cadence”) that a license was required for the export, re-export or in-country transfer of electronic design automation software and technology classified under Export Control Classification Numbers (ECCNs) 3D991 and 3E991 on the Commerce Control List (the “EDA Software and Technology”), when a party to the transaction is located in": 0.0,
  "(Item 8.01) Other Events On July 2, 2025, Synopsys received a letter from the Bureau of Industry and Security of the U.S. Department of Commerce informing Synopsys that the export restrictions related to China, pursuant to a letter received on May 29, 2025, have now been rescinded, effective immediately. Synopsys is working to restore access to the recently restricted products in China. Synopsys is continuing to assess the impact of export restrictions related to China on its": 0.2,
  "5 Insightful Analyst Questions From GE HealthCare’s Q1 Earnings Call": 0.5,
  "Do Fundamentals Have Any Role To Play In Driving Diamondback Energy, Inc.'s (NASDAQ:FANG) Stock Up Recently?": 0.2,
  "At US$301, Is It Time To Put Verisk Analytics, Inc. (NASDAQ:VRSK) On Your Watch List?": 0.2,
  "Stocks Edge Up Pre-Bell as Investors Await Key Jobs Report Before Independence Day": 0.5,
  "An Intrinsic Calculation For Exelon Corporation (NASDAQ:EXC) Suggests It's 43% Undervalued": 0.8,
  "How Nancy Pelosi Nailed This AI Stock Options Trade, Plus 5 More Political Insider Picks": 0.2,
  "Is DexCom (DXCM) Stock Outpacing Its Medical Peers This Year?": 0.2,
  "Old Dominion Freight Line (NASDAQ:ODFL) Could Become A Multi-Bagger": 0.8,
  "Nonfarm Payrolls Exceed Estimates in June": 0.8,
  "Electronic Arts (EA) Upgraded to Buy: Here's Why": 0.8,
  "Will Linde (LIN) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "CoStar Group (NasdaqGS:CSGP) Elevates Leadership To Drive European Expansion": 0.5,
  "Q1 Medical Devices & Supplies - Imaging, Diagnostics Earnings: GE HealthCare (NASDAQ:GEHC) Earns Top Marks": 0.8,
  "3 Reasons to Sell ODFL and 1 Stock to Buy Instead": -0.5,
  "GE HealthCare’s Vizamyl Receives Expanded FDA Approval for Quantitative Alzheimer’s Amyloid Detection": 0.8,
  "Linde Stock Holds Price Target as UBS Highlights AI, Hydrogen, and Growth Sectors": 0.6,
  "Earnings Preview: What to Expect From Old Dominion’s Report": 0.0,
  "Should You Invest in Linde plc (LIN)?": 0.0,
  "JPMorgan Lowered PT on Copart (CPRT), Kept a Neutral Rating, Here’s Why": 0.1,
  "2 Stocks to Buy on the Dip and Hold for 10 Years": 0.5,
  "(Item 2.02) Results of Operations and Financial Condition Biogen Inc. (Biogen) expects that its GAAP and non-GAAP results for the second quarter of 2025 will include acquired in-process research and development, upfront and milestone expense of approximately $46 million on a pre-tax basis. The estimated charge is expected to impact GAAP and non-GAAP net income per diluted share for the second quarter 2025 by approximately ($0.26) per share. During the first quarter of 2025 we began presenting": -0.5,
  "1 Safe-and-Steady Stock to Own for Decades and 2 to Think Twice About": 0.2,
  "What You Need to Know Ahead of DexCom’s Earnings Release": 0.0,
  "Is Now The Time To Look At Buying Old Dominion Freight Line, Inc. (NASDAQ:ODFL)?": 0.2,
  "Do Options Traders Know Something About Exelon Stock We Don't?": 0.2,
  "Possible Bearish Signals With Diamondback Energy Insiders Disposing Stock": -0.6,
  "Are You a Value Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Weekly Stock Grader Analysis: Upgrades & Downgrades on Top Blue-Chip Stocks": 0.5,
  "The Top 5 Analyst Questions From Paychex’s Q2 Earnings Call": 0.2,
  "The Top 5 Analyst Questions From Verisk’s Q1 Earnings Call": 0.5,
  "XPO's Results to Show Improved Operational Efficiency Despite Macro Headwinds, Oppenheimer Says": 0.6,
  "(Item 1.01) . Entry into a Material Definitive Agreement. On July 8, 2025, The Kraft Heinz Company (the “Company”), together with its 100% owned subsidiary, Kraft Heinz Foods Company (“Parent Borrower”) entered into a Fourth Amendment (the “Amendment”) to the Credit Agreement, dated as of July 8, 2022, among the Company, Parent Borrower, the lenders party thereto, and JPMorgan Chase Bank, N.A., as administrative agent (as previously amended, the “Credit Agreement”). The Amendment extends the maturity date": 0.2,
  "(Item 1.01) . Entry into a Material Definitive Agreement. On July 3, 2025, KLA Corporation (the “Company”) entered into a Credit Agreement (the “Credit Agreement”), among the Company, the lenders party thereto, JPMorgan Chase Bank, N.A., as Administrative Agent, JPMorgan Chase Bank, N.A., BofA Securities, Inc., Citibank, N.A. and Wells Fargo Securities, LLC as Joint Lead Arrangers and Joint Bookrunners, J.P. Morgan Securities LLC as Sustainability Structuring Agent, Bank of America, N.A., Citibank, N.A. and Wells Fargo\n\n(Item 1.01) and not defined herein have the meanings ascribed to them in the Credit Agreement. The proceeds of the loans under the Credit Agreement may be used by the Company for general corporate purposes of the Company and its subsidiaries, including repaying the Company’s outstanding debt. The new revolving credit facility expires on July 3, 2030. The Credit Agreement is subject to two one-year extension options, at the request of the Company and with the consent\n\n(Item 1.01) above is hereby incorporated by reference in its entirety into this": 0.1,
  "3 Reasons EA is Risky and 1 Stock to Buy Instead": -0.5,
  "3 Reasons to Avoid CDW and 1 Stock to Buy Instead": -0.5,
  "Moody's Stock Recently Broke Out Of A Double-Bottom Base; Is It Ready For Takeoff?": 0.6,
  "Looking for Earnings Beat? Buy These 5 Top-Ranked Stocks": 0.6,
  "Here's How Much You'd Have If You Invested $1000 in Idexx Laboratories a Decade Ago": 0.5,
  "LVS vs. TTWO: Which Stock Is the Better Value Option?": 0.2,
  "US Equity Indexes Mixed in Midday Trading": 0.0,
  "US Equity Indexes Mixed After Trump Says Aug. 1 Tariff Deadline Won't Be Extended": 0.1,
  "GlobalFoundries Stock Pops on AI Chip Designer Acquisition": 0.6,
  "Regeneron’s Blockbuster Dupixent Faces a New Rival": -0.5,
  "Sector Update: Energy Stocks Climb Late Afternoon": 0.5,
  "Sector Update: Tech Stocks Rise Late Afternoon": 0.5,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On July 9, 2025, The Kraft Heinz Company (the “Company”) announced that Marcos Eloi Lima, Executive Vice President and Chief Procurement and Sustainability Officer, will be stepping down from his role effective August 1, 2025. Mr. Lima will remain with the Company as an Advisor through March 6, 2026. Janelle Aydin, the Company’s Chief Procurement Officer,": -0.2,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On July 8, 2025, Apple Inc. (“Apple”) announced that Jeff Williams will transition his role as Chief Operating Officer later this month to Sabih Khan, Apple’s Senior Vice President of Operations, as part of a long-planned succession. Mr. Williams will continue reporting to Apple CEO Tim Cook and overseeing Apple’s world-class design team and Apple Watch alongside": 0.2,
  "Bernstein Lowers PDD Holdings (PDD) PT After Q1 Results, Keeps Outperform Rating": 0.5,
  "Citigroup Upgrades Linde (LIN) to Buy, Raises Price Target": 0.8,
  "Monster Beverage Corp (MNST) rated a ‘Buy’ at Stifel on Sales Growth Prospects": 0.6,
  "DexCom Is Doubling Down on Its ‘Mistake.’ Why It’s Time to Buy the Stock.": 0.6,
  "GlobalFoundries to buy MIPS": 0.5,
  "Monster Energy execs purchase Thrifty ice cream business": 0.2,
  "What to Expect From American Electric Power's Next Quarterly Earnings Report": 0.2,
  "What Does IDEXX Laboratories, Inc.'s (NASDAQ:IDXX) Share Price Indicate?": 0.1,
  "Ritz recall 2025: Mislabeled peanut butter cracker sandwiches pose risk of life-threatening allergic reaction": -0.8,
  "American Electric Power Company (AEP) Bolsters Management Team": 0.5,
  "Is the Options Market Predicting a Spike in Copart Stock?": 0.2,
  "Microsoft upgraded, Instacart initiated: Wall Street's top analyst calls": 0.5,
  "Why Electronic Arts (EA) is a Top Momentum Stock for the Long-Term": 0.6,
  "PDD Holdings Inc. (PDD) Slid Amid Investment in E-Commerce Support and External Challenges": -0.5,
  "SKYT Gross Margin Rises on Wafer Services Rebound: Is it Sustainable?": 0.5,
  "Why Exelon (EXC) is a Great Dividend Stock Right Now": 0.8,
  "T-Mobile US Lags Peers in Fiber Investments, KeyBanc Says in Downgrade": -0.5,
  "Take-Two Interactive Software (NasdaqGS:TTWO) Unveils NBA 2K26 with Star Athletes and New Features": 0.6,
  "Verisk Analytics (NasdaqGS:VRSK) Partners With OneClick To Enhance Insurance Claims Solutions": 0.5,
  "Peak Oil? Maybe at $70, Not at $100": 0.5,
  "Bloom Energy Stock Is Getting a Big Beautiful Bump. An Analyst Sees More.": 0.8,
  "Sector Update: Energy Stocks Softer Late Afternoon": -0.5,
  "Sector Update: Tech Stocks Advance Late Afternoon": 0.5,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers Election of New Director. Effective July 10, 2025, the board of directors (the “Board”) of IDEXX Laboratories, Inc. (the “Company”) elected Joseph L. (Jay) Hooley as an independent Class III Director and appointed him as a member of its Audit Committee and Governance and Corporate Responsibility Committee. To effect Mr. Hooley’s election as a Class III\n\n(Item 5.02) (d) of Form 8-K and Item 404(a) of Regulation S-K since the beginning of the Company’s last fiscal year. Mr. Hooley will receive the same compensation as is paid to the Company’s other non-employee Directors, as described in the section entitled “Corporate Governance – Non-Employee Director Compensation” in the Company’s Proxy Statement filed with the Securities and Exchange Commission on March 28, 2025, which description is incorporated herein by reference. The cash fee to be\n\n(Item 5.02) shall be deemed to be furnished, and not filed. 99.1 Press Release entitled \"IDEXX Laboratories Elects Joseph L. (Jay) Hooley to Board of Directors\" dated July 10, 2025. 104 Cover Page Interactive Data File (embedded within Inline XBRL document) 1": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. Diamondback Energy, Inc. (“Diamondback”) presents in this\n\n(Item 2.02) certain information for the quarter ended June 30, 2025 regarding its derivative activity, realized prices, and weighted average basic and diluted shares outstanding. Realized Prices Second quarter 2025 average unhedged realized prices were $63.23 per barrel of oil, $0.88 per Mcf of natural gas and $18.13 per barrel of natural gas liquids (“NGLs”). Second quarter 2025 average realized hedged prices were $62.34 per barrel of oil, $1.45 per Mcf of natural gas and $18.13 per": 0.2,
  "Unexpected chip deal may reshape the semiconductor market": 0.5,
  "3 Big Reasons to Love Atlassian (TEAM)": 0.6,
  "2 Surging  Stocks Worth Investigating and 1 to Brush Off": 0.5,
  "5 Revealing Analyst Questions From CDW’s Q1 Earnings Call": 0.2,
  "What You Need To Know Ahead of GE HealthCare Technologies’ Earnings Release": 0.1,
  "Copart (CPRT) Fell After the Announcement of Quarterly Results": -0.5,
  "What to Expect From Electronic Arts’ Next Quarterly Earnings Report": 0.0,
  "Implied Volatility Surging for American Electric Power Stock Options": 0.5,
  "Nvidia initiated, Roku upgraded: Wall Street's top analyst calls": 0.5,
  "MAIA Biotechnology doses first patient in expansion of Phase II lung cancer trial": 0.5,
  "BofA Raises Price Target on Charter Communications (CHTR) to $500 from $450, Maintains a Buy Rating": 0.8,
  "RBC Capital Maintains a Buy on Biogen (BIIB) With a $208 PT": 0.6,
  "Walmart Shares Jump 40% in a Year: Should You Still Buy Now?": 0.5,
  "Autodesk & PTC, Workday, Estée Lauder: Trending Tickers": 0.0,
  "Will Diamondback (FANG) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Idexx (IDXX) is an Incredible Growth Stock: 3 Reasons Why": 0.8,
  "Growth Stocks: Zscaler Forms Fresh Buy Point After 71% Year-To-Date Rally": 0.8,
  "Copart, Inc. (CPRT): A Bull Case Theory": 0.5,
  "Why Atlassian (TEAM) Shares Are Plunging Today": -0.8,
  "Take-Two Interactive (TTWO) Stock Falls Amid Market Uptick: What Investors Need to Know": -0.2,
  "Workday (WDAY) Stock Falls Amid Market Uptick: What Investors Need to Know": -0.2,
  "Atlassian Stock Drops 9% as CEO Sheds Over $1.6 Million of Shares": -0.7,
  "(Item 8.01) Other Events. On July 7, 2025, the Company entered into an underwriting agreement (the “Underwriting Agreement”) with J.P. Morgan Securities LLC, Morgan Stanley & Co. LLC and Wells Fargo Securities, LLC (collectively, the “Underwriters”), pursuant to which the Company agreed to issue and sell to the Underwriters $6,000,000,000 aggregate principal amount of its senior notes, consisting of $1,750,000,000 aggregate principal amount of its 4.600% senior notes due 2030 (the “2030 Notes”), $1,750,000,000 aggregate principal amount": 0.1,
  "Saving a Studio? This Looks Like a Job for Superman!": 0.6,
  "Analyst Sees Strong Growth Pipeline for Workday (WDAY) Amid Healthy Enterprise Demand": 0.8,
  "Regeneron (REGN) Scores FDA Approval, JP Morgan Reaffirms $800 Price Target": 0.6,
  "Should You Be Excited About Coca-Cola Europacific Partners PLC's (AMS:CCEP) 16% Return On Equity?": 0.5,
  "June earnings update: Paychex, FedEx, Carnival, Chewy, Petco and Lululemon": 0.0,
  "What to Expect From Automatic Data Processing's Q4 2025 Earnings Report": 0.1,
  "Is atai Life Sciences (ATAI) Stock Outpacing Its Medical Peers This Year?": 0.2,
  "CDW, Asato Boost Business Observability With AI-Driven IT Intelligence": 0.5,
  "Can AI-Driven Platform Momentum Keep Aiding PANW's FCF Growth?": 0.5,
  "How Far Can KDP's Energy & Hydration Bet Go in a Shifting Market?": 0.2,
  "Indeed, Glassdoor cutting about 6% of staff; sites to merge operations": -0.6,
  "Oxford Industries, PENN Entertainment, American Airlines, United Airlines, and Atlassian Shares Plummet, What You Need To Know": -0.6,
  "What to expect from legacy media stocks as Q2 earnings season is set to start": 0.2,
  "Why Paychex, Inc. (NASDAQ:PAYX) Could Be Worth Watching": 0.5,
  "Temu’s Q2 Boom Driven by EU and Latin America, Under PDD’s Leadership": 0.5,
  "Atlassian (NasdaqGS:TEAM) Reports Q3 Net Loss Of US$71 Million": -0.5,
  "Warner Bros. Discovery, Inc. (WBD)’s CEO Is The Right Executive For This Environment, Says Jim Cramer": 0.6,
  "Ride the AI Wave with Two Long-Term Leaders": 0.5,
  "Box Office Rebound Gets Boost from Superman": 0.5,
  "Workday (WDAY) Just Got Downgraded—Here’s Why Analysts Are Worried About AI": -0.6,
  "‘Superman’ Bounds to $122 Million Domestic Opening": 0.8,
  "Goldman Sachs Begins Coverage of Analog Devices (ADI) Stock, Gives Buy": 0.8,
  "Goldman Sachs Begins coverage of GLOBALFOUNDRIES (GFS) Stock with a Neutral Rating": 0.5,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On July 8, 2025, Mark Bottini, Senior Vice President, Sales of Paychex, Inc. (the “Company”), notified the Company of his intention to retire from his current role with the Company, effective immediately. Mr. Bottini will serve as a special advisor to the Company through August 31, 2025 at his current salary to assist with a smooth transition": -0.2,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On July 11, 2025, Kathleen K. Oberg, Chief Financial Officer and Executive Vice President, Development, of Marriott International, Inc. (“Marriott” or “the company”), notified Marriott of her intent to retire from the company. She intends to step down from her role as Chief Financial Officer and Executive Vice President, Development immediately following the date on which": -0.2,
  "(Item 8.01) . Other Events. On July 14, 2025, Synopsys, Inc. issued a press release that is attached hereto as Exhibit 99.1 and is incorporated herein by reference.": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. On July 14, 2025, the Registrant issued a press release announcing the results of its most recently ended fiscal quarter, a copy of which is attached hereto as Exhibit 99.1 and is incorporated herein by reference.": 0.0,
  "(Item 8.01) Other Events. ATM Updates On July 14, 2025, MicroStrategy Incorporated d/b/a Strategy (“Strategy” or the “Company”) announced updates with respect to its at-the-market offering programs: ATM Program Summary During Period July 7, 2025 to July 13, 2025 As of July 13, 2025 Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) Common ATM 797,008 MSTR Shares - $330.9 $17,779.8 Securities Offered: Class A Common Stock,": 0.1,
  "1 Large-Cap Stock Worth Investigating and 2 to Think Twice About": 0.2,
  "1 Large-Cap Stock on Our Buy List and 2 to Keep Off Your Radar": 0.2,
  "2 Large-Cap Stocks Worth Your Attention and 1 to Brush Off": 0.2,
  "Ferrara holding company in talks to buy French confectioner CPK": 0.5,
  "What You Need to Know Ahead of Verisk Analytics' Earnings Release": 0.0,
  "Warner Bros. Discovery, Inc. (WBD) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Are You a Growth Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Why This 1 Growth Stock Could Be a Great Addition to Your Portfolio": 0.8,
  "AT&T vs. Comcast: Which Telecom Stock is a Better Buy Right Now?": 0.5,
  "CDNS Unveils LPDDR6/5X Memory IP System for Next-Gen AI & HPC Workload": 0.5,
  "Verisk Analytics Expected to Report In-Line Q2 Results, Reaffirm Full-Year 2025 Outlook, RBC Says": 0.5,
  "CTSH or EPAM: Which Is the Better Value Stock Right Now?": 0.2,
  "DexCom (DXCM) Upgraded to Strong Buy: Here's What You Should Know": 0.8,
  "Seattle University Chooses Workday (NasdaqGS:WDAY) to Enhance Campus Operations and Student Experience": 0.6,
  "Synopsys Buy of Ansys Gets China OK. The $35 Billion Deal Is Set to Close.": 0.5,
  "This Industrial Company’s Earnings Are Good News for the Economy": 0.8,
  "These Stocks Are Moving the Most Today: Boeing, MicroStrategy, Waters, Autodesk, Ansys, Fastenal, Kenvue, and More": 0.0,
  "Autodesk Stock Rallies As Firm Nixes Rumored PTC Acquisition": 0.5,
  "Equity Markets Close Higher as Investors Await Key Economic Reports": 0.5,
  "Tech, Media & Telecom Roundup: Market Talk": 0.0,
  "Nasdaq Reaches New High as Investors Brush Off Tariff Concerns": 0.8,
  "Marriott finance chief Leeny Oberg to retire next year": 0.0,
  "PDD Holdings Inc. Sponsored ADR (PDD) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Diamondback Energy (FANG) Stock Falls Amid Market Uptick: What Investors Need to Know": 0.1,
  "‘Superman’ Soars. Warner Bros. Stock Will Too, Says Analyst.": 0.8,
  "Should You Buy Take-Two Stock Around $235?": 0.2,
  "1 Nasdaq 100 Stock for Long-Term Investors and 2 to Brush Off": 0.2,
  "3 Services Stocks Worth Your Attention": 0.5,
  "1 Healthcare Stock on Our Buy List and 2 to Brush Off": 0.2,
  "Fortinet Stock Shows Rising Market Leadership: Earns 84 Relative Strength Rating": 0.8,
  "Fastenal Co (FAST) Q2 2025 Earnings Call Highlights: Record Revenue and Strong Digital Growth": 0.8,
  "1 Unstoppable Growth Stock to Buy With $3,000": 0.8,
  "What to Expect From Diamondback Energy's Next Quarterly Earnings Report": 0.2,
  "Marriott CFO Leeny Oberg to exit, 2 successors named": 0.1,
  "Health Canada extends Evkeeza approval for children with HoFH": 0.5,
  "Vermont man loses $100K to NASCAR pro impersonator — what The Ramsey Show hosts suggest he do next to recover": -0.5,
  "Synopsys clears final hurdles in $35bn Ansys acquisition": 0.5,
  "Vertex Pharmaceuticals And 2 Other Stocks That May Be Trading Below Their Estimated Value": 0.5,
  "Vertex and NHS England agree reimbursement for Alyftrek": 0.5,
  "Is Keurig Dr Pepper (KDP) Trading at a Discount?": 0.2,
  "Strength Seen in Autodesk (ADSK): Can Its 5.1% Jump Turn into More Strength?": 0.6,
  "Microchip Technology Achieves Key Space Qualifications for RT PolarFire FPGAs, Releases SoC Samples": 0.6,
  "Cognizant Launches “Agent Foundry” to Help Enterprises Scale Autonomous AI Agents": 0.5,
  "Cadence Design Systems, Inc. (CDNS) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Under The Bonnet, MercadoLibre's (NASDAQ:MELI) Returns Look Impressive": 0.8,
  "EU Commission Approves Vertex Pharmaceutical’s (VRTX) Cystic Fibrosis Treatment": 0.8,
  "Here's What to Expect From IDEXX Laboratories' Next Earnings Report": 0.2,
  "Company News for Jul 15, 2025": 0.0,
  "Mondelez executive to join Hindustan Coca-Cola Beverages as CEO": 0.5,
  "What Makes CDW Corporation (CDW) an Attractive Investment?": 0.5,
  "Connecticut wants to make generic GLP-1s. Will RFK Jr. lend a hand?": 0.1,
  "PANW Stock Trades at a Discount: Should You Buy, Sell or Hold?": 0.2,
  "Can Monster Beverage Sustain Its Margin Momentum in a Volatile Market?": 0.1,
  "CELH Stock Trades at Premium Value: Should You Buy, Hold or Sell?": 0.2,
  "SHOP's Merchants Drive GMV Higher: Is Growth Thesis Strengthening?": 0.5,
  "NFLX vs. WBD: Which Entertainment Stock Has an Edge Right Now?": 0.2,
  "Bernstein Maintains Buy Rating on Gilead Sciences (GILD) Stock": 0.6,
  "Alibaba & Chinese tech stocks jump, Nvidia lifts AMD & Broadcom": 0.6,
  "ON Semiconductor Earnings Preview: What to Expect": 0.0,
  "Merck Starts Phase III Studies on Once-Monthly Pill for HIV Prevention": 0.8,
  "Vertex Pharmaceuticals (VRTX) Secures NHS England Agreement For Next-In-Class Cystic Fibrosis Treatment": 0.8,
  "Exploring 3 High Growth Tech Stocks In The US Market": 0.0,
  "Lilly’s Zepbound Faces a Potential Weight-Loss Rival. It’s Made by a Chinese Biotech.": 0.1,
  "Sector Update: Health Care Stocks Fall Late Afternoon": -0.5,
  "US SEC ends Cognizant bribery case that the Justice Department also abandoned": 0.1,
  "Analog Devices (ADI) Suffers a Larger Drop Than the General Market: Key Insights": -0.5,
  "Here's Why Gilead Sciences (GILD) Fell More Than Broader Market": -0.5,
  "Vertex Pharmaceuticals (VRTX) Declines More Than Market: Some Information for Investors": -0.5,
  "Autodesk (ADSK) Falls More Steeply Than Broader Market: What Investors Need to Know": -0.6,
  "Here's Why Ross Stores (ROST) Fell More Than Broader Market": -0.5,
  "(Item 8.01) . Other Events The Board of Directors declared a quarterly cash dividend on the Company's common stock of $1.30 per share. The dividend was declared on July 15, 2025, and is payable August 15, 2025, to shareholders of record at the close of business on August 1, 2025.": 0.5,
  "Q1 Earnings Roundup: Gilead Sciences (NASDAQ:GILD) And The Rest Of The Therapeutics Segment": 0.2,
  "Analog Semiconductors Stocks Q1 Teardown: Microchip Technology (NASDAQ:MCHP) Vs The Rest": 0.2,
  "Jim Cramer Urges to “Buy NXPI”": 0.5,
  "1 Volatile Stock Worth Your Attention and 2 to Brush Off": 0.2,
  "Earnings Preview: What to Expect From Amgen’s Report": 0.5,
  "Marriott signs seven City Express hotels in Brazil": 0.5,
  "Institutional investors have a lot riding on Warner Bros. Discovery, Inc. (NASDAQ:WBD) with 69% ownership": 0.2,
  "Fastenal Second Quarter 2025 Earnings: EPS Beats Expectations": 0.6,
  "Is Analog Devices (NASDAQ:ADI) Using Too Much Debt?": -0.5,
  "Fortinet's Q2 2025 Earnings: What to Expect": 0.2,
  "Is Weakness In Monster Beverage Corporation (NASDAQ:MNST) Stock A Sign That The Market Could be Wrong Given Its Strong Financial Prospects?": 0.5,
  "How Cloudflare CEO Prince Turned Company Into Internet's 'Swiss Army Knife'": 0.6,
  "Zacks.com featured highlights include Walt Disney, TE Connectivity, Fortinet, Banco Bilbao Vizcaya Argentaria and Colgate-Palmolive": 0.2,
  "Hologic Rides on AI-Powered Breast Health Innovations: What's Next?": 0.6,
  "These 2 Computer and Technology Stocks Could Beat Earnings: Why They Should Be on Your Radar": 0.6,
  "Vertex Pharmaceuticals Incorporated (VRTX) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "ON Semiconductor Corporation (ON) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Why Investors Need to Take Advantage of These 2 Consumer Staples Stocks Now": 0.5,
  "We Think Amgen (NASDAQ:AMGN) Can Stay On Top Of Its Debt": 0.6,
  "Axon vs. Teledyne: Which Defense & Security Stock has Better Prospects?": 0.2,
  "Will Tariff Pressures Disrupt Ross Stores' Sourcing Advantage?": 0.1,
  "'Without Her, None Of This Would've Happened,' Says Billionaire Jay Chaudhry, Crediting Wife For Building His $17 Billion Cybersecurity Empire": 0.8,
  "O'Reilly Automotive (ORLY) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "Credo Bets Big on AEC Business: Will It Deliver Sustainable Growth?": 0.5,
  "Utilities may speed renewable projects under new tax credit timeline: Jefferies": 0.2,
  "Axon Enterprise's Strong Growth Already Reflected in Valuation, UBS Says": 0.5,
  "Why Applied Materials (AMAT) Stock Is Down Today": -0.5,
  "KLA Corporation, Marvell Technology, Micron, Nova, and FormFactor Shares Are Falling, What You Need To Know": -0.5,
  "Why Lam Research (LRCX) Shares Are Trading Lower Today": -0.5,
  "This Week's 2 Hottest Earnings Charts: Netflix and Cintas": 0.5,
  "Stocks Pressured by Chip-Stock Sell-off and Increased Talk about Powell Firing": -0.6,
  "Scotiabank Raises Comcast (CMCSA) Price Target, Maintains Sector Perform Rating": 0.5,
  "UBS Raises Regeneron (REGN) Price Target, Maintains Neutral Rating": 0.5,
  "MercadoLibre (MELI) Teams with Oxxo to Expand Financial Access Across Mexico": 0.6,
  "Barclays Trims Keurig Dr Pepper (KDP) Price Target, Maintains Overweight Rating": 0.5,
  "Why Lam Research Stock Dropped on Wednesday": -0.5,
  "Should You Buy, Sell or Hold MELI Stock After Trump's Tariff Pledge?": 0.1,
  "Genuine Parts' Outlook 'Too Optimistic,' Q2 Unlikely to Exceed Expectations, UBS Says": -0.6,
  "One of the most critical AI companies in the world just said it ‘cannot confirm’ growth in 2026, wiping out $30 billion": -0.8,
  "GitLab and Atlassian Get Downgrades. AI Competition is a Threat, Analyst Says.": -0.6,
  "Marvell Technology (MRVL) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "Cadence Design Systems (CDNS) Stock Declines While Market Improves: Some Information for Investors": -0.5,
  "Fortinet (FTNT) Stock Dips While Market Gains: Key Facts": -0.5,
  "ON Semiconductor Corp. (ON) Outperforms Broader Market: What You Need to Know": 0.5,
  "Kraft Heinz (KHC) Rises Higher Than Market: Key Facts": 0.5,
  "Ross Stores (ROST) Outperforms Broader Market: What You Need to Know": 0.6,
  "(Item 2.02) Results of Operations and Financial Condition. On July 17, 2025, Netflix, Inc. (the “Company”) announced its financial results for the quarter ended June 30, 2025. The Letter to Shareholders, which is attached hereto as Exhibit 99.1 and is incorporated herein by reference, includes reference to the non-GAAP financial information. A reconciliation to the GAAP equivalent of non-GAAP measures is contained in tabular form in Exhibit 99.1. We are not able to reconcile forward-looking non-GAAP financial\n\n(Item 2.02) and the accompanying Exhibit 99.1 are “furnished” and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that section, and shall not be incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act regardless of any general incorporation language in such filing, unless expressly incorporated by specific": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On July 15, 2025, Marvell Technology, Inc. (the “Company” or “Marvell”) promoted Chris Koopmans to President and Chief Operating Officer and Sandeep Bharathi to President, Data Center Group. Mr. Koopmans and Mr. Bharathi will report directly to Marvell’s Chairman and Chief Executive Officer, Matt Murphy. Mr. Koopmans will expand his scope of responsibilities to include Worldwide Sales,": 0.1,
  "(Item 1.01) . Entry into a Material Definitive Agreement. On July 15, 2025, Synopsys, Inc. (“ Synopsys ”), ANSYS, Inc., a Delaware corporation (“ Ansys ”), and ALTA Acquisition Corp., a Delaware corporation and a wholly owned subsidiary of Synopsys (“ Merger Sub ”), entered into an amendment (the “ Amendment ”) to the Agreement and Plan of Merger, dated as of January 15, 2024 (the “ Merger Agreement ”), by and among Synopsys, Ansys and Merger\n\n(Item 1.01) in Synopsys’ Current Report on Form 8-K filed with the Securities and Exchange Commission (“ SEC ”) on March 17, 2025. Synopsys funded the Cash Consideration through a combination of cash on hand, proceeds from the issuance of senior notes and borrowings under the Term Loan Credit Agreement referred to in\n\n(Item 1.01) in Synopsys’ Current Report on Form 8-K filed on February 14, 2024 (the “ Prior Term Loan 8-K ”), which description is incorporated herein by reference. In addition, the Credit Agreement was filed as Exhibit 2.2 to the Prior Term Loan 8-K and is incorporated herein by reference. On July 17, 2025, Synopsys terminated the approximately $690 million in remaining commitments under the previously disclosed commitment letter for a bridge facility to fund the Merger,\n\n(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On July 17, 2025, in accordance with the applicable provisions of Synopsys’ amended and restated bylaws, the Board of Directors (the “ Board ”) of Synopsys increased the size of the Board from nine to eleven directors and, pursuant to the Merger Agreement, appointed Dr. Ajei Gopal and Ravi Vijayaraghavan to serve as directors effective as": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On July 17, 2025, Cintas Corporation issued a press release announcing its financial results for the quarter ended May 31, 2025. A copy of the press release is furnished as Exhibit 99 to this Current Report on Form 8-K and is incorporated herein by reference.": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. The information in this\n\n(Item 2.02) , including Exhibit 99.1 attached hereto, is being furnished and shall not be deemed “filed” for the purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that Section and shall not be incorporated by reference into any registration statement or other document pursuant to the Securities Act of 1933, as amended, or the Exchange Act, except as otherwise expressly stated in\n\n(Item 2.02) is a copy of the press release issued by PepsiCo, Inc. (“PepsiCo”), dated July 17, 2025, reporting PepsiCo’s financial results for the 12 and 24 weeks ended June 14, 2025.": 0.0,
  "(Item 8.01) . Other Events. As previously disclosed in our Annual Report on Form 10-K (the 2024 Form 10-K) for the fiscal year ended December 28, 2024, effective beginning with our first quarter of 2025, we realigned certain of our reportable segments to conform with changes to our organizational structure and how our Chief Executive Officer monitors the performance of, and allocates resources to, these segments. In North America, the food businesses, Frito-Lay North America and Quaker\n\n(Item 8.01) are recast segment discussions within Part I, “Item 1. Business;” Part II, “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations;” and Notes 1, 3, 4, 9 and 13 to PepsiCo’s consolidated financial statements, in each case as included in the 2024 Form 10-K, as filed with the Securities and Exchange Commission (SEC) on February 4, 2025. The changes in the reportable segment structure discussed above, as reflected in the information": 0.1,
  "Therapeutics Stocks Q1 Teardown: Amgen (NASDAQ:AMGN) Vs The Rest": 0.1,
  "Q1 Earnings Outperformers: KLA Corporation (NASDAQ:KLAC) And The Rest Of The Semiconductor Manufacturing Stocks": 0.5,
  "Spotting Winners: Lam Research (NASDAQ:LRCX) And Semiconductor Manufacturing Stocks In Q1": 0.5,
  "3 Reasons to Avoid REGN and 1 Stock to Buy Instead": -0.5,
  "3 Reasons to Sell MDLZ and 1 Stock to Buy Instead": -0.5,
  "3 Small-Cap Stocks with Mounting Challenges": -0.7,
  "KLA Corporation (KLAC) Is One Of The Most Important Companies In America, Says Jim Cramer": 0.6,
  "Vail Resorts Stock Offers a Hefty Dividend and Capital Appreciation. Why It’s Time to Buy.": 0.8,
  "Linde Secures $400M Contract to Supply Industrial Gases to Blue Point’s World-Scale Low-Carbon Ammonia Plant in Louisiana": 0.8,
  "Here's What to Expect From Monster Beverage's Next Earnings Report": 0.2,
  "Looking for AI Chip Stocks Beyond Nvidia? Goldman Sachs Says These 2 Names Deserve a Look": 0.5,
  "Texas investigating Skittles maker Mars for failing to remove artificial food dyes": -0.5,
  "3 Growth Stocks That Could Help Make You a Fortune": 0.8,
  "What to Expect From Axon Enterprise's Next Quarterly Earnings Report": 0.2,
  "Researchers warn of cyberattacks targeting key Fortinet software": -0.6,
  "Midsize business use of PayPal, Zelle dipped, Citizens says": -0.2,
  "Here’s Why CDW Corporation (CDW) Declined in Q2": -0.5,
  "Insiders At Axon Enterprise Sold US$78m In Stock, Alluding To Potential Weakness": -0.6,
  "Chip design software firm Synopsys completes $35B deal": 0.5,
  "Affirm and JAKKS Pacific have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Why Investors Need to Take Advantage of These 2 Computer and Technology Stocks Now": 0.5,
  "Gilead Sciences, Inc. (GILD) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Should You Think About Buying Cadence Design Systems, Inc. (NASDAQ:CDNS) Now?": 0.2,
  "Loop Capital Maintains ‘Buy’ Rating on Datadog, Inc. (DDOG); Raises PT": 0.6,
  "Seeking Clues to CoStar (CSGP) Q2 Earnings? A Peek Into Wall Street Projections for Key Metrics": 0.2,
  "Coca-Cola says it appreciates Trump's 'enthusiasm' after president says company will use real sugar in drinks": 0.6,
  "BMO Capital Maintains ‘Outperform’ Rating on Intuit Inc. (INTU); Raises PT from $820 to $870": 0.8,
  "Wall Street Bulls Look Optimistic About MercadoLibre (MELI): Should You Buy?": 0.8,
  "Is It Worth Investing in Lam Research (LRCX) Based on Wall Street's Bullish Views?": 0.5,
  "Is Booking Holdings (BKNG) Outperforming Other Retail-Wholesale Stocks This Year?": 0.2,
  "Is Microchip Technology (MCHP) Stock Outpacing Its Computer and Technology Peers This Year?": 0.2,
  "Eli Lilly vs. Merck: Which Drug Giant Appears Better Poised Today?": 0.5,
  "Starbucks downgraded, Oracle initiated: Wall Street's top analyst calls": 0.1,
  "Keurig Dr Pepper, Inc (KDP) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "GE HealthCare Technologies Inc. (NASDAQ:GEHC) is largely controlled by institutional shareholders who own 78% of the company": 0.1,
  "Cintas' Q4 Earnings Surpass Estimates, Revenues Increase Y/Y": 0.8,
  "O'Reilly Gears Up to Report Q2 Earnings: What's in the Cards?": 0.2,
  "Deutsche Bank backs Visa, Mastercard amid fintech sector slump": 0.5,
  "Can Amgen (AMGN) Keep the Earnings Surprise Streak Alive?": 0.2,
  "Intuit Stock Rises 19.3% Year to Date: Still a Buy or Time to Wait?": 0.2,
  "MRVL vs. MCHP: Which Ethernet PHY Transceiver Stock Has an Edge?": 0.5,
  "Can Cybersecurity Boom Push FTNT Stock Past its 10.5% Gain in 6 Months?": 0.5,
  "How is MELI Holding its Lead in LATAM's Acquiring Business Space?": 0.5,
  "Microchip Technology (MCHP) Partners With Delta to Innovate Energy Solutions": 0.8,
  "Cintas (CTAS) Reports US$10 Billion Revenue, Confirms Guidance, Completes Buyback": 0.6,
  "Paychex (PAYX) Partners With SoFi To Enhance Flex®? Perks For Financial Independence": 0.6,
  "3 Unusually Active Cash-Secured Puts in Quality Companies for Attractive Income": 0.6,
  "OpenAI Hires Entire Team From AI Startup Backed By Shopify And Radical Ventures 'To Ensure AGI Benefits All Of Humanity'": 0.6,
  "Why Datadog (DDOG) Stock Is Up Today": 0.5,
  "Datadog Versus Chronosphere Inside OpenAI": 0.0,
  "BancFirst, Bath and Body Works, Brown-Forman, Warner Bros. Discovery, and Lululemon Shares Skyrocket, What You Need To Know": 0.8,
  "Resideo, Helios, AMN Healthcare Services, Cintas, and Williams-Sonoma Shares Are Soaring, What You Need To Know": 0.5,
  "Value-Investing Winner Bets Big on Out-of-Favor Energy Stocks. Think Conoco, APA.": 0.6,
  "High-bandwidth memory demand set to surge in 2026 as AI powers up: UBS": 0.5,
  "Cisco Systems (CSCO) Outperforms Broader Market: What You Need to Know": 0.6,
  "Take-Two Interactive (TTWO) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Workday (WDAY) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Warner Bros. Discovery (WBD) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "MercadoLibre (MELI) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "Freelance, self-employed and gig workers: Here are 5 key provisions you should know about in the new tax law": 0.5,
  "Former Heads of Google Travel and Tripadvisor Form AI Startup to Head Off Online Travel Agencies": 0.5,
  "(Item 8.01) . Other Events. On July 8, 2025, United States District Court for the Northern District of California (the “Court”) preliminarily approved the settlement (“Settlement”) of a stockholder derivative action captioned In re Alphabet Inc. Shareholder Derivative Litigation, Consolidated Case No. 3:21-cv-09388-RFL (the “Action”). Pursuant to the Court’s order granting preliminary approval of the Settlement, Alphabet Inc. (the “Company”) is required to publish the Notice of Pendency and Proposed Settlement of Derivative Action (the “Notice”), attached": 0.1,
  "(Item 8.01) . Other Events SPS Resource Plan (IRP) — In October 2023, Southwestern Public Service Company (SPS), a New Mexico corporation and a wholly owned subsidiary of Xcel Energy, Inc., filed its IRP with the New Mexico Public Regulation Commission (NMPRC) which supports projected load growth and increasing reliability requirements, and secures replacement energy and capacity for retiring resources. SPS’ projected resource needs range from approximately 5,300 MW to 10,200 MW of nameplate capacity by 2030.": 0.2,
  "Take-Two (TTWO): Buy, Sell, or Hold Post Q1 Earnings?": 0.2,
  "Axon (AXON): 3 Reasons We Love This Stock": 0.6,
  "3 Cash-Producing Stocks with Warning Signs": -0.5,
  "CTAS Q1 Deep Dive: Margin Expansion and Operational Efficiency Drive Guidance Update": 0.6,
  "Data Centers Aren’t Just a U.S. Trend. These Stocks Could Benefit from Europe’s Power  Surge.": 0.5,
  "Cintas Corp (CTAS) Q4 2025 Earnings Call Highlights: Strong Revenue Growth and Optimistic ...": 0.8,
  "Uber to invest $300 million in EV maker Lucid as part of robotaxi deal - https://www.reuters.com/business/autos-transportation/uber-invest-300-million-ev-maker-lucid-part-robotaxi-deal-2025-07-17/ Uber (UBER.N), opens new tab will invest $300 million in electric vehicle maker Lucid (LCID.O), opens new tab in a robotaxi deal that aims to start with one major U.S. city late next year, the companies said on Thursday. Over six years starting in 2026, Uber will acquire and deploy over 20,000 Lucid Gravity SUVs that will be equipped": 0.5,
  "Jim Cramer Says AppLovin Has “No Real Competition”": 0.6,
  "Citi Raised the Firm’s PT on Applied Materials (AMAT), Kept a Buy Rating": 0.5,
  "The Trade Desk Set to Join S&P 500 Today": 0.5,
  "CFOs On the Move: Week ending July 18": 0.0,
  "Charter (CHTR) Target Raised by UBS Despite Broadband Growth Concerns": 0.5,
  "Kraft Heinz (KHC) Considers $20 Billion Grocery Spinoff Amid Restructuring": 0.2,
  "China Stocks Hit 3-Year High as Global Rally Rolls On": 0.8,
  "DoorDash, Inc. (DASH): “The Multiple’s Too High,” Says Jim Cramer": -0.5,
  "Exelon Corporation (NASDAQ:EXC) is favoured by institutional owners who hold 85% of the company": 0.5,
  "Applied Materials' (NASDAQ:AMAT) investors will be pleased with their solid 216% return over the last five years": 0.8,
  "What Is CDW Corporation's (NASDAQ:CDW) Share Price Doing?": 0.0,
  "Earnings Preview: What to Expect From Xcel Energy's Report": 0.5,
  "3 Growth Stocks With Significant Insider Ownership": 0.5,
  "Discover Datadog And Two Other Stocks That May Be Priced Below Estimated Value": 0.5,
  "3 Unstoppable Dow Dividend Stocks to Buy and Hold Forever": 0.8,
  "EBay Stock: How To Find & Own America's Greatest Opportunities": 0.5,
  "Is DexCom, Inc. (NASDAQ:DXCM) Trading At A 34% Discount?": 0.1,
  "Here's What to Expect From Biogen's Next Earnings Report": 0.1,
  "Booking Holdings' Q2 2025 Earnings: What to Expect": 0.0,
  "Lululemon Opening in Milan, Adding a Fashion Capital to Its International Push": 0.5,
  "Intel shares could squeeze higher during earnings, analyst says": 0.6,
  "Wedgewood Partners Continues to Hold Copart (CPRT)": 0.0,
  "Booking Holdings (BKNG) Benefited from Strong Travel Spending and Share Buybacks": 0.8,
  "Comcast Corporation (CMCSA) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Zscaler, Inc. (ZS) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "PDD Holdings Inc. Sponsored ADR (PDD) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Head of $8 Billion Wealth Firm Has His Eye on These 3 Major Market Disruptors": 0.5,
  "Fastenal (FAST) Reliance on International Sales: What Investors Need to Know": 0.2,
  "Insights Into O'Reilly Automotive (ORLY) Q2: Wall Street Projections for Key Metrics": 0.2,
  "Snowflake initiated, Chipotle upgraded: Wall Street's top analyst calls": 0.5,
  "Are Computer and Technology Stocks Lagging  Intuit (INTU) This Year?": -0.2,
  "The Zacks Analyst Blog Highlights Costco Wholesale, Dollar General, Ross Stores and Target": 0.5,
  "Are You a Momentum Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Company News for Jul 18, 2025": 0.0,
  "Regeneron Stock Plunges 22.6% YTD: Should You Buy, Sell or Hold?": -0.5,
  "Stocks to watch this week: Tesla, Alphabet, Intel, Lloyds and JD Wetherspoon": 0.0,
  "Kymera Surges 70% in 3 Months: Buy, Sell or Hold the Stock?": 0.2,
  "Should You Buy Datadog (DDOG) After Golden Cross?": 0.2,
  "CoStar Group to Post Q2 Earnings: What's in Store for the Stock?": 0.2,
  "Charter Communications (CHTR) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "6 Frugal Living Lessons From the Great Recession": 0.5,
  "Talen Stock Soars on Plant Purchases. Why the Market Is Excited About the Nuclear Play’s Bet on Gas.": 0.8,
  "Intel Could Face a Short Squeeze and More Calls on Semi Stocks From Citi": 0.5,
  "Is a Recession Coming in 2025?": -0.5,
  "Robinhood, AppLovin Could Soon Join S&P 500 as Hess Deal Creates Opening in Index": 0.5,
  "Talen Energy Soars On $3.5 Billion Deal To 'Enhance' Data Center Load; S&P 500 Rivals Jump": 0.8,
  "Can Intuit Sustain Its Growth Momentum With Bold AI Push?": 0.5,
  "Keurig to Post Q2 Earnings: What Is in the Cards for Investors?": 0.2,
  "PYPL vs. MA: Which Stock Is the Better Value Option?": 0.0,
  "KLA Stock, Quanta Form This Chart Pattern, Giving The Green Light To Buy": 0.6,
  "Nvidia and 2 Other Chip Stocks to Play AI Into Earnings, Says J.P. Morgan": 0.5,
  "Clear Secure Stock Gets Relative Strength Rating Lift": 0.5,
  "Crypto pops on GENIUS Act, Chinese tech stocks, CRISPR": 0.5,
  "Analysts revamp Alphabet stock price target before key earnings": 0.5,
  "Stock Market Hits Highs On Nvidia AI Chip News, Taiwan Semi Earnings, Economic Data: Weekly Review": 0.8,
  "Industrial Power: Watch CSX, MMM, and Cintas": 0.2,
  "Marvell Technology (MRVL) Strengthens Leadership Team With Key Executive Promotions": 0.8,
  "QUALCOMM (QCOM) Confirms US$0.89 Dividend for September 2025 Payout": 0.5,
  "Synopsys (SNPS) Completes Acquisition Of Ansys, Expands Market Reach To US$31 Billion": 0.8,
  "GE’s 3 Offspring Are All Grown Up and Making Waves. The Best Is Yet to Come.": 0.8,
  "Exploring High Growth Tech Stocks In The US Market": 0.5,
  "What’s the most “off the wall” way you’ve discovered a good stock? - A while back I started noticing teenagers wearing Crocs again. Not as a joke, just actually wearing them. Saw it at the mall, at the gym, even some coworkers had them on. Randomly looked it up one day and turns out Crocs is public ($CROX), and the stock was actually doing alright. Didn’t end up buying it (kicking myself now), but it": 0.4,
  "IPO Stock Of The Week: Nvidia Partner Arm Holdings Nears New Buy Point": 0.5,
  "HSBC Trims Amgen (AMGN) Price Target, Maintains Buy Rating": 0.5,
  "Repligen, Bruker, Fortrea, Azenta, and Biogen Stocks Trade Down, What You Need To Know": -0.5,
  "Watch Reddit, DoorDash, and Google as Netflix Disappoints": 0.1,
  "Why We Booked Our Profits In Booking Stock": -0.5,
  "GE Aerospace Price Targets Suggest a Record High Is Coming. How That’s Possible.": 0.5,
  "Block shares soar 10% on entry into S&P 500 - Block shares jumped more than 10% in extended trading on Friday, as the fintech company get set to join the S&P 500, replacing Hess which is exiting due to its acquisition by Chevron. Source: [https://www.cnbc.com/2025/07/18/block-shares-soar-on-entry-into-sp-500.html](https://www.cnbc.com/2025/07/18/block-shares-soar-on-entry-into-sp-500.html)": 0.8,
  "Company was sold, are my stocks still floating around somewhere? - I’ll try to make this short. So back in 1999 I started working for a company. Instead of signing up for a 401k I opted for stocks. Fast forward 2 years and I get laid off. I completely forget about the stocks until about a year ago. I do some digging and the company has since been sold. Are my stocks just gone now?": -0.5,
  "The Score: Norfolk Southern, Citigroup, Nvidia and More Stocks That Defined the Week": 0.2,
  "Block to Replace Hess in S&P 500 Index. Shares Jump on Admission News.": 0.8,
  "Square Parent Block Jumps On S&P 500 News; Robinhood Snubbed Yet Again": 0.2,
  "The Trade Desk (TTD) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Qualcomm (QCOM) Increases Despite Market Slip: Here's What You Need to Know": 0.5,
  "Amgen (AMGN) Declines More Than Market: Some Information for Investors": -0.5,
  "Axon Enterprise (AXON) Rises As Market Takes a Dip: Key Facts": 0.5,
  "4 Signs You’re Financially Comfortable (and Ready To Level Up)": 0.5,
  "Block Stock Jumps on S&P 500 Inclusion, Replacing Hess": 0.6,
  "Why Amgen (AMGN) Could Be a Hidden Gem Among Dividend Pharma Stocks in 2025": 0.6,
  "Why Gilead Sciences (GILD) Appeals to Income Investors in the Pharma Sector": 0.5,
  "How CEO Cristiano Amon Is Building ‘a New Qualcomm’": 0.5,
  "Should i sell AMD, its up 65% - Hello, i started investing in the beginning of july with AMD and sone other tech companies. I am up 65% in AMD and the others around 30-40% i am thinking about holding for long term but there is a possibility that it will crash soon. i am not sure what to do because i am new. maybe u guys can help me out. i would be happy": 0.2,
  "Down 16%, Should You Buy the Dip on Arm Holdings?": 0.5,
  "How Shopify quietly became a payments giant in North America": 0.5,
  "/r/Stocks Weekend Discussion Saturday - Jul 19, 2025 - This is the weekend edition of our stickied discussion thread. Discuss your trades / moves from last week and what you're planning on doing for the week ahead. Some helpful links: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips *": 0.2,
  "Novo Nordisk - is it buy? And where to buy USA or DK stock market? - What do you think about Novo Nordisk after more than 50% fall from ATH. The reason probably is risk of tarrifs and rival Eli Lilly. But in fact the glp market is so huge that both companies cant fulfill the demand so it’s not like one win other lose. The tarrifs are also a risk, but after 55% fall": 0.2,
  "MaxLinear (MXL) - A Return to Profitability - Hello everyone, I don’t post on Reddit often, but I felt like sharing some personal analysis I’ve been doing for a project on MaxLinear, a designer of Systems-on-Chips (SoCs). Business: The company designs Systems-on-Chips for a broad range of applications. Broadband, wireless, infrastructure, and industrial/multi-market are the key segments. The technology MXL designs is sold to original equipment makers, majority of which are located in Asia. The": 0.5,
  "Costco Is One of the Largest Consumer Goods Companies by Market Cap. But Is It a Buy?": 0.5,
  "There are opportunities to make life changing money with this administration. - Just wanted to share some thoughts/start a discussion. I don't want this to get political. I'll just say that I'm generally not a trump fan... That being said I believe Trump provides for easy ways to print money, and I'm going to try to get mine before the country comes crashing down. Fundamentally, I think this administration pushes big policy. Policy that is": 0.2,
  "Atlassian stock: Should you own it into the print, or wait to buy a dip after?": 0.2,
  "Want $1 Million in Retirement? Invest $100,000 in These 3 Stocks and Wait a Decade.": 0.5,
  "ASML’s Q2 Beat Fails to Impress as Bernstein Flags Order Weakness": -0.5,
  "3 Magnificent Dividend Stocks to Buy Today and Hold for 20 Years": 0.8,
  "O'Reilly Automotive, Inc.'s (NASDAQ:ORLY) Intrinsic Value Is Potentially 23% Below Its Share Price": -0.7,
  "Analog Devices price target raised to $270 from $248 at Stifel": 0.5,
  "These 7 Stocks Are Analyst Favorites For Magnificent Earnings Growth; Arista, Micron Lead": 0.8,
  "Cintas Full Year 2025 Earnings: In Line With Expectations": 0.5,
  "Could Arm Holdings Stock Help You Become a Millionaire?": 0.5,
  "Possible Bearish Signals With Old Dominion Freight Line Insiders Disposing Stock": -0.6,
  "Possible Bearish Signals With Trade Desk Insiders Disposing Stock": -0.6,
  "5 Worst States To Run an Airbnb in 2025, According to Experts": -0.7,
  "Trump Tariffs Spell Trouble for Hawaii’s Few Coffee Farmers": -0.8,
  "ASML (ASML) Gets EUR700 Price Target From Deutsche Bank — Analysts Stick With ‘Buy’ Despite Headwinds": 0.6,
  "AppLovin Corporation (APP) Is A “Cash Flow Machine,” Says Jim Cramer": 0.6,
  "Big food companies undergo 'self reflection' on business future as deals sweep the sector": 0.2,
  "Peter Thiel-backed cryptocurrency exchange Bullish files to go public on NYSE - The Peter Thiel-backed cryptocurrency exchange Bullish filed for an IPO on Friday, the latest digital asset firm to head for the public market. The company, led by CEO Tom Farley, a veteran of the finance industry and former president of the New York Stock Exchange, said it plans to trade on the NYSE under the ticker symbol “BLSH.” A spinout of [Block.one](http://Block.one), Bullish": 0.6,
  "r/Stocks Weekly Thread on Meme Stocks Saturday - Jul 19, 2025 - The meme stock scheduled posts will now run weekly and post Saturday afternoon and won't be a sticky; you're probably seeing this because automod sent you here! [Full list of meme stocks here.](https://www.reddit.com/r/stocks/wiki/meme-stocks) This will be updated every once in a while. ------ Welcome traders who just can't help them selves discuss the same exact stock that's been discussed 100s of times a": 0.1,
  "3 reasons to buy Costco stock and steer clear of Target": 0.2,
  "Did the market become oversensitive? - I’m talking about the earnings of GOOG and NFLX where despite strong results the stock price fell down. Going through the details, you’ll find one or two metrics where the expectations weren’t met. Still, I feel like the market is really overreacting. Is this the new norm? Oh, and let’s ignore TSLA. It’s a meme stock.": 0.2,
  "TYL Tyler Tech: defensive tech or missed opportunity cost - Defensive within tech? TYL has low beta with stable government contracts, and SaaS-driven recurring revenue. More of a defensive tech stock. Overvalued? high P/E and DCF suggesting overvaluation is a concern, stays in line with historical valuation trend. Worth a protection against a bear market? Or just a missed opportunity cost with better options out there with similar downside but better upside.": 0.1,
  "Oppenheimer Remains Bullish on Costco (COST)": 0.6,
  "China Galaxy International Downgrades PT on PDD Holdings (PDD) from $164 to $112": -0.5,
  "What to Expect From CDW’s Next Quarterly Earnings Report": 0.2,
  "What You Need to Know Ahead of Cognizant Technology’s Earnings Release": 0.1,
  "Better Energy Stock: Diamondback Energy vs. Chevron": 0.5,
  "UNH Protective puts before earnings - Hi everyone, I have 5,200 shares of UNH @295 and i’m not very confident about the health sector lately, but I’m very confident in one year UNH can reach 350 again. (I don’t have extensive knowledge in options) How do you find a good option strike price/expiration for the upcoming earnings to hedge using protective puts for the upcoming earning on July 29.": 0.2,
  "This Magnificent Tech Stock Is Soaring After Joining the S&P 500. Should You Buy It?": 0.5,
  "Own ARM stock? This Is the 1 Thing to Watch Now": 0.5,
  "Prediction: 3 Stocks That Will Be Worth More Than Palantir 5 Years From Now": 0.5,
  "Insiders At Analog Devices Sold US$7.2m In Stock, Alluding To Potential Weakness": -0.6,
  "Tesla, Alphabet highlight earnings rush as market hovers near record highs: What to know this week": 0.5,
  "Bloomberg: EU to prepare retaliation as US stance hardens - The US and the EU have less than two weeks to agree on a framework or it will be 30% across the board tariffs which will devastate many businesses. The EU has a powerful weapon in its fight against this economic bullying- a law called the ACI or anti Coercion instrument that gives the entire block broad powers to take retaliatory action. This can include": -0.6,
  "Kraft Heinz Could Be Breaking Up. How Should You Play the High-Yield Dividend Stock Here?": 0.2,
  "Monster Beverage (NASDAQ:MNST) Might Become A Compounding Machine": 0.6,
  "Coca-Cola, GM, Alphabet, Tesla: Earnings to watch this week": 0.5,
  "How AI is breathing new life into old tech giants": 0.5,
  "Sold Early This Year. Now Watching Markets Climb. What Can I Learn From This? - Lately, with how stocks and crypto have been moving up, I’ve been thinking a lot about some decisions I made earlier this year and trying to figure out what I can learn from it. Back in late Feb, when the market was dipping, I cut my exposure by about half. Then in May, I sold almost everything. Altogether, I cashed": 0.2,
  "1 Incredible Reason to Buy This Value Stock Before Wall Street Catches On": 0.8,
  "Why This Beaten-Down Medical Device Stock Could Be Your Best Investment for the Next 5 Years": 0.8,
  "Which stocks will have the most glorious drops once this bull markets over? - So far this markets been on a mega bull run since aprils announcement of tariffs tanked major indexes. Although that drop was overblown, I believe we are coming due for a correction as many stocks are making new highs daily. What are your picks for some that will crush accounts when the tides turn?": -0.6,
  "Should You Buy the 3 Highest-Paying Dividend Stocks in the Nasdaq-100?": 0.2,
  "London Stock Exchange Group considers launch of 24-hour trading - https://www.ft.com/content/881341a6-9b16-4051-abbe-102572868fe2 > London Stock Exchange Group is weighing whether to launch 24-hour trading as bourses race to extend access to stocks amid growing demand from small investors active outside normal business hours. > Pioneered in the US, longer trading windows have become a hot topic among exchange groups as they seek to modernise, spurred by the rise of younger investors who trade on their smartphones.": 0.6,
  "Nvidia Will Continue Controlling The AI Board - Nvidia is the 'queen' of the AI ecosystem, dominating hardware, software, and systems and controlling key segments from training to inference and networking. Unmatched AI leadership, explosive revenue growth, and strategic partnerships with players like Astera Labs, Credo, and Super Micro Computer reinforce Nvidia's central role. China market access and the Omniverse platform provide significant new growth drivers, supporting a strong 12-24 month growth outlook and a": 0.8,
  "Donald Trump faces frosty reception on Aberdeen golf trip": -0.6,
  "Tesla, Verizon, Coca-Cola, Alphabet, and More Stocks to Watch This Week": 0.5,
  "Thoughts on BBAI, OPEN, and CTM for long-term growth? - I’ve been looking into BBAI, OPEN, and CTM as potential long-term plays. I know BBAI isn’t technically a penny stock anymore, but I’m still curious about where people see it going. Just trying to take on a bit of risk while I’m still young (I’m 22), so I’d love to hear your thoughts or experiences with any of these. Any other suggestions in the same": 0.5,
  "AI Action Day This Wednesday - I posted a couple days ago expressing my view that money can be made by being on top of trump's agenda, policy-related news, etc. I'm not saying its easy, but I think in several instances so far this year, the \"puzzle pieces\" have been out there, and if you put them together, you could have positioned ahead of the news. MP was one i mentioned in my previous post": 0.2,
  "$SBET vs $BMNR - There's two jockeys racing to have the biggest ETH bag and i think BMNR might win, but everyone will make money. My thesis is Tom Lee might have a leg up over Joseph Lubin. Although Lubin is a co-founder Tom Lee has wallstreet name recognition and street cred on wallstreet. He's also a good salesman talking his book, im sure he's had alot of meetings gathering cash for more purchases. He": 0.6,
  "(Item 2.02) . Results of Operations and Financial Condition. On July 21, 2025, Roper Technologies, Inc. (the “Company”) issued a press release containing information about the Company’s results of operations for the quarter ended June 30, 2025. A copy of the press release is furnished as Exhibit 99.1.": 0.1,
  "(Item 8.01) Other Events. ATM Updates On July 21, 2025, MicroStrategy Incorporated d/b/a Strategy (“Strategy” or the “Company”) announced updates with respect to its at-the-market offering programs: ATM Program Summary During Period July 14, 2025 to July 20, 2025 As of July 20, 2025 Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) Common ATM 1,636,373 MSTR Shares - $736.4 $17,042.7 Securities Offered: Class A Common Stock,": 0.1,
  "(Item 8.01) Other Events. On July 21, 2025, MicroStrategy ® Incorporated d/b/a Strategy ™ (the “Company”) issued a press release announcing that, subject to market and other conditions, it intends to conduct an initial public offering of 5,000,000 shares of its Variable Rate Series A Perpetual Stretch Preferred Stock. A copy of the press release is filed hereto as Exhibit 99.1 and is incorporated herein by reference. Neither this Current Report on Form 8-K nor the press": 0.1,
  "(ITEM 8.01) . OTHER EVENTS. As previously disclosed, on May 16, 2025, Charter Communications, Inc., a Delaware corporation (“Charter”), entered into a Transaction Agreement (the “Transaction Agreement”) by and among Charter, Charter Communications Holdings, LLC, a Delaware limited liability company and subsidiary of Charter (“Charter Holdings”), and Cox Enterprises, Inc., a Delaware corporation (“Cox Enterprises”), pursuant to which (i) Cox Enterprises will sell and transfer to Charter 100% of the equity interests of certain subsidiaries of Cox": 0.1,
  "3 Cybersecurity Stocks You Can Buy and Hold for the Next Decade": 0.5,
  "How do you start to use a company’s financials? - I’m 28 and I have some money left over every month after my core investments to play around with and want to start to get into some more risky stocks. When I say risky I don’t mean crazy risk but want to start analyzing financial statements etc.. to make smart decisions. How should I start to learn to value stocks and not just look at": 0.5,
  "How do you actually do due diligence on a stock? - I’ve been investing for a bit now but still feel like I’m just guessing sometimes. I want to learn how to properly evaluate a company like knowing if it’s undervalued, what indicators to look at, how to assess financials, competitive advantage, management, etc. Basically, how do you figure out if a stock is likely to go up in the long term? Any resources, frameworks,": 0.6,
  "CoStar (CSGP) To Report Earnings Tomorrow: Here Is What To Expect": 0.2,
  "Earnings To Watch: PACCAR (PCAR) Reports Q2 Results Tomorrow": 0.2,
  "How do you guys actually keep up with SEC filings in real time? - I've missed a few major trades lately just because I wasn’t fast enough to catch the filings. I try to track 6-Ks, 8-Ks, S-1s, etc. but it’s just overwhelming sometimes. Curious, how do you stay on top of it without spending hours refreshing EDGAR?": -0.6,
  "Ground Transportation Stocks Q1 Teardown: Old Dominion Freight Line (NASDAQ:ODFL) Vs The Rest": 0.2,
  "Apparel Retailer Stocks Q1 Highlights: Lululemon (NASDAQ:LULU)": 0.5,
  "UBS Raises Monster (MNST) Price Target, Maintains Neutral Rating": 0.5,
  "HSBC Raises Booking (BKNG) Price Target, Maintains Buy Rating": 0.6,
  "3 Reasons We Love Booking (BKNG)": 0.5,
  "3 Reasons We’re Fans of MercadoLibre (MELI)": 0.5,
  "2 Growth Stocks to Add to Your Roster and 1 We Brush Off": 0.2,
  "2 Large-Cap Stocks for Long-Term Investors and 1 We Brush Off": 0.2,
  "1 Volatile Stock with Competitive Advantages and 2 We Avoid": 0.5,
  "2 Large-Cap Stocks with Promising Prospects and 1 That Underwhelm": 0.2,
  "2 Industrials Stocks with Competitive Advantages and 1 We Find Risky": 0.2,
  "Is it better to invest in shares or stocks with monetary dividend option? - New to the world of stocks. I’m still trying to grasp all concepts and terminology but I noticed on RobinHood and SoFi, a person has the option to invest in shares acquisitions or just monetary investment. I’m just wondering which is better in the long run or if there’s an actual difference. Any advice would be greatly appreciated!": 0.2,
  "Fastenal’s Q2 Earnings Call: Our Top 5 Analyst Questions": 0.2,
  "Think it's time to sell GRAB. Thoughts on what to buy into? - Initially bought into GRAB as it's big where I live and pretty much had the market cornered. My personal experience with the company and working with several of it's developers also prompted my buy. Now, I think GRAB is starting to run out of room to grow. The SEA rideshare market is pretty crowded and, atleast where I live, competitors are moving": -0.6,
  "Is this a good time to buy Netflix after the earnings dip? - I know I'm late to the party on NFLX, but after their recent dip post earnings, I have a feeling it would be a good buy in point looking at the potentials of Q3/4. I genuinely believe it could go past 1300, and despite what people like to claim YouTube is not a direct competitor to Netflix. I'm mostly looking at this": 0.6,
  "Kewsong Lee owns 21,351,492 shares of TransDigm Group Inc (TDG) stock worth over $34.1 Billion - Is Gurufocus legit? If it's true why isn't he on Forbes, Bloomberg list? AI response: As of my latest knowledge, Kewsong Lee, the former CEO of The Carlyle Group, has not been confirmed as a billionaire. While he held a high-profile leadership role at one of the world's largest private equity firms, his exact net worth is not publicly": 0.0,
  "Zacks Market Edge Highlights: FAST, NVDA and CTAS": 0.0,
  "Domino’s regains US sales momentum in Q2": 0.6,
  "TownePlace Suites by Marriott unveils new extended-stay hotel in US": 0.5,
  "Zacks Industry Outlook Highlights O'Reilly Automotive and Advance Auto Parts": 0.5,
  "Zacks Industry Outlook Highlights Honeywell, 3M, Carlisle Companies and Federal Signal": 0.5,
  "Analysis-Kraft Heinz seeks to revive old brands by undoing 2015 mega-merger": 0.5,
  "Microchip Technology's Quarterly Earnings Preview: What You Need to Know": 0.5,
  "ASML Shares Tumble. Time to Run for the Hills or Buy the Dip?": -0.5,
  "Biggest US Power Sale to Offer Glimpse of AI’s Cost to Consumers": 0.2,
  "Block Surges on S&P 500 Inclusion: ETFs in Focus": 0.5,
  "Best Income Stocks to Buy for July 21st": 0.5,
  "Verizon boosts annual forecast on demand for premium plans, tax law benefit": 0.6,
  "Lululemon enters Italy with first store in Milan": 0.5,
  "Cadence Design Systems (NASDAQ:CDNS) shareholders have earned a 25% CAGR over the last five years": 0.8,
  "Estimating The Intrinsic Value Of Starbucks Corporation (NASDAQ:SBUX)": 0.1,
  "Airbnb Sued by Los Angeles Over Alleged Price Gouging, Misrepresentation During Wildfires": -0.8,
  "Corporate Earnings, Geopolitics Nudge Wall Street Higher Pre-Bell; Asia Mixed, Europe Off": 0.5,
  "Stocks Gain Pre-Bell as Investors Brace for More Earnings": 0.5,
  "JAKKS Pacific And Two Other Leading Dividend Stocks": 0.2,
  "This Week In AI Chips - Reshoring Boosts Manufacturing Amid Strategic Partnerships and Acquisitions": 0.5,
  "3 Stocks Estimated To Be 10% To 27.3% Below Intrinsic Value": -0.5,
  "Roper Technologies beats Q2 estimates, raises full-year guidance": 0.8,
  "Biogen beefs up North Carolina manufacturing ahead of potential drug tariff storm": 0.2,
  "Roper Technologies raises annual forecasts on strong software demand": 0.8,
  "Domino's Same-Store Sales Growth Tops Estimates": 0.8,
  "Returns On Capital Are Showing Encouraging Signs At Baker Hughes (NASDAQ:BKR)": 0.6,
  "Roper Technologies (ROP) Surpasses Q2 Earnings and Revenue Estimates": 0.8,
  "U.S. plays hardball on tariffs deadline as EU battles for a deal - >The U.S. has signaled it will not let up on its Aug. 1 deadline for higher tariffs on the European Union as the bloc fights to strike a deal in time. >Over the weekend, U.S. Commerce Secretary Howard Lutnick said he was confident a trade deal could be struck with the European Union, but warned that the deadline for a baseline 30%": 0.2,
  "Micron Stock Soars 36% YTD: Still a Buy or Time to Book Profits?": 0.5,
  "LRCX Soars 59% in Three Months: Is the Stock Still Worth Buying?": 0.5,
  "Lululemon expands to Italy with first store in Milan": 0.5,
  "SRPT's Shocking Stand: Company Rejects FDA Request To Pull Gene Therapy Elevidys - >The ground shook for Sarepta Therapeutics, Inc. (NASDAQ:SRPT) last week as the U.S. Food and Drug Administration (FDA), alarmed by a third patient death tied to its gene therapy platform, pulled a rare move: requesting a voluntary halt to Elevidys shipments. The company’s response? A resounding “no,” igniting a major regulatory clash with severe implications for patients and investors alike. >The upheaval": -0.8,
  "ACHR is up 23% this week hold or lock in profits? - Hey everyone, I’m still new to investing and started a small position in Archer Aviation a little while back. This past week it jumped 23% and now I’m not sure if I should hold or trim a bit. The rise happened right after their CFO resigned, which initially spooked the stock, but they quickly announced that Priya Gupta (who was already acting CFO)": 0.2,
  "Jeep maker Stellantis warns of a shock $2.7 billion loss as tariffs bite - >Auto giant Stellantis expects a net loss of 2.3 billion euros ($2.68 billion) in the first half of the year amid pre-tax net charges and early effects of U.S. tariffs, the company said Monday in its preliminary figures. >Stellantis, which owns household names including Jeep, Dodge, Fiat, Chrysler and Peugeot, estimated first-half net revenue of 74.3 billion euros, down from 85": -0.8,
  "Cisco Systems, Inc. (CSCO): It “Could Have An Oracle-Like Revaluation,” Says Jim Cramer": 0.6,
  "CSX Corporation (CSX): CEO Is Doing A Good Job, Says Jim Cramer": 0.6,
  "Digital Payment Update - PaaS Growth Driven By Evolving Consumer Preferences and Tech Advancements": 0.5,
  "Marriott International, Inc. (MAR)’s Raise Was Great, Says Jim Cramer": 0.8,
  "Madison Large Cap Fund Added Airbnb (ABNB) on a Dip": 0.5,
  "CDW Corporation (CDW) Moved Higher Tied to Industry Tailwinds": 0.5,
  "Three Things to Watch for in Tesla Q2 Earnings (Estimated EPS of $0.43) after market closed on Wednesday. - One: Tesla's Core Business * Automobile sale is Tesla's Core * Guidance for upcoming automobile sales * Refreshed Model Y's outlook * Outlook of sales with the Sep 30 expiration of the US EV tax credit Two: Robotaxi rollout * Future rollout plans * Strategy to compete from Waymo and Uber * Chance for Tesla's Robotaxi/": 0.2,
  "Starbucks Corporation (SBUX): “This Is The Right Rime To Buy Starbucks,” Says Jim Cramer": 0.6,
  "Tesla Q2 Earnings: Can They Rebound or Are the Best Days Behind Them? - Tesla Q2 earnings are about to drop, and investors are nervous. The stock’s down about 20% this year, and the company is facing a mix of challenges. First off, the auto business, which is still Tesla’s cash cow, is struggling. Deliveries dropped by 13.5% compared to last year, and revenue is expected to fall by about 9%. With competition heating up": -0.6,
  "(07/21) Sarepta Slumps - Interesting Stocks Today! - (07/21) Interesting Stocks Today Hi! I am an ex-prop shop equity trader. This is a daily watchlist for short-term trading: I might trade all/none of the stocks listed, and even stocks not listed! I am targeting potentially good candidates for short-term trading; I have no opinion on them as investments. The potential of the stock moving today is what makes it interesting, everything else is secondary. News:": 0.2,
  "Froot Loops maker WK Kellogg to remove artificial colors": 0.5,
  "Shopify Inc. (SHOP) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Want Better Returns? Don't Ignore These 2 Computer and Technology Stocks Set to Beat Earnings": 0.5,
  "Datadog, Inc. (DDOG) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "How to Find Strong Computer and Technology Stocks Slated for Positive Earnings Surprises": 0.8,
  "Investors Heavily Search Costco Wholesale Corporation (COST): Here is What You Need to Know": 0.5,
  "DOJ antitrust case against Google could hit Apple harder than expected $20Byear in question - It looks like the Department of Justice is about to announce a remedial decision in Google's antitrust case Most people are focusing on Alphabet but Apple may be at greater risk in the short term. According to Morgan Stanley the case directly threatens the roughly $20 billion-plus that Google pays Apple annually for defaulting to Google's search engine on the": -0.5,
  "Three CMOs of multibillion-dollar tech companies share the secrets to success they wish all CEOs knew": 0.5,
  "Beat the Market the Zacks Way: Curtiss-Wright, Oracle, Starbucks in Focus": 0.5,
  "Domino’s Earnings Bring Good and Bad News. The Stock Is Jumping.": 0.5,
  "Exploring Analyst Estimates for Honeywell International (HON) Q2 Earnings, Beyond Revenue and EPS": 0.2,
  "Gear Up for Keurig Dr Pepper (KDP) Q2 Earnings: Wall Street Estimates for Key Metrics": 0.2,
  "Why Lam Research (LRCX) is a Top Stock for the Long-Term": 0.8,
  "Roper Technologies (ROP) Q2 Earnings: How Key Metrics Compare to Wall Street Estimates": 0.5,
  "Are Medical Stocks Lagging  DexCom (DXCM) This Year?": 0.1,
  "Target downgraded, Dollar Tree upgraded: Wall Street's top analyst calls": 0.2,
  "Morgan Stanley: AMZN Top Pick, Boosts Internet Stock Outlook - Morgan Stanley upgraded PINS to Overweight and ETSY to Equalweight, naming AMZN its top internet stock, citing a more favorable macro outlook and lower expected China tariffs. The firm raised its U.S. online ad growth forecast for 2025 to 11% (from 8%), driven by improved sentiment and lowered tariff risks. AMZN is seen with 33% upside to a $300 target, fueled by AWS strength and": 0.8,
  "Verizon Earnings Push the Stock Higher. Why the Market Loves the Results.": 0.8,
  "Verizon Beats Estimates, Microsoft in Security Crisis, Equinix Gets Aggressive Buy as Tech Earnings Week Begins - This week's market focus will be on big tech company earnings reports. Today's pre-market index gains, especially in Nasdaq futures, reflect the market's expectations for tech stocks. Here are four stock moves I'm watching: 🔹 Microsoft (MSFT): down 0.3% premarket as SharePoint software was revealed to be under “active attack”. The software is widely used within government and": 0.2,
  "NKE Rallies 19% in a Month: Time to Buy the Hype or Wait for Proof?": 0.2,
  "Here's Why Cognizant (CTSH) is a Strong Momentum Stock": 0.6,
  "r/Stocks Daily Discussion Monday - Jul 21, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.2,
  "Cadence Design Systems (CDNS) Reports Next Week: Wall Street Expects Earnings Growth": 0.5,
  "Update: Airbnb Sued by Los Angeles Over Alleged Price Gouging, Misrepresentation During Wildfires": -0.8,
  "SHOP Trades Higher Than Industry at 13.75X P/S: Is the Stock a Buy?": 0.2,
  "How to deal with the feeling of selling too early and missing out on life changing money? - I had bought PLTR back in 2021 at an average of 28$/share. In November, it flew all the way up and it was at 43$/share. I doomscrolled on reddit and researched as much as I could. The P/E ratio did not make sense at all. With the presidency news on the horizon too, I decides to sell": -0.6,
  "Why Microsoft Is Urging Security Updates for SharePoint Customers": 0.2,
  "Earnings live: GM stock sinks on tariff hit, Coca-Cola to launch cane sugar soda": 0.1,
  "Figma looks to raise nearly $1B as it kicks off its IPO roadshow": 0.5,
  "CRWD vs. CYBR: Which Cybersecurity Stock is the Better Buy Now?": 0.5,
  "Automatic Data Processing Investors Eyeing Q4 Bookings Growth, Fiscal 2026 Outlook, RBC Says": 0.5,
  "TD Cowen upgrades Norfolk Southern and CSX on rising takeover odds": 0.5,
  "Starbucks Poised to Report Better-Than-Expected Fiscal Q3 Same-Store Sales, RBC Says": 0.8,
  "BlackLine Stock Gets Relative Strength Rating Lift": 0.5,
  "Target Catches Another Downgrade. These Stores Are Better Positioned.": 0.5,
  "S&P 500 and Nasdaq hit record highs to start the week thanks to gains in tech - U.S. stocks moved higher on Monday as investors tracked the latest developments in trade and awaited the start of big tech earnings this week. The S&P 500 rose 0.6%, and the Nasdaq Composite jumped 0.7%. Both indexes hit new all-time intraday highs earlier in the session, bolstered by advances in major technology names. Alphabet increased around 2%, while": 0.8,
  "DocuSign's IAM: Automating Agreements, Redefining Enterprise": 0.5,
  "Roper Q2 Earnings Top Estimates, Application Software Sales Up Y/Y": 0.8,
  "Applied Materials (AMAT) Upgraded to Buy: Here's What You Should Know": 0.6,
  "Why Qualcomm (QCOM) Could Beat Earnings Estimates Again": 0.5,
  "Why Booking Holdings (BKNG) is Poised to Beat Earnings Estimates Again": 0.8,
  "Will Kraft Heinz (KHC) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Five Key Charts to Watch in Global Commodities This Week": 0.0,
  "Roper Tech Lifts 2025 Outlook As AI, Acquisitions Fuel Double-Digit Growth": 0.8,
  "Can PayPal's Crypto Strategy Give It a Competitive Edge?": 0.5,
  "Airbnb: A Capital-Light Compounder Hiding in Plain Sight": 0.5,
  "Reinvest profits or let it ride? - Hi all, For the last 18 months I’ve been contributing into my ISA (UK tax-free investment account) and have managed to make a nice return of around £1.5k on my investments in multiple different ETFS. Originally, my strategy with this ISA was to almost treat it like a retirement fund i.e any money made or invested into the account wouldn’t be touched unless I had a dire life": 0.5,
  "Figma's IPO priced between $25 to $28 - Three weeks ago I [wrote a post](https://www.reddit.com/r/investing/comments/1lr70x3/figmas_ipo_why_i_think_its_worth_2750share/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) estimating Figma’s IPO valuation and landed on a fair value of $27.50/share based on a discounted cash flow analysis. Today, Figma officially priced its IPO between $25 - $28/share - almost exactly in line with my estimate. The fully diluted valuation is estimated to be $14.6B o $16.4B. For context, I had assumed: * Revenue would decelerate from 46% to": 0.8,
  "Adobe Trades 38% Below 52-Week High: Right Time Buy the ADBE Stock?": 0.2,
  "Domino's belated stuffed crust and delivery investments drive 3.4% sales growth": 0.6,
  "Affirm Likely to Continue to Gain Share in Buy Now, Pay Later Space, Oppenheimer Says": 0.8,
  "This 12 Dividend Stock Portfolio Will Pay Your Bills – Every Week": 0.6,
  "How do we feel about Popmart (PMRTY)? - There's been A LOT of mainstream hype around the IP at Popmart. Labubu is becoming a global phenomenon with, it seems like, people of all ages similar to a Hello Kitty or Miffy. They also have collaborations with Disney, Toei Animation, and other companies that have built-in audiences. There's an element of gambling with the blind boxes, a model that's popular in Asia and seems to be": 0.6,
  "S&P 500, Nasdaq Scale New Highs in Broad-Based Rally": 0.8,
  "How Will Celsius Leverage Its Energy Drink Market Share in 2025?": 0.5,
  "Alphabet earnings, Cleveland-Cliffs surges, CSX upgraded": 0.5,
  "Biogen beefs up North Carolina manufacturing ahead of potential Trump tariff": 0.1,
  "Mondelez International (MDLZ) Unveils CHIPS AHOY! x Stranger Things Cookie Collaboration": 0.5,
  "He's 66, Retired, And Has $1.9M In An IRA — Should He Pay Cash or Finance a Vacation Home?": 0.2,
  "Verizon boosts annual forecast, shares rise": 0.8,
  "Netflix Stock Is Still a Hit on Wall Street After Earnings": 0.8,
  "Equities Rise Intraday as Traders Await This Week's Corporate Earnings": 0.5,
  "Its not just bitcoin. Companies are now adding ethereum to their balance sheets.": 0.5,
  "US retail giant Costco to set up global capability centre in India, to employ 1000 people, sources say": 0.6,
  "American Electric Power Company (NASDAQ:AEP) shareholders have earned a 9.2% CAGR over the last five years": 0.8,
  "Figma's $1 Billion IPO Gambit: Can It Bounce Back After Adobe Walked Away?": 0.1,
  "3 Stocks Showcasing Strong Earnings Growth: NVDA, APP, GE": 0.8,
  "Nat-Gas Prices Sink on the Outlook for Cooler US Temps and Higher Gas Production": -0.7,
  "U.S. Natural Gas Futures Give Back Gains": -0.5,
  "Starbucks to Report Weak Q3 Results Amid Slow Demand, Higher Investments, UBS Says": -0.6,
  "Biogen (BIIB) Stock Trades Down, Here Is Why": -0.5,
  "onsemi (ON) Stock Is Up, What You Need To Know": 0.5,
  "Sector Update: Consumer Stocks Rise Late Afternoon": 0.5,
  "Top Stock Picks for Week of July 21, 2025": 0.0,
  "Synopsys Acquisition Of Ansys Gives It Unique Capabilities, CFO Says": 0.6,
  "Why SentinelOne Stock Is Skyrocketing Today": 0.8,
  "Chip Gear Stocks Get Boost From AI Prospects": 0.6,
  "Nasdaq, S&P 500 Hit Fresh Record Highs as Focus Shifts to Upcoming Earnings": 0.8,
  "Why SentinelOne (S) Stock Is Trading Up Today": 0.5,
  "NXP Semiconductors (NXPI) Surpasses Q2 Earnings and Revenue Estimates": 0.8,
  "Any bull case for IWM? - I have SPY and VYM in my portfolio but I'm trying to actively trade a few things, IWM being one of them. My hope was that IWM was lagging and would eventually pick up steam, but it's not looking great right now, sitting below all time high and not making a higher high today. Is there a bull case for IWM or should I look elsewhere? This is specifically": -0.6,
  "Trump Media ($DJT) builds $2 billion bitcoin hoard, as cryptocurrency swells president’s net worth - >Trump Media and Technology Group said Monday it has accumulated roughly $2 billion in bitcoin and related assets, as President Donald Trump’s highly lucrative pivot to cryptocurrency continues to grow his net worth while in office. > >The bitcoin holdings now account for about two-thirds of Trump Media’s total liquid assets, the company said in a press release. > >Trump": 0.8,
  "Palo Alto Networks (PANW) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "Applied Materials (AMAT) Laps the Stock Market: Here's Why": 0.5,
  "PDD Holdings Inc. Sponsored ADR (PDD) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Shopify (SHOP) Laps the Stock Market: Here's Why": 0.5,
  "Broadcom Inc. (AVGO) Outperforms Broader Market: What You Need to Know": 0.6,
  "Constellation Energy Corporation (CEG) Stock Declines While Market Improves: Some Information for Investors": -0.5,
  "Lam Research (LRCX) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Synopsys (SNPS) Rises Higher Than Market: Key Facts": 0.5,
  "Intuit (INTU) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Microsoft Rushes to Stop Hackers from Wreaking Global Havoc": -0.8,
  "Acquisition Bought Stock at Premium - So I had stocks of Ansys Inc. (ANSS), today they were bought and merged into Synopsys (SNPS). But in my account transactions ANSS was sold at market price and SNPS was bought at an insane premium of $1007 USD, market price would have been around $590 USD. Can anyone explain why, I'm not very experienced and can't find a reason online.": -0.8,
  "BNSF hires Goldman, CSX seeks bankers as Union Pacific sparks rail M&A race, sources say": 0.2,
  "Comcast (CMCSA) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Diamondback Energy (FANG) Stock Declines While Market Improves: Some Information for Investors": -0.5,
  "Biogen Inc. (BIIB) Partners with Stoke Therapeutics to Tackle Dravet Syndrome": 0.6,
  "What are your favorite speculative plays that HAVE NOT blow up yet? - I’ve been doing a lot of research lately into speculative growth stocks with major upside potential think multi-baggers over the next couple years, but not ones that have already had their big run recently (e.g., not up 100%+ this month or +25% today). I’ve been looking into names like ENVX, NVTS, AMPX, and SOUN companies that might have rough execution now, but": 0.2,
  "AstraZeneca Plans to Invest $50 Billion in U.S. by 2030": 0.8,
  "MicroStrategy 'Stretch'-ed it too far with new product launch": -0.6,
  "(Item 2.02) . Results of Operations and Financial Condition. On July 22, 2025, Intuitive Surgical, Inc. (“Intuitive”) issued a press release announcing its financial results for the quarter ended June 30, 2025. A copy of the press release is furnished hereto as Exhibit 99.1. The information in this Current Report on Form 8-K, including Exhibit 99.1, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange": 0.1,
  "(Item 8.01) . Other Events On July 22, 2025, Constellation Energy Corporation (the Company) learned the results of the PJM capacity auction for the 2026-2027 planning year. Each of the Company's power plants located in the PJM market cleared in the auction. Capacity revenues for nuclear units are included in the gross receipts calculation for the Production Tax Credit. The auction results take effect June 1, 2026. The table below lists the Company's cleared capacity volumes for": 0.2,
  "(ITEM 2.02) . Results of Operations and Financial Condition The Registrant’s news release dated July 22, 2025, regarding its second-quarter results of operations and financial condition is attached hereto as Exhibit 99. The attached news release includes references to the following financial measures that were not prepared in accordance with generally accepted accounting principles in the United States (non-GAAP measures): free cash flow and ratios based on free cash flow. The company believes these non-GAAP measures provide\n\n(Item 2.02) ) 104 Cover Page Interactive Data File (embedded within the Inline XBRL document)": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition. On July 22, 2025, Baker Hughes Company (the \"Company\") issued a news release announcing its financial results for the quarter ended June 30, 2025, a copy of which is furnished with this Form 8-K as Exhibit 99.1 and incorporated herein by reference. In accordance with General Instructions B.2. of Form 8-K, the information shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of\n\n(Item 2.02) , \"Results of Operations and Financial Condition.\"": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On July 18, 2025, the Board of Directors (the “Board”) of Applied Materials, Inc. (“Applied” or the “Company”) elected James R. Anderson to the Board and the Board’s Strategy and Investment Committee, effective immediately. Mr. Anderson will receive the standard compensation payable to non-employee directors of the Board, consisting of: (1) an annual retainer of $100,000 (prorated": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On July 22, 2025 , CoStar Group, Inc. (“CoStar Group” or the “Company”) announced its financial and operating results for the quarter ended June 30, 2025. The full text of the press release (the “Press Release”) issued in connection with the announcement is furnished as Exhibit 99.1 to this Current Report on Form 8-K. The information contained in this\n\n(Item 2.02) and the Press Release shall be considered “furnished” and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of that Section or Sections 11 and 12(a)(2) of the Securities Act of 1933, as amended, nor shall it be deemed incorporated by reference into any reports or filings with the Securities and Exchange Commission (the \"SEC\"), whether made before or": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition On July 22, 2025 PACCAR Inc (the “Registrant”) issued a press release announcing its financial results for the second quarter of 2025 and announcing that it would hold a conference call with securities analysts to discuss second quarter 2025 earnings to be held that same day as more fully described in the press release attached as Exhibit 99.1 to this report. The information in this Current Report on Form": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition. On July 21, 2025, NXP Semiconductors N.V. (\"NXP\") issued a press release regarding NXP’s financial results for its second quarter 2025. A copy of the press release is attached as Exhibit 99.1. The information contained in this\n\n(Item 2.02) , including the attached exhibit, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), nor shall it be deemed to be incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such a filing.": 0.0,
  "Got $1,000? 2 Top Growth Stocks to Buy That Could Double Your Money.": 0.8,
  "ASML Just Quietly Booked Billions for Its EUV Machines. Is It Time to Buy the Stock?": 0.5,
  "Dow Jones Futures: Astera, Circle, Google, Netflix, Robinhood Are Big Movers; Powell Speech Next": 0.5,
  "Port of Los Angeles sees record container traffic as shippers race to beat Trump’s tariff deadlines - https://www.cnbc.com/2025/07/14/port-of-los-angeles-record-container-traffic-trade-war-shipping-tariffs.html KEY POINTS The Port of Los Angeles says that shipping container traffic has increased as importers race to beat the latest deadlines set by President Trump for tariffs. Trade from China, while short of a Covid-like surge, has been up ahead of the mid-August deadline for a deal which could raise tariffs on Chinese goods to 145%.": 0.5,
  "Earnings To Watch: CSX (CSX) Reports Q2 Results Tomorrow": 0.2,
  "O'Reilly (ORLY) To Report Earnings Tomorrow: Here Is What To Expect": 0.2,
  "Redditors working in IT, how do you feel about Cisco? - Some analysts are saying Cisco might be a great buy given it is undervalued compared to other AI infrastructure plays. But is it an AI play or just another cautionary tale? Some questions: * How exciting is the partnership with Nvidia? Nvidia has their own networking products so how will this work? Will Nvidia end up just using Cisco's connections to get in front": 0.2,
  "How can I learn to properly research stocks? - I’ve been in the market for a while but mostly just trading based on news and basic price trends. With earnings season coming up, I really want to take things a bit more seriously and improve my ability to do fundamental research. Problem is, I’m not quite sure where to begin. I know I should look at earnings reports, valuation ratios, maybe even compare companies in": 0.2,
  "2 Reasons to Watch ADP and 1 to Stay Cautious": 0.5,
  "2 Reasons to Avoid VRSK and 1 Stock to Buy Instead": -0.5,
  "2 Unpopular Stocks That Deserve a Second Chance and 1 We Find Risky": 0.2,
  "Roper Technologies Inc (ROP) Q2 2025 Earnings Call Highlights: Strong Revenue Growth and ...": 0.8,
  "Leveraged Bearish Strategy ETF Pulls in Millions at Record Lows": 0.2,
  "Is PepsiCo Stock a Buy After Earnings?": 0.2,
  "Zacks.com featured highlights NVIDIA, AppLovin and GE Aerospace": 0.2,
  "Can Netflix Stock Double by 2028?": 0.2,
  "SpaceX Wallet Springs to Life With $153M Bitcoin Transfer, First Move Since 2022": 0.5,
  "The Zacks Analyst Blog Highlights HubSpot, Okta, Adobe, NICE and Teradata": 0.5,
  "Company News for Jul 22, 2025": 0.0,
  "3 Healthcare Stocks to Buy Before They Announce Game-Changing Clinical Trial Results": 0.5,
  "Is CrowdStrike a Buy a Year After the Big IT Outage?": 0.2,
  "Liberty Group exits hotel business after 45 years": -0.5,
  "Biogen to invest further $2bn in North Carolina’s Research Triangle Park": 0.8,
  "Airbnb ‘take over’ now driving up Atlanta homeowners’ costs — here’s why insurance may be their next headache": -0.6,
  "r/Stocks Daily Discussion & Technicals Tuesday - Jul 22, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on technical analysis (TA), but if TA is not your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly": 0.2,
  "Trump Media stock tests the limits of bitcoin accumulation": 0.1,
  "Market Chatter: Hackers Breach US, European Government Networks Using Microsoft SharePoint Software Flaw": -0.8,
  "MicroStrategy Bolsters Its Bitcoin War Chest": 0.5,
  "I calculated which stocks are most sensitive to tariff announcements - In preparation for the August 1 tariff deadlines, I think it's important to know which stocks are most and least sensitive to tariff-related news. This will allow us to select exactly the stocks that will change the most when new tariff changes are announced, or buy the ones that are least sensitive to hedge your position or profit from the opposite direction. To calculate": 0.2,
  "After Falling on Earnings, Should You Buy the Dip in ASML Stock?": 0.2,
  "'Superman' Flies Past $400 Million But Falters Overseas, While 'Jurassic World Rebirth' Charges Toward $650 Million In A Red-Hot Summer Box Office Battle": 0.6,
  "Dollar's dive offsets tariff sting for some US bellwethers": 0.2,
  "Those who invested in Marvell Technology (NASDAQ:MRVL) five years ago are up 110%": 0.8,
  "Here's Why We Think Axon Enterprise (NASDAQ:AXON) Is Well Worth Watching": 0.6,
  "Only one Mag 7 name is investable, this money manager says": 0.2,
  "PepsiCo to roll out prebiotic cola in US": 0.5,
  "Union Pacific--Norfolk Southern Merger Buzz Could Spur Berkshire to Target CSX": 0.5,
  "15 names that Morgan Stanley’s analysts expect to move meaningfully on earnings": 0.5,
  "Buy 5 Big Data Behemoths to Strengthen Your Portfolio in 2H 2025": 0.5,
  "Buy Now or Regret Later: This Small-Cap Stock Has Big Disruption Potential": 0.8,
  "1 Stock-Split Stock to Buy Hand Over Fist in July and 1 to Avoid": 0.5,
  "Stocks Down Pre-Bell Ahead of Key Earnings, Fed Chair Powell's Speech": -0.5,
  "Here’s Why Copart (CPRT) Lagged the Market": -0.5,
  "Vertex Pharmaceuticals' Quarterly Earnings Preview: What You Need to Know": 0.5,
  "$ENVX Enovix Corp undertaking transformative battery tech - DD on $ENVX Enovix Batteries Corp (posted on behalf of 2percentisfair on X) Most battery tech journalism is frustrating because you will hear constant tales of a tech that will double or triple battery capacity, and then of course the change never happens. The reason for this is multi-faceted: 1) what works in a lab often doesn't work in real world conditions, 2) battery materials are like": 0.2,
  "Starbucks opens new drive-through store in St Philip, Barbados": 0.5,
  "5 Things to Know Before the Stock Market Opens": 0.0,
  "Astrazeneca, Phillip Morris & D.R. Horton earnings: Trending Tickers": 0.0,
  "SentinelOne (S) Moves 9.8% Higher: Will This Strength Last?": 0.5,
  "45% Of This Constellation Energy Insider's Holdings Were Sold": -0.5,
  "Paccar: Q2 Earnings Snapshot": 0.0,
  "Elon Musk Says 'They Simply Don't' Have The Funding, Doubts Stargate AI": -0.6,
  "Investor Confidence in Continued Growth Boosted Netflix (NFLX) in Q2": 0.8,
  "PACCAR (NASDAQ:PCAR) Posts Better-Than-Expected Sales In Q2": 0.8,
  "Carnival and General Mills have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "NFL Star Odell Beckham Jr., Who Converted His Salary To Bitcoin In 2021, Says, 'Safe To Say We Still Our Happy With Our Decision'—Here's What It Is Worth Now": 0.8,
  "Is the Options Market Predicting a Spike in Analog Devices Stock?": 0.2,
  "PPL vs. Xcel Energy: Which Utility Stock Offers More Upside?": 0.2,
  "$TSLA RSI at 35: Is the Selloff Overdone or Just Getting Started? - Tesla ($TSLA) is down 18% this month, and the RSI is now at 35, just above oversold territory. The MACD is also showing a bearish crossover. Is this a buying opportunity, or should I wait for a clearer trend reversal?": -0.5,
  "Figma’s IPO Seeks $13B Valuation in Latest Tech Debut. How It Stacks Up to Adobe.": 0.5,
  "Is Trending Stock Netflix, Inc. (NFLX) a Buy Now?": 0.2,
  "How to Boost Your Portfolio with Top Medical Stocks Set to Beat Earnings": 0.8,
  "Adobe Inc. (ADBE) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Investors Heavily Search Micron Technology, Inc. (MU): Here is What You Need to Know": 0.5,
  "AppLovin Corporation (APP) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Those who invested in Exelon (NASDAQ:EXC) a year ago are up 25%": 0.5,
  "Coca-Cola Europacific Partners to close non-refundable PET line in Germany": -0.5,
  "Another round of US-China trade talks will start next week in Sweden: Bessent": 0.2,
  "PACCAR shares up after Q2 profit beat": 0.8,
  "Tesla’s Easy Money from Regulatory Credits Drying Up Amid Sluggish Sales - Tesla's financial model has long been propped up by selling regulatory credits to traditional automakers, but that source of income is rapidly shrinking as U.S. government policies change and Tesla’s sales falter. In a key shift, recent changes to environmental laws, particularly under the Trump administration, are set to weaken the demand for these credits. Essentially, regulatory credits have been a way for": -0.7,
  "Vuori plots international growth with 15 stores": 0.5,
  "Morning Movers: Cleveland-Cliffs rallies after second quarter earnings release": 0.5,
  "Paccar (PCAR) Beats Q2 Earnings and Revenue Estimates": 0.8,
  "Countdown to Charter (CHTR) Q2 Earnings: A Look at Estimates Beyond Revenue and EPS": 0.5,
  "Brokers Suggest Investing in Zscaler (ZS): Read This Before Placing a Bet": 0.5,
  "Why This 1 Computer and Technology Stock Could Be a Great Addition to Your Portfolio": 0.6,
  "Brokers Suggest Investing in Cadence (CDNS): Read This Before Placing a Bet": 0.5,
  "Is It Worth Investing in Take-Two (TTWO) Based on Wall Street's Bullish Views?": 0.5,
  "Brokers Suggest Investing in Marvell (MRVL): Read This Before Placing a Bet": 0.5,
  "Paccar (PCAR) Reports Q2 Earnings: What Key Metrics Have to Say": 0.2,
  "Lockheed Martin, AstraZeneca, DR Horton: Trending Tickers": 0.0,
  "Applied Materials (AMAT) Recently Broke Out Above the 20-Day Moving Average": 0.6,
  "SharpLink's Ether Bet Surpasses $1.3B After Latest Purchase": 0.6,
  "1 Incredible Reason to Buy This Dividend Stock Before July 29": 0.5,
  "Here's Why CDW (CDW) is a Strong Value Stock": 0.6,
  "Netflix downgraded, Intel initiated: Wall Street's top analyst calls": 0.1,
  "Stifel Q2 cybersecurity survey: Macro dynamics weighing on near-term results": -0.5,
  "Over 30 million US homes don’t have a mortgage, report says — why that’s a red flag for the housing market": -0.6,
  "Here's Why Intuit (INTU) is a Strong Growth Stock": 0.6,
  "KSS (Kohl's Stores) Current Trend and Future Outlook Analysis - Hello everyone, today we are here to talk about the latest price and future trend of KSS (Kohl's Stores).Looking at the charts, KSS has been a very bright price performer of late, with the latest closing price set at $10.42, flat from earlier, but pre-market quotes show a gain of 78.55%, indicating that the market's interest in this stock has increased dramatically. It is worth": 0.8,
  "S&P 500 stocks: List of additions and removals in 2025": 0.0,
  "Will Cisco's Focus on Web-Scale Clients Bring More AI Deals?": 0.5,
  "Electronic Arts (EA) Expected to Beat Earnings Estimates: What to Know Ahead of Q1 Release": 0.5,
  "Booking Holdings (BKNG) Earnings Expected to Grow: Should You Buy?": 0.5,
  "Earnings Preview: Mondelez (MDLZ) Q2 Earnings Expected to Decline": -0.5,
  "Analysts Estimate Starbucks (SBUX) to Report a Decline in Earnings: What to Look Out for": -0.5,
  "Paypal (PYPL) Reports Next Week: Wall Street Expects Earnings Growth": 0.5,
  "Halliburton Stock Slips. CEO Sees Oil Services Demand Weakening.": -0.6,
  "Is Alibaba Cloud's Growing Partner Base a Catalyst for Future Returns?": 0.5,
  "Jefferies Maintains Underperform on Lululemon (LULU), Trims Target to $175": -0.5,
  "NXP Semiconductors Q2 Earnings Beat Estimates, Revenues Fall Y/Y": 0.2,
  "Meet the Newest Growth Stock Joining the S&P 500. It's Up 80% in 3 Months, and It's Still a Buy Right Now, According to Wall Street.": 0.8,
  "Stocks Pressured by Chip Stock Weakness": -0.5,
  "QuantumScape (QS) Can't Hide Commercialization Lag Even After Big Gains; I'm Keeping a Neutral Point of View - QuantumScape (NYSE: QS) shares have doubled in value in just a few weeks, soaring to a market capitalization of about $7.6 billion after announcing the inclusion of Cobra diaphragms in its baseline production process. But I don't think the current valuation is sustainably supported, despite the major theoretical breakthrough in solid-state battery technology. Highlight review: The Cobra": 0.1,
  "Charter Communications to Report Q2 Earnings: What's in the Cards?": 0.2,
  "Will Strong Top-Line Expansion Boost Corning's Q2 Earnings?": 0.5,
  "Should You Consider Adding IDEXX Laboratories (IDXX) to Your Portfolio?": 0.5,
  "Berkshire Hathaway May Have Stepped Up Its Role in Potential Railroad Mergers": 0.5,
  "Should you replace your bank account with PayPal?": 0.0,
  "How Global Expansion Is Shaping Costco's Long-Term Profile": 0.5,
  "Fortinet Expands via Cross-Selling: A Path to More Profitability?": 0.5,
  "Cathie Wood Goes Bargain Hunting: 3 Stocks She Just Bought": 0.5,
  "Here’s why Intel is in a catch-22 situation: Loop Capital": 0.1,
  "Dollar General Up 51% in 6 Months: Time to Cash Out or Hold DG Stock?": 0.2,
  "Honeywell Gears Up to Report Q2 Earnings: Is a Beat in Store?": 0.5,
  "Keurig Dr Pepper Likely to Post In-Line Q2 Despite Softer Sales, RBC Says": 0.2,
  "Mondelez Q2 Earnings Expected to Be 'Positive Catalyst' for Stock, Vital Farms Likely to Raise Outlook, Morgan Stanley Says": 0.8,
  "Stocks Slip on Weakness in Chip Makers and Disappointing Earnings": -0.7,
  "Nvidia Stock Slips. Here Are Reasons to Believe the AI Trend Will Keep Going, Analysts Say.": 0.5,
  "Are These Stocks the Next FANG? Jim Cramer Thinks So": 0.5,
  "Micron Launches First Space-Ready Memory Chip To Power AI Missions In Orbit": 0.8,
  "Magnificent 7's AI Spend Accelerates: Can it Push INOD Stock Higher?": 0.6,
  "Arm Holdings (ARM) Stays on Analyst Radar as AI Demand Fuels Fresh Price Target": 0.5,
  "PLTR Stock Warning: This Analyst Says Palantir Is ‘Too Crowded.’ Here’s Why.": -0.6,
  "I'm bullish on AST SpaceMobile because it has major contracts with Vi India and NASDA - I'm bullish on AST SpaceMobile, Inc. ( NASDAQ: ASTS ) based on recent contracts with government and commercial organizations. For example, a deal with Vi India (Vodafone Idea) to provide satellite connectivity could reach 1.1 billion subscribers, while a government contract with the U.S. Space Development Agency (SDA) is expected to generate $43 million in revenue. When I looked": 0.8,
  "AZN Commits USD50B to US Manufacturing Expansion Amid Tariff Pressures": 0.5,
  "Zoom Workplace enhancements:  Opportunities and hurdles": 0.2,
  "Super Micro Computer's HPC Solutions Propel Server Growth: What's Next?": 0.5,
  "Dear Intel Stock Fans, Mark Your Calendars for July 24": 0.5,
  "Palantir (PLTR) Wins Key U.S. Army AI Contract in Push for Défense Growth": 0.6,
  "Shopify (SHOP) Stock Trades Down, Here Is Why": -0.5,
  "Electronic Arts (EA) Stock Trades Up, Here Is Why": 0.5,
  "Netflix (NFLX) Upgraded to Strong Buy: Here's Why": 0.8,
  "Intel (INTC) Price Target Raised Ahead of Lip Bu Tan’s First Full-Quarter Earnings Report": 0.5,
  "Why Take-Two (TTWO) is Poised to Beat Earnings Estimates Again": 0.8,
  "Will CDW (CDW) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Railroad stocks, Microsoft, Equifax: Trending Tickers": 0.0,
  "Chip stocks slide, NXP weak outlook, Coinbase inks PNC deal": -0.5,
  "NVIDIA (NVDA) Analysts See Long-Term Upside as AI Exports to China Get Green Light": 0.8,
  "Strategy vs. Riot Platforms: Which Bitcoin-Focused Stock Has an Edge?": 0.1,
  "CRWD Bets on Agentic AI Security: Will it Unlock Next Growth Phase?": 0.6,
  "Big Tech earnings: Why this 'common thread' will be 'key'": 0.5,
  "GitLab's Partner Base Expands: Is Growth Thesis Strengthening?": 0.6,
  "Poppi Founder Allison Ellsworth on Selling Her $500 Million Brand: 'You're Happy But You Have Anxiety'": 0.2,
  "Nvidia, Apple Partner Sets Up After 217% Surge; Custom Chip King Eyes AI Boom": 0.8,
  "Why Paccar Stock Popped Today": 0.5,
  "Etsy faces user boycott over ‘Alligator Alcatraz’-branded products": -0.7,
  "PACCAR CEO Optimistic About Growth Despite Soft Truckload Market, Tariff Concerns": 0.8,
  "Solana News: $SOL >$200, Ecosystem >$250 Billion, DEX Volume >$1 Trillion for 2025": 0.8,
  "ASML Earnings \"Miss\": What the Market Got Wrong": -0.5,
  "PepsiCo Stock Just Had Its Best Day in Over 5 Years. Is The Dividend King a No-Brainer Buy Now?": 0.8,
  "AstraZeneca to invest $50 bn in the US as tariff threat looms": 0.5,
  "Coca-Cola swaps corn syrup for cane sugar in MAHA-inspired move": 0.5,
  "Intuit (INTU) Enhances Enterprise Suite With AI Agents For Mid-Market Business Efficiency": 0.6,
  "PepsiCo (PEP) Innovates With Launch Of Prebiotic Cola To Meet Modern Tastes": 0.8,
  "American Electric Power Company (AEP) Declares US$0.93 Quarterly Dividend Payable September 2025": 0.5,
  "Google to report Q2 earnings as Wall Street looks for AI revenue gains": 0.5,
  "Alphabet and Tesla Earnings, Home Sales and More: What to Watch This Week": 0.5,
  "Linde (LIN) Expands U.S. Space Footprint With New Industrial Gas Facilities": 0.5,
  "Nvidia move deals a major blow to AMD, Intel, and ARM": -0.8,
  "NXP Semiconductors (NXPI) Reports Lower Q2 Earnings, Provides Q3 Revenue Guidance": -0.5,
  "Palo Alto Networks (PANW) Eyes Possible Acquisition of SentinelOne for Approximately US$7 Billion": 0.5,
  "Palantir Stock Just Zoomed Past $150. My Prediction for What Comes Next": 0.5,
  "Netflix Lifted Guidance. Is the Stock a Buy Following Its Drop?": 0.2,
  "US Equity Indexes Mixed as General Motors Reports $1.1 Billion Tariff Hit, Economic Data Show Weakness": -0.6,
  "Arm Holdings (ARM) Reports Strong Year-Over-Year Performance Despite Net Income Dip": 0.6,
  "Is Google new AI model release Gemini 2.5 Flash-Lite worth keeping an eye on? - Google just released Gemini 2.5 Flash-Lite their fastest and lowest-cost AI model yet optimised for latency-sensitive tasks like translation and classification. Compared to previous versions it has lower latency and is more affordable Many companies are already using it such as Satlyt to reduce latency and power consumption HeyGen to do automatic video translation DocsHound to process long videos and": 0.6,
  "Market Breadth Is Improving. Tech Recovers From Early Drop.": 0.5,
  "Pepsi to introduce prebiotic cola this fall after buying Poppi": 0.2,
  "PepsiCo To Launch Cane Sugar-Based Prebiotic Cola This Fall To Counter Declining Soda Consumption": 0.5,
  "Corporate Earnings, Trade Developments Leave Equity Markets Mixed Intraday": 0.0,
  "Microsoft Says Chinese Hackers Exploiting SharePoint Flaws": -0.7,
  "Time to sell ENPH? - Enphase been on a constant slope for a year and with the current US administration it seems to have very little incentive to rise much within the next 3.5 years. What are your opinions? Time to sell and invest in something more lucrative and get in later? My entry was around 70$": -0.6,
  "The S&P 500 Would Be Cruising to Another Record Today—If Not for These Stocks": 0.2,
  "GOOGL Earnings: The Cheapest of the Magnificent 7": 0.5,
  "Why This Analog Semiconductor Stock Is A Top Undervalued Pick": 0.6,
  "Threads adds improved content performance metrics for creators": 0.6,
  "NXPI Q2 Deep Dive: Early Signs of Cyclical Recovery, Automotive Inventory Headwinds Ease": 0.6,
  "iOS 26 beta 4 arrives, with Liquid Glass tweaks and AI news summaries": 0.5,
  "Lululemon's China Cooldown And US Struggles Weigh On Outlook": -0.5,
  "How AI Earnings Could Make or Break the S&P 500’s Rally": 0.2,
  "Navitas vs. ON Semiconductor: Which Power Stock is a Better Bet Now?": 0.2,
  "Why CSX (CSX) Stock Is Up Today": 0.5,
  "Palantir (PLTR) Stock Trades Down, Here Is Why": -0.5,
  "The 'Stakes Are High' for Big Tech Earnings": 0.5,
  "Microsoft: Chinese Hackers Exploiting SharePoint Flaw": -0.6,
  "ASM second-quarter bookings disappoint, cites order timing": -0.5,
  "Tesla's California sales down for seven straight quarters - https://www.reuters.com/business/autos-transportation/teslas-california-sales-down-seven-straight-quarters-2025-07-22/ “July 22 (Reuters) - Tesla's (TSLA.O), opens new tab electric vehicle registrations in California fell 21.1% in the second quarter, according to industry data, marking the seventh consecutive quarterly drop in the crucial U.S. market.”": -0.8,
  "Forecasts for Milder US Weather Weigh on Nat-Gas Prices": -0.5,
  "Welcome everyone to exchange ideas about DUNT. - Krispy Kreme ($DNUT) is quietly transforming itself from a nostalgic donut brand into a global powerhouse. With its scalable hub-and-spoke model, new partnership with McDonald's, and growing international presence, the company is positioned for long-term sweet returns. Add in improving margins and consistent revenue growth, and you’ve got a dessert stock with real meat on the bones.": 0.8,
  "Sector Update: Tech Stocks Retreat Late Afternoon": -0.5,
  "Why AMD Stock Is Sinking Today": -0.5,
  "SharePoint Hacks Turn Up Heat on Microsoft’s Cyber Overhaul": 0.5,
  "AI Search Is Growing More Quickly Than Expected": 0.8,
  "Commentary: CEOs have a new boss — Trump": 0.1,
  "SentinelOne (S) Rallies 9.8% on $10-Billion Potential Buyout": 0.8,
  "General Motors and Coca-Cola earnings reveal an important reminder: Opening Bid top takeaways": 0.2,
  "Oracle & OpenAI, Amazon, NXP Semi: Trending Tickers": 0.0,
  "Wall Street's Gold Fever Goes Beyond Nvidia, Palantir. Here's Another Gem To Watch.": 0.5,
  "S&P 500 Ekes Out Record–Even as Nvidia and Broadcom Close Lower": 0.2,
  "AT&T Earnings Are Up Next. Verizon’s Results Bode Well.": 0.5,
  "Amazon analysts reboot stock price targets ahead of Q2 report; a focus on space tech": 0.2,
  "Alphabet’s Longest Rally Since 2010 Underlines Earnings Optimism": 0.8,
  "question about wash sales and partial sales - so i've always wondered. let's say you buy 1000 shares of X corp on January 1st. and you see the price going down so you decide to sell 500 shares. Now you have 500 shares short term remaining. Let's say you decided to buy back 500 shares in July and then sell the 500 shares again in September. So you are back to having just 500 shares": 0.0,
  "Texas Instruments’s (NASDAQ:TXN) Q2 Sales Top Estimates But Stock Drops": -0.5,
  "Dear Microsoft Stock Fans, Mark Your Calendars for July 30": 0.5,
  "CoStar: Q2 Earnings Snapshot": 0.0,
  "Intuitive Surgical (NASDAQ:ISRG) Beats Expectations in Strong Q2": 0.8,
  "Texas Instruments Stock Falls On Weak Earnings Outlook": -0.8,
  "China innovation and deals are good for biotech: AstraZeneca CEO": 0.6,
  "Is Robinhood’s Earnings Notification Broken on LMT? - Notification when I woke up said Lockheed earned $7.29 per share beating expectations by 11%. I bought some shares thinking the dip was random. Then I read some news saying they massively missed earnings, earning $1.46 a share. Missing expected earnings of $6.41…. Where did they pull the 7.29 number from LMFAO. Mad I bought shares but it is at a massive low rn for an evil": -0.8,
  "Trump Revises Trade Terms With Indonesia, Philippines. Critical Mineral Access Added.": 0.5,
  "Earnings release - how soon can I find out? - A company I am interested in was supposed to release the earnings today after market close. Market closed 25 minutes back and I cannot find the earnings anywhere online (on their website or google or yahoo or nasdaq). I know I will be able to find the earnings tomorrow on google but is there a way to find them today? Is there a way to": -0.5,
  "Wall Street Loves GE Vernova. Earnings Are an Important Test.": 0.6,
  "Figma’s Auction-Like IPO Set Up to Capitalize on Strong Demand": 0.8,
  "He Lost His Wife — And Now He's Been Waiting Over 6 Months For Her Social Security Benefits": -0.8,
  "CoStar’s (NASDAQ:CSGP) Q2 Sales Top Estimates": 0.8,
  "Three Video Streamers Top Netflix In Customer Satisfaction": 0.6,
  "US stocks end mixed as GM shares tumble and S&P 500 reaches record high": 0.5,
  "Texas Instruments Stock Slides on Disappointing Outlook": -0.7,
  "Robotic surgery giant Intuitive falls on profit margin concerns": -0.6,
  "Hershey Lifts Candy Prices, Citing High Cocoa Costs": -0.5,
  "Arm Rises 3% as Wells Fargo Lifts Price Target to $175": 0.8,
  "Top Research Reports for NVIDIA, Amazon.com & Meta Platforms": 0.5,
  "Texas Instruments Stock Slumps on Soft Profit Forecast": -0.7,
  "Intel Stock Is in a ‘Catch-22’ Scenario. How Should You Play INTC Here?": 0.2,
  "Constellation Energy and Vistra stocks surge after PJM capacity auction results": 0.8,
  "Amazon acquires Bee, the AI wearable that records everything you say": -0.5,
  "Apple alerted Iranians to iPhone spyware attacks, say researchers": -0.5,
  "NVIDIA's Story Keeps Getting Brighter": 0.8,
  "S&P 500 Notches New Record, Nasdaq Snaps 6-Day Winning Streak": 0.5,
  "Low income people: where's your portfolio at? - I'm sure you've all seen the posts about people hitting milestones on this sub and others, and perhaps felt a bit inadequate for being so far behind. You know the ones I'm talking about: 30 year olds hitting $100k on 6 figure salaries or mid earners FIREing and investing every penny whilst living with parents. So this is a post for normal people with low-mid salaries with": -0.6,
  "Baker Hughes: Q2 Earnings Snapshot": 0.0,
  "SAP Reports Mixed Results. The AI Stock Is Falling.": -0.5,
  "Morgan Stanley recalibrates its view on Apple stock ahead of earnings": 0.5,
  "CoStar raises annual revenue forecast as net bookings climb": 0.8,
  "Baker Hughes beats second-quarter profit estimates on strong demand for natgas technology": 0.8,
  "AI Boom Drives Power Costs to New Record on Biggest US Grid": -0.6,
  "Texas Instruments (TXN) Q2 Earnings and Revenues Top Estimates": 0.8,
  "Intuitive Surgical Skids As Robotic Surgery Giant Calls For A Slowdown This Year": -0.6,
  "Intuitive Surgical, Inc. (ISRG) Q2 Earnings and Revenues Top Estimates": 0.8,
  "CoStar Group (CSGP) Q2 Earnings and Revenues Beat Estimates": 0.8,
  "Nasdaq edges down from records ahead of big tech earnings": -0.5,
  "Texas Instruments (TXN) Q2 Earnings: Taking a Look at Key Metrics Versus Estimates": 0.5,
  "CoStar (CSGP) Reports Q2 Earnings: What Key Metrics Have to Say": 0.2,
  "Baker Hughes Logs Higher Second-Quarter Profit, but Revenue Slides": 0.2,
  "Marvell Technology (MRVL) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Palantir Technologies Inc. (PLTR) Stock Declines While Market Improves: Some Information for Investors": -0.5,
  "Nvidia (NVDA) Stock Falls Amid Market Uptick: What Investors Need to Know": 0.1,
  "Fortinet (FTNT) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Why Cadence Design Systems (CDNS) Outpaced the Stock Market Today": 0.5,
  "Tesla Vs. BYD: Tesla Stock Near Buy Point With Earnings, Robotaxis In Focus; BYD Makes Bullish Move": 0.5,
  "Intuitive Surgical (ISRG) Reports Q2 Earnings: What Key Metrics Have to Say": 0.2,
  "Gilead Sciences (GILD) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Booking Holdings (BKNG) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Vertex Pharmaceuticals (VRTX) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Tesla Faces 75% Drop in Credit Revenue Amid Policy Shift": -0.8,
  "AstraZeneca Announces $50B US Investment Amid Pharma Tariff Threat": 0.5,
  "Intuitive Surgical reports upbeat quarterly earnings on strong demand for surgical robots": 0.8,
  "Baker Hughes (BKR) Tops Q2 Earnings and Revenue Estimates": 0.8,
  "Why Broadcom Stock Sank Today": -0.5,
  "Ross Stores (ROST) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "KLA (KLAC) Stock Falls Amid Market Uptick: What Investors Need to Know": -0.2,
  "Tesla Settles Lawsuit Over Louisiana's Direct Sales Ban          Ask ChatGPT": 0.0,
  "Texas Instruments Profit, Sales Up in Second Quarter": 0.5,
  "AI Takes Gold at Math's Toughest Test": 0.6,
  "Google's AI Licensing Deal with 20 News Outlets": 0.5,
  "Larry Ellison Defended 'Friend' Elon Musk While Others Mocked Him —'You're Saying Elon's An Idiot. The Guy's Landing Rockets! And Who Are You?'": 0.6,
  "Nvidia, Alphabet, SMCI Rally With No Bubble Warning": 0.6,
  "Netflix Leans on Runway AI for Rapid VFX": 0.5,
  "OpenAI's $500B Power Move Just Got Bigger -- Oracle Is Building the Backbone": 0.6,
  "Texas Instruments Plunges After Forecast Fuels Tariff Fears": -0.7,
  "Amazon to buy startup focused on AI wearables": 0.5,
  "Why Micron Stock Sank Today": -0.5,
  "Google Q2 Earnings Preview: First Hyperscaler Out of the Gate": 0.5,
  "T-Mobile's 5G to power Comcast, Charter wireless business plans": 0.5,
  "This Tiny AI Startup Just Hit $1 Billion -- And It's Not Backed by OpenAI or Google": 0.8,
  "Alphabet & Tesla earnings, existing home sales: What to Watch": 0.0,
  "Nvidia and Snowflake Power Reka AI to Billion-Dollar Heights": 0.8,
  "Women Climbed The Corporate Ladder—Then Watched The \"Alpha Males\" Take Over Again": -0.6,
  "Stock market today: Dow, S&P 500, Nasdaq futures inch up as Trump announces trade deal with Japan": 0.5,
  "Dow Jones Futures Rise As Trump Announces Japan Trade Deal; Tesla, Google, GE Vernova Earnings Due": 0.5
}