{
  "Morgan Stanley Reduces Price Target on PayPal Holdings (PYPL)": -0.5,
  "Block, Inc. (XYZ)’s Square and Thrive Expand Partnership": 0.5,
  "What 2025 Tells Us About MercadoLibre's Long-Term Story": 0.2,
  "Market Chatter: China Requiring Chipmakers to Use at Least 50% Domestically Made Equipment for Expanding Capacity": 0.2,
  "Zacks Industry Outlook Highlights Veracyte, IDEXX Laboratories and Intuitive Surgical": 0.5,
  "AI Trade’s Next Leg Is All About Tech’s ‘Pick-and-Shovel’ Stocks": 0.5,
  "The Zacks Analyst Blog Highlights International Business Machines, Analog Devices, Johnson & Johnson's, The Gap and Hewlett Packard Enterprise": 0.5,
  "The Zacks Analyst Blog Highlights Apple, Cisco Systems and IBM": 0.5,
  "3 Growth Stocks With High Insider Confidence": 0.5,
  "Celsius Holdings Among 3 Value Stocks Trading Below Estimated Worth": 0.5,
  "Exploring High Growth Tech Stocks In The US For December 2025": 0.5,
  "My 3 Favorite Stocks to Buy Right Now": 0.0,
  "AI trade next year: This stock is an AI 'sleeper hit'": 0.6,
  "How to Buy PYPL for a 29% Discount, or Achieve a 7% Annual Return": 0.2,
  "AppLovin (APP) Surged Spurred By Broad-Based Growth Drivers": 0.8,
  "How Tempus AI Is Building Scale While Near-Term Risks Persist": 0.2,
  "3 Stocks Likely to Gain From Rising HSA Contribution & Medicare Premium": 0.5,
  "Low-Beta Stocks to Own as We Head Into 2026: MNST, TDC, NGS & COCO": 0.5,
  "Vertex Pharmaceuticals price target raised to $525 from $456 at Leerink": 0.5,
  "Company News for Dec 30, 2025": 0.0,
  "2 Growth Stocks to Buy For 2026 and Beyond": 0.5,
  "Here's How Much a $1000 Investment in KLA Made 10 Years Ago Would Be Worth Today": 0.5,
  "Cathie Wood’s ARK Funds Have Crushed the Market This Year. What’s She’s Buying Now.": 0.8,
  "Here’s what you should know about the US TikTok deal": 0.2,
  "Three Key Trends CoStar Says Are Likely to Shape Canada’s Real Estate Market in 2026": 0.5,
  "PayPal Holdings, Inc. (PYPL) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Palo Alto Networks, Inc. (PANW) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Investors Heavily Search Constellation Energy Corporation (CEG): Here is What You Need to Know": 0.5,
  "AI Arms Race Drives Capex Boom: 3 AI Stocks to Watch in 2026": 0.5,
  "The Dividend Aristocrat With 53% Margins Just Widened the Gap on the Frozen Dividend Competitor": 0.6,
  "Reasons Why Investors Can Consider Buying ADP Stock Now": 0.5,
  "Starbucks Winning Battle Against Labor": -0.5,
  "Is It Finally Time to Buy This Dividend Stock Now That It Has a 6.6% Dividend Yield?": 0.2,
  "eBay (EBAY) Climbs 3% on Holiday Boost": 0.6,
  "GE HealthCare Technologies (GEHC) Boasts Earnings & Price Momentum: Should You Buy?": 0.6,
  "Datadog (DDOG) Is Considered a Good Investment by Brokers: Is That True?": 0.5,
  "RBLX vs TTWO: Which Gaming Stock Has the Stronger 2026 Setup?": 0.5,
  "CorpGov Yearly Highlights: Looking Ahead to Princeton, LA and Palm Beach in 2026": 0.5,
  "Mondelēz Global LLC Expands Voluntary Recall of 2 SKUs of CHIPS AHOY! Baked Bites Brookie in the US": -0.6,
  "Warner Bros Discovery to reject Paramount’s $108.4B bid, CNBC says": -0.5,
  "Can Amgen's MariTide Take on Leaders in the Obesity Space?": 0.2,
  "Why Trump blocking Netflix-WBD deal would be 'the right thing to do'": -0.5,
  "Top Midday Stories: Meta Acquires AI Startup Manus; Tesla Says Analysts Project Lower Q4 Deliveries": 0.2,
  "OGE vs. AEP: Which Stock Is the Better Value Option?": 0.0,
  "Can Unified SASE Adoption Strengthen FTNT's Growth Trajectory in 2026?": 0.5,
  "SoftBank Finishes $40 Billion OpenAI Bet": 0.5,
  "What Makes Monolithic (MPWR) a New Buy Stock": 0.5,
  "PayPal Holdings, Inc. (PYPL) Offers Upside, but Analysts Aren’t Fully Convinced": 0.2,
  "Robinhood makes shocking prediction for 2026": 0.1,
  "Porch Group And 2 Other Growth Stocks Insiders Are Confident In": 0.5,
  "Marriott’s controversial new ban draws guest criticism": -0.6,
  "3 ESG Stocks to Add to Your Portfolio for Sustainable Returns in 2026": 0.5,
  "PLTR vs. ARM: Which AI-Tech Stock is the Better Buy Now?": 0.5,
  "BMY vs AMGN: Which Biotech Stock Is More Resilient Now?": 0.2,
  "New $17 Million Bet on STAAR Surgical Comes as Sales Jump 7% and Margins Hit 82%": 0.8,
  "Sector Update: Consumer Stocks Decline in Afternoon Trading": -0.5,
  "Top Stock Reports for Berkshire Hathaway, AstraZeneca & Intel": 0.0,
  "Electronic Arts Is Going Private. Is It Too Late to Buy EA Stock?": 0.1,
  "Warner Bros. Plans to Reject Paramount Offer Next Week": -0.5,
  "Dow Jones AI Giant Nvidia Hits Early Buy Trigger": 0.5,
  "ADP Downgraded to Underperform as Jefferies Flags Structural Headwinds": -0.6,
  "Stocks to Watch Tuesday: Boeing, Meta, Applied Digital, Pop Mart": 0.2,
  "This Company Just Announced Long-Term Contracts For Nuclear Power Amid Rosy Outlook For This Commodity": 0.8,
  "Gilead (GILD) Reaches Pricing Agreement with US Government to Lower Drug Costs": 0.8,
  "Strong Results and Pipeline Momentum Power Amgen’s (AMGN) 2025 Rally": 0.8,
  "Applied Materials (AMAT) Dips More Than Broader Market: What You Should Know": -0.5,
  "Shopify (SHOP) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Lam Research (LRCX) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "CSX Says Train Derailed in Kentucky; Delays Expected": -0.5,
  "Why Gilead Sciences (GILD) Dipped More Than Broader Market Today": -0.5,
  "Vertex Pharmaceuticals (VRTX) Dips More Than Broader Market: What You Should Know": -0.5,
  "KLA (KLAC) Suffers a Larger Drop Than the General Market: Key Insights": -0.5,
  "This Restaurant Tech Stock Is Down 50% and Just Lost a $17 Million Backer": -0.7,
  "Diamondback Energy (FANG) Increases Despite Market Slip: Here's What You Need to Know": 0.5,
  "Bankers Are Gearing Up for Another Onslaught of Monster Deals in 2026": 0.6,
  "Q3 Earnings Roundup: Monolithic Power Systems (NASDAQ:MPWR) And The Rest Of The Analog Semiconductors Segment": 0.2,
  "Amgen (AMGN): Buy, Sell, or Hold Post Q3 Earnings?": 0.2,
  "3 Reasons to Avoid REGN and 1 Stock to Buy Instead": -0.5,
  "1 S&P 500 Stock to Target This Week and 2 We Turn Down": 0.2,
  "3 High-Flying Stocks That Fall Short": -0.6,
  "1 Safe-and-Steady Stock to Keep an Eye On and 2 We Question": 0.0,
  "1 Cash-Heavy Stock to Keep an Eye On and 2 We Turn Down": 0.2,
  "2 Large-Cap Stocks with Solid Fundamentals and 1 Facing Challenges": 0.2,
  "It’s Earnings Warning Season. How to Profit From Others’ Misery.": 0.2,
  "Update: Market Chatter: China Requiring Chipmakers to Use at Least 50% Domestically Made Equipment for Expanding Capacity": 0.2,
  "IDEXX Laboratories (NASDAQ:IDXX) shareholders have earned a 65% return over the last year": 0.8,
  "Tecnotree Included as a Representative Provider in Gartner® Innovation Insight: AI SOC Agents Accelerate CSP SecOps Transformation": 0.6,
  "Wedbush Names Apple a Top AI Pick for the 2026 Market Cycle": 0.8,
  "Starbucks doesn’t want to be on every street in New York and Los Angeles anymore": 0.2,
  "Starbucks Closes 400 U.S. Stores": -0.7,
  "Warner Bros. Board Prepares to Reject Revised Paramount Skydance Bid": -0.5,
  "Palo Alto Networks (NASDAQ:PANW) Is Looking To Continue Growing Its Returns On Capital": 0.6,
  "The Zacks Analyst Blog Highlights Berkshire Hathaway, AstraZeneca, Intel, Kingsway Financial and BK Technologies": 0.5,
  "American Electric's Investments and Renewables Fuel Long-Term Growth": 0.8,
  "ISRG Sees 91% SP Growth: A Turning Point for Single-Port Surgery?": 0.6,
  "Earnings Preview: What to Expect From KLA Corporation's Report": 0.5,
  "Dow Jones Futures Fall On 2025's Final Day; Eli Lilly, Shopify Forge Buy Points": -0.2,
  "Donna Rae Garff Marriott, Cherished Wife, Mother, Grandmother, and Community Leader, Passes Away at Age 90": -0.8,
  "Warren Buffett Says Goodbye Today With 65% of Berkshire Hathaway in 5 of His Favorite Stocks": 0.5,
  "Intuit (INTU) Slipped as the Outlook and Guidance Fell Short of Expectations": -0.6,
  "The 5 Best Stocks to Play AI in 2026, According to Wall Street’s Loudest Tech Bull": 0.5,
  "Can Qualcomm Stock Benefit From a Foray Into Mid-Range AI Chips?": 0.5,
  "Do Options Traders Know Something About MercadoLibre Stock We Don't?": 0.2,
  "Why Lam Research Is a Must-Own Pick-and-Shovel Stock for the AI Boom": 0.8,
  "Starbucks Corporation (SBUX) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Ultragenyx (RARE) Moves 15.5% Higher: Will This Strength Last?": 0.5,
  "Micron Technology's NAND Revenues Reach $2.7B: Is It a Growth Lever?": 0.5,
  "Nvidia asks TSMC to ramp up H200 production, Paramount's WBD offer": 0.0,
  "Brokers Suggest Investing in Analog Devices (ADI): Read This Before Placing a Bet": 0.5,
  "Is Monolithic Power Systems (MPWR) Outperforming Other Computer and Technology Stocks This Year?": 0.2,
  "Inside the Streaming Consolidation Battle": 0.0,
  "By 2026, These Underrated AI Stocks Could Be the Market's Biggest Winners": 0.6,
  "Here Are the Top-Performing S&P 500 Stocks From 2025": 0.5,
  "Buy 5 Solid Semiconductor Stocks of 2025 With Room for Growth in 2026": 0.8,
  "Mondelez expands voluntary recall of Chips Ahoy Baked Bites Brookie in U.S.": -0.5,
  "Micron, Trade Desk, Western Digital: 2025's Big Stock Movers": 0.5,
  "AppLovin's High Revenue-to-Profit Conversion is the Story": 0.6,
  "Is Monster Beverage Driving Momentum Through Innovation and Marketing?": 0.5,
  "Can T-Mobile's Customer-Focused Strategy Benefit the Stock?": 0.5,
  "ASML (ASML) Positioned for Growth as Citi Identifies AI Demand as Primary Catalyst for 2026 Semiconductor Equipment Outlook": 0.8,
  "Lam Research (LRCX) Leads Etch Market as AI-Driven Memory Supercycle Fuels Robust WFE Spending Outlook Through 2026": 0.8,
  "Cantor Fitzgerald Urges Long Position on Western Digital (WDC) Amid AI Infrastructure Wave": 0.8,
  "Citi: SpaceX’s $800B Valuation Doubles EchoStar’s (SATS) Expected Equity Value Following Spectrum Deal": 0.5,
  "Morgan Stanley Expects Gilead Sciences (GILD) to Thrive as Biopharma Policy Uncertainties Fade in 2026": 0.8,
  "DV vs. ADSK: Which Stock Is the Better Value Option?": 0.2,
  "Is KLA Corporation (KLAC) The Best Performing Quantum Computing Stock of 2025?": 0.5,
  "Is Shopify (SHOP) One of the High Growth Large Cap Stocks to Buy Right Now?": 0.5,
  "Wedbush Lifts PT on DoorDash (DASH) Stock": 0.5,
  "J.P. Morgan Maintains Bullish Stance on CrowdStrike Holdings (CRWD) Stock": 0.8,
  "Morgan Stanley Reduces PT on Axon Enterprise (AXON) Stock": -0.5,
  "Morgan Stanley Reduces PT on Zscaler (ZS) Stock": -0.5,
  "Starbucks CEO Brian Niccol says a Reddit thread about people interviewing at the company convinced him his ‘Back to Starbucks’ plan is working": 0.5,
  "Warren Buffett is stepping down as Berkshire Hathaway CEO. It's one of several big C-suite shake-ups in 2026.": 0.2,
  "Starbucks store hours for New Year's Eve and New Year's Day 2026": 0.0,
  "Global X Cybersecurity’s ETF May Be 2026’s Best Investment As Cybercrime Explodes | BUG": 0.6,
  "Dogs of the Dow Had a Strong Year. Here Are the 10 Stocks for 2026.": 0.6,
  "Rival Railroads Slam UP-NS Merger Application, Citing Incomplete Data": -0.6,
  "Robo-Taxis and Home Runs? 40 ’Forgotten’ Stocks for 2026.": 0.2,
  "How Western Digital Became the S&P 500’s Best Stock in 2025—and Why Trade Desk Was the Worst": 0.2,
  "Where Will Intuitive Surgical Be in 5 Years?": 0.2,
  "AppLovin (APP) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Here's Why Datadog (DDOG) Fell More Than Broader Market": -0.5,
  "Constellation Energy Corporation (CEG) Declines More Than Market: Some Information for Investors": -0.5,
  "Palo Alto Networks (PANW) Dips More Than Broader Market: What You Should Know": -0.5,
  "Paypal (PYPL) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "Why Starbucks (SBUX) Dipped More Than Broader Market Today": -0.5,
  "Fortinet (FTNT) Declines More Than Market: Some Information for Investors": -0.5,
  "Intuit (INTU) Suffers a Larger Drop Than the General Market: Key Insights": -0.5,
  "Intuitive Surgical, Inc. (ISRG) Dips More Than Broader Market: What You Should Know": -0.2,
  "Analog Devices (ADI) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Paccar (PCAR) Declines More Than Market: Some Information for Investors": -0.5,
  "Booking Holdings (BKNG) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Here's Why Texas Instruments (TXN) Fell More Than Broader Market": -0.5,
  "The 3 Stocks That Crushed the S&P 500 in 2025": 0.5,
  "Prediction: These 2 Growth Stocks Will Beat the Market Through 2031": 0.5,
  "Unpacking Q3 Earnings: Palo Alto Networks (NASDAQ:PANW) In The Context Of Other Cybersecurity Stocks": 0.2,
  "3 Reasons ADSK is Risky and 1 Stock to Buy Instead": -0.5,
  "3 of Wall Street’s Favorite Stocks Worth Your Attention": 0.5,
  "3 S&P 500 Stocks We Keep Off Our Radar": -0.5,
  "1 Profitable Stock with Exciting Potential and 2 Facing Headwinds": 0.5,
  "2 Growth Stocks to Add to Your Roster and 1 We Avoid": 0.5,
  "2 Healthcare Stocks for Long-Term Investors and 1 We Find Risky": 0.2,
  "1 Healthcare Stock to Target This Week and 2 We Question": 0.2,
  "3 Profitable Stocks Walking a Fine Line": 0.1,
  "1 Cash-Heavy Stock on Our Buy List and 2 Facing Challenges": 0.2,
  "3 Semiconductor Stocks with Open Questions": -0.5,
  "Home Stocks Go Ape Over Google. Why Zillow and Others Aren’t Scared.": 0.6,
  "10 Stock Market Predictions for 2026": 0.2,
  "VC Firm a16z Flags Stablecoins, Tokenization and Privacy as Key Themes for 2026": 0.5,
  "Is Texas Instruments Incorporated (NASDAQ:TXN) Expensive For A Reason? A Look At Its Intrinsic Value": 0.5,
  "The Best Stocks to Invest $1,000 in to Start the New Year Off Right": 0.5,
  "Investors Should Be Encouraged By Fortinet's (NASDAQ:FTNT) Returns On Capital": 0.8,
  "Seagate Technology Holdings (STX) Has Gained More Than 98% Over the Past 6 Months, Here’s What You Need to Know": 0.8,
  "Wall Street Bullish on Lam Research Corporation (LRCX), Here’s What You Need to Know": 0.8,
  "Goldman Sachs Downgrades Arm Holdings (ARM) Amid Limited AI Cycle Exposure and Non-Traditional Market Challenges": -0.5,
  "US High Growth Tech Stocks to Watch": 0.0,
  "Diamondback Energy Insiders Sold US$365m Of Shares Suggesting Hesitancy": -0.5,
  "Roper Technologies (NASDAQ:ROP) Has A Pretty Healthy Balance Sheet": 0.6,
  "GE HealthCare Technologies Inc. (NASDAQ:GEHC) is largely controlled by institutional shareholders who own 87% of the company": 0.1,
  "The NASDAQ Cybersecurity ETF Looks Like One of 2026’s Best Investments": 0.8,
  "Reddit's 2026 Stock Picks - Here is the list for data from multiple posts and thousands of comments from r/stocks, r/wsb and r/investing from the various recommendation posts in the last 10 days. Data is optimized as best as I could to remove multiple recommendations from the same usernames as to not double count someone trying to pump certain stocks for some reason. Here's the list of top 30 recommendations ranked by # of mentions.": 0.1,
  "Paramount Skydance (PSKY) Should Bid $34 For Warner Bros, Says Jim Cramer": 0.5,
  "Britain hits ‘peak Costa’ as coffee chain’s losses double": -0.6,
  "'Stranger Things' Finale Could Boost Both Netflix, AMC Stocks: Here's How": 0.5,
  "CrowdStrike Is Still Best-in-Breed—But 2026 May Be a Tough Trade": 0.1,
  "The Power Bill, the AI Dip, and the Date That Could Flip 2026 Stocks": 0.2,
  "Insider Buying: Smart Money Just Spent +$100M on These 3 Stocks": 0.5,
  "Paypal Casino 2026 - Online Casino That Accept Paypal By Cafe Casino": 0.1,
  "From Rust to Riches: 2 Auto Parts Names Built for 2026": 0.5,
  "Better Artificial Intelligence Stock: Figma vs. UiPath": 0.5,
  "The Last Time This Happened, Qualcomm Fell 10%": -0.5,
  "Wall Street Braces For Another Year Of High-Value Transactions Following A Record-Breaking 2025": 0.8,
  "After Record Runs for Western Digital and Sandisk in 2025, Consider This 1 Data Center Storage Stock for 2026": 0.6,
  "2026 Sector Playbook: 3 Sectors Trading Below Fair Value": 0.5,
  "CrowdStrike Insiders Are Offloading CRWD Stock. Should You?": -0.5,
  "Moderately bullish activity in Marvell with shares down 1.95%": 0.5,
  "3 Top Cybersecurity Stocks to Buy in January": 0.5,
  "(Item 8.01) Other Events. Adjustment to Dividend Rate on Variable Rate Series A Perpetual Stretch Preferred Stock On December 31, 2025, Strategy Inc (the “Company”) increased the regular dividend rate per annum on the Company’s Variable Rate Series A Perpetual Stretch Preferred Stock effective for monthly periods commencing on or after January 1, 2026 from 10.75% to 11.00%. The Company announced this new rate via its website, www.strategy.com/strc. Cash Dividend Declaration On January 2, 2026, the Company": 0.1,
  "(Item 8.01) . Other Events On Dec. 29, 2025, Public Service Company of Colorado (PSCo), a Colorado corporation and wholly owned subsidiary of Xcel Energy Inc. filed a natural gas rate case with the Colorado Public Utilities Commission (CPUC) seeking an increase in revenue of $190 million or 11.6%. The request is based on a 10.75% return on equity, an equity ratio of 55% and a 2025 test year with a projected rate base of $4.7 billion.": 0.2,
  "(Item 2.02) Results of Operations and Financial Condition. On January 2, 2026, Tesla, Inc. published the press release which is attached hereto as Exhibit 99.1 and is incorporated herein by reference. This information is intended to be furnished under\n\n(Item 2.02) of Form 8-K and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “ Exchange Act ”), or incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act as shall be expressly set forth by specific reference in such a filing .": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. As part of Apple Inc.’s (“Apple’s”) previously announced Principal Accounting Officer transition plan, Apple’s Board of Directors appointed Ben Borders, 45, as Apple’s Principal Accounting Officer, effective January 1, 2026. Mr. Borders succeeds Chris Kondo in the role of Principal Accounting Officer. Mr. Borders joined Apple in November 2010 and assumed his current position in January 2026.": 0.2,
  "How Kraft Heinz Lost Its Lock on Mac and Cheese—and American Shoppers": -0.5,
  "Spotting Winners: Electronic Arts (NASDAQ:EA) And Consumer Internet Stocks In Q3": 0.5,
  "Semiconductor Manufacturing Stocks Q3 Teardown: KLA Corporation (NASDAQ:KLAC) Vs The Rest": 0.2,
  "3 Reasons to Sell PCAR and 1 Stock to Buy Instead": -0.5,
  "2 Reasons to Like QCOM (and 1 Not So Much)": 0.5,
  "3 Volatile Stocks with Open Questions": -0.5,
  "1 Cash-Producing Stock to Target This Week and 2 Facing Challenges": 0.2,
  "1 Growth Stock Set to Flourishand 2 We Avoid": 0.5,
  "1 S&P 500 Stock with Competitive Advantages and 2 We Brush Off": 0.2,
  "1 Unpopular Stock That Deserves a Second Chance and 2 We Question": -0.5,
  "2 Nasdaq 100 Stocks for Long-Term Investors and 1 That Underwhelm": 0.2,
  "2 Financials Stocks for Long-Term Investors and 1 We Find Risky": 0.2,
  "1 High-Flying Stock with Exciting Potential and 2 We Turn Down": 0.6,
  "1 Large-Cap Stock on Our Watchlist and 2 We Brush Off": 0.2,
  "2 Large-Cap Stocks Worth Your Attention and 1 We Question": 0.2,
  "1 Services Stock to Own for Decades and 2 We Ignore": 0.2,
  "3 Unpopular Stocks That Deserve Some Love": 0.5,
  "2 Nasdaq 100 Stocks with Solid Fundamentals and 1 We Turn Down": 0.2,
  "3 Large-Cap Stocks with Questionable Fundamentals": -0.5,
  "Is the Great Live Sports Bet Paying Off?": 0.2,
  "Best Income Ideas for 2026: Dividend Stocks, Energy Pipelines, and Other Top Picks": 0.8,
  "Investing in ASML Holding (AMS:ASML) five years ago would have delivered you a 132% gain": 0.8,
  "Zacks Investment Ideas feature highlights: Sandisk, Western Digital and Micron": 0.5,
  "Copart (NASDAQ:CPRT) investors are sitting on a loss of 31% if they invested a year ago": -0.7,
  "European AI Stocks Leap Into New Year": 0.6,
  "Hybrid AI will drive 'whole new wave' of opportunity in 2026": 0.6,
  "Monolithic Power Systems' (NASDAQ:MPWR) three-year total shareholder returns outpace the underlying earnings growth": 0.5,
  "Charter Communications (NASDAQ:CHTR) Use Of Debt Could Be Considered Risky": -0.6,
  "Building a 10 Stock Portfolio for the Long Run What Would You Pick? - I’m building a long-term individual stock portfolio for 2026 and beyond, and I want to narrow my focus to 10 high-quality companies I can hold for long term + 10 years Below is a list of stocks I’m currently considering, covering a mix of large-cap tech, growth, fintech, healthcare, AI, and speculative plays I’m comfortable taking on more risk in exchange": 0.5,
  "2026 portfolios: Why this strategist is watching these 5 stocks": 0.0,
  "US High Growth Tech Stocks To Watch This January 2026": 0.5,
  "Insmed To Present at the 44th Annual J.P. Morgan Healthcare Conference": 0.0,
  "Those who invested in Analog Devices (NASDAQ:ADI) five years ago are up 89%": 0.8,
  "Are Strong Financial Prospects The Force That Is Driving The Momentum In Adobe Inc.'s NASDAQ:ADBE) Stock?": 0.5,
  "Intuit (INTU) Slid on Cautious FY2026 Guidance": -0.6,
  "SGA U.S. Large Cap Growth Exited Its Position in Workday (WDAY)": 0.0,
  "Baidu, ASML, furniture stocks rise; Outlook Therapeutics sinks": 0.2,
  "Here’s Insiders Fund’s View on Axon Enterprises (AXON)": 0.1,
  "Insider Buying Drove Strong Stock Performance at Marvel Technologies (MRVL)": 0.6,
  "Applied Materials (AMAT): “The Arms Dealer of the Semiconductor Revolution.”": 0.5,
  "Is Cadence Design Systems, Inc. (NASDAQ:CDNS) Worth US$313 Based On Its Intrinsic Value?": 0.2,
  "Billionaire Peter Thiel Sold Nvidia and Tesla to Buy This Other AI Stock": 0.5,
  "INSM Stock Up 78% in 6 Months: Here's What You Need to Know": 0.6,
  "What to Expect From Charter Communications' Next Quarterly Earnings Report": 0.2,
  "Apple Stock’s Growth Trajectory Is Challenged in 2026. Why This Analyst Is Staying on the Sidelines.": -0.6,
  "Axsome (AXSM) Stock Jumps 22.8%: Will It Continue to Soar?": 0.6,
  "HONEYWELL TO RELEASE FOURTH QUARTER FINANCIAL RESULTS AND ANNOUNCE 2026 OUTLOOK DURING ITS INVESTOR CONFERENCE CALL ON THURSDAY, JANUARY 29": 0.0,
  "SPAR Group, Inc. Strengthens Executive Leadership Team; Appoints Jean Richer as Head of North American Sales & Marketing and Announces Executive Share Purchases": 0.8,
  "Here's Why You Should Add Inogen Stock to Your Portfolio Now": 0.6,
  "Equities to Get Boost From Robust Earnings in 2026 But Near-Term Fed Path Uncertain, Analysts Say": 0.5,
  "REGN Soars 41% in Six Months: Is There More Upside Potential in 2026?": 0.6,
  "MRVL's Custom Silicon Business Scales Up: What's Coming Next?": 0.5,
  "Will Monster Beverage's Expansion Strategy & Innovations Aid?": 0.5,
  "CES 2026: What to expect from the tech industry’s biggest show of the year": 0.5,
  "Tesla reports 418,227 deliveries for the fourth quarter, down 16% - Tesla posted its fourth-quarter 2025 vehicle production and deliveries report on Friday. Here are the key numbers: * Total deliveries: 418,227 * Total production: 434,358 Wall Street expected 426,000 deliveries for the quarter, according to estimates compiled by StreetAccount. In a company-compiled consensus posted to its website on Dec. 29, Tesla said analysts it surveyed were expecting a 15% drop from a year earlier": -0.6,
  "AMC Theatres Declares Netflix’s Stranger Things Series Finale Theatrical Event a Triumph; More Joint Netflix-AMC Cooperation Envisioned in 2026 and Beyond": 0.6,
  "Pre-market on the first trading day of 2026: All three major stock index futures rise, with Nasdaq futures leading gains; Tesla's Q4 deliver - The first U.S. stock trading day of 2026 is about to commence, with overall pre-market sentiment leaning bullish. As of now, all three major stock index futures are rising: Dow futures are higher S&P 500 futures are up Nasdaq 100 futures are up nearly 1%, with the tech sector showing relative": 0.8,
  "Zscaler (ZS) Upgraded to Outperform Amid AI and Zero Trust Growth": 0.8,
  "TSM is hitting new highs - Toward the end of last year, I brought up a question here: was TSM being undervalued because of geopolitical risk, or had the market already priced that risk in pretty fairly? It sparked some really good discussions at the time. Fast forward to today, and TSM just hit another all-time high at $316. I still think the geopolitical risk around Taiwan hasn’t gone away it’s a real factor in": 0.6,
  "The 300 mark has finally been broken! MU has been underestimated for far too long. - Waking up to find MU finally standing tall! It surged straight to 308, climbing nearly 8% in a single day this momentum is incredibly uplifting. While MU was often labeled the laggard in AI, Bernstein today raised its target price to 330, effectively reminding the market of its potential. Honestly, even at today's level, looking at its P/E ratio": 0.8,
  "Gryphon Investors Completes Sale of 3Cloud to Cognizant": 0.5,
  "The Maker of Biscoff Cookies Bets on a Global Expansion": 0.5,
  "T‑Mobile Continues to Power New York's Holiday Season on America's Best Network": 0.6,
  "Is Micron Technology Stock a 'Buy' or 'Sell' In 2026?": 0.1,
  "Versant Media to Begin Trading After Comcast Spinoff": 0.2,
  "ASML Jumps on Analyst Double Upgrade Citing AI Cycle": 0.8,
  "CSCO's Security Revenues Decline: Can Strong Portfolio Revive Growth?": 0.1,
  "Micron and Sandisk Stocks Kick Off New Year Just as They Finished 2025—With Big Gains": 0.8,
  "Software Has Been Battered by AI. Shopify, Veeva, and 3 More Stocks to Play a Turnaround.": 0.2,
  "BMO and Mizuho Bullish on Linde (LIN), Forecasting 10%+ EPS Growth": 0.8,
  "Baker Hughes (BKR) Maintains Outperform Rating Amid Hydrogen and LNG Project Wins": 0.6,
  "Labor Market Data in Focus": 0.2,
  "Why Is Lam Research (LRCX) Stock Rocketing Higher Today": 0.5,
  "Western Digital Stock And Rival Seagate Soared In 2025. What's The 2026 Outlook?": 0.5,
  "FTSE 100 reshuffle 2025: Burberry, Games Workshop and British Land join as WPP, Frasers and B&M exit": 0.2,
  "2 Unstoppable Stocks to Buy in 2026 and Hold Forever": 0.5,
  "European Equities Traded in the US as American Depositary Receipts Gain Friday": 0.2,
  "BofA unveils its top 10 U.S. ideas for Q1 2026": 0.2,
  "Adobe (ADBE) Reaffirms AI Leadership With Strong Revenue and Cash Flow, Piper Sandler Reaffirms Outperform Rating": 0.8,
  "Here's Why Investors Should Give Old Dominion Stock a Miss Now": -0.8,
  "US Oil Drilling Activity Ends Down for 2025, But Production Still Near Highs": 0.5,
  "3 Cybersecurity Stocks to Watch in 2026 as Identity and Endpoint Converge": 0.5,
  "Investopedia's top stock picks for 2026, one is Berkshire Hathaway": 0.5,
  "Exploring 3 High Growth Tech Stocks In The US Market": 0.5,
  "Top Midday Decliners": -0.5,
  "Why ASML Stock Popped Today": 0.5,
  "AI is Driving Demand for Seagate, Western Digital, and Micron Technology. Can the Boom Last?": 0.5,
  "Could This Equipment Maker Be the Hidden Winner of the AI Buildout?": 0.5,
  "3 Cash-Flow Machines Investors May Want Heading Into 2026": 0.5,
  "Why Western Digital (WDC) Stock Is Up Today": 0.5,
  "Applied Materials (AMAT) Stock Trades Up, Here Is Why": 0.5,
  "Marvell Technology (MRVL) Stock Trades Up, Here Is Why": 0.5,
  "Should I Invest in Walmart stock? - Hello everyone! For background, I am almost 19yo. I've been working at Walmart for a little over 6 months as a Pharmacy Technician while I pursue my undergraduate studies that will hopefully land me in pharmacy school. As for my \"portfolio\" I have invested in VOO and NVDA through vanguard but no insane amount or anything contributed (roughly 1k). Considering I haven't hit my 1 year anniversary, Walmart": 0.2,
  "These Healthcare and Bank Stocks Had Incredible Runs in 2025. Why Gains Will Continue This Year.": 0.8,
  "2026 kicked off with a bang: ASTS is leading the space race, and my screen is officially \"Too Green\" - I promised myself I’d step away from the screen to spend time with family this New Year, but damn... I just can't look away! Market opened with a massive green wave, thought it was a late \"Santa Rally\". But while most tickers started retracing, a few of my favorites are absolutely mooning. ASTS is the": 0.8,
  "The Memory Market Is Going to Boom in 2026: 1 Top Stock to Buy Hand Over Fist Before It Skyrockets (Hint: It's Not Micron)": 0.8,
  "Palantir Leaves Software Peers Behind": 0.8,
  "AMC Turns Stranger Things Into $15 Million": 0.5,
  "ARK Comes Roaring Back in 2025": 0.8,
  "AppLovin Stock Extends Its Santa Claus Skid. What to Know.": 0.1,
  "What a “Normal” Economy Could Mean for These 3 Travel Stocks": 0.5,
  "Where Will O'Reilly Automotive Be in 1 Year?": 0.1,
  "TSLA whiplash on Day 1 of 2026， premarket hype to intraday dump - Honestly starting to feel like TSLA might be one to walk away from. Going into the first trading day of 2026, TSLA was up \\~2% in premarket, and it really looked like it might finally make a run at the $500 psychological level. Sentiment felt bullish, risk‑on vibes, new year optimism， all of it. Then the market opened… and it completely fell": -0.8,
  "$SMR up sharply today looks more like a sector move than a company story - SMR (NuScale Power) is having a strong day, but unless I missed something, there’s no obvious company specific catalyst behind the move. This looks more like a broader nuclear sector rotation than a sudden fundamental re rating of SMR itself. A few quick thoughts: The nuclear theme keeps coming back AI, data centers, and grid reliability all support the long": 0.2,
  "LRCX Outperformed in 2025, but Valuation and Options Activity Flag 2026 Risks": 0.1,
  "Treasury Yields Have Mixed Weekly Performance Ahead of Labor Data": 0.1,
  "Funds Plow Money Into AppLovin, Broadcom, Google — And This Top 100 Stock": 0.5,
  "US Equity Markets Rise, Carried by Tech, Healthcare Sectors": 0.6,
  "CES 2026: Nvidia, AMD, Intel, & more to make announcements": 0.2,
  "Regeneron to Report Fourth Quarter and Full Year 2025 Financial and Operating Results and Host Conference Call and Webcast on January 30, 2026": 0.0,
  "Analog Devices, Inc. (ADI) Balances Analyst Optimism With Insider Share Sale": 0.2,
  "Cisco Systems, Inc. (CSCO) Draws Mixed Trading Sentiment as Options Activity Remains Balanced": 0.0,
  "These Stocks Moved the Most Today: Tesla, Baidu, Western Digital, Micron, RH, Vertiv, Sable Offshore, AppLovin, and More": 0.0,
  "Pro Analysis SpaceX stock debut is the big market event of 2026. Why Musk’s venture could be biggest IPO ever - As billionaire entrepreneur Elon Musk readies to take SpaceX to the public market, investors are awaiting the chance to get in on what is expected to be the biggest IPO on record. Musk said late last month that reports of the space technology company’s plans to go public this year were “accurate.” Multiple outlets": 0.8,
  "ASML - stockplit in the foreseeable future? - Would love to see that! Earnings coming up soon. Maybe a good time to announce a beautiful 10:1 split? LRCX did it, NFLX as well. NOW just did a 5:1 split. I already have a full position, plus the stock rallied too much for me to buy more. Buuut I wouldn't mind for some retailers to FOMO into the stock after a split to a lower price.": 0.6,
  "Stock Market Today: Dow Up With 'January Barometer' On Watch; Nvidia Stock Climbs (Live Coverage)": 0.5,
  "O’Reilly Automotive, Inc. Announces Dates for Its Fourth Quarter and Full-Year 2025 Earnings Release and Conference Call": 0.0,
  "ASML Stock Jumps On Double Upgrade For Chip Gear Leader": 0.8,
  "S&P 500 Posts Slight Weekly Decline as Calendar Turns to 2026": -0.2,
  "AppLovin Stock Just Plunged Below a Key Support Level. Should You Buy the Dip?": -0.5,
  "Netflix Stock Sinks Into The Upside Down Despite 'Stranger Things' Success": -0.5,
  "How We Kept AppLovin Stock Positive Before Software Took Its Hit": 0.5,
  "Forget 2025: These 3 Growth Stocks Could Soar in 2026": 0.5,
  "Stock Market Today, Jan. 2: Micron Surges as Bernstein Hikes Price Target 20%": 0.6,
  "The Trade Desk vs. SanDisk: Buying the Wreckage or the Winner?": 0.2,
  "Cisco Systems (CSCO) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Netflix (NFLX) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Stock Market Today, Jan. 2: Dow Climbs After Industrials Outperform on Rotation Away From Mega Cap Tech": 0.5,
  "Airbnb, Inc. (ABNB) Stock Declines While Market Improves: Some Information for Investors": -0.2,
  "MercadoLibre (MELI) Stock Dips While Market Gains: Key Facts": 0.1,
  "Synopsys (SNPS) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Take-Two Interactive (TTWO) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "Comcast (CMCSA) Stock Dips While Market Gains: Key Facts": -0.2,
  "PepsiCo (PEP) Gets Price Target Bump, but BofA Remains Cautious on Staples": 0.1,
  "Barclays Sees Renewed Investor Interest in Honeywell (HON) into Spring 2026": 0.6,
  "B. Riley Raises Target on Applied Materials (AMAT) on HBM and DRAM Capex Upside": 0.5,
  "December jobs report, earnings, CES 2026: What to Watch": 0.0,
  "Strong AI Tailwinds Lift KLAC Despite Ongoing China Export Risks": 0.6,
  "Cloud Spending and AI Workloads Push Western Digital (WDC) Higher": 0.6,
  "Encouragement as we start the new year. - I keep seeing people say “this feels just like the dot com bubble” whenever the NASDAQ comes up, and I get why. Prices are high, tech runs the show, and everyone’s talking about AI. But the reality today is very different than 2000, especially when you look under the hood. Back in the dot com bubble, a huge chunk of companies had no profits at all. A": 0.5,
  "US rig count up one as prices increase": 0.5,
  "Here are my predictions for Monday (01/05/26) - There will be a post asking if MU can go higher. There will be a post mentioning that the valuations are ridiculously high and that we are, in fact, in a bubble of epic bubbly proportions. There will be a post where the user is going to be quite confused and distraught. About the current valuation of TSLA. Because it simply makes no sense. The confusion will": -0.5,
  "Thought on CES next week? - With the CES conference in a few days, what do people expect from the event? Think there will be any big catalysts? [https://finance.yahoo.com/news/nvidia-amd-focus-ahead-key-230700530.html](https://finance.yahoo.com/news/nvidia-amd-focus-ahead-key-230700530.html) [https://finance.yahoo.com/news/ces-2026-what-to-expect-from-the-tech-industrys-biggest-show-of-the-year-140552142.html](https://finance.yahoo.com/news/ces-2026-what-to-expect-from-the-tech-industrys-biggest-show-of-the-year-140552142.html)": 0.2,
  "2 Spectacular Artificial Intelligence (AI) Stocks to Buy Hand Over Fist in 2026, According to Wall Street": 0.8,
  "Union Pacific, Norfolk Southern defend completeness of merger application": 0.5,
  "Exelon Corporation: Reliable Growth and Long-Term Value": 0.8,
  "Best Stock to Buy Right Now: Coca-Cola vs. Monster Beverage": 0.5,
  "Netflix Stock Just Keeps Falling. Is It Finally a Buy?": -0.5,
  "Samsara (IOT): Durable AI-Driven Growth With Room to Run": 0.6,
  "Should You Be Excited About Comcast Corporation's (NASDAQ:CMCSA) 23% Return On Equity?": 0.6,
  "Baker Hughes, Cactus announce closing of SPC joint venture": 0.2,
  "Mega-rich Americans are ditching stocks and hoarding historic highs of cash. Here’s where their wealth’s going instead": -0.5,
  "3 Phenomenal Stocks That Could Double in 2026": 0.8,
  "Marvell Technology, Inc.'s (NASDAQ:MRVL) Fundamentals Look Pretty Strong: Could The Market Be Wrong About The Stock?": 0.6,
  "A Look At The Intrinsic Value Of Autodesk, Inc. (NASDAQ:ADSK)": 0.2,
  "Why Investors Are Watching SailGP’s Explosive Audience Growth": 0.5,
  "3 Consumer Stocks Set for a Comeback in 2026": 0.5,
  "This could be a better — and safer — way into the AI trade in 2026": 0.6,
  "The Returns At Honeywell International (NASDAQ:HON) Aren't Growing": -0.5,
  "Has Monster Beverage Corporation's (NASDAQ:MNST) Impressive Stock Performance Got Anything to Do With Its Fundamentals?": 0.2,
  "$META has a huge potential - I've been eyeing Meta recently. I know it's not a biotech with a $200M market cap and it's not rocketing, but I think it has potential, even if it's been slow lately. First of all, what does Meta do? We all know it for its social media (IG, Facebook, WhatsApp, Messenger, and Threads), which have an incredible 3.5 billion users daily. It's practically a monopoly, but officially it hasn't": 0.8,
  "2026 should be record year within the last decade of video games": 0.8,
  "AT&T to launch new service for customers as it takes on T-Mobile": 0.5,
  "This Robotic Surgery Pioneer Could Be Worth $1 Million for Long-Term Holders": 0.8,
  "This Stock Has Soared About 4,000% in Just 2 Decades. After Declining Last Year, Is It Finally a Buy?": 0.5,
  "Rate my picks - Ran a scan earlier in the week in hopes to find individual value stocks to buy and hold. Smallish exposure, goal is to have 25% of portfolio these picks and the other 75% VOO. Scan criteria is as follows: Reasonable share price vs book value (except MU, I’m willing to pay a higher ratio here for tech) Must haves: Current EPS growth higher than 5 yr avg Positive P/E Current revenue": 0.5,
  "History of Costco: Company timeline and facts": 0.0,
  "r/Stocks Weekly Thread on Meme Stocks Saturday - Jan 03, 2026 - The meme stock scheduled posts will now run weekly and post Saturday afternoon and won't be a sticky; you're probably seeing this because automod sent you here! [Full list of meme stocks here.](https://www.reddit.com/r/stocks/wiki/meme-stocks) This will be updated every once in a while. ------ Welcome traders who just can't help them selves discuss the same exact stock that's been discussed 100s of times a": 0.1,
  "Here Are 3 Financial Stocks Making Big AI Moves in 2026": 0.5,
  "Best Stock to Buy Right Now: Amazon vs. Costco": 0.5,
  "Why I think Quantumscape is a great company for value investors with a growth mindset - Our edge as retail investors are 2 things; to be contrarian and to take timelines others are not willing to. I find this personally to be anywhere upwards of 3 years. With these in mind I found Quantumscape towards the end of 2021 midway through its intial covid money hype run For some history we have been using very": 0.6,
  "With the US hitting Venezuela today, is anyone else terrified China takes Taiwan next? (and bricks the global chip supply) - Everyone is focused on Caracas right now, but I can’t stop thinking about the precedent this sets. If Beijing decides this is their green light to finally move on Taiwan, we aren’t looking at a chip shortage. People seem to forget the silicon shield failsafes. ASML has remote kill switches for their machines, and": -0.8,
  "What does Trump really want with Venezuela? Here are the Best Takes and stocks - We’ve all read the news, but what are Trumps real motivations. What do you guys think he wants? 1. Flooding the global oil supply will lower prices, or more importantly, give Trump additional control over the global economy through the oil supply. This may potentially be used as a bargaining chip (e.g. to weaken Iranian, Russian, Chinese economies, or to": 0.2,
  "Why is no one seeing the bigger picture? - >\\*Disclaimer\\* >The information provided is for educational and informational purposes only and does not constitute financial, investment, legal, or tax advice. Economic conditions, markets, and regulations can change rapidly, and past performance is not indicative of future results. You should conduct your own research and consult with a qualified professional before making any financial decisions. Ok First of all i'm not good with words im more": 0.0,
  "Portfolio evaluation - I'm an 18-year-old who started investing some of my savings in various stocks last year. I aim to diversify across different markets while maintaining some dividend yield, although most of my investments are in growth stocks. Here’s a breakdown of my current portfolio: QQQI 15.27%, EEM 15.03%, VOO 14.97%, AMD 10.06%, VEA 9.79%, OKLO 8.96%, AVGO 6.63%, APLM 5.55%, CEG 4.95%, MELI 4.9%, ECH 4.39%": 0.5,
  "Perplexity CEO Says On-Device AI Threatens Data Centers As Industry Faces '$10 Trillion Question' — Apple, Qualcomm Positioned To Benefit": 0.5,
  "What do you recommend for 3rd party apps/sites alongside Fidelity? - I have been purchasing just by looking at the \"biggest gainer/loser\" tab in the app and it has been my lazy way to grab $20 and below stock to purchase then sell later when they hit a good threshhold for me. Its time I put a \"little\" bit more effort, will be getting Estate money finally after a long two years of legal stuff": 0.2,
  "5 Predictions for the Stock Market in 2026 -- and Which Stocks Will Soar the Most If They're Right": 0.5,
  "The S&P 500's Best Stock in 2025 May Soar in 2026 as the Artificial Intelligence (AI) Boom Continues (Hint: Not Palantir)": 0.6,
  "Palo Alto Networks (NASDAQ:PANW) pulls back 4.8% this week, but still delivers shareholders solid 24% CAGR over 5 years": 0.6,
  "December jobs numbers get data back on track during first full week of trading in 2026: What to watch": 0.2,
  "DexCom, Inc.'s (NASDAQ:DXCM) Stock Been Rising: Are Strong Financials Guiding The Market?": 0.5,
  "Calculating The Fair Value Of Exelon Corporation (NASDAQ:EXC)": 0.1,
  "4 Stocks to Buy in January That Could Join Nvidia in the $1 Trillion Club by 2030": 0.8,
  "5 tech stocks that could bring gains to your portfolio in the new year": 0.6,
  "3 Cybersecurity Stocks You Can Buy and Hold for the Next Decade": 0.5,
  "[UPDATE] $GT Goodyear Tires: Maduro's Capture Stock Analysis - [**Initial DD here**](https://www.reddit.com/r/ValueInvesting/comments/1pvm8ml/long_goodyear_tires_gt_best_turnaround/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) ***Note:*** *I've been away on vacation so not much time for new full DDs yet. As to my previous post, I'll be researching and writing up on PayPal (most upvotes). As of now, PYPL is not a long, I am looking into whether its a short or a hold, more information to come.* ==================================================================== We recently got news of Maduro's capture by the": 0.1,
  "2 Leading Tech Stocks to Buy in 2026": 0.5,
  "Once a Market Darling, This Software-as-a-Service Stock Has Been Crushed. Time to Buy?": -0.5,
  "Top analyst resets price target on Micron stock": 0.5,
  "CES 2026, Sector Rotation and Other Key Things to Watch this Week": 0.2,
  "My case for SNAP as a winner in 2026 - Ok, I want to preface with this being speculation but I believe snap to be a highly undervalued company in the age of information technology as such a overvalued sector, (only software stock still held across all portfolios ) mostly due to there new charging for data addition, the old geezers on wall street seem to think this will deter people from using the app": 0.4,
  "Major tech CEO sounds alarm on AI agents": -0.5,
  "3 stocks to watch in 2026": 0.0,
  "Regeneron (REGN) Valuation Check After Japan Clears Dupixent for Pediatric Severe Asthma Expansion": 0.5,
  "Paychex (PAYX): Exploring Valuation After a 20% Share Price Drop Despite Growing Earnings": 0.5,
  "Is CSX (CSX) Still Undervalued After Its Recent 1-Year Shareholder Return?": 0.2,
  "Siebert Williams Initiates Coverage On American Electric Power Company, Inc. (AEP)": 0.2,
  "Is the AI boom a bubble waiting to pop? Here’s what history says": -0.5,
  "Is It Too Late to Consider Micron After a 252.1% Surge on AI Optimism in 2026": 0.2,
  "Broadcom (AVGO): Assessing Valuation After Recent Share Price Softness and Multi‑Year Run": 0.2,
  "(Item 8.01) Other Events. ATM Updates On January 5, 2026, Strategy Inc (\"Strategy\") announced an update with respect to sales made under its at-the-market offering program (\"ATM\") of the following securities during the periods and as of the dates indicated below: During Period December 29, 2025 to December 31, 2025 As of December 31, 2025 Security Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) STRF Stock": 0.1,
  "(Item 1.01) . Entry into a Material Definitive Agreement Completion of Separation of Versant from Comcast On January 2, 2026 (the “Distribution Date”), after the close of trading on Nasdaq, the previously-announced separation (the “Separation”) of Versant Media Group, Inc. (“Versant”) from Comcast Corporation (“Comcast”) was completed. The separation of Versant, which comprises a strong portfolio of cable television networks and complementary digital platforms (the “Spin Business”), was achieved through Comcast’s distribution (the “Distribution”) of 100% of\n\n(Item 1.01) .\n\n(Item 1.01) of this Current Report on Form 8-K and the Separation and Distribution Agreement attached as Exhibit 2.1 to this Current Report on Form 8-K are incorporated by reference in this\n\n(Item 1.01) of this Current Report on Form 8-K related to the TLA/Revolver Credit Agreement, TLB Credit Agreement and First Supplemental Indenture is incorporated by reference in this\n\n(Item 1.01) of this Current Report on Form 8-K is incorporated herein by reference.\n\n(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Resignation of Directors Effective as of 11:59 p.m. Eastern Time on January 2, 2026, Thomas J. Reid and Jason S. Armstrong (collectively, the “Resigning Directors”) resigned from the Board of Directors (the “Board”) of Versant. The Resigning Directors’ resignation from the Board was not due to any disagreement with Versant. Appointment of Directors and Officers Effective\n\n(Item 5.02) . In connection with their joining the Board, in addition to Ms. Montiel who had previously already been appointed as a member and the Chair of the Audit Committee, certain other directors of Versant were appointed to the Audit, Compensation and Governance Committees of the Board (the “Committees”) effective as of 11:59 p.m. Eastern Time on January 2, 2026. The current composition of the Committees is as follows: · the Audit Committee consists of Maritza\n\n(Item 5.02) . In addition, effective as of 11:59 p.m. Eastern Time on January 2, 2026, Greg Wright was appointed to serve as the Chief Accounting Officer and Controller of Versant. Mr. Wright (age 48) served as Vice President, External Reporting & Treasury Controller for Comcast from 2022 until the Separation and as Vice President for Comcast from 2017 to 2022, where he oversaw the company’s external financial reporting function as well as enterprise-wide accounting for treasury,\n\n(Item 5.02) . Mr. Wright’s employment agreement is on a form generally consistent with those of our named executive officers.\n\n(Item 8.01) . Other Events. On January 5, 2026, Versant issued a press release announcing the completion of the Separation. The full text of the press release is filed as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated by reference in this\n\n(Item 8.01) .": 0.1,
  "(Item 8.01) . Other Events. On January 5, 2026, Comcast Corporation (“Comcast”) issued a press release announcing the completion of the previously-announced separation of Versant Media Group, Inc. (“Versant”) from Comcast, effective as of 11:59 p.m. Eastern Time on January 2, 2026. The separation of Versant, which comprises a strong portfolio of cable television networks and complementary digital platforms, was achieved through Comcast’s distribution (the “Distribution”) of 100% of the shares of Versant Class A common stock\n\n(Item 8.01) .": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition The information pursuant to\n\n(Item 2.02) in this report on Form 8-K is being furnished as contemplated by General Instruction B(2) to Form 8-K and shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of that Section. On January 5, 2026, we announced our expected net sales for the third quarter of fiscal year 2026 ended December 31, 2025. The complete release is attached to": 0.0,
  "Qualcomm (QCOM) Valuation Check as CES 2026 AI and Snapdragon X-Series Momentum Build": 0.5,
  "PayPal (PYPL): Revisiting Valuation After New AI-Focused PYUSD Financing Partnership with USD.AI": 0.5,
  "Question regarding extra RoTh allocations - I’m 26 years old in grad school. My portfolio is made up of a weekly ROTH contribution that looks like this: 1. SCHG - 26$ 2. Tesla - 19$ 3. Amazon - 10$ 4. QQI - 10$ 5. Microsoft - 9$ 6. Visa - 9$ 7. Palantir - 8$ 8.Microstrategy - 5$ 9. Nividia - 5$ 10. ASML - 5$ 11. VTI - 5$ 12. CIBR - 5$ 13.": 0.1,
  "The Bull Case For Constellation Energy (CEG) Could Change Following Its AI Data Center Nuclear Contracts – Learn Why": 0.5,
  "Will AI-Fueled Demand for HAMR Drives Rewrite Seagate Technology Holdings' (STX) Earnings Narrative?": 0.2,
  "Taking Another Look at Amgen (AMGN)’s Valuation After Its Recent Share Price Pullback": 0.2,
  "Dow Jones Futures: Muted Reaction To Trump's Venezuela Move; Nvidia, AMD, Taiwan Semi Due": 0.1,
  "Investors Believe Overvaluation Is One of the Biggest Risks to the AI Story. Here Are 2 AI Stocks With the Frothiest Valuations.": -0.8,
  "Assessing Microchip Technology (MCHP) Valuation As Mixed Share Performance Meets Conflicting Fair Value Signals": 0.1,
  "3 Nasdaq 100 Stocks Worth Your Attention": 0.0,
  "1 Growth Stock to Stash and 2 That Underwhelm": -0.5,
  "1 S&P 500 Stock with Exciting Potential and 2 We Question": 0.5,
  "3 Large-Cap Stocks We’re Skeptical Of": -0.5,
  "2 Cash-Producing Stocks to Keep an Eye On and 1 Facing Headwinds": 0.2,
  "1 Value Stock Worth Investigating and 2 We Turn Down": 0.0,
  "3 of Wall Street’s Favorite Stocks on Our Buy List": 0.5,
  "3 Profitable Stocks That Fall Short": -0.5,
  "1 Cash-Producing Stock with Solid Fundamentals and 2 That Underwhelm": 0.2,
  "Bubble Fears Not Spoiling Billion-Dollar AI Buildout Plans in ’26 … Yet": 0.2,
  "Is It Too Late To Consider Applied Materials (AMAT) After A 53% One Year Run?": -0.2,
  "Assessing DexCom (DXCM) Valuation As Shares Lag Over The Past Year": -0.5,
  "3 Best Artificial Intelligence Stocks to Buy in January": 0.5,
  "Stock Ideas from Barron’s 1/5 Issue: SCHW, BABA, NVDA - This is my latest summary of stock ideas I drew from this week’s issue of Barron’s Magazine. I didn’t find many specific stock recommendations from the pages because some of the big articles were overviews about dividend paying stocks and international markets, and the official stock pick of Schwab seemed pretty lame to me. **SCHW**. I really cannot endorse this week’s stock pick by Barron’s.": -0.6,
  "Best CEO’s & Companies with best leadership/management? - Guys, as you know it’s more about the person leading the front than the company itself so, if we take leadership aka how well the company is run as a metric, whom would you say is the top guy/gal/ceo in your list. My favs are SPB - RKLB, Lisa Su - AMD & Jansen - NVDA. All of mag 7’s are great but still wanna know the": 0.6,
  "Agoda Reveals Growing Interest for Year-End Domestic Travel with Kuala Lumpur at the Forefront in 2025": 0.5,
  "AI-driven inflation is 2026's most overlooked risk, investors say": -0.5,
  "Is Palo Alto Networks (PANW) Offering Value After Recent Share Price Weakness": 0.2,
  "Assessing CrowdStrike (CRWD) Valuation After Recent Share Price Pressure And Multi‑Year Gains": 0.5,
  "A Look At O'Reilly Automotive (ORLY) Valuation After Recent Share Price Softness": 0.1,
  "3 of China’s most innovative pharma companies": 0.5,
  "FloQast CFO on why the demand for accountants is ‘skyrocketing’": 0.6,
  "ASML Holding (ENXTAM:ASML) Is Up 8.8% After AI-Fueled EUV Demand Triggers Broker Upgrade – What's Changed": 0.6,
  "ASML stock gains on upgrade to Top Pick at Bernstein": 0.8,
  "Earnings Preview: What to Expect From NXP Semiconductors’ Report": 0.5,
  "AI and Key Market Trends to Watch in 2026": 0.5,
  "U.S. oil stocks explode following Trump’s actions, comments on Venezuela": 0.5,
  "US Stock Market Today: S&P 500 Futures Rise On Solid Global Growth And Rate Doubts": 0.8,
  "The Zacks Analyst Blog Nvdia, MicronTechnology and Palantir": 0.0,
  "Palo Alto Networks in talks to acquire Koi Security for $400m": 0.5,
  "California woman was dropped by insurer over drone-captured images. What to know": -0.5,
  "History Says the Nasdaq Will Soar in 2026: 2 AI Stocks to Buy Now, According to Wall Street": 0.8,
  "SPAR Group names Jean Richer to lead North American sales and marketing": 0.5,
  "The Ultimate Growth Stock to Buy With $1,000 Right Now": 0.8,
  "Kraft Hockeyville Extends Community Impact with Biggest Prize Pool Yet to Celebrate 20th Anniversary": 0.8,
  "Declining Stock and Decent Financials: Is The Market Wrong About Texas Instruments Incorporated (NASDAQ:TXN)?": -0.5,
  "Palantir bull: It's the narrative, not valuation driving gains": 0.5,
  "Trending tickers: Chevron, TSMC, ASML and Auction Technology": 0.0,
  "Former consumer goods exec takes stake in Treasury Wine Estates": 0.5,
  "Oil, Tech Issues Lift Wall Street Pre-Bell; Asia, Europe Gain": 0.5,
  "Zenas shares crash after top drug misses expectations in immune disease study": -0.8,
  "Returns expected to spike in the new year": 0.6,
  "Stocks Set to Open Higher as Investors Stay Calm Despite Venezuela Tumult, U.S. Jobs Data Awaited": 0.5,
  "MulticoreWare Demonstrates Real-Time Cloud-to-Car AI Workflow with Qualcomm AI HUB and QCR100 Instance at CES 2026": 0.6,
  "AI Chips Update - Strategic Tech Advancements Drive Future Innovations": 0.8,
  "High Growth Tech Stocks In The US Market January 2026": 0.5,
  "Social Buzz: Wallstreetbets Stocks Advance Premarket Monday; SELLAS Life Sciences Group, Chevron to Open Higher": 0.5,
  "ASML (ASML) Surges 8.8%: Is This an Indication of Further Gains?": 0.6,
  "Comcast Announces Completion of Separation of Versant Media Group, Inc.": 0.2,
  "Costco stock rises on Mizuho upgrade, Top Pick designation": 0.8,
  "Why The Narrative Around DoorDash NasdaqGS DASH Is Shifting After Recent Analyst And Market Updates": 0.5,
  "Texas Instruments' Quarterly Earnings Preview: What You Need to Know": 0.2,
  "Insiders Fund’s Investment Thesis for AppFolio (APPF)": 0.0,
  "GOOGL, AMZN, and DASH: J.P. Morgan Picks the Top Internet Stocks to Buy for 2026": 0.8,
  "Canada Alternative Lending Databook Report 2025: Market Size & Forecast by Value and Volume Across 100+ KPIs 2020-2029": 0.0,
  "Metaplanet Stock Shoots 15% as BTC Treasury Firm Updates on Share Buyback": 0.6,
  "Stocks Rise Pre-Bell as Investors Assess US Military Operation in Venezuela": 0.5,
  "PepsiCo and Coca-Cola Reassess Venezuela as U.S. Pressure Shifts Landscape": 0.1,
  "Crane Company Completes Acquisition of Precision Sensors & Instrumentation and Announces Date for Fourth Quarter 2025 Earnings Release and Teleconference": 0.2,
  "VERSANT Begins Trading on Nasdaq Today as Independent Company Following Completion of Comcast Spin-Off": 0.5,
  "NVIDIA Soars 39% in 2025: Will the Stock Carry Momentum in 2026?": 0.6,
  "Crypto wallet firm Ledger faces customer data breach through payment processor Global-e": -0.7,
  "Baker Hughes Closes Sale of Precision, Sensors & Instrumentation Product Line to Crane Company": 0.2,
  "This Week In Digital Payment - South Africa Embraces Cashless Revolution With Rapid Growth": 0.8,
  "Watch 5 AI-Powered Medical Stocks for a Strong Portfolio in 2026": 0.5,
  "Should You Buy Netflix Stock Before Jan. 20?": 0.2,
  "AI Stocks At A Crossroads After Big 2025 Gains, Pullbacks": 0.2,
  "Cactus secures majority stake in Baker Hughes’ SPC unit": 0.5,
  "Beat the Market the Zacks Way: LATAM, General Motors, Amgen in Focus": 0.5,
  "Cognizant acquires 3Cloud to boost global Azure expertise": 0.6,
  "US Dollar Mixed Early Monday Ahead of Busy Data Schedule, December Nonfarm Payrolls Employment Data Friday": 0.2,
  "Stagwell (STGW) Launches 'The Machine': Marketing's First Agentic Operating System": 0.6,
  "Novo Nordisk's Wegovy® pill, the first and only oral GLP-1 for weight loss in adults, now broadly available across America": 0.8,
  "CrowdStrike, AWS, and NVIDIA Select 35 Startups for the 2026 Cybersecurity Startup Accelerator": 0.5,
  "Geordie AI Selected for the 2026 CrowdStrike, AWS & NVIDIA Cybersecurity Startup Accelerator": 0.5,
  "GE HealthCare to announce fourth quarter and full year 2025 results on February 4, 2026": 0.0,
  "ADP to Announce Second Quarter Fiscal 2026 Financial Results on January 28, 2026": 0.0,
  "Investors Already Pick Their 5 Favorite S&P 500 Stocks This Year": 0.5,
  "Here Are Monday’s Top Wall Street Analyst Research Calls: Adobe, Arista Networks, ASML, Coinbase Global, IBM, Marvell Technology, NetFlix, and More": 0.5,
  "S&P 500 Continues Its Stellar Run to Open New Year: 4 Solid Picks": 0.8,
  "Breaking: Michael Saylor’s Strategy Buys 1,286 BTC, Increases USD Reserve To $2.25B": 0.8,
  "Is Credo Technology Still a Buy After 55% Gain in the Past 6 Months?": 0.2,
  "i am stucked in UVXY $64>$34 - i brought in about 100 shares of UVXY at cost $64, right now it is only worth $34. i considering how to cover back my loss, should i utilize this 100 shares to trade Options(covered call). or just sell out all the shares, to stop to loss. but i really think UVXY will growth again... any advice?": -0.5,
  "Strategy boosted bitcoin holdings and cash reserve last week": 0.5,
  "5 Things to Know Before the Stock Market Opens": 0.0,
  "Billionaire Michael Saylor’s Strategy Adds 1,287 BTC, Lifts USD Reserves to $2.25B": 0.8,
  "Hush Security Selected for the 2026 CrowdStrike, AWS & NVIDIA Cybersecurity Startup Accelerator": 0.6,
  "How should you adjust your investment portfolio in the new year? - 2025 was a fruitful year for me. All three major stock indices rose, with the Nasdaq Composite performing the best, gaining 25%-30% for the year, significantly outperforming the broader market and emerging as the ultimate winner. If you had chosen a stock from this index and held it for a year, the probability of profit would have been as high as 70%. If": 0.6,
  "Is MRVL Stock a Buy, Sell or Hold at a P/S Multiple of 7.67X?": 0.0,
  "Novo Nordisk’s Wegovy Pill Now Broadly Available Across U.S.": 0.8,
  "Palantir: Buy, Sell, Hold – Doesn’t Matter. There’s Ways to Lose Money No Matter What": -0.5,
  "Is Falcon Flex Now the Main Driver of CrowdStrike's ARR Growth?": 0.2,
  "Jefferies downgrades Adobe, upgrades IBM as AI reshapes 2026 software outlook": 0.2,
  "Can Platformization Continue Fueling PANW's NGS ARR Growth?": 0.2,
  "Why CrowdStrike CEO just spent a reported $300 million to become a partial owner of the Mercedes F1 team": 0.5,
  "Qualcomm Introduces a Full Suite of Robotics Technologies, Powering Physical AI from Household Robots up to Full-Size Humanoids": 0.6,
  "Evoke Security Selected for the 2026 CrowdStrike, AWS & NVIDIA Cybersecurity Startup Accelerator": 0.5,
  "Fortinet to Announce Fourth Quarter and Full Year 2025 Financial Results": 0.0,
  "AI took investors on a date in 2025. In 2026, analysts say it's time to foot the bill.": 0.1,
  "ReturnPro Launches Shopify App Offering First-of-its-Kind, End-to-End Returns Capabilities": 0.8,
  "TI accelerates the shift toward autonomous vehicles with expanded automotive portfolio": 0.5,
  "US invades Venezuela, market reaction, CES kicks off: 3 Things": -0.5,
  "What You Need To Know Ahead of PepsiCo's Earnings Release": 0.0,
  "Alnylam to Webcast Presentation at 44th Annual J.P. Morgan Healthcare Conference": 0.0,
  "Could the Michael Saylor Strategy Of Holding Your Nose and Buying Bitcoin No Matter the Price Really Be the Winning Way?": 0.6,
  "Memory chipmakers rise as global supply shortage whets investor appetite": 0.6,
  "Goldman boosts TSMC price target, Comcast spinoff to begin trading": 0.5,
  "Costco's Digital Ecosystem Emerges as a Powerful Growth Engine": 0.8,
  "Chevron, US Oil Stocks Rally as Trump Vows Venezuela Revival": 0.6,
  "Seagate Technology a Position Trading - I am looking at Seagate Technology as a good candidate for a Position Trade. Any thoughts? # 5 Pros * **HAMR Technology Leadership:** Seagate’s HAMR delivers 30%+ capacity gains, supports premium pricing, and positions the company ahead of peers, with gross margins expected to exceed 50% as adoption ramps. * **AI-Driven Storage Demand:** Mass Capacity now accounts for \\~80% of revenue, driven primarily by hyperscalers; FY25 shipments hit a": 0.6,
  "AI Bubble or Not, These 3 Stocks Make Excellent Long-Term Plays to Buy in January": 0.6,
  "Why Qualcomm stock is rising today: Next-gen robotics architecture unveiled": 0.5,
  "AT&T Declines 5% in Three Months: Should You Buy the Dip?": 0.2,
  "Can Intel's Xeon 6900 Processors Drive Long-Term Growth?": 0.5,
  "Does MercadoLibre's Expanding Credit Book Elevate Risk in 2026?": -0.5,
  "PayPal downgraded, Costco upgraded: Wall Street's top analyst calls": 0.2,
  "Chevron stock is spiking after the U.S. raid on Venezuela": 0.5,
  "Wall Street Bulls Look Optimistic About AppLovin (APP): Should You Buy?": 0.8,
  "Wall Street Bulls Look Optimistic About PDD Holdings Inc. Sponsored ADR (PDD): Should You Buy?": 0.8,
  "U.S. Energy Company Shares Rise": 0.5,
  "Trump's Maduro ousting: Oil prices tick higher, oil stocks rally": 0.5,
  "AT&T Stock Had a Miserable 2025. Why This Analyst Says 2026 Will Be Better.": 0.5,
  "Novo Nordisk Stock Rises on Launch of Weight-Loss Pills": 0.8,
  "Limitless X Appoints Seasoned Consumer Products and Manufacturing Executive Daniel Sanders as President": 0.5,
  "Afero and Texas Instruments Partner to Build a Secure IoT Platform Designed for a Connected World": 0.6,
  "Sevii Selected for the 2026 CrowdStrike, AWS & NVIDIA Cybersecurity Startup Accelerator": 0.5,
  "Are Functional Waters and Energy Drinks Reviving PepsiCo's PBNA Unit?": 0.5,
  "CFRA flags risks as Netflix is downgraded on WBD deal concerns": -0.5,
  "Strong AI-Driven Quarter and Dividend Spotlight Might Change The Case For Investing In KLA (KLAC)": 0.6,
  "What Catalysts Are Quietly Shifting The Intel (INTC) Narrative Now": 0.2,
  "AI buildout's next theme will be finding meaning in other sectors": 0.5,
  "What to Expect From Comcast Corporation's Q4 2025 Earnings Report": 0.2,
  "BC-Most Active Stocks": 0.0,
  "Qualcomm Witnesses Just 8.2% Growth in Past Year: Reason to Worry?": -0.6,
  "What to Expect From IDEXX Laboratories’ Next Quarterly Earnings Report?": 0.2,
  "Palantir Stock Surges 121% in a Year: Is the Rally Still Investable?": 0.5,
  "Strategy reports a multi-billion dollar unrealized loss tied to BTC holdings": -0.8,
  "IBM Stock Gets Upgraded to Buy. Why This Other Tech Stock Was Downgraded.": 0.5,
  "Will Palantir’s Venezuela Connection Trump Valuation Concerns?": 0.2,
  "Intellia Stock Declines Around 55% in 3 Months: Here's Why": -0.8,
  "VONG vs VOOG: The Best Vanguard Growth Stocks ETF to Buy and Hold": 0.5,
  "Hon Hai Sales Jump 22% as AI Data Center Buildouts Accelerate": 0.6,
  "ShowSeeker and Innovar Solutions Combine to Reimagine Ad Sales Management": 0.5,
  "Intel Shares Jump Ahead of CES, Panther Lake Chips in Spotlight": 0.6,
  "Chevron Lead Energy Stocks Rally Amid Venezuela Oil Hopes": 0.6,
  "Cognizant's 3Cloud Buyout to Accelerate AI Transformation for Clients": 0.6,
  "Assessing KLA (KLAC) Valuation After Strong Q3 Beat And AI Outlook As Shares Slip Slightly": 0.5,
  "Micron Leads Memory Chip Rally as AI Demand Fuels Global Supply Shortage": 0.8,
  "BofA says these are the best 7 AI chip stocks to own in 2026": 0.5,
  "European Equities Traded in the US as American Depositary Receipts Rise Monday": 0.5,
  "Should You Invest $1,000 in MP Materials Right Now?": 0.2,
  "Palo Alto Eyes $400 Million Cyber Deal": 0.5,
  "SEZL: Flipping the Script on BNPL - It is rare to find a company growing its top line at 76% while maintaining 28% net income margins, and it is even rarer to find it trading at just \\~14x forward earnings. Sezzle (SEZL) is that company. Sezzle provides flexible, consumer focused ‘Buy Now, Pay Later’ financing and credit-building tools specifically designed for the underserved market. While the headlines focus on subprime fears and regulatory noise, Sezzle": 0.8,
  "Here are the stocks I'm watching recently what do you think? - NVDA may reach 195–200 in the short term. ARM could rebound strongly above 130. LRCX is a solid pick for medium to long-term holds. MU broke 300 on Friday and surged to 315. From 315, next targets could be 324 and 332. Call options this week might price above 315. MU could hit 350 this month. SNDK broke out on Friday, rising from": 0.5,
  "Why 1 Top Analyst Expects Apple Stock to Stagnate in 2026": -0.5,
  "Jefferies’ top software stocks to own led by Microsoft, Meta": 0.5,
  "CES 2026: Bosch is shaping the future of mobility, manufacturing and technology in everyday life": 0.8,
  "3 Top Ranked Stocks to Buy for 2026 (LLY, WFRD, PGY)": 0.5,
  "BOE and RT-RK Collaborate to Deliver Next-Generation Android TV with Advanced AI Capabilities powered by Qualcomm Technologies": 0.6,
  "NXP’s New S32N7 Unlocks the Full Potential of SDVs": 0.6,
  "Qualcomm unveils PC chip, humanoid robotics initiative at CES 2026": 0.5,
  "Top Midday Stories: Oil Stocks Rise After US Attack on Venezuela; QXO Receives $1.2 Billion Investment From Apollo-Affiliated Funds": 0.5,
  "Costco fixes key member pain points (this time it's personal)": 0.6,
  "Tesla China Shipments Fall 7% in 2025, Marking Second Straight Annual Decline": -0.6,
  "Comcast Spinoff Versant Starts Trading Today. The Stock Is Dropping.": -0.8,
  "IREN's GPU Expansion Accelerates: Is Revenue Visibility Improving?": 0.5,
  "Alphabet Ramps Up AI Chip Patents to Curb Nvidia Dependence": 0.2,
  "Strategy Records a $17.44 Billion Unrealized Loss in Fourth Quarter": -0.8,
  "European Equities Mostly Higher in Monday Trading; Novo Nordisk Rolls Out Wegovy Pill in US": 0.5,
  "Tesla’s Deliveries Have Fallen for 2 Years: Should TSLA Investors Even Care Amid the AI Pivot?": -0.5,
  "LOS ANGELES LAKERS GAMES ON SPECTRUM FRONT ROW™ IN APPLE IMMERSIVE TIP OFF JANUARY 9": 0.2,
  "Venezuela Won’t Derail the Rally. Here’s What Might.": 0.2,
  "Meta Platforms Reaffirmed 'Buy' at Jefferies with $910 Price Target": 0.6,
  "Why Palantir Technologies (PLTR) Stock Is Up Today": 0.5,
  "Why Is Shopify (SHOP) Stock Rocketing Higher Today": 0.6,
  "Why Upwork (UPWK) Stock Is Trading Up Today": 0.5,
  "Foxconn Stock Is Rising. Nvidia's Supply Chain Is the Real Winner": 0.5,
  "Strategy (MSTR) Shares Skyrocket, What You Need To Know": 0.8,
  "DoorDash (DASH) Stock Trades Up, Here Is Why": 0.5,
  "The Best Stocks to Buy With $1,000 Right Now": 0.5,
  "Is there a stock tool that allows you group industries live in a dashboard? - I've setup a few tabs in google finance grouping together stocks. (metals, oil, tech etc). I like the ''compare to'' feature. But this requires 4-5 tabs and wanting to have a dashboard view of it all. Is there an app out there that you can visually show stocks in this way?": 0.2,
  "Nvidia Leads Chip Stocks Rally as Foxconn Record Sales Spark Gains": 0.6,
  "Uber Stock Plunges After Top Analyst Downgrade To 'Sell' Rating": -0.8,
  "Amazon Launches Web Version of Alexa+ to Compete with ChatGPT and Gemini": 0.2,
  "Amazon Stock Gains As It Launches Alexa Website To Compete With ChatGPT, Gemini": 0.5,
  "Qualcomm Unveils Full Robotics AI Stack": 0.5,
  "Strategy Buys $116 Million Bitcoin Despite Q4 Loss": 0.2,
  "Palantir Stock Jumps Amid Contract Wins and AI Optimism": 0.8,
  "Venezuela Fuels Broad Sector Rally But These Oil And Gas Plays Slide": -0.5,
  "Why Adobe Stock Is Falling Today": -0.5,
  "Looking for a Growth Stock? 3 Reasons Why AppLovin (APP) is a Solid Choice": 0.8,
  "This Put Option Pays Off If Uber Stock Fails To Pick Up": -0.5,
  "Strategy Pads Cash Reserve, Drops Another $116 Million on Bitcoin": 0.5,
  "Xumo Introduces Advanced Identity Solution to Power Smarter Streaming Investments": 0.5,
  "ServiceNow appoints Hossein Nowbar as President and CLO": 0.5,
  "Tech start-up run by Tony Blair’s son cuts dozens of jobs": -0.7,
  "TSMC Shares Jump Most Since April After Goldman Lifts Target": 0.8,
  "Thinking about trimming NVDA, 4 straight sessions of gap‑up opens and intraday fades - I’m starting to think it might be time to trim or sell some of my NVDA position. For the fourth trading day in a row, NVIDIA (NVDA) has gapped up at the open, only to sell off or fade during the session. That kind of price action is starting to stand out. To me, it feels like: Strength is getting sold": -0.6,
  "Michael Saylor's MicroStrategy sits on unrealized loss worth billions": -0.8,
  "This Underrated Industrial Stock Could Be the Purest Play on AI Infrastructure": 0.6,
  "How New Drug Launches And Patent Risks Are Rewriting The Story For Amgen (AMGN)": 0.2,
  "Investing in Old Dominion Freight Line (NASDAQ:ODFL) five years ago would have delivered you a 61% gain": 0.8,
  "The Bull Case For Quanta Services (PWR) Could Change Following Major Grid And Data Center Expansion - Learn Why": 0.5,
  "Eli Lilly Lags In The Weight-Loss Pill War. But It Has A Plan.": 0.2,
  "After Nvidia’s Groq deal, meet the other AI chip startups that may be in play—and one looking to disrupt them all": 0.5,
  "Qualcomm's new PC chip, Netflix downgraded on Warner Bros. debt": -0.5,
  "ReelTime Media’s Reel Intelligence Delivers Transformational 2025, Structurally Outperforming Centralized AI Leaders in Under 8 Months": 0.8,
  "Is Broadcom 1 of the Best AI Stocks for 2026?": 0.5,
  "GM sales slip in Q4, rise overall in 2025 thanks to gas trucks, SUVs": 0.2,
  "Stocks Jump After U.S. Captures Venezuela’s Maduro": -0.5,
  "Don’t Push for Growth in 2026, Push for Yield: The Case for 3 Top Dividend Stocks": 0.5,
  "Advanced Energy, IBD Stock Of The Day, Breaks Out. So Do Several Chip Peers.": 0.5,
  "US-based multinational companies will be exempt from global tax deal": -0.8,
  "Intel Stock Gets an AI Upgrade. Why This Analyst Is Optimistic.": 0.8,
  "After a 130% Surge in 2025, Can Palantir Stock Keep Beating the Market in 2026?": 0.2,
  "Billionaire Larry Ellison Sells $45 Million Home on San Francisco’s Gold Coast": 0.5,
  "MercadoLibre and 2 More Global Stocks Ready to Rebound": 0.6,
  "5 2026 Market Predictions": 0.0,
  "Uber Stock Is Cut to Sell as Robo-Taxi Competition Heats Up": -0.7,
  "KYMR Skyrockets 82.4% in a Year: More Upside Potential in 2026?": 0.8,
  "Versant launches, Comcast spins off E!, CNBC and MS NOW": 0.0,
  "This Stock Faces ‘Unprecedented AI Demand.’ It’s One Analyst’s Top Pick.": 0.6,
  "Biotech and Pharma Stocks Tumble as Investors Race into Energy": 0.1,
  "2 Tech Stocks That Could Be Winners If the OpenAI Boom Turns to Bust": -0.5,
  "Exelon to Announce Fourth Quarter Results on Feb. 12": 0.0,
  "Back to Investing after years off the markets. - Hey guys. For context I'm from Argentina so 120 dollars monthly here is a decent amount of money to invest in stocks. With that being said, I opened my portfolio through a broker that allows me to access the US market without any fees or restrictions that I would face if I use any CEDEARS (basically US stocks mirrored in Argentine pesos), and started my tiny": 0.2,
  "Sector Update: Tech Stocks Rise Monday Afternoon": 0.5,
  "Novo Nordisk Rolls Out Wegovy's Weight Loss Pill in US": 0.5,
  "Intel Stock Just Surged Through Its 50-, 20-Day Moving Averages. Should You Buy INTC Here?": 0.5,
  "Assessing Meta Platforms (META) Valuation After Manus AI Deal And Reduced Metaverse Spending": 0.1,
  "Assessing Apple (AAPL) Valuation After Recent Share Price Softness and Mixed Return Signals": 0.2,
  "How Recent AI Moves Are Rewriting The Story For Alphabet (GOOGL)": 0.2,
  "UP, Norfolk Southern Push Back on Class I Challenges to Merger Filing": 0.1,
  "Why Big Oil has a long road ahead in Venezuela, the 'fallen angel of global crude markets'": -0.5,
  "Bleichmar Fonti & Auld LLP Announces New Partners": 0.5,
  "This Exclusive Costco Perk Is Also Boosting Company Sales": 0.6,
  "5 Things Costco Needs to Do to End Its Stock Slump": -0.5,
  "Happy New Year: Here Are 2 Stocks to Watch Going Into 2026": 0.6,
  "2025 Wasn’t an Easy Year for Tesla Stock, but Baird Says It’s a ‘Core Holding’ for 2026 Anyways": 0.2,
  "Bitcoin's Price is Climbing. Did the U.S. Capture of Venezuela's Maduro Help?": 0.5,
  "1 AI & 1 Quantum Stock Beat NVIDIA in 2025, Promise More Gains Ahead": 0.6,
  "Deribit, SignalPlus competition logs over $23B as options demand grows": 0.5,
  "Assessing Alphabet (NasdaqGS:GOOGL) Valuation After Gemini AI Momentum And Expanding Government And Enterprise Deals": 0.5,
  "What Analysts Think Is Shifting The Story For Take-Two Interactive Software (TTWO)": 0.2,
  "Is Adobe (ADBE) Turning Its AI Ambitions Into a Slower-Growth Story?": -0.5,
  "Intel (INTC) Valuation Check After Recent Share Price Momentum": 0.2,
  "Assessing Netflix (NFLX) Valuation After Recent Share Price Weakness And Long Term Gains": 0.5,
  "Intel launches next-gen PC chip at CES in Las Vegas": 0.5,
  "XRP's 9% surge leads crypto as bitcoin climbs to 6-week high near $95,000": 0.8,
  "Here's My Top AI Growth Stock to Buy in January": 0.5,
  "Should Investors Be Worried That the \"Magnificent Seven\" Make Up 35% of the S&P 500?": -0.5,
  "Why Intel Stock Initially Surged Today but Has Given Up Most of Its Gains": -0.5,
  "Oracle's AI-Driven Growth Remains on Track After Stock Selloff, UBS Says": 0.5,
  "Ethereum Surges Past $3.2K as Blue Origin Accepts ETH": 0.8,
  "Sector Update: Tech Stocks Advance Late Afternoon": 0.5,
  "Google, Nvidia, Reddit — And This Hot IPO — Lead Slew Of Stocks To Watch": 0.5,
  "MercadoLibre (MELI) Shares Skyrocket, What You Need To Know": 0.8,
  "Stock market today: Dow jumps 600 points to record, S&P 500 and Nasdaq rally as oil stocks surge after Venezuela strike": 0.8,
  "Zscaler Appoints Sunil Frida as Chief Marketing Officer to Drive Next Phase of Global Growth": 0.6,
  "These Stocks Moved the Most Today: Chevron, Valero Energy, Comcast, Tesla, CoreWeave, IBM, Coinbase, and More": 0.2,
  "Microchip Technology Provides Q3 Fiscal 2026 Business Update": 0.0,
  "Power Integrations Names Chris Jacobs Senior Vice President, Marketing and Product Strategy": 0.2,
  "Zenas BioPharma, A Top 1% Stock, Quadrupled In 2025. Why It Just Collapsed.": -0.6,
  "Versant Stock Slides in Its First Day of Trading. Here's What You Need to Know About the Comcast Spin-Off.": -0.5,
  "MongoDB, Doximity, DoubleVerify, and 8x8 Shares Skyrocket, What You Need To Know": 0.8,
  "Tesla Stock Could Be Worth Just $80. The Price Is Rising.": 0.2,
  "Abbott hosts conference call for fourth-quarter earnings": 0.0,
  "Dogs Of The Dow: 10 High-Yield Stocks With Dividends Up To 6.8% - Including Several Warren Buffett Favorites": 0.5,
  "Stock Market Today: Dow Surges As Maduro Makes This Plea; This AI Stock Clears An Entry (Live Coverage)": 0.5,
  "Bitcoin Up Amid Venezuela Operation; 'Shadow Reserve' Rumors Swirl": 0.5,
  "Stocks to Watch Recap: Chevron, Versant, Bed Bath, AMD": 0.0,
  "Stocks Rise With Traders Sanguine on Maduro Ouster: Markets Wrap": 0.5,
  "Top Stock Reports for Meta, Bank of America & Procter & Gamble": 0.5,
  "Disney Might Have a Slow Start in 2026. Don’t Dump the Stock, Analyst Says.": 0.2,
  "Why Snowflake (SNOW) Stock Is Trading Up Today": 0.5,
  "LiveRamp, GitLab, PubMatic, and Paylocity Stocks Trade Up, What You Need To Know": 0.5,
  "My 2 Favorite Growth Stocks to Buy Right Now": 0.5,
  "Emerging Currencies Shrug Off Weakness as USD Loses Haven Appeal": 0.5,
  "IBM Stock Upgraded To Buy While Oracle Seen Bouncing Back In Analyst's 2026 Software Preview": 0.6,
  "Palantir Stock Jumps. How It Benefited from the Venezuela Raid.": 0.5,
  "Microchip Technology raises Q3 revenue forecast on strong bookings": 0.8,
  "Exclusive: yMedia founder says Google’s AI crackdown squeezes crypto media": -0.5,
  "Under Biden, America got 150 countries to agree a 15% global corporate tax. Under Trump, America gets an exemption": 0.6,
  "Is Intuit’s (INTU) Cautious Outlook and DEI ROI Audit Push Reframing Its Risk‑Reward Story?": 0.1,
  "Amazon purchases $2 million lot in Eugene for e-commerce center": 0.5,
  "Chevron, Halliburton, Other Energy Shares Gain on Venezuela Windfall Hopes": 0.6,
  "Is Costco (COST) Pricing Too High After Recent Share Price Weakness?": -0.5,
  "CES 2026: What are natural language operating systems?": 0.2,
  "NVIDIA Kicks Off the Next Generation of AI With Rubin — Six New Chips, One Incredible AI Supercomputer": 0.8,
  "4 Top Tech Stocks to Buy in January": 0.5,
  "Is Costco Stock Set to Rebound Higher in 2026?": 0.5,
  "Castration-sensitive Prostate Cancer Market Projected to Grow at a 13.2% CAGR (2020-2034), Driven by Expanded Approval and Wider Commercialization Opportunity in nmCSPC Segment | DelveInsight": 0.6,
  "How Trump Moved Stocks In 2025: Crypto, Drones, Health Care Sectors": 0.2,
  "TSMC Stock Rises, But Semiconductor Rally Fades": 0.2,
  "Nvidia partners with Mercedes to train autonomous driving models": 0.5,
  "Stock Market Today, Jan. 5: Dow Hits Record High on Energy Stocks Rally After Venezuela Developments": 0.8,
  "Apple (AAPL) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Advanced Micro Devices (AMD) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Meta Platforms (META) Laps the Stock Market: Here's Why": 0.5,
  "Bitcoin hoarder Strategy reveals $17.44 billion unrealized loss in fourth quarter": -0.8,
  "PepsiCo (PEP) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Workday (WDAY) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Nvidia CEO Says Next Major AI Chip Is in ‘Full Production’": 0.6,
  "Nvidia launches Vera Rubin, its next major AI platform, at CES 2026": 0.6,
  "Stock Market Today, Jan. 5: SLB Surges on Venezuela-Driven Oil Volatility and Digital Growth Momentum": 0.6,
  "Cerence xUI, Leveraging NVIDIA AI Enterprise and Running on Microsoft Azure, Drives Strong Traction with Automakers": 0.6,
  "CES 2026: Intel Core Ultra Series 3 Debuts as First Built on Intel 18A": 0.5,
  "Acer Announces New Lineup of Premium Swift AI Copilot+ PCs Featuring Intel Core Ultra Series 3 Processors": 0.6,
  "Red Hat Expands Collaboration with NVIDIA to Pair Enterprise Open Source with Rack-Scale AI for Faster, Production-Ready Innovation": 0.8,
  "Advantech Partners with Intel® Core™ Ultra Series 3 Processors to Power the Next Wave of Scalable Edge AI Innovation": 0.8,
  "Aeva and NVIDIA to Integrate 4D LiDAR as Reference Sensor within the NVIDIA DRIVE Hyperion Platform Ecosystem": 0.5,
  "Amgen (AMGN) Stock Declines While Market Improves: Some Information for Investors": -0.5,
  "Gilead Sciences (GILD) Stock Declines While Market Improves: Some Information for Investors": -0.5,
  "Nvidia CEO confirms Vera Rubin AI platform is 'in full production'": 0.6,
  "Microsoft’s Nadella wants us to stop thinking of AI as ‘slop’": 0.5,
  "Potential Venezuela Opening Could Be A Game Changer For MercadoLibre’s (MELI) Expansion Narrative": 0.8,
  "Does CrowdStrike’s Expanded AI Security Accelerator With AWS and NVIDIA Reshape Its Long‑Term Narrative (CRWD)?": 0.2,
  "Is It Time To Reassess American Electric Power (AEP) After Its 32.7% One-Year Rally?": 0.2,
  "Acer Introduces the Veriton RA100 AI Mini Workstation, a Windows 11 Copilot+ PC Powered by AMD Ryzen AI Max+ 395 Processors for Advanced AI Performance": 0.5,
  "Honeywell International Inc. (HON) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Copart, Inc. (CPRT) Outperforms Broader Market: What You Need to Know": 0.5,
  "Diamondback Energy (FANG) Stock Dips While Market Gains: Key Facts": 0.1,
  "Kraft Heinz (KHC) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Microsoft’s Nadella wants us to stop thinking of AI as ‘slop’ - A few weeks after Merriam-Webster named “slop” its Word of the Year, Microsoft CEO Satya Nadella shared his thoughts on the future of AI in 2026. In his signature intellectual style on his personal blog, Nadella wrote that he hopes we stop thinking of AI as “garbage” and start seeing it as a “bicycle for the mind.” He wrote, “A new concept that": 0.6,
  "Nvidia accelerates AI roadmap: Rubin superchip in full production, 5x faster": 0.8,
  "Stock market today: Dow, S&P 500, Nasdaq futures climb after Dow's record-setting rally": 0.8,
  "Stock Market Today, Jan. 5: BigBear.ai Rises After $125 Million Convertible Debt Redemption": 0.5,
  "Help with investment strategy! - So just to give some context I am an 18 year old college freshman and started my own bank accounts late November 2025. Currently I have my checking account with Capital One and I do both my savings as well as investing with Sofi (High APY+ I love their UI). I have a part time job where I make minimum wage, so I'm not exactly talking about significant amounts of": 0.2,
  "Rise in food prices drove shop inflation higher in the festive period": -0.5,
  "How Qualcomm’s New Dragonwing IQ10 Robotics Platform At QUALCOMM (QCOM) Has Changed Its Investment Story": 0.5,
  "Shareholder Activism Worked in 2025. The Surge Will Continue This Year.": 0.8,
  "Earnings Season Looms: Why You Should Pay Attention": 0.5,
  "Prediction: The S&P 500 $1 Trillion Club Will Double Between 2026 and 2030": 0.6,
  "Why Constellation Energy Stock Slumped Today": -0.5,
  "Mark Zuckerberg Once Revealed One Thing Movies Often Get 'All Wrong' And Why He Thinks It's A 'Dangerous Lie'": 0.2,
  "Nvidia CEO says Rubin in Production, Keynote Falls Flat": -0.5,
  "NVDA at CES feels like they’re already playing the next AI cycle - Just my 2 cents after watching Jensen at CES. This didn’t feel like a simple “faster GPU” update. More like NVDA quietly setting up **what comes** ***after*** **Blackwell**. Rubin being a *full platform* (chip + networking + system) stood out to me. That’s how they keep everyone locked into the ecosystem, not just selling cards. Also interesting that Jensen said next-gen stuff": 0.6,
  "A Look At MicroStrategy (MSTR) Valuation After New Bitcoin Losses And Higher Preferred Dividend": 0.1,
  "Micron Technology (MU) Is Up 7.2% After Hiking 2026 AI Capex To $20 Billion – Has The Bull Case Changed?": 0.5,
  "Bitmine Buys More ETH, Strategy Posts $17B Loss—What’s the Difference?": -0.5,
  "Two Tata groups updated today - very different trends - Two important updates from the Tata group today, showing a clear contrast between auto and energy businesses: **1) Jaguar Land Rover (JLR) – Q3FY26 (**[Press Release](https://www.bseindia.com/xml-data/corpfiling/AttachLive/4653f3da-7e37-45d5-81dc-8b80069e9c5a.pdf)**)** * Wholesale volumes down **43% YoY** to \\~59,200 units * Retail sales down **25% YoY** * Impacted by: * Cyber incident causing production stoppages * Distribution delays even after restart * Planned wind-down of legacy Jaguar models * Incremental": 0.2,
  "My 10 Top Stocks to Buy to Start the New Year Off Right": 0.5,
  "Innodisk Unveils the New \"AI on Dragonwing\" Computing Series with the First EXMP-Q911 COM-HPC Mini Module Powered by Qualcomm's SoC": 0.5,
  "Will TI’s Afero IoT Push and New Auto Chips Reframe Texas Instruments' (TXN) Innovation Narrative?": 0.2,
  "PayPal Casinos 2026: High 5 Casino Selected as Leading PayPal Casino": 0.8,
  "Agoda reveals: Perhentian Islands is Malaysia's top emerging destination": 0.8,
  "Melius Sets $135 Target on Marvell (MRVL) as Custom Silicon Demand Accelerates": 0.6,
  "What are your top stock picks in 2026? - I’ll be honest, my portfolio blew up over the last couple years mostly due to poor trading decisions and trying to time the market. I’ve stepped away from day trading and options for now, and I’m working on building a more stable, long-term portfolio from scratch. This time I’m focusing on growth stocks that have a shot at outperforming the S&P or broader ETFs. So far,": -0.6,
  "What are the significant announcements made today by Nvidia CEO Jensen Huang at CES 2026 - There was a lot of information provided to us during the keynote speech by Jensen Huang. At CES 2026, NVIDIA unveiled its most ambitious AI roadmap yet, headlined by the Rubin platform, a six-chip, extreme-codesigned AI system, and a suite of open models spanning healthcare, robotics, and autonomous driving. The company also showcased its vision for “physical AI” with": 0.8,
  "AMD shows off new higher performing AI chip at CES event": 0.8,
  "Could This AI ETF Surge 300% and Become the Next Nvidia?": 0.5,
  "Jeff Bezos Picked Andy Jassy To Run Amazon. His Secret? Dad's Advice: Do It All The Way Or Don't": 0.5,
  "AMD Expands AI Leadership Across Client, Graphics, and Software with New Ryzen, Ryzen AI, and AMD ROCm Announcements at CES 2026": 0.8,
  "AMD Introduces Ryzen AI Embedded Processor Portfolio, Powering AI-Driven Immersive Experiences in Automotive, Industrial and Physical AI": 0.8,
  "Nvidia Unveils Faster AI Chips Sooner Than Expected": 0.8,
  "Dow Jones Futures: AMD, Apple, Palantir, Tesla Are Key Movers; Nvidia CEO Jensen Huang Announces New AI Chip": 0.5,
  "Is Surging AI Custom Silicon Demand Reshaping the Investment Case for Marvell Technology (MRVL)?": 0.5,
  "Is Palantir Technologies (PLTR) Pricing In Too Much Optimism After Its Recent Surge?": -0.5,
  "AMD and its Partners Share their Vision for “AI Everywhere, for Everyone” at CES 2026": 0.6,
  "Michael Saylor’s Strategy Posts $17.4B Q4 Unrealized Loss On Digital Assets": -0.7,
  "IREN Ltd. (IREN) Jumps 13% on Bitcoin Fever": 0.6,
  "The Bull Case For NVIDIA (NVDA) Could Change Following Rubin AI ‘Factory’ Platform Push – Learn Why": 0.5,
  "Goodbye, gas! Why this electric boat is making waves": 0.8,
  "Motley Fool Money: Stock Market Naughty and Nice List": 0.5,
  "AIC Expands NVIDIA BlueField-Accelerated Storage Portfolio With New F2032-G6 JBOF Storage System to Accelerate AI Inference": 0.6,
  "A Look At Ross Stores (ROST) Valuation As Store Expansion Accelerates With Solid Same Store Sales": 0.6,
  "Assessing ASML Holding’s (ENXTAM:ASML) Valuation After Strong Recent Share Price Momentum": 0.5,
  "AMD's Su Unveils New Tech, Talks Up AI Demand": 0.5
}