{
  "Is Keurig Dr Pepper Stock Underperforming the Nasdaq?": -0.5,
  "Nuclear Power Is Back! 3 Simple Ways to Invest in the Nuclear Renaissance.": 0.5,
  "Is Ross Stores Stock Underperforming the S&P 500?": -0.5,
  "How Is DexCom's Performance Compared to Other Medical Device Companies?": 0.0,
  "Can new Alzheimer’s tests help clear the way for the next generation of therapies?": 0.5,
  "USA Hotel Market Outlook Report 2025-2030 | Energy Efficiency, Waste Reduction, and Green Certifications Enhance Brand Loyalty and Attract Environmentally Conscious Consumers": 0.6,
  "Reaktor and ZAP Surgical win renowned Red Dot Award for ZAP-AXON, a next-generation treatment planning system for brain radiosurgery": 0.8,
  "FERC transmission rate decision sparks dissent over possible bill increases": -0.6,
  "Yotel taps Marriott exec as CEO": 0.5,
  "ASML Invests Billions In Nvidia-Backed Mistral AI To Power Next Era Of Semiconductors": 0.8,
  "S&P Futures Tick Higher Ahead of U.S. Payrolls Revisions": 0.5,
  "Nokia Strengthens Defense Lineup With New Mission Safe Phone And 5G Tactical Radio": 0.6,
  "Hepatitis D Market Research Report 2023-2035 | Gilead, GSK, and Janssen Drive Innovation as Biotechs Advance Antivirals, RNA, and Gene Therapies": 0.6,
  "Libtayo® (cemiplimab) Plus Chemotherapy Results at Five Years Reinforce Significant and Durable Improvements in Survival Outcomes for Advanced Non-small Cell Lung Cancer": 0.6,
  "Analog Devices, Inc.'s (NASDAQ:ADI) Stock Has Seen Strong Momentum: Does That Call For Deeper Study Of Its Financial Prospects?": 0.5,
  "Amgen and Kyowa Kirin report preliminary outcomes from AD treatment trial": 0.5,
  "Xilio Therapeutics Announces Initiation of Phase 2 Trial for Efarindodekin Alfa (XTX301), a Tumor-Activated IL-12, and Achievement of $17.5 Million Development Milestone Under Exclusive License Agreement with Gilead": 0.8,
  "Analysis-ASML-Mistral AI deal boosts Europe tech hopes as Trump rivalry heats up": 0.6,
  "What the Trump Administration Partnership Means for Gilead Sciences Shares in 2025": 0.2,
  "Mistral cements AI lead in Europe with cash infusion": 0.5,
  "Flytrex Appoints Former Waze CEO and Google VP Noam Bardin as Executive Chairman": 0.8,
  "DoorDash CEO Tony Xu: M&A is easy on paper— ‘very hard to get right in practice’": -0.5,
  "Baker Hughes joins giant California geothermal power project": 0.5,
  "Deutsche Bank says ’buy the news’ in EchoStar stock after SpaceX deal": 0.5,
  "What is Mistral AI? Everything to know about the OpenAI competitor": 0.2,
  "TRG Accelerates Global Leadership in Managed Endpoints and Cybersecurity": 0.5,
  "Vyome Holdings Strengthens Leadership Team with Industry Veterans as it plans Pivotal Trial Studies": 0.8,
  "Are Options Traders Betting on a Big Move in ARM Holdings Stock?": 0.5,
  "Video Games ETF (NERD) Hits New 52-Week High": 0.8,
  "Cadence Expands Digital Twin Platform Library with NVIDIA DGX SuperPOD Model to Accelerate AI Data Center Deployment and Operations": 0.6,
  "DoorDash Canada Expands DashPass Benefits: Free for Amazon Prime Members, New Family Sharing, and Exclusive Subscriber Savings": 0.6,
  "Ace Hardware and DoorDash Launch Exclusive Nationwide Partnership for On-Demand Delivery from Local Stores": 0.5,
  "Investors Heavily Search Comcast Corporation (CMCSA): Here is What You Need to Know": 0.5,
  "QUALCOMM Incorporated (QCOM) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Here is What to Know Beyond Why Datadog, Inc. (DDOG) is a Trending Stock": 0.2,
  "The Zacks Analyst Blog Highlights Broadcom, T-Mobile, Abbott Laboratories, CBL & Associates Properties and Crown Crafts": 0.2,
  "Do Insider Moves and Global Headwinds Reveal a Shift in ISRG’s Strategic Outlook?": 0.1,
  "Baker Hughes Saves 30% in Prototyping Costs Using Ultrasonic Simulations": 0.6,
  "Company News for Sep 9, 2025": 0.0,
  "Internet of Vehicles (IoV) Report 2025 | Industry to Experience 21.4% CAGR During 2025-2034 | Leading Players are Google, NXP Semiconductors, Intel, Texas Instruments, IBM": 0.5,
  "DP World Highlights Environmental Leadership as First Supplier Invited to Sustainability Event": 0.8,
  "Why Lam Research (LRCX) is a Top Stock for the Long-Term": 0.8,
  "Can Advanced Packaging Boost Systems Sales at Lam Research in FY26?": 0.2,
  "Jim Cramer Shares Key Role Palo Alto Networks, Inc. (PANW) Can Play In Defending AI": 0.5,
  "Yum Brands taps tech chief amid slew of leadership changes": 0.2,
  "Cellhub and Lifetime EPR Launch First-to-Market “PCaaS” with Lenovo ThinkPads, 24/7 Support, Exchange, 5G Connectivity and Enhanced Security": 0.8,
  "Intuit's AI Push Boosts Growth: Can TurboTax and QuickBooks Lead?": 0.6,
  "The Trade Desk Declines 28% in 3 Months: How to Play the Stock Now?": -0.6,
  "EU approves takeover of Deliveroo by Doordash": 0.5,
  "Form 8.3 - QUALCOMM INC": 0.0,
  "Is MELI's Heavy Latin America Exposure Limiting Growth Potential?": -0.5,
  "ASML invests $1.5B in French AI startup Mistral, forming European tech alliance": 0.8,
  "MNDY's Spending Surge Intensifies: Is Margin Expansion at Risk?": -0.6,
  "ASYS' AI Equipment Sales Surge 5x Y/Y: Can the Momentum Continue?": 0.6,
  "ASML Invests $1.5 Billion in Mistral AI, Taking Lead Stake in Europe's Top AI Startup": 0.8,
  "MemorialCare Launches Da Vinci 5 Robotic Surgical System, Expanding Robotic Surgical Program Access Across All Hospitals in Health System": 0.8,
  "IBM vs. QCOM: Which Tech Stock Deserves a Spot in Your Portfolio Now?": 0.5,
  "CrowdStrike CEO: AI could unleash the bad actors": -0.5,
  "EchoStar Expected to Sell AWS-3 Spectrum Following AWS-4 Deal With SpaceX, Deutsche Bank Says": 0.2,
  "PANW's SASE ARR Hits $1.3B: Is Prisma Browser the Key Driver?": 0.5,
  "Broadcom Rises 13% Post Q3 Earnings: Buy, Sell or Hold the Stock?": 0.2,
  "Why Atlassian (TEAM) Stock Is Up Today": 0.5,
  "Should You Buy, Sell or Hold ADI Stock After a 17.2% YTD Rise?": 0.2,
  "AT&T Stock Rebounds After EchoStar and SpaceX Deal. Why the Shares Can Jump 10%.": 0.8,
  "CISO Leader David Hahn Joins DTEX’s Advisory Board": 0.5,
  "Top 19 Companies Leading the Middle East Cybersecurity Market in 2025 and Beyond | Middle East CyberSecurity Company Evaluation Report, 2025": 0.5,
  "Electric freight truck prices ‘much higher in US than Europe’ – study": -0.5,
  "Health Care Roundup: Market Talk": 0.0,
  "Regeneron’s cat and birch allergy mAbs score in Phase III trials": 0.5,
  "Oracle Needs to Keep Sales Growth Humming After $200 Billion Run": 0.5,
  "Tata Communications and Cisco partner on IoT connectivity": 0.5,
  "Is American Electric Power Stock Underperforming the Nasdaq?": -0.5,
  "US economy added 911,000 fewer jobs than previously reported in largest-ever revision - https://abcnews.go.com/Business/us-economy-added-911000-fewer-jobs-previously-reported/story?id=125394153 > U.S. employers added far fewer jobs in 2024 and early 2025 than previously thought, indicating the labor market may have been significantly weaker than initial estimates had suggested. The U.S. economy added 911,000 fewer jobs over the 12 months ending in March than previously estimated, the U.S. Bureau of Labor Statistics (BLS) said on Tuesday. The figure, which exceeded economists'": -0.8,
  "Roblox Trades 15% Below Its 52-Week High: How to Play the Stock?": 0.2,
  "US Equity Indexes Rise After Downwardly Revised Nonfarm Payrolls Increase Fed Rate-Cut Odds": 0.5,
  "Sector Update: Consumer Stocks Mixed Tuesday Afternoon": 0.0,
  "Apple debuts iPhone 17": 0.5,
  "Hardware vs. IP: How to trade the gaming industry": 0.1,
  "AI Is Now Entering Second Phase, Cisco's Patel Says": 0.2,
  "Coupang Stock Sees Relative Strength Rating Jump To 86": 0.6,
  "Quantum Pact: NVIDIA, Honeywell Raise Stakes for IonQ, Rigetti, D-Wave": 0.5,
  "Amgen Rocatinlimab's Data Shows Potential As Long-Term Therapy For Atopic Dermatitis": 0.8,
  "Regeneron's Libtayo Combo Achieves Nearly Double Survival Rate In Advanced Lung Cancer Compared To Chemotherapy": 0.8,
  "Ross Stores, Inc.'s (NASDAQ:ROST) Recent Stock Performance Looks Decent- Can Strong Fundamentals Be the Reason?": 0.5,
  "Microsoft to buy AI from Anthropic in shift from OpenAI - Microsoft so far has exclusively used OpenAI and while their relationship isn’t on the greatest grounds. This puts some pressure on OpenAI who has had exclusive access to Microsoft and also access to their compute. This could be signaling to OpenAI that MSFT is more than happy to go with other startups if their models are in demand. https://www.reuters.com/business/microsoft-use-ai-anthropic-shift-openai-information-reports-2025-09-09/": 0.1,
  "Sector Update: Consumer Stocks Mixed in Late Afternoon Trading": 0.0,
  "Analog Devices to Participate in the J.P. Morgan 16th Annual U.S. All Stars Conference": 0.5,
  "CN and CSX Collaborate to Launch New Intermodal Rail Service into Nashville": 0.5,
  "ASML (ASML) Price Target Raised to EUR680 at Barclays": 0.5,
  "AT&T CEO on economy: There's stress in some consumer segments": -0.5,
  "Homes.com Report: U.S. Home Price Growth Remained Muted at 2.4% in August as the Market Shifts Toward Buyers": 0.2,
  "US Equity Indexes Close Beneath Record Highs Following Downward Revision in Annual Nonfarm Payrolls": -0.7,
  "Why Jefferies Sees More Upside Ahead for AppLovin (APP) Stock": 0.6,
  "Is QUALCOMM (QCOM) The Best AI Chip Stock to Buy Now?": 0.5,
  "NDT Pharmaceuticals Completes Acquisition of Good Salt(TM) Life, LLC": 0.5,
  "Network Built for iPhone 17: T-Mobile COO": 0.2,
  "This High-Yield Dividend Stock Is Getting a Makeover. Should You Buy Shares Here?": 0.5,
  "Synopsys reports quarterly revenue below estimates, shares fall": -0.7,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (b) Shopify Inc., a founder-led commerce company, today announces that Chief Operating Officer and Vice President of Product, Kasra Nejatian’s last day will be September 12, 2025. The company expresses gratitude for Kaz’s significant contributions over the past six years. The executive team will assume Kaz’s responsibilities. This is a strong group with deep experience and": 0.6,
  "(Item 8.01) Other Events. As previously disclosed, Broadcom Inc. (the “Company”) completed its acquisition of VMware, Inc. (“VMware”, and such acquisition, the “VMware Merger”) on November 22, 2023. The Company is filing this Current Report on Form 8-K to provide certain pro forma financial information regarding the VMware Merger for the fiscal year ended November 3, 2024.": 0.1,
  "Lam Research Introduces VECTOR® TEOS 3D to Address Critical Advanced Packaging Challenges in Chipmaking": 0.5,
  "(Item 8.01) Other Events Effective September 10, 2025, senior management and certain members of the Board of Directors of Take-Two Interactive Software, Inc. (the “Company”) will begin using the materials included in Exhibit 99.1 to this report (the “Investor Presentation”) in connection with presentations to existing shareholders of the Company. The Investor Presentation is incorporated into this\n\n(Item 8.01) by reference. Cautionary Note Regarding Forward-Looking Statements The statements contained in the Investor Presentation in Exhibit 99.1 which are not historical facts, including statements relating to Take-Two Interactive Software, Inc.’s (“Take-Two,” the “Company,” “we,” “us,” or similar pronouns) outlook, are considered forward-looking statements under federal securities laws and may be identified by words such as “anticipates,” “believes,” “estimates,” “expects,” “intends,” “plans,” “potential,” “predicts,” “projects,” “seeks,” “should,” “will,” or words of similar meaning and include, but": 0.1,
  "ADP® Unveils New ANZ Headquarters in Melbourne to Accelerate Growth and Innovation": 0.8,
  "Paint the Town: Agoda Unveils Asia's Top Cities for a Mural Art Walk": 0.5,
  "The Trade Desk (TTD) Stock Holds Buy Rating After Stifel Tech Executive Summit": 0.5,
  "Keurig Dr Pepper (KDP) Shares Hold Buy Rating Despite JDE Peet’s Acquisition Concerns": 0.5,
  "Applied Materials (AMAT) Maintains Overweight Rating as Analysts Cite Modeling Missteps": 0.2,
  "Analysts See Autonomous Delivery Boosting DoorDash (DASH) Adoption Despite Market Competition": 0.5,
  "2 Reasons to Like PAYX and 1 to Stay Skeptical": 0.5,
  "3 Reasons to Sell SBUX and 1 Stock to Buy Instead": -0.5,
  "Jim Cramer Weighs in on CSX and Railroad Mergers": 0.2,
  "ASTS will be fine: Elon admits a “2 year timeframe” to modify the phones to be able to use the spectrum he just purchased. - Proof that this sell off is completely overblown. https://open.spotify.com/episode/3yje4qpbf90VlJ5wJoxnS6?si=tWHd8YbxREetkBFe-HXh6A Starts at 16:53 Elon is on a new episode of All In talking the purchase of spectrum this week. Just dropped a few mins ago. He admits a “2 year timeframe” to modify the phones to be able to use the": 0.5,
  "2 S&P 500 Stocks to Target This Week and 1 That Underwhelm": 0.2,
  "Citizens JMP Initiates IDEAYA Biosciences (IDYA) With a Buy Rating": 0.6,
  "The TJX Companies, Inc. (TJX) Is Offering Great Value & Variety, Says Jim Cramer": 0.8,
  "How Is Kraft Heinz's Stock Performance Compared to Other Food & Beverage Stocks?": 0.2,
  "Is Paychex Stock Underperforming the Nasdaq?": -0.5,
  "Pharma’s new boomtown? Why drugmakers are setting up shop in a small Swiss city.": 0.5,
  "China Automotive Cockpit Domain Controller Research Report 2025 | Innovations from Qualcomm, PATEO, and SemiDrive Highlight Industry Advancements in Deep AI Empowerment for Smart Cockpits": 0.6,
  "3 Dividend-Paying Growth Stocks to Double Up on and Buy in September": 0.8,
  "Morgan Stanley Downgrades Lam Research Corporation (LRCX) from ‘Equal Weight’ to ‘Underweight’, Reduces PT": -0.8,
  "First Manhattan Backs Applied Materials, Inc. (AMAT)’s Chip Growth Story": 0.6,
  "Bull of the Day: Credo Technology (CRDO)": 0.2,
  "S&P 500 and Nasdaq notch record-high closes as Oracle soars on AI optimism": 0.8,
  "Nutrabolt boosts stake in Bloom Nutrition with nearly $160M investment": 0.8,
  "GameStop Q2 earnings beat + warrant dividend announced. Thoughts? - GameStop just released their Q2 2025 results: • Revenue: $972M (up from $798M last year) • Net income: $169M (vs $15M last year) • Cash + securities: $8.7B (includes ~$529M in Bitcoin) The bigger news: they announced a dividend of warrants. • Record date: Oct 3, 2025 • Distribution: 1 warrant for every 10 shares • Each warrant: right to buy 1 share at $32": 0.8,
  "The Dutch Connection: French AI Leader Gets Backing from European Tech Giant ASML": 0.5,
  "US Cystic Fibrosis Therapeutics Market Forecast and Company Analysis Report 2025-2033 Featuring Vertex, Abbvie, Novartis, Gilead Sciences, Viatris, Pfizer, AstraZeneca, and F. Hoffmann-La Roche": 0.5,
  "PsiQuantum hits $7 billion valuation as investors bet on quantum’s AI-style potential": 0.8,
  "PsiQuantum valued at $7 billion in latest funding round, teams up with Nvidia": 0.8,
  "Cadence Design Systems (CDNS): Evaluating Valuation After Digital Twin Platform Expands With NVIDIA DGX Support": 0.5,
  "Is Tencent a Bargain After Being Shortlisted for Starbucks China Stake in 2025?": 0.5,
  "I Asked ChatGPT How To Build Wealth With Just a Side Hustle: Here’s What It Said": 0.5,
  "Marriott International (MAR): Examining the Stock’s Valuation as Investors Reassess Growth Potential": 0.5,
  "The Bull Case For Amgen (AMGN) Could Change Following Phase 3 Rocatinlimab Data Release": 0.5,
  "Arm debuts Lumex chips": 0.2,
  "Celsius makes marketing hires to build “mega brands”": 0.5,
  "LA28 Olympic and Paralympic Games Selects T-Mobile for Business as its Official Telecommunications Services Provider": 0.5,
  "Kriya, Odyssey secure ‘megarounds’; Amgen boosts R&D leadership": 0.2,
  "Cisco Systems Inc. (CSCO) Expands Secure AI Factory with the Nvidia Platform": 0.5,
  "Palo Alto Networks (PANW) Unveils Browser-Based Security Solution as Recurring Revenue Grows 35%": 0.6,
  "Canaccord Genuity Lifts Zscaler (ZS) Price Target amid Looming $100B Market Opportunity": 0.6,
  "AI Chips Update - Scintil Photonics Revolutionizes AI Infrastructure With $58M Investment": 0.8,
  "Exploring High Growth Tech Stocks in the US Market": 0.5,
  "Strong Results Boosted The Trade Desk (TTD) in Q2": 0.8,
  "Semtech Delivers Network Lifeline with T-Mobile’s T-Priority Certified Router": 0.6,
  "GE HealthCare announces intent to acquire icometrix to strengthen neurology portfolio with brain MRI assessment solutions": 0.5,
  "Marriott International and Noble Investment Group Break Ground on Their 10th StudioRes Hotel, Scaling New Extended Stay Brand": 0.5,
  "Deca and Silicon Storage Technology Announce Strategic Collaboration to Enable NVM Chiplet Solutions": 0.5,
  "Dow Jones Futures Fall, But Surging Oracle Lifts AI Stocks; Palantir Leads 5 New Buys": 0.5,
  "Cisco, Tata Communications Collaborate to Usher in Next Era of eSIM and IoT Connectivity": 0.6,
  "Paychex Introduces New Financial Management Solution Powered by BILL to Simplify Payroll and Payments for SMBs": 0.6,
  "Dexcom Launches Its First Open Call to Uncover the Next Diabetes Advocates Ahead of World Diabetes Day": 0.5,
  "lululemon athletica Second Quarter 2026 Earnings: EPS Beats Expectations": 0.6,
  "Ion Platform Poised for Cost Optimization: A Margin Lever for ISRG?": 0.5,
  "Airbnb’s Brian Chesky: AI Opens New Markets, ‘Everything Is Now Back on the Table’": 0.5,
  "CSX Chief Executive Officer and Chief Financial Officer to Address J.P. Morgan U.S. All Stars Conference": 0.1,
  "Marketing Teams Achieved 342% ROI with Jasper, According to Total Economic Impact Study": 0.6,
  "Unmissable Experiences in Latin America for Nature Enthusiasts": 0.5,
  "Blis Integrates T-Mobile Advertising Solutions Data into DSP, Redefining Audience Discovery in Omnichannel Advertising": 0.6,
  "GetReal Security Advances Continuous Identity Protection to Combat Deepfakes": 0.5,
  "Karbon Appoints Vivek Srivastava as Senior Director of Product to Drive AI Innovation in Accounting": 0.6,
  "Investors Heavily Search Zscaler, Inc. (ZS): Here is What You Need to Know": 0.5,
  "Investors Heavily Search Cadence Design Systems, Inc. (CDNS): Here is What You Need to Know": 0.5,
  "Here is What to Know Beyond Why Constellation Energy Corporation (CEG) is a Trending Stock": 0.2,
  "Bernstein lowers U.S. telecom stock targets on rising competition": -0.7,
  "Stocks making big moves yesterday: Centene, GoPro, Pitney Bowes, Atlassian, and UnitedHealth": 0.5,
  "Down More Than 30%: Analysts Spot Attractive Entry Points in 2 Beaten-Down Stocks": 0.5,
  "Stock-Split Watch: Is ASML Next?": 0.2,
  "CN, CSX join on new Nashville intermodal service": 0.5,
  "Datadog (DDOG) Just Overtook the 50-Day Moving Average": 0.5,
  "Is It Worth Investing in MercadoLibre (MELI) Based on Wall Street's Bullish Views?": 0.5,
  "Broadcom Cements Its AI Credentials - **Broadcom (AVGO) $342** I first bought Broadcom more than a year ago for $150, and added more yesterday around $340, deciding to take the plunge after holding on and realizing that the price wouldn’t come down. Broadcom (AVGO) the second largest AI chipmaker, and the leader by far in custom GPUs, and datacenter networking gear declared July quarter results that just passed estimates by a whisker. The stock, however,": 0.5,
  "Oracle stock booms 30%, on pace for best day since 1999 - Oracle stock roared more than 30% Wednesday after reporting gobsmacking cloud demand numbers, setting the company on track for a historic gain. The cloud giant is on pace for its best day since 1999, and is now quickly approaching the $1 trillion market cap benchmark The company said it has $455 billion in remaining performance obligations, up 359% from a year earlier. “This": 0.8,
  "This Top Computer and Technology Stock is a #1 (Strong Buy): Why It Should Be on Your Radar": 1.0,
  "Cisco: Rebuilding Homes and a Resilient Community in Western North Carolina": 0.6,
  "Oracle’s $230 Billion Market Cap Surge to Lift It Above JPMorgan": 0.5,
  "2025 Opportunities in the Global Savory Snacks Sector Featuring PepsiCo, Intersnack Group, Kellogg's, Campbell Soup, and Want Want Group": 0.5,
  "Synopsys downgraded, Oracle upgraded: Wall Street's top analyst calls": 0.2,
  "Pillsbury(TM) Brings its Most Popular Halloween Recipe to Life – Launching a Crescent Mummy Dog Costume for Pets": 0.5,
  "OPEN PLATFORM VIDEO TECHNOLOGY SUPPORTS SENIOR LIVING COMMUNITY'S OPEN VALUES": 0.5,
  "Gilead Sciences Commits to Veeva Vault CRM": 0.2,
  "8MM Alzheimer's Disease Market Drug Forecast and Market Analysis 2025-2033 | Eisai, Biogen, and Lilly to Lead, Novel Late-stage Pipeline Drugs Will Be a Key Driver, Opportunities in Unmet Needs": 0.5,
  "Shorts Are Returning to AppLovin Even After $3.4 Billion Squeeze": 0.2,
  "Prevent Blindness Kicks Off Annual World Sight Day Activities to Raise Awareness, Provide Education on the Importance of Vision Health and Equitable Access to Eye Care": 0.8,
  "This All-Star Stock Just Set New All-Time Highs": 0.8,
  "Form 8.3 - Aqua Acquisition Sub LLC (subsidiary of Qualcomm Incorporated)": 0.0,
  "Why AppLovin Continued to Rally in August": 0.5,
  "PepsiCo Partnership Puts Celsius Holdings on Faster Growth Track": 0.5,
  "Synopsys Stock Plummets 34% After Earnings. Here’s Why.": -0.8,
  "Brex Partners with DoorDash for Business to Deliver DashPass to Brex Corporate Cardholders": 0.5,
  "Quantum Computing Stocks: Nvidia's Growing Appetite For Startup Investments": 0.5,
  "The Trade Desk stock falls after Amazon-Netflix ad partnership": -0.6,
  "Cadence Expands Digital Twin Platform With NVIDIA DGX SuperPOD Model": 0.5,
  "Cintas Corporation Announces Webcast for First Quarter Fiscal Year 2026 Results": 0.0,
  "QBTS in Focus Amid Quantum Launches, Competition With IBM, HON": 0.2,
  "Why Constellation Energy Stock Popped Today": 0.5,
  "Is lululemon's Earnings Outlook Still Aligned With Its Growth Story?": 0.2,
  "Autodesk Stock: Is ADSK Underperforming the Technology Sector?": -0.5,
  "SNPS post earning down 30% - who's buying and when are you buying? - Hi So SNPS has reported earnings and got punished greatly. Stock is down 30% today. SNPS generally is a company with strong fundamentals and One big player in the semiconductor design industry. It's fundamentals are rather strong. So I'm curious if anyone's buying this dip? I'm not gonna lie. I'm tempted.": 0.5,
  "Atlassian lays off another 200 customer service, support staff": -0.8,
  "All You Need to Know About PepsiCo (PEP) Rating Upgrade to Buy": 0.6,
  "Are You Looking for a Top Momentum Pick? Why PDD Holdings Inc. Sponsored ADR (PDD) is a Great Choice": 0.8,
  "Why The Trade Desk (TTD) Shares Are Falling Today": -0.5,
  "Can Fortinet's Large Enterprise Deals Drive Long-Term Revenue Growth?": 0.2,
  "Is Cisco Stock's 4.42X PS Still Worth it? Buy, Sell, or Hold?": 0.2,
  "Jim Cramer Says He Joked With CSX Corporation (CSX)’s CEO About Its Valuation Being Higher Than JPMorgan": 0.2,
  "You Don’t Pick A Fight With Costco Wholesale Corporation (COST), Says Jim Cramer": 0.5,
  "Jim Cramer Reveals Why lululemon athletica inc. (LULU)’s Shares Fell By 18%": -0.5,
  "Stocks you believe in from direct customer experience - I'm curious to hear about any businesses that people believe in as investment opportunities primarily from first hand experience. Not because of how good they hear that a business is, but because they used it and thought \"this is amazing and I would personally be a repeat heavy customer\". For me, GRAB is a good example. A super app that's like Uber for Southeast Asia that": 0.6,
  "Get iPhone 17 Pro, iPhone 17 and iPhone Air all on Us at T-Mobile, America’s Best Network": 0.6,
  "US court upholds Verizon $46.9 million fine over location data": -0.5,
  "5G network slicing services – what are they offering?": 0.0,
  "WeRide – Quietly Crushing the Autonomous Driving Game - Alright, let’s talk about a ticker nobody’s giving enough love: WeRide ($WRD). Yeah, their earnings were 2 months ago, but sometimes you gotta let the hype die down and actually look at the numbers. And holy hell, these guys are quietly building one of the strongest plays in autonomous driving. Q2 ‘25 Recap: * Total revenue hit $17.8M, up 60% YoY. * Robotaxi revenue exploded +836%": 0.8,
  "CSX and the 2025 Medal of Honor Celebration Partner to Hold Historic Reenactment of the Great Locomotive Chase": 0.6,
  "The Kraft Heinz Company (KHC) “Is A Tough Deal,” Says Jim Cramer": -0.6,
  "Keurig Dr Pepper Inc. (KDP): I Just Can’t Make Sense Of Its Big Business Decision, Says Jim Cramer": -0.5,
  "T-Mobile US, Inc. (TMUS) Is Key To New iPhone Deals,  Says Jim Cramer": 0.5,
  "ComEd Begins Testing Phase of First of Its Kind Vehicle-to-Grid Charging Pilot with Local School Districts": 0.6,
  "It Doesn’t Cost Much To Switch An iPhone, Says Jim Cramer": 0.2,
  "Why Cadence Design Systems (CDNS) Stock Is Down Today": -0.5,
  "Is Charter Communications Stock Underperforming the Dow?": -0.5,
  "Amgen (AMGN) And Kyowa Kirin Reveal Initial Results From Rocatinlimab ASCEND Study": 0.5,
  "IDEXX Laboratories Stock: Is IDXX Outperforming the Healthcare Sector?": 0.5,
  "T-Mobile US (TMUS) Partners With LA28 As Official Telecom Provider For 2028 Olympics": 0.8,
  "CSX (CSX) and CN Team Up to Enhance Intermodal Service to Nashville": 0.6,
  "Trade Desk Stock Is Plummeting. Why It Faces Growing Concerns.": -0.8,
  "Is Constellation Energy (CEG) Too Pricey After Its Data Center Surge?": -0.5,
  "Paychex (PAYX) Introduces Integrated Financial Solution for SMBs Through Innovative Bill Pay Platform": 0.8,
  "Nvidia Just Placed a $1 Billion Quantum Bet--Here's What's Coming Next": 0.5,
  "Why AppLovin (APP) Stock Is Trading Up Today": 0.5,
  "Why Atlassian (TEAM) Shares Are Trading Lower Today": -0.5,
  "BILL Holdings (BILL) Partners With Paychex To Streamline Financial Management For SMBs": 0.5,
  "Oracle, OpenAI Sign Massive $300 Billion Cloud Computing Deal - https://www.wsj.com/business/openai-oracle-sign-300-billion-computing-deal-among-biggest-in-history-ff27c8fe > OpenAI signed a contract to purchase $300 billion in computing power over roughly five years from Oracle ORCL 35.05%, people familiar with the matter said, a massive commitment that far outstrips the startup’s current revenue. > > The deal is one of the largest cloud contracts ever signed, reflecting how spending on AI data centers is hitting new highs despite mounting concerns over": 0.8,
  "Not just the little guys: Lululemon feels the pain after death of de minimis": -0.5,
  "Why UBS Says ASML Is a 2027 Story Worth Buying Now": 0.6,
  "Needham Reaffirms Buy on Workday (WDAY) Ahead of Analyst Day": 0.6,
  "Synopsys Suffers Worst Rout Ever After Trade War Hits Sales": -0.8,
  "Stocks to Watch Recap: Apple, Oracle, Klarna, Synopsys": 0.0,
  "These Stocks Moved the Most Today: Klarna, Oracle, GameStop, Synopsys, Wolfspeed, Chewy, and More": 0.2,
  "S&P 500 Closes at New High Ahead of Consumer Inflation Data; Oracle Surges": 0.8,
  "US Equity Indexes Mixed as Consumer Discretionary Weighs on Tech Gains Ahead of August Consumer Price Inflation": 0.1,
  "Aviat Networks, Inc. (AVNW) Q4 Earnings and Revenues Surpass Estimates": 0.8,
  "S&P 500 Gains & Losses Today: Oracle Stock Soars, While Synopsys Staggers": 0.5,
  "Opendoor Names Kaz Nejatian as CEO; Founders Rabois and Wu Rejoin Board": 0.5,
  "Costco (COST) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Lam Research (LRCX) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "ON Semiconductor Corp. (ON) Stock Declines While Market Improves: Some Information for Investors": -0.5,
  "Intuitive Surgical, Inc. (ISRG) Stock Falls Amid Market Uptick: What Investors Need to Know": 0.1,
  "Vertex Pharmaceuticals (VRTX) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Why KLA (KLAC) Outpaced the Stock Market Today": 0.5,
  "Paccar (PCAR) Rises Higher Than Market: Key Facts": 0.5,
  "Oscar Health, Penumbra, DexCom, Merit Medical Systems, and HCA Healthcare Shares Are Falling, What You Need To Know": -0.5,
  "Select Medical, Guardant Health, Artivion, PacBio, and Intuitive Surgical Shares Are Falling, What You Need To Know": -0.5,
  "Honeywell International Inc. (HON) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Diamondback Energy (FANG) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "NXP Semiconductors (NXPI) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "CDTX – Is their CD388 “universal flu prophylaxis” the most undervalued clinical-stage blockbuster on the market, or I am missing something? - New to reddit and looking for a second set of eyes on one of my investments. I’ve been digging into Cidara ($CDTX), which is developing CD388, a once-per-season prophylaxis for influenza. Essentially a “universal flu med” for high-risk groups (elderly, immunocompromised, diabetics) where vaccines don't work well. It recently came out of a": 0.8,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On September 11, 2025, the Board of Directors (the “Board”) of Datadog, Inc. (the “Company”) increased the size of the Board from nine to ten members and appointed Ami Vora as a Class I director of the Company to fill the resulting vacancy, each effective September 11, 2025. Ms. Vora's term will expire at the Company’s Annual": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On September 11, 2025, Adobe Inc. (“Adobe”) issued a press release announcing financial results for its third quarter fiscal year 2025 ended August 29, 2025. A copy of this press release is furnished and attached hereto as Exhibit 99.1 and is incorporated herein by reference. The information in this report and the exhibit attached hereto are being furnished and shall not be deemed filed for purposes of the": 0.0,
  "Alibaba to raise $3.2 billion via convertible bond to fund cloud growth": 0.5,
  "Honeywell Introduces New BESS for C&I Applications": 0.5,
  "Is $AAPL still a good long term holding? - Apple dropped 3% after the event, just like it usually does. They launched new versions of the iPhone, AirPods, and Apple Watch, but there were no major upgrades, just like it usually does. What stands out more this time is how far behind they seem on AI. There’s been little progress in integrating generative AI into their products, and their collaborations with other AI companies don’t": -0.6,
  "1 Cash-Burning Stock with Promising Prospects and 2 We Turn Down": 0.5,
  "2 Cash-Heavy Stocks on Our Buy List and 1 Facing Challenges": 0.2,
  "Energy names worth looking at, but oil stuck in neutral - demand soft? - Crude has been moving sideways, with Brent at \\~$76 and WTI at \\~$72–73, after falling about 8% from its peak last month. While stockpiles continue to rise, EIA data just revealed that U.S. gasoline demand is down around 3% year over year, which isn't particularly encouraging. In addition to softer employment and worse PMI prints, the market is pricing in slower": -0.6,
  "$BYRN DD: It's Mispriced, and I think it'll pop by October 8th. I'll prove it. - **TL;DR: I believe $BYRN will pop off on or before their earnings call on October 8th.** Shorts are trying to convince you that a company with 57% revenue growth and frankly explosive profits is a bad bet. They are wrong. Standard play: $BYRN shares currently $19-20; Budget play 1: 10/17 25c currently ~$0.65; Budget play 2: 12/19 30c currently": 0.8,
  "5 Must-Read Analyst Questions From Copart’s Q2 Earnings Call": 0.2,
  "Lululemon’s Q2 Earnings Call: Our Top 5 Analyst Questions": 0.5,
  "lululemon's Dr. Joey Chan Explores Innovation at Retail Asia Conference & Expo 2025": 0.5,
  "Accenture and 5 Other AI Stocks That Don’t Stint on Dividends": 0.5,
  "Synopsys (SNPS) Drops to 5-Month Low on Dismal Earnings": -0.8,
  "Trade Desk (TTD) Drops 11.9% on PT, Rating Downgrade": -0.7,
  "Is Old Dominion Freight Line Underperforming the S&P 500?": -0.5,
  "Fastenal Stock: Is FAST Outperforming the Industrial Sector?": 0.5,
  "Merck scraps £1bn London expansion as report warns UK drugs sector ‘losing out’": -0.7,
  "Carlyle, EQT, HongShan among final bidders for Starbucks China, sources say": 0.2,
  "Is PepsiCo a Buy After an Activist Investor Took a $4 Billion Stake in the Dividend King Stock?": 0.5,
  "5 Reasons Lululemon Stock Can Bounce Back": 0.5,
  "3 Artificial Intelligence ETFs to Buy With $100 and Hold Forever": 0.5,
  "Strength Seen in Travere (TVTX): Can Its 26.2% Jump Turn into More Strength?": 0.6,
  "Trending tickers: Klarna, Alibaba, Opendoor, Synopsys and Fevertree": 0.0,
  "Which UK Regions Splurged or Saved on Summer ’25 Travel?": 0.0,
  "Marriott opens first dual-branded hotel in Las Vegas": 0.5,
  "Marriott’s StudioRes expansion continues with tenth hotel": 0.5,
  "r/Stocks Daily Discussion & Options Trading Thursday - Sep 11, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why": 0.2,
  "Britain defends investment record as Merck scraps labs over pharma environment": 0.1,
  "Is lululemon athletica Stock Underperforming the S&P 500?": -0.5,
  "Kraft Heinz split may come too late to fend off growing MAHA threat": -0.5,
  "Q2 Metals Clarifies Technical Disclosure on Cisco Lithium Project": 0.1,
  "China’s Multibillion-Dollar US Pharma Pipeline Draws Scrutiny in Washington": 0.1,
  "7 No-Brainer Robotics Stocks to Buy Right Now": 0.5,
  "Social Buzz: Wallstreetbets Stocks Advance Premarket Thursday; Opendoor Technologies, Synopsys to Open Higher": 0.5,
  "Baker Hughes to Supply Integrated Subsea, Completion Systems for Turkish Petroleum’s Sakarya Gas Field Phase 3": 0.5,
  "Strada Unveils Exclusive Nayya Partnership and Innovation Portfolio at Workday Rising U.S. 2025": 0.5,
  "GE HealthCare inks Icometrix buyout to acquire brain MRI software": 0.5,
  "Calculating The Intrinsic Value Of Marvell Technology, Inc. (NASDAQ:MRVL)": 0.1,
  "1 Thing I Can't Stop Thinking About Following O'Reilly Automotive's Recent Earnings Report": 0.5,
  "Multiple LTL carriers report August volume declines": -0.5,
  "$1 billion berry startup Fruitist hires tech finance chief as its new CFO": 0.5,
  "Latest News In Energy Transition - Renewable Growth Opportunities in Middle East and Africa Regions": 0.5,
  "Discover September 2025's Stocks That May Be Trading Below Estimated Value": 0.5,
  "Comcast (CMCSA) Valuation Check: Is the Current Slowdown Creating Opportunity?": 0.5,
  "How Cadence's (CDNS) Expanded Digital Twin Platform With NVIDIA Could Shape AI Infrastructure Development": 0.5,
  "Does the Latest AppLovin Rally Signal More Growth Ahead for 2025?": 0.5,
  "T-Mobile (TMUS): Taking a Closer Look at Valuation After Recent Share Price Pause": 0.2,
  "Does Luckin Coffee’s US Launch Signal a Bargain After Shares Surge 95% This Year?": 0.5,
  "Kraft Heinz Post-Split Fate Uncertain as Analysts Recall Kellogg M&As": 0.1,
  "Ascend Communications: How To Find & Own America's Greatest Opportunities": 0.0,
  "Why Agree Realty, Open Text, And Comcast Are Winners For Passive Income": 0.8,
  "Exploring PACCAR (PCAR) Valuation: Is the Market Overlooking Opportunity?": 0.5,
  "YolTech Therapeutics Raises $45 Million in Series B Financing Led by AstraZeneca-CICC": 0.5,
  "AI-Fueled Cybersecurity Market Makes These 3 Stocks Worth Buying": 0.5,
  "Opendoor, Alibaba, Synopsys: Trending Stocks": 0.0,
  "Voya Financial joins the Workday Wellness Partner Program to enhance employee wellness through AI-powered benefits": 0.5,
  "Starbucks Teams With AI Startup NomadGo To Automate Counting In 11,000 Stores — CTO Says Goodbye To Manual Tallies Forever": 0.8,
  "Waterford Hotel Group Takes the Helm at Aloft & Element Arundel Mills BWI Airport": 0.5,
  "CPI rose 2.9% and Core CPI rose 3.1% as expected in August. - \"In August, the Consumer Price Index for All Urban Consumers rose 0.4 percent, seasonally adjusted, and rose 2.9 percent over the last 12 months, not seasonally adjusted. The index for all items less food and energy increased 0.3 percent in August (SA); up 3.1 percent over the year (NSA).\" The expected inflation, combined with an increasingly weak job market, sets the stage": 0.2,
  "TEM Gains Validation for PurIST Amid Evolving Cancer Care Landscape": 0.6,
  "ZKTeco WFM to Showcase Next-Generation Time Clocks and Data Collection at Workday Rising San Francisco and Barcelona": 0.5,
  "Are Options Traders Betting on a Big Move in Thomson Reuters Stock?": 0.5,
  "ColorTokens Announces Integration with the CrowdStrike Falcon Platform": 0.5,
  "Trintech Deepens Partnership with Workday through Embedded AI-Powered Financial Close Solution": 0.6,
  "Veza Partners with CrowdStrike to Deliver End-to-End Access Security and Identity Threat Protection to Stop the #1 Attack Vector: Compromised Identity": 0.6,
  "Take-Two Interactive to Host Webcast of 2025 Annual Meeting of Stockholders": 0.2,
  "The Trade Desk (TTD) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Starbucks Corporation (SBUX) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "lululemon athletica inc. (LULU) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Vertex Scientists Awarded the 2025 Lasker~DeBakey Clinical Medical Research Award for Pioneering Discoveries in Cystic Fibrosis": 0.8,
  "Chewy wants to make Chewy+ the top pet membership program": 0.6,
  "Cisco Systems Stock Outlook: Still the Backbone of Modern Networks?": 0.5,
  "Starbucks Nears Sale of China Stake as Bidders Line Up": 0.5,
  "Sector Update: Energy Stocks Decline Pre-Bell Thursday": -0.5,
  "Company News for Sep 11, 2025": 0.0,
  "Is It Worth Investing in Take-Two (TTWO) Based on Wall Street's Bullish Views?": 0.5,
  "Wall Street Bulls Look Optimistic About Intuitive Surgical (ISRG): Should You Buy?": 0.8,
  "Diamondback Energy Stock: Is FANG Underperforming the Energy Sector?": 0.1,
  "Union Pacific, Norfolk Southern: Rival alliances bolster merger case": 0.5,
  "Is Exelon Stock Underperforming the S&P 500?": -0.5,
  "Buy, Hold or Sell Costco Stock? August Sales Signal Next Move": 0.2,
  "Is Climb Bio, Inc. (CLYM) Stock Outpacing Its Medical Peers This Year?": 0.2,
  "Are You a Value Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Guggenheim bullish on Atlassian and GitLab as AI adoption to fuel growth": 0.8,
  "Are You a Growth Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Why This 1 Growth Stock Could Be a Great Addition to Your Portfolio": 0.8,
  "Apple downgraded, Nvidia upgraded: Wall Street's top analyst calls": 0.2,
  "Here's Why Qualcomm (QCOM) is a Strong Momentum Stock": 0.8,
  "TeamBuilder Named Workday Partner to Bring Predictive Scheduling to Ambulatory Care": 0.5,
  "Baker Hughes Signs Equipment Contract with Geothermal Developer Fervo": 0.5,
  "When Should You Buy Honeywell International Inc. (NASDAQ:HON)?": 0.0,
  "TimesSqure Capital U.S. Focus Growth Equity Trimmed CrowdStrike Holdings (CRWD) Following Share Price Appreciation": 0.2,
  "Can MRVL Sustain EPS Momentum as AI Competition Heats Up?": 0.1,
  "Synopsys Stock Rises. Why This Analyst Sees a Buying Opportunity After Wednesday’s Pummeling.": 0.6,
  "Can AMAT Maintain Strong Margins Amid Rising R&D Expenses?": -0.5,
  "Micron Reports Earnings Soon. Watch for This Surprise.": 0.5,
  "Asia-Pacific Router and Switch Market Review 2019-2025 and Forecast to 2030 Featuring Profiles of Key Players - Cisco, Dell, Hewlett Packard Enterprise, Huawei Technologies, Broadcom and More": 0.2,
  "Starbucks Corporation (SBUX): Jim Cramer Wonders Whether CEO Might Not Have Realized How Broken Things Were": 0.1,
  "AI Chip Stock Astera Labs Breaks Out Past Rare Buy Point With This Bullish Signal": 0.8,
  "Fabrinet vs. TE Connectivity: Which Electronics Stock is the Better Buy?": 0.5,
  "2 Growth Stocks Down 20% or More to Buy Right Now": 0.5,
  "Comcast (CMCSA) Plans Redemption of $2.47B in 3.950% Notes due October 2025": 0.2,
  "Old Dominion Faces Analyst Split After Earnings Miss and August LTL Decline": -0.5,
  "Renowned AI Expert Kathy Pham Speaks at Kennesaw State’s Inaugural Presidential Lecture Series Event": 0.8,
  "EPAM vs. CSGP: Which Stock Is the Better Value Option?": 0.0,
  "What happens when they cut rates and jobless numbers don’t improve? - Historically the fed has had a dual mandate to both manage inflation and the employment rate, attempting to keep both in a band with their interest lever. This has always worked historically because when you lower interest rates you hire more people and do more work. But ‘work’ is no longer a direct function of employment especially in white collar sectors so this": 0.2,
  "Zelle owner Early Warning Services exploring stablecoin for retail bank customers": 0.5,
  "Workday Named a Leader in 2025 Gartner® Magic Quadrant™ for Cloud HCM Suites for 1,000+ Employee Enterprises for Tenth Consecutive Year": 0.8,
  "ARM's 11% Rise in Three Months: Should You Buy, Hold, or Sell?": 0.2,
  "OppFi Soars 139% in a Year: Should You Buy the Stock Now or Wait?": 0.5,
  "Honeywell Unveils Ionic Modular All-in-One BESS for Industrial Use": 0.5,
  "Update: Q2 Metals Up 3% as Clarifies Technical Disclosure on Cisco Lithium Project": 0.5,
  "Why Celsius (CELH) Stock Is Up Today": 0.5,
  "Lam Research (LRCX) Shares Skyrocket, What You Need To Know": 0.8,
  "DAT thanks truck drivers with free BBQ and giveaways Sept. 15-16": 0.6,
  "Should Investors Buy Target Stock at the Current Discounted Level?": 0.5,
  "Qualcomm and Harman forge alliance to elevate AI in car cockpits": 0.5,
  "The ELC Awards $2 Million in Scholarships to More Than 100 Emerging Business Leaders in 2025 Cohort": 0.8,
  "Starbucks Opens First Spain Flagship Store Inside Real Madrid’s Bernabéu Stadium": 0.5,
  "QUALCOMM (QCOM) Expands its Collaboration with Google Cloud": 0.5,
  "UBS Maintains a Hold Rating on The Kroger Co (KR)": 0.1,
  "Wall Street is Bullish on PDD Holdings (PDD), Here’s Why?": 0.6,
  "Amgen Inc (AMGN) Releases Top-Line Results From ASCEND Study of Rocatinlimab": 0.5,
  "TD Cowen Remains Bullish on On Semiconductor Corporation (ON)": 0.6,
  "Phase III success for Regeneron signals pozelimab and cemdisiran’s entry into MG market": 0.5,
  "Comcast, Amazon Announce Expanded Distribution Agreements for Streaming Services": 0.5,
  "T-Mobile US Increases Synergy Expectations, Accelerates Integration of UScellular Acquisition": 0.8,
  "Fiserv Acquires CardFree to Enhance Clover Point-of-Sale System": 0.5,
  "Warren Buffett wouldn’t worry about cash if he retired with just $1M — here’s why and how to copy his strategy": 0.5,
  "1 Reason Every Investor Should Know About Intuitive Surgical (ISRG) Stock": 0.5,
  "Starbucks Faces Scrutiny as CEO's Pay Is 6,666 Times That of the Median Barista": -0.8,
  "3 Stocks Estimated To Be Trading Below Intrinsic Value By Up To 47.5%": 0.5,
  "KLA (KLAC) Sees 10% Share Price Rise Over Past Week": 0.8,
  "Oracle's blockbuster surge shows AI trade's growing influence on market": 0.6,
  "Why Lam Research Rallied Today": 0.5,
  "Paramount Skydance is preparing a takeover bid for Warner Bros. Discovery - https://www.cnbc.com/2025/09/11/warner-bros-discovery-paramount-skydance-bid.html > Warner Bros. Discovery shares soared more than 25% Thursday afternoon on a report from the The Wall Street Journal that the recently merged Paramount Skydance was preparing a takeover bid. Shares of Paramount Skydance were up roughly 8% in afternoon trading. Representatives for Paramount and Warner Bros. Discovery declined to comment. Warner Bros. Discovery recently announced plans to separate its global": 0.8,
  "StandardAero Opens Expanded Augusta Facility to Increase Business Aviation MRO Capacity": 0.5,
  "Warner Bros. Discovery soars on rumored Paramount Skydance bid": 0.8,
  "Why Zscaler (ZS) Stock Is Trading Up Today": 0.5,
  "Gilead Sciences Commits To Veeva Systems (VEEV) For Vault CRM Suite": 0.5,
  "Equipment Check: Charts Show Energy Services Stocks Poised to Rally": 0.8,
  "Why Synopsys Stock Bounced Higher Today": 0.5,
  "Arm Holdings (ARM) Stock Surges 17% In One Week": 0.8,
  "Biotechs Could Benefit If RFK Jr. Leaves HHS": 0.2,
  "Is it ok to post short biased valuation analysis in this community? - I write a lots of skeptical short biased reports on companies, but I sense a lots of long biases in this community. I for one believe that the main function of an analysis is to ward off the public against deceitful, overextended, and fraudulent securities. I think that great businesses always take care of themselves and should be bought a fair value": 0.2,
  "Kewaunee Scientific Announces Appointment of J. Jette Campbell to Board of Directors": 0.5,
  "Datadog Appoints Ami Vora to Its Board of Directors": 0.5,
  "The Estée Lauder Cos. Taps PepsiCo’s René Lammers as Chief Research & Innovation Officer": 0.5,
  "Top Research Reports for Oracle, AstraZeneca & Shopify": 0.0,
  "How to Buy the Dip in Synopsys Stock with a 2:1 Reward/Risk Ratio": 0.6,
  "Booking Holdings Bets on Agentic AI to Challenge Big Tech": 0.5,
  "Michael Saylor Mocks S&P 500 Returns After MicroStrategy Snub": -0.5,
  "Fresh Video Game Data Is Positive For Roblox Stock": 0.8,
  "These Stocks Moved the Most Today: Warner Bros., Oracle, Micron, Opendoor, Synopsys, Centene, Delta, and More": 0.0,
  "Wall Street Rises to New Highs as Fed Rate Cut Bets Intact": 0.8,
  "Baker Hughes Secures Order for Rio Grande LNG Expansion": 0.5,
  "Hyatt Hotels, Marriott Vacations, Travel + Leisure, Xponential Fitness, and Polaris Shares Skyrocket, What You Need To Know": 0.8,
  "Cognizant Pledges to Expand AI Education and Upskill Workforce": 0.8,
  "US oil titan to cut up to 25% of its workforce — impacting thousands. So what happened to ‘drill baby drill’?": -0.6,
  "Why Zscaler Stock Topped the Market on Thursday": 0.5,
  "Take-Two Interactive (TTWO) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "PepsiCo (PEP) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "Qualcomm (QCOM) Laps the Stock Market: Here's Why": 0.5,
  "Gilead Sciences (GILD) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "Figure ipo, how many shares did you get? - Figure just went ipo, On the first day it opened at $25, hit a peak of $38, and closed at $31. As the first RWA stock, it’s definitely got that rare appeal. Personally, I think this IPO has both short-term flip potential and long-term investment value, but the risks aren’t small. How many shares did you guys get this time? \\- would you treat it as": 0.5,
  "OpenAI, ORCL, NVDA and the UK - The question has to be asked, who is funding OpenAI moving forward? $300 billion to Oracle. Projected cash burn through 2029 is $115 billion (as of a few days ago). And now this comes out: OPENAI, NVIDIA TO ANNOUNCE BILLIONS IN UK DATA CENTER PROJECTS So that lands them in the realm of needing maybe $500+ billion in the next 4 years? They don’t make money, they burn": -0.8,
  "Agoda Maps Asia's Appetite for Regional Food-Focused Tourism as Hoteliers Eat Up the Benefits": 0.6,
  "2 High-Flying Stocks to Target This Week and 1 We Ignore": 0.2,
  "1 High-Flying Stock to Own for Decades and 2 We Avoid": 0.5,
  "3 Growth Stocks Set to Flourish": 0.5,
  "2 Profitable Stocks for Long-Term Investors and 1 We Brush Off": 0.2,
  "Jim Cramer on AppLovin: “It’s a Buy”": 0.6,
  "Jim Cramer on Fortinet: “That’s Actually the Weakest of the Cybersecurities”": -0.6,
  "Jim Cramer on Marvell: “The Guidance Was Not What I Wanted”": -0.5,
  "AstraZeneca (AZN) Price Target Backed by Goldman After Baxdrostat Phase 3 Data": 0.5,
  "NASDAQ wants to tokenize stocks… are they just late to the party? - When Bitcoin and Ethereum ETFs finally got approved, it felt like TradFi was pulling crypto into its world. But with Nasdaq now asking the SEC to allow trading tokenized stocks, the roles might be reversing: traditional finance is moving into blockchain territory. What stands out is that tokenization isn’t new. Crypto platforms have already been experimenting with RWA products for a while": 0.5,
  "Is CoStar Group Stock Underperforming the Nasdaq?": -0.5,
  "UK's September 2025 Stock Selections Estimated Below Intrinsic Value": -0.5,
  "Why The Trade Desk Stock's Recent Slide Was Justified": -0.5,
  "Cadence (CDNS) Stock Jumps 4.8%: Will It Continue to Soar?": 0.6,
  "The Zacks Analyst Blog Highlights Oracle, AstraZeneca, Shopify and Blue Ridge Bankshares": 0.5,
  "Puts on Duolingo - Been watching this stock for a while. It had a surge yesterday and is now sitting at $310, still down from its ath of $545. This upward movement came from 2 analysts increasing their price target to $400. It had a similar spike back on August 18th when it increased to $370, which was then followed by a large sell off down to $270. Same reason, an analyst made an upgrade.": 0.2,
  "Meet the Impressive Growth Stock That's Up More Than 700% Since IPO and Is Poised to Join the S&P 500": 0.8,
  "Up More Than 40% This Year, Can Netflix Stock Keep Rising?": 0.5,
  "Crypto Treasury ‘Easy Money’ Era Ends as Companies Enter ‘Player vs Player’ Competition – Good for Investors?": 0.2,
  "Kraft Heinz opens a new tomato processing plant in Portugal": 0.5,
  "PayPal CEO rejects stablecoin threat": 0.1,
  "Starbucks shortlists five candidates for China stake sale": 0.2,
  "If Pepsi Wants to Win, It Has to Play Coke’s Game": 0.2,
  "r/Stocks Daily Discussion & Fundamentals Friday Sep 12, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is": 0.2,
  "Marriott’s Moxy brand makes debut in Northern Ireland": 0.5,
  "Starbucks unveils Spanish flagship outlet at Bernabéu Stadium, Madrid": 0.5,
  "Meet the Artificial Intelligence (AI) Stock That's Crushing Nvidia on the Market in 2025": 0.8,
  "The Friday Checkout: The king of private brands turns 30": 0.5,
  "Starbucks Whips Up Big Bids for Its Chinese Biz": 0.5,
  "Ethena Labs Withdraws Bid for Hyperliquid’s USDH Stablecoin Amid Pushback": -0.5,
  "Kinaxis Announces New Partnership with Workday to Unite Supply Chain, Finance and Workforce Planning": 0.8,
  "Charter Communications (NASDAQ:CHTR) Has A Somewhat Strained Balance Sheet": -0.5,
  "Is DoorDash, Inc.'s (NASDAQ:DASH) Recent Stock Performance Influenced By Its Fundamentals In Any Way?": 0.1,
  "IonQ Secures Regulatory Approval from the UK Investment Security Unit (ISU) for the Acquisition of Oxford Ionics": 0.5,
  "Values Cap Wall Street Pre-Bell, Asia Up, Europe Off": 0.2,
  "TSLA broke out with no catalyst. When there's no story, it usually means one’s coming. - TSLA has been range-bound between **$310–$365** for months. It's now testing the top of that range with **bullish momentum** (MACD crossed up, RSI near 65). A **daily close above $360** has just confirmed a breakout. Entry at \\~$367–370 targets **$400 and $430** (Fib extensions). Stop below $352. No confirmation = no trade. Volume needs to keep showing up, otherwise,": 0.8,
  "Mizuho downgrades Applied Materials on China competition risks": -0.6,
  "Applied Materials Announces Cash Dividend": 0.5,
  "How Is Verisk Analytics' Stock Performance Compared to Other Industrial Stocks?": 0.1,
  "AI Chips Update - Edge Video Streaming Revolution Powered By Advanced AI Hardware": 0.8,
  "Earnings growth outpaced the decent 9.8% CAGR delivered to Datadog (NASDAQ:DDOG) shareholders over the last five years": 0.6,
  "Dow Jones Futures Fall: New Bullish Phase For Market Rally? Tesla Leads 5 Stocks Flashing Buy Signals": 0.5,
  "NFLX: Netflix Shares Tumble as Rivals Circle in on Streaming Market": -0.8,
  "Why Is Warner Bros Discovery (WBD) Stock Soaring Today": 0.5,
  "Roper's Application Software Growth Picks Up: A Sign of More Upside?": 0.6,
  "Applied Materials Faces Growing Risks in China, Analyst Says. The Stock Falls.": -0.7,
  "Kinaxis Partners With Workday to Link AI Supply Chain and Planning Platforms": 0.5,
  "Maia’s NSCLC immunotherapy secures Phase II efficacy win": 0.6,
  "Strength Seen in Silicon Motion (SIMO): Can Its 6.4% Jump Turn into More Strength?": 0.6,
  "Can CEG's Energy Efficiency Products Act as a Growth Catalyst?": 0.5,
  "Should You Add IDEXX Stock to Your Portfolio Right Now?": 0.2,
  "Walmart Stock Jumps 22% in Six Months: Hold Steady or Take Profits?": 0.5,
  "Best Buy Appoints Meghan Frank to Board of Directors": 0.6,
  "Break Free: Borderlands®4 Now Available Worldwide": 0.5,
  "ASML Is Betting Big on AI Giant Mistral. Does That Make ASML Stock a Buy, Sell, or Hold Here?": 0.2,
  "How to Boost Your Portfolio with Top Computer and Technology Stocks Set to Beat Earnings": 0.5,
  "Vertex Pharmaceuticals Incorporated (VRTX) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Intuitive Surgical, Inc. (ISRG) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Is Trending Stock Applied Materials, Inc. (AMAT) a Buy Now?": 0.2,
  "Cisco Systems, Inc. (CSCO) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Investors Heavily Search CrowdStrike (CRWD): Here is What You Need to Know": 0.5,
  "KDP strikes distribution deal for Cove Soda in Canada": 0.5,
  "How will the market react to secondary tariffs on china/India? - [https://www.bloomberg.com/news/articles/2025-09-12/us-proposes-broad-g-7-sanctions-on-russian-energy-to-end-war](https://www.bloomberg.com/news/articles/2025-09-12/us-proposes-broad-g-7-sanctions-on-russian-energy-to-end-war) Apparently Trump wants the EU to impose upto 50/100 percent tariffs on china and india to pressure Russia to end the war, and he will do the same. What are you guys thoughts?": -0.5,
  "1 Reason Wall Street Is Obsessed With Netflix Stock": 0.5,
  "NVIDIA's Data Center Sales Soar 56% in Q2: Can It Keep the Momentum?": 0.6,
  "Exchange-Traded Funds Higher, Equity Futures Mixed Ahead of September Consumer Sentiment Report": 0.5,
  "(09/12) Interesting Stocks Today- An AI for an AI makes the whole world blind? - Hi! I am an ex-prop shop equity trader. This is a daily watchlist for short-term trading: I might trade all/none of the stocks listed, and even stocks not listed! I am targeting potentially good candidates for short-term trading; I have no opinion on them as investments. The potential of the stock moving today is what makes it interesting, everything else": 0.2,
  "Intuitive Introduces Real-Time Surgical Insights for da Vinci 5": 0.5,
  "Lam Research vs. Micron: Which Semiconductor Stock Is the Better Bet?": 0.5,
  "Charlotte AI Usage Jumps 85%: Will it Power CRWD's Growth Momentum?": 0.6,
  "Crypto Proxy Strategy Inc (MSTR) Just Flashed an Ultra-Enticing Reversal Signal": 0.8,
  "Unlocking Zscaler (ZS) International Revenues: Trends, Surprises, and Prospects": 0.5,
  "Sector Update: Energy Stocks Advance Premarket Friday": 0.5,
  "Wall Street Set to Open Little Changed Friday Ahead of Consumer Sentiment Report": 0.0,
  "Paychex Recognized as One of America’s Greatest Companies and Most Admired Workplaces by Newsweek": 0.8,
  "Wall Street Analysts See Constellation Energy Corporation (CEG) as a Buy: Should You Invest?": 0.5,
  "How Is Electronic Arts' Stock Performance Compared to Other Video Gaming and eSports Stocks?": 0.0,
  "Is AppLovin (APP) Outperforming Other Business Services Stocks This Year?": 0.2,
  "Synopsys (SNPS) Soars 13% on 4 Analysts’ “Buy” Calls": 0.8,
  "Cisco - The Data Catalyst: Blended Finance Paving the Way for Climate AI Solutions": 0.5,
  "Here's Why Qualcomm (QCOM) is a Strong Growth Stock": 0.8,
  "CN and CSX tout railroad collaboration to power growth": 0.5,
  "Is ON Semiconductor Stock Underperforming the S&P 500?": -0.5,
  "Baker Hughes Wins Key Contract to Support Sakarya Gas Field Phase 3": 0.6,
  "Will Amazon Partnership Help Netflix Double Ad Revenue Targets?": 0.5,
  "Berkshire + ASML: The Investment That Never Happened, Why? - ASML fits many of Buffett’s usual criteria: near-monopoly, critical infrastructure, decades of R&D. Yet Berkshire has never owned it, at least to my knowledge. What’s your take? Was it too ‘tech’, too cyclical, or something else?": 0.1,
  "What Is Workday, Inc.'s (NASDAQ:WDAY) Share Price Doing?": 0.1,
  "How a Paramount-Warner Bros. Merger Could Hurt Netflix": -0.7,
  "Is $ORCL secretly SoftBank in a mask? - Let me get this straight: * Oracle announces $455B in RPOs through 2030, driving stock up 40% in a single day * $300B of this (66%) depends on a single contract with OpenAI starting in 2027 * OpenAI's funding for this contract comes from SoftBank's $500B Stargate commitment * SoftBank's total assets are $300B - meaning they'd need to liquidate their entire company just for the Oracle": 0.2,
  "Which of these stocks should I sell off this year? - Unfortunately I jumped on the bandwagon for a couple stocks back in 2022 and I am down a couple grand on each of them. Which of these do you think have the most potential and which has the least? I’ve held for years and they hardly budged so I’m coming to this subreddit for some advice on what you would do. PayPal - PYPL": -0.6,
  "Baker Hughes Stock: Is BKR Outperforming the Energy Sector?": 0.5,
  "Nvidia Stock Ticks Up. It’s Getting a Super Micro Boost.": 0.6,
  "Form 8.3 - Qualcomm Incorporated": 0.0,
  "Stock Market Runs To Highs On Surging Oracle, Fed Rate Cut Hopes: Weekly Review": 0.6,
  "PayPal vs. StoneCo: Which Fintech Stock Offers Greater Upside Now?": 0.5,
  "Gartner predicts Fortune 500 companies won’t eliminate human agents anytime soon": 0.2,
  "AppLovin price target raised as Wedbush sees ’vast, growth potential": 0.8,
  "Baker Hughes to supply liquefaction equipment for Rio Grande LNG’s Train 4": 0.5,
  "AppLovin Poised to Benefit 'Handsomely' From Gaming Momentum, Wedbush Says": 0.8,
  "Applied Materials, Inc. (AMAT) Reaffirms Its Forecast for High-End Chipmaking Tools; Cantor Fitzgerald Maintains Bullish Stance": 0.8,
  "QUALCOMM Incorporated (QCOM) and BMW Launches Snapdragon Ride Pilot, A Next-Generation Automated Driving System": 0.8,
  "Why Shares in Synopsys Tumbled This Week": -0.5,
  "How the Paramount/Warner Bros Deal Could Avoid the Media Merger Curse": 0.5,
  "Honeywell International Inc. (HON) Announces $600 Million Equity Capital Raise for Its Quantum Subsidiary Quantinuum": 0.5,
  "Okta Shares Rise 17% Year to Date: Buy, Sell or Hold the Stock?": 0.2,
  "RH, Lululemon, Alaska Air: Wall Street analyst calls": 0.2,
  "Jim Cramer Comments On Micron Technology (MU)’s Shares & Says Be Careful": -0.5,
  "Tariff-Driven Price Increases Taking Hold, With More Hikes on the Cards, Oppenheimer Study Shows": -0.5,
  "The Kroger Co. (KR) “Had A Very Good Number,” Says Jim Cramer": 0.8,
  "Analyst on US Government’s Stake in Intel (INTC): Trump is ‘Going to Come Back and Ask For More’": 0.2,
  "AppLovin Stock Could Rise 25%, Analyst Says. Here’s Why.": 0.8,
  "Comcast Urges More Civil Dialogue After Kirk’s Death": 0.2,
  "Intuitive adds new real-time insights to da Vinci 5 robot": 0.6,
  "SpeedLine Solutions launches cloud-based POS system for restaurants": 0.5,
  "Why Is Tesla (TSLA) Stock Soaring Today": 0.5,
  "Opendoor Stock Soars 80% as Co-Founders Return. Why the ‘Open Army’ Is Snapping Up Shares.": 0.8,
  "Prescription Drug Ads Face Big Changes. These Stocks Could Get Hurt the Most.": -0.7,
  "Novartis Catches a ‘Sell.’ Goldman Sachs Says the Stock Is Overvalued.": -0.8,
  "Adobe Earnings Were ‘Solid.’ Long-Term Growth Concerns Remain.": 0.2,
  "Exclusive-AstraZeneca pauses $270 million investment in Britain": -0.6,
  "Is Cognizant Technology Solutions Stock Underperforming the S&P 500?": -0.5,
  "LULU is the next UA not NKE - Post earnings LULU has slid harder and continues to fall off a cliff. I understand its trading low and it gets people excited to buy cheap.. thing is its going to get much cheaper. Once a brand is deemed uncool or unpopular it can easily fall into a value trap that slow bleeds. Nike has been able to weather the storm as it has a iconic brand": -0.8,
  "EA SPORTS™ NHL® 26 Launches Worldwide Today, Bringing Fans an Early Start to the Hockey Season": 0.6,
  "US Equity Indexes Mixed, Treasury Yields Rise as Michigan Consumer Sentiment Drops to Four-Month Low": -0.5,
  "Rambus (RMBS) Surges 14.9%: Is This an Indication of Further Gains?": 0.8,
  "Returns On Capital Are Showing Encouraging Signs At Thomson Reuters (TSE:TRI)": 0.6,
  "US Drillers See Slight Uptick in Oil Activity": 0.2,
  "Intuitive Surgical (ISRG) Unveils New Software Upgrades for da Vinci 5 Platform": 0.5,
  "Starbucks (SBUX) Opens Immersive Experience at Madrid's Santiago Bernabeu Stadium": 0.5,
  "Heavy Options Trading on Opendoor Raises Bullish-Bearish Debate": 0.2,
  "Advanced Micro Devices (AMD) Partners In AI-Driven Drug Discovery With Absci And Oracle": 0.5,
  "CNI & CSX Partner to Expand Intermodal Network to Nashville": 0.5,
  "AstraZeneca (LSE:AZN) Advances Cancer Drug In EU With EMA Application Validation": 0.5,
  "Sellers on Amazon, MercadoLibre face competitive barriers, Mexico watchdog rules": -0.5,
  "Why Opendoor Technologies Stock Crashed Today": -0.5,
  "Follow-up: Why flu vaccine economics shouldn’t apply to Cidara’s (CDTX) CD388 universal flu prophylaxis - In response to my earlier post asking if Cidara’s (CDTX) CD388 “universal flu prophylaxis” was the most undervalued clinical-stage blockbuster on the market ([CDTX – Is their CD388 “universal flu prophylaxis” the most undervalued clinical-stage blockbuster on the market, or I am missing something?](https://www.reddit.com/r/stocks/comments/1ndt2go/cdtx_is_their_cd388_universal_flu_prophylaxis_the/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)), I received a number of comments that begged the question: Why should CD388 be priced any": 0.1,
  "Is Biogen Stock Underperforming the Nasdaq?": -0.5,
  "AstraZeneca pauses £200m Cambridge expansion amid NHS pricing row": -0.6,
  "After Trump Meeting, Union Pacific CEO Defends Norfolk Southern Deal as Catalyst for Fiercer Rail Competition": 0.5,
  "Wash Sale effecting cost basis? - Bought a stock I sold earlier, I purchased it at 7.85, but listed as me buying it at 8.32. Did not realize wash sale was a thing. Is 8.32 the price I bought in at now after Wash Sale adjustment? Will it go down after a certain amount of time or when I sell it? I’ve read explanations a few times but I’m having trouble wrapping my head around": -0.6,
  "Datadog (DDOG) Expands Board With Appointment Of Former WhatsApp Product Leader": 0.5,
  "Why Lululemon (LULU) Stock Is Falling Today": -0.5,
  "Why Micron (MU) Stock Is Trading Up Today": 0.5,
  "Intuitive Surgical Reveals New FDA-Cleared Features Driving Innovation In da Vinci 5": 0.5,
  "Physical gold, silver & gold miners have outperformed S&P500, Nasdaq & NVidia YTD - Wanna hear something funny? YTD Performance * Gold ($PHYS) +39.45% * Silver ($PSLV) +48.60% * Gold miners ($GDS) +105.32% * Sibanye Stillwater ($SBSW) +164.70% In comparison (YTD) * Nasdaq +14.18 * SP500 +12.24% * NVidia ($NVDA) +32.24% Full disclosure, I'm invested and I've been invested in the PM tickers I mentioned for the past 3+ years": 0.8,
  "Stocks can't be this easy???? - What a ride it's been. I can definitely see why people get greedy and eventually get burned. If you've been investing these last 3 years, you are up BIG and likely want to add more than you can afford. 2023 SP 500 returns: 26% 2024 SP 500 returns: 25% 2025 SP 500 returns YTD: 13% Holy cow those are amazing returns. And that's if you just followed the SP": 0.6,
  "Nuclear renaissance has 'more momentum' than ever to power AI": 0.6,
  "Thoughts on $APLD? - I’m up 230% right now bought 6059 shares @$5.58, the stock doesn’t seem to slow down. It looks like a lot of AI datacenter companies are doing very well. Including $WULF $IREN $NBIS and of course $APLD. They seem to keep expanding while the demand is not slowing down at all. Are you guys confident in AI datacenter stocks especially $APLD?": 0.8,
  "The Coca-Cola Company (KO)’s CEO Is Putting “Consistent Numbers,” Says Jim Cramer": 0.5,
  "Conagra Brands, Inc. (CAG)’s Sector Needs A “Great Merger,” Says Jim Cramer": 0.5,
  "The Kraft Heinz Company (KHC) Might Be Better Off With A Big Deal, Says Jim Cramer": 0.5,
  "Jim Cramer Says Maybe A Merger Would Solve PepsiCo, Inc. (PEP)’s Problems": 0.2,
  "Oil Rig Count Rises by 2; Crude Headed for Weekly Gains Amid Growing Geopolitical Risks": 0.5,
  "Opendoor can be the Amazon of housing, investor Eric Jackson says": 0.5,
  "Palo Alto Networks, Inc. (PANW) CEO Is A Great Example Of How To Convince Investors, Says Jim Cramer": 0.8,
  "Should You Buy the Dip in Opendoor Stock Today? Options Data Tells Us OPEN Could Be Trading at These Levels Soon": 0.5,
  "Sector Update: Health Care Stocks Fall Late Afternoon": -0.5,
  "Warner Bros. Jumps As Paramount Skydance Circles Bid": 0.5,
  "Sector Update: Tech Stocks Mixed Late Afternoon": 0.0,
  "US Equity Indexes Mixed, Treasury Yields Rise Ahead of Market Close": 0.1,
  "Top Funds Have This Nvidia Partner Etched In Their Brains": 0.6,
  "I’m 67. My wife, 48, is financially illiterate. How do I teach her to manage our money? After all, I won’t be around forever.": -0.7,
  "Opendoor Is Sliding. Don’t Call It a Meme Stock, Says New Chairman.": 0.1,
  "Why AppLovin Stock Zoomed Almost 19% Higher This Week": 0.8,
  "Corteva, a $50 Billion Seed-and-Pesticide Maker, Is Exploring a Breakup": 0.1,
  "Black Rock Coffee Bar Plots Post-IPO Growth": 0.5,
  "US Equity Markets End Mixed as Investors Weigh Weak Consumer Sentiment, Inflation Outlook": -0.5,
  "S&P 500 Posts Broad Weekly Climb Led by Technology, Rate Cut Hopes": 0.6,
  "These Were the 3 Top-Performing Stocks in the Nasdaq-100 in August 2025": 0.5,
  "Nasdaq Composite Bucks Trend, Rises as Dovish Policy Expectations Lift Consumer Discretionary, Technology": 0.6,
  "AstraZeneca pauses £200m expansion in Cambridge": -0.5,
  "Tech, Media & Telecom Roundup: Market Talk": 0.0,
  "Should You Forget Nvidia and Buy These 2 Artificial Intelligence (AI) Stocks Instead?": 0.2,
  "Nasdaq Extends Record Run as Wall Street Posts Weekly Gains Ahead of Fed Rate Decision": 0.8,
  "Why Micron Stock Was Moving Higher Today": 0.5,
  "These Stocks Moved the Most Today: Warner Bros., Paramount Skydance, Tesla, Moderna, IonQ, Gemini Space, Microsoft, and More": 0.2,
  "Sipping with Style: Capri Sun and Christian Siriano Introduce the Fan-Fueled Pouch Purse": 0.6,
  "ASML Partners With Mistral AI in Strategic €1.3 Billion Deal": 0.8,
  "The Score: Apple, Oracle, Warner Bros. Discovery and More Stocks That Defined the Week": 0.5,
  "AppLovin (APP) Gains As Market Dips: What You Should Know": 0.5,
  "Constellation Energy Corporation (CEG) Gains As Market Dips: What You Should Know": 0.5,
  "Here's Why Datadog (DDOG) Fell More Than Broader Market": -0.5,
  "Why Fortinet (FTNT) Dipped More Than Broader Market Today": -0.5,
  "Here's Why Comcast (CMCSA) Fell More Than Broader Market": -0.5,
  "Pfizer, Moderna shares fall on report that Trump officials will link child deaths to Covid shots - https://www.cnbc.com/2025/09/12/pfizer-moderna-shares-fall-on-trump-child-covid-shot-report.html > Shares of Pfizer and Moderna fell on Friday after a report that Trump administration health officials plan to link Covid vaccines to the deaths of 25 children. The report from the Washington Post said officials plan to include the claim in a presentation next week to a key vaccine panel that advises the Centers for Disease": -0.8,
  "Stocks to Watch Friday: Adobe, Microsoft, Boeing, Warner Bros.": 0.5,
  "Q3 Earnings Season Gets Underway: A Closer Look": 0.0,
  "Finally leaving Robinhood after a decade - I was part of the original batch of users when Robinhood was first teased online. Back then zero commission trading was unheard of. As a 21 year old trying to buy Tesla, logging into Scotttrade and paying commissions every single time felt like a huge barrier. Robinhood completely changed that and honestly changed the whole industry for the better. But the app today feels very different. It has": 0.5,
  "Why Adobe Stock Just Couldn't Light a Fire Under Investors Today": -0.5,
  "Foundations Shored Up Endowments in 2024. Nonprofits Need the Funding.": 0.5,
  "Review & Preview: Waiting for the Rate Cut": 0.0,
  "Why I’m selling $RDDT even though I think it has great growth potential - (Purely on vibes, no fundamental analysis) I bought RDDT at IPO and have been holding, because I believed in the company, and still believe that it’s a well run company with a good strategy for growth/monetization. However, the Trump administration is putting their hands all over corporate America, and almost every large corporation is following the White House’s bidding, because no": -0.5,
  "Larry Ellison Is More Interesting Than Ever at 81": 0.6,
  "Rate Cuts: Priced In? - We know rate cuts will be happening next week. We could either be getting a 25bps or 50bps rate cut. But the main question is, what has the markets priced in already? Do you think we have already priced in a 50 point cut and see a massive sell off happening after rates are cut? Or do you think we will be seeing small profit taking but a continued rally?": 0.2,
  "My thoughts on PAR. - Hey Everyone, So i have been looking for undervalued securities, and often you find investement ideas in niche places, from value line, to barrons, to in my case a interview with a founder of a asset management firm. The founder brought up PAR, and naturally my curiosity spiked, i went to check out the company as of now. This is will be pretty unformal so please bare with. The company": 0.2,
  "Here's How You Can Earn $100 In Passive Income By Investing In Gilead Sciences Stock": 0.5,
  "Warner Bros Hits All-Time High on Paramount Skydance (PSKY) Bid Report": 0.8,
  "1 Cash-Producing Stock with Exciting Potential and 2 We Avoid": 0.5,
  "Salesforce (CRM) Needs to Convince Investors About Its Moat, Says Jim Cramer": 0.1,
  "5 Top Artificial Intelligence Stocks to Buy in September": 0.5,
  "Why Is Everyone Talking About Netflix?": 0.5,
  "2 Elite Growth Stocks to Buy and Hold Forever": 0.5,
  "Bull of the Day: Micron Technology (MU)": 0.5,
  "Oracle Just Delivered Incredible News for Nvidia, AMD, Broadcom, and Micron Investors": 0.8,
  "Deep dive on the hotel opportunity for Airbnb": 0.5,
  "Investing.com’s stocks of the week": 0.0,
  "/r/Stocks Weekend Discussion Saturday - Sep 13, 2025 - This is the weekend edition of our stickied discussion thread. Discuss your trades / moves from last week and what you're planning on doing for the week ahead. Some helpful links: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips *": 0.2,
  "Is AI truly a boon for the entire IT industry, or could it also be a curse?": -0.5,
  "‘Fastest-Growing Market in Software’: Morgan Stanley Suggests 2 Cybersecurity Stocks to Buy": 0.8,
  "Can You Tell the Difference Between a Human Voice and AI? Take Our Quiz": 0.2,
  "Those who invested in Analog Devices (NASDAQ:ADI) five years ago are up 133%": 0.5,
  "Best Stock to Buy Right Now: Costco vs. Amazon": 0.0,
  "3 Monster Stocks That Could Double Your Money by 2030": 0.5,
  "Homeowners insurance costs just hit a new high. It’s scaring off some buyers.": -0.6,
  "Broadcom (AVGO) Is Up 7.5% After Announcing $10 Billion OpenAI Chip Deal and Record AI Revenue": 0.8,
  "How Investors Are Reacting To Liberty Broadband (LBRD.K) Beating Q2 Revenue Forecasts With Tech-Driven Growth": 0.5,
  "3 Red-Hot Growth Stocks to Buy in 2025": 0.8,
  "Assessing Warner Bros. Discovery After 55% Weekly Rally and Rumored Netflix Deal in 2025": 0.5,
  "Micron (MU) Is Up 19.7% After Analyst Upgrades Driven by Strong AI Data Center Memory Demand": 0.8,
  "Could Buying Shopify Stock Today Set You Up for Life?": 0.5,
  "Adobe price target lowered to $450 from $475 at Evercore ISI": 0.1,
  "Does Intel's New Leadership and AI Push Signal a Strategic Shift for INTC?": 0.2,
  "Is There an Opportunity in Adobe After Shares Slide 35%?": 0.2,
  "Does Elliott’s $4B Stake Signal Value in PepsiCo After Double Digit Slide?": 0.5,
  "Is Now the Right Time to Reconsider Lam After the 13% Weekly Price Surge?": 0.2,
  "Prediction: This Stock Could Be a Winner of the AI Networking Boom (Hint: It's Not Nvidia or Broadcom)": 0.5,
  "Jim Cramer on AppLovin: “I Think This is a Mini Google”": 0.6,
  "Jim Cramer on The TJX Companies: “They Have the Best Merchandise”": 0.8,
  "Jim Cramer on Ross Stores: “I’m Happy to Put Ross at Second”": 0.6,
  "HSBC: Wall Street Underestimating Advanced Micro Devices Inc. (AMD)’s AI GPU Business": 0.5,
  "Jim Cramer on Cintas: “This is a Great Long-Term Hold”": 0.8,
  "Datadog Inc. (DDOG)’s AI Initiatives Accelerating Growth": 0.6,
  "Jim Cramer Says “I’m Not Going to Pull the Trigger” on Intuitive Surgical": 0.1,
  "Palo Alto Networks Inc. (PANW) Targets $15B in Recurring Revenue": 0.5,
  "Jim Cramer on Pepsi: “You Let That Dividend Compound Over Time”": 0.5,
  "Needham Affirms Workday Inc. (WDAY) ‘Buy’ Rating on Growth Bounce Back": 0.6,
  "Shopify (SHOP) COO Kasra Nejatian Departs for Opendoor CEO Role": 0.1,
  "Crowdstrike Holdings Inc. (CRWD) Rated as a ‘Buy’ at Truist Securities": 0.8,
  "Truist Securities Buoyed by Zscaler (ZS)’s Emerging Business Growth, Affirms Buy Stance": 0.8,
  "Constellation Energy Corporation's (NASDAQ:CEG) Stock Been Rising: Are Strong Financials Guiding The Market?": 0.5,
  "Paramount-Skydance's reported bid for Warner Bros. Discovery could spark media bidding war": 0.5,
  "This Was the Top-Performing Stock in the Nasdaq-100 in August 2025": 0.5,
  "These Were the 3 Top-Performing Stocks in the S&P 500 in August 2025": 0.5,
  "China Probes U.S. Chip Sector On Eve Of Trade Talks": -0.5,
  "Warner Bros (WBD) Extends Run on 3rd Day Amid Paramount Skydance Acquisition Report": 0.2,
  "r/Stocks Weekly Thread on Meme Stocks Saturday - Sep 13, 2025 - The meme stock scheduled posts will now run weekly and post Saturday afternoon and won't be a sticky; you're probably seeing this because automod sent you here! [Full list of meme stocks here.](https://www.reddit.com/r/stocks/wiki/meme-stocks) This will be updated every once in a while. ------ Welcome traders who just can't help them selves discuss the same exact stock that's been discussed 100s of times a": 0.1,
  "Jim Cramer Shares Important Metric For Salesforce, Inc. (CRM)’s Hypothesis": 0.2,
  "Jim Cramer Shares Key Insights For Adobe Inc. (ADBE)": 0.5,
  "Jim Cramer Shares His Dicussion With Micron Technology, Inc. (MU)’s CEO For The Stock": 0.2,
  "Jim Cramer Says Someone Might Go to Jail For Buying Warner Bros. Discovery, Inc. (WBD) Call Options": -0.5,
  "Arizona Oasis: Purity ReSource Water Tech Is A Game-Changer For The Desert": 0.8,
  "Is O'Reilly Automotive Stock a Buy After Recent Earnings?": 0.2,
  "Electronic Arts (EA) Launches NHL 26 With Innovative Features And Enhanced Gameplay": 0.8,
  "Palantir Technologies (PLTR) Q2 Earnings Propel 24% Price Surge Over Last Quarter": 0.8,
  "Is Microsoft planning a 1GW datacenter in Permian Basin outside Odessa? - Context Labs runs its platforms exclusively on Microsoft Azure, the only hyperscaler in a confirmed partnership for the tech, providing real-time emissions tracking and sustainability tools that support Azure’s hyperscale data center goals. Context labs just got onboard for a 250-1000MW datacenter project in the Permian Basin. Then Globelink NETWORK got 1,600 miles of fiber planned running from Odessa through Microsoft Azure's locations": 0.5,
  "Netflix Is Just Getting Started: Here Are 3 Growth Drivers for the Next Few Years": 0.8,
  "1 Reason Wall Street Is Obsessed With Palantir's Stock": 0.5,
  "Citi Group among US finance firms pledging investment into UK before Trump visit": 0.5,
  "US financial firms pledge $1.7 billion to UK ahead of Trump's visit": 0.8,
  "Dovish fed 2021 around the corner - Bitcoin ripped in Q4 last year after the Fed cut and Trump’s win. Since then, hawkish policy has stalled things out. Now we’re about to get rate cuts next week, and potentially more into next year. This feels like 2021 all over again. The talks of a looming recession? That’s even more of an indicator, big money is sitting on the sidelines ready to chase. Don’t be late.": 0.8,
  "Intel (INTC) Stays at Hold as Analyst Sees Long Road to Recovery": -0.5,
  "HSBC Trims AMD Target Amid Revised Pricing Assumptions": -0.2,
  "How is this possible? - So, draftkings and fanduel have BOTH found a way to not turn a profit on a sports book. I understand it's more complex than that, but cmon. They both are probably unable to offload action, but the players prepay. No risk on collecting either. That leaves 2 companies inept at keeping enough lines right to profit on the spread, and even worse with parlays. Books don't go broke on parlays.": -0.8,
  "I'm losing money... - Because of socio-economic-political uncertainty in the age of Trump. The financial markets have their bear and bull cycles, everybody knows that, but I'm farting onto my fence over here like an asshole, anxious about this overpriced market and afraid to go all in. Meanwhile... I'm missing out on gains trying to stay sane. Is there a tried and true strategy to combat the FUD?": -0.6,
  "The Market’s Riskier Than It Used to Be—and Investors Love It": 0.6,
  "China launches probes targeting US semiconductors ahead of Madrid trade talks": -0.6,
  "Klaviyo Appoints Chano Fernández as Interim Executive Officer to Guide AI, International Growth": 0.5,
  "Netflix Chief Product Officer Eunice Kim to Depart; CTO Elizabeth Stone Appointed as Interim Successor": 0.1,
  "Silvaco Group Appoints Semiconductor Veteran Chris Zegarelli as Chief Financial Officer": 0.5,
  "Mizuho Reiterates Buy Rating on Intuit (INTU) with $875 PT Following Strong FQ4, Full-Year FY2025 Results": 0.8,
  "Evercore ISI Reiterates Buy Rating on Costco (COST) with $1,060 PT Ahead of Q4 Earnings": 0.8,
  "Arete Upgrades ASML to Buy with €879 PT, Cites Strong Bookings, Robust Backlog": 0.8,
  "Where is PDD Holdings (PDD) Headed According to Analyst?": 0.1,
  "BMO Capital Maintains a Buy on Regeneron Pharmaceuticals (REGN), Sets a $640 PT": 0.6,
  "Guggenheim Maintains a Hold on Amgen Inc. (AMGN)": 0.0,
  "Opendoor Technologies Inc. (OPEN) Is A Company That Flips Houses, Says Jim Cramer": 0.2,
  "2 Popular AI Stocks to Sell Before They Fall 46% and 73%, According to Wall Street Analysts": -0.8,
  "3 Tech Stocks You Can Buy and Hold for the Next Decade": 0.5,
  "The Ultimate Growth Stock to Buy With $1,000 Right Now": 0.8,
  "Buying individual company Stocks vs ETFs? - Currently purchased individual stock for companies like apple, Microsoft, google, NVDA, Tesla, and META. Have some left over investing to split into ETFS (s&p 500) and Nasdaq. Should i just transfer the money from individual stocks into ETFS instead of splitting my investing into half for individual companies and then the other half for ETFs? and if so please reccomend me some low cost/passive ETFS. esp for Nasdaq.": 0.2,
  "Digital Asset Treasury Companies Explained: Bitcoin, Ethereum, Solana, and Other Top Crypto Treasury Assets": 0.5,
  "2 Artificial Intelligence (AI) Stocks That Could Become $1 Trillion Giants": 0.8,
  "Africa Crypto News Week in Review:  Altvest Raises $210M To Buy Bitcoin, Luno Tokenized Stocks In Nigeria, Binance Partners With Zapper": 0.5,
  "Broadcom and Oracle's Blowout Earnings Just Proved Why It's Time to Forget the \"Magnificent Seven\"": 0.8,
  "Biotech stocks: Who wins and who loses if RFK, Jr. goes": 0.1,
  "Stock buybacks--Why are they happening and what do they imply for regular investors? - I just saw that companies are buying back their own stock at a record pace, and this activity represented 6 times the volume of households buying in the market in 2024. This is mind-blowing, and I can see a few ways to take it. Also, I might be missing the point or the info might be misleading. For example, how did": 0.2,
  "2 Healthcare Dividend Stocks to Buy and Hold": 0.0,
  "Duolingo valuation. - Seems like great company. Amazing growth. Has pulled back 50 percent and now retracing a bit. I circled back to this. How do you get comfortable with valuation even after the drop ? Analysts have like 8 $ in eps in 29. So 40x pe or 10x projected 2 billion revenue is nearly any upside. Maybe I’m missing something? Unless you think they can crush estimates and become the learning super app.": 0.6,
  "3 Top Cybersecurity Stocks to Buy in September": 0.5,
  "3 Monster Stocks to Hold for the Next 5 Years": 0.5,
  "Why Is Wall Street So Bearish on Palantir Stock? There's 1 Key Reason.": -0.5,
  "Why PepsiCo, Black Hills, And Tyson Foods Are Winners For Passive Income": 0.5,
  "Should You Buy Costco Stock Right Now?": 0.0,
  "The Bull Case For Voya Financial (VOYA) Could Change Following Strategic AI-Powered Partnership With Workday": 0.6,
  "How the Narrative for Lululemon Is Evolving Amid Analyst Downgrades and Execution Risks": 0.1,
  "Does Regeneron Offer Value After Recent Share Price Drop in 2025?": 0.1,
  "Roper Technologies, Inc. (NASDAQ:ROP) Stock's Been Sliding But Fundamentals Look Decent: Will The Market Correct The Share Price In The Future?": 0.5,
  "3 hot takeaways from Goldman Sachs' biggest tech stock conference of 2025": 0.5,
  "Should You Reconsider Costco’s Value After Strong March Sales Update?": 0.5,
  "Can PayPal Holdings' (PYPL) Workforce Strategy Unlock New Operating Leverage in a Shifting Payments Market?": 0.5,
  "Here's Why We Think Exelon (NASDAQ:EXC) Is Well Worth Watching": 0.6,
  "3 Millionaire-Maker Technology Stocks": 0.0,
  "Should You Investigate CoStar Group, Inc. (NASDAQ:CSGP) At US$86.80?": 0.1,
  "Do Fundamentals Have Any Role To Play In Driving Monster Beverage Corporation's (NASDAQ:MNST) Stock Up Recently?": 0.2,
  "Perspectives on OKLO, its potential and realistic expectations - I was wondering if I can hear more about people’s thoughts on OKLO. On paper and on the stock market evaluations and trends, it sounds like it has a lot of potential and also it keeps on rising. But realistically speaking, OKLO currently does not have any ACTUAL product right? And no actual income? I worry that it is more of a theoretical future income and": -0.5,
  "Mag 7: exposure to AI downside - Hi everyone, A quick question: out of the Mag 7, which do you think have the largest and lowest downside potential in case AI does not turn out to be the goldmine many think/thought it could be? There are increasing concerns around the current version of AI (LLMs) being limited and not able to reach AGI (see, for instance, Yann Lecun’s take on it), coupled with concerns around": -0.5,
  "SES S.A. $SESG Stock Thoughts? - Yo so I was digging around random tickers and ended up on SES S.A. (ticker SESG) – barely anyone here ever talks about it 🤷‍♂️. It’s basically a Luxembourg-based satellite outfit running the Astra satellites + O3b stuff. What’s kinda dope is they’re not just GEO like the old guys but also got a MEO constellation, so the latency’s lower and coverage’s wider than some of the newer LEO": 0.6,
  "Corporate Bitcoin Buying Slowed in August as Treasuries Add $5B": 0.1,
  "Hennessy funds recommends these top 3 small caps to become GIANTS - Josh Wein, a VP & key 5 star portfolio manager of Hennessy Funds, who manages 10 of the funds worth collectively 3B in AUM, recently mentioned that these 3 top small caps are his favorite to become giants. **$ROOT insurance:** ROOT insurance is an insurance company with a 1.5B market-cap that underwrites risk utilizing AI targeting safe drivers, which allows them to have": 0.8,
  "Is Opendoor Stock a Buy After Skyrocketing Last Week?": 0.2,
  "3 Top Artificial Intelligence Stocks to Buy in September": 0.5,
  "Billionaire Phillipe Laffont Sold Coatue Management's Stake in Super Micro Computer and Snapped Up This Surgical Robotics Pioneer That's Up 19,390% Since Its IPO": 0.8,
  "O'Reilly Automotive: The '\"Boring\" Retailer Beating Wall Street's Hottest Stocks": 0.5,
  "U.S. Oil Majors Slash Jobs Despite Trump’s Fossil Fuel Push": -0.7,
  "BMNR - 50x? Tom Lee thoughts. - I get Tom Lee is talking his book, but if everything does go on-chain, ETH does appear to be the leading blockchain right now, which would add to the value... Tom said BMNR will focus on having low debt & increasing ETH/per share, which would make it a more leverage ETH play, so thoughts on it being a impactful trade/investment?": 0.5,
  "Klarna seeks growth beyond buy now, pay later as its stock goes public": 0.5,
  "Prediction: This Stock Will Be Worth More Than Palantir 3 Years From Now": 0.6,
  "(Item 8.01) Other Events. ATM Updates On September 15, 2025, Strategy Inc (“Strategy” or the “Company”) announced updates with respect to its at-the-market offering programs: ATM Program Summary During Period September 8, 2025 to September 14, 2025 As of September 14, 2025 Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) STRF ATM 302,503 STRF Shares $30.3 $34.0 $1,749.6 $2.1 billion of 10.00% series A perpetual strife": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Yvonne McGill resigned from the Board of Directors of Applied Materials, Inc. (the “Company”), effective September 12, 2025. Ms. McGill’s resignation is not due to any disagreement with the Company related to the Company’s operations, policies or practices.": 0.5,
  "Agoda Unveils Ranking of Asia's Top Rural Destinations: Highland Tourism on the Rise": 0.6,
  "Dow Jones Futures: Nvidia, Meta, Tesla In Focus; Markets Want This From Fed Meeting": 0.5,
  "Thoughts on $LULU? - Lululemon has been having a rough time this year. Their stock went down more than 40%. Revenue growth has slowed for several quarters in a row, and their latest profit guidance didn’t meet expectations. Even though its forward P/E has dropped to around 13.8, which is way below Nike’s 39, there doesn’t seem to be much buying interest. Now they’ve got another issue. Tariffs are expected to cut around 240 million": -0.8,
  "Q2 Earnings Outperformers: Mondelez (NASDAQ:MDLZ) And The Rest Of The Shelf-Stable Food Stocks": 0.6,
  "IT Services & Other Tech Stocks Q2 Recap: Benchmarking Cisco (NASDAQ:CSCO)": 0.0,
  "3 Reasons MRVL Has Explosive Upside Potential": 1.0,
  "3 Value Stocks We Find Risky": -0.7,
  "2 Unpopular Stocks That Deserve a Second Chance and 1 We Avoid": 0.2,
  "1 Services Stock Worth Your Attention and 2 We Brush Off": 0.0,
  "1 Momentum  Stock to Target This Week and 2 We Ignore": 0.2,
  "3 Large-Cap Stocks to Consider Right Now": 0.0,
  "2 Unpopular Stocks That Deserve a Second Chance and 1 Facing Headwinds": 0.2,
  "2 Profitable Stocks to Target This Week and 1 We Brush Off": 0.2,
  "1 Cash-Producing Stock to Consider Right Now and 2 We Turn Down": 0.2,
  "JDE Peet’s transfers shares to participants under its employee incentive plans": 0.2,
  "Is CDW Stock Underperforming the Nasdaq?": -0.5,
  "Native Markets Wins Race for Hyperliquid Stablecoin USDH, Beating Paxos and Rivals": 0.6,
  "Dexcom Spotlights Upcoming Feature Launches, Improved Health Outcomes and Cost-Effectiveness With Dexcom Glucose Biosensing at EASD 2025": 0.6,
  "Broadcom vs. Oracle: Which AI Stock Is the Better Buy Right Now?": 0.2,
  "would investing in rolls royce @ p1140 be stupid? - i ownded rolls royce stock from around 300 up to 700 and then i took out because i was satisfied with the winnings, hindsight is a wonderful thing lol. I've been looking at more stocks and currently into small modular reactors which rolls royce is very keen on making so i want to buy back into it but is it worth buying now or should": 0.2,
  "AstraZeneca Pauses Plans for $271 Million Expansion of U.K. Site": -0.5,
  "Intuitive da Vinci 5 updates offer feedback during surgery": 0.5,
  "Update: Market Chatter: AstraZeneca Pauses $271 Million Cambridge Project": -0.5,
  "Micron Technology and Wendy's have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Prediction: This \"Ten Titans\" Growth Stock Will Join Nvidia, Microsoft, Apple, Alphabet, Amazon, Broadcom, and Meta Platforms in the $2 Trillion Club by 2030": 0.8,
  "Trending tickers: Nvidia, Adobe, Opendoor, Pop Mart and Sainsbury's": 0.0,
  "Oracle, Adobe and Alphabet are part of Zacks Earnings Preview": 0.0,
  "TV Industry Bets AI Can Peel Ad Dollars Away From Big Tech": 0.5,
  "'Look outside of the Mag 7': Fed rate cut investor playbook": 0.1,
  "Is GE HealthCare Stock Underperforming the Dow?": -0.5,
  "PayPal introduces payment links": 0.5,
  "Stocks Set to Open Higher as Investors Await Fed Meeting and U.S. Economic Data": 0.5,
  "Intel trims full-year expense outlook following Altera stake sale": 0.2,
  "Wipro Partners with CrowdStrike to Deliver AI-Powered Unified Security Services": 0.6,
  "China Ministry to Launch Anti-Dumping Probe of US-Made Microchips": -0.5,
  "Is MercadoLibre Stock a Warren Buffett-Worthy Investment?": 0.5,
  "Adobe: After Boosting Guidance, Is Its Beaten-Down Stock Ready to Break Out?": 0.5,
  "With 82% ownership, Marvell Technology, Inc. (NASDAQ:MRVL) boasts of strong institutional backing": 0.8,
  "Are Strong Financial Prospects The Force That Is Driving The Momentum In Palo Alto Networks, Inc.'s NASDAQ:PANW) Stock?": 0.5,
  "A Closer Look At Honeywell International Inc.'s (NASDAQ:HON) Impressive ROE": 0.8,
  "Is There Now an Opportunity in Baker Hughes After 39.9% Share Price Rise?": 0.5,
  "My 3 Favorite Stocks to Buy Right Now": 0.0,
  "Netflix’s ties to Paramount and Warner Bros.: How much do they matter?": 0.2,
  "A Fresh Look at MicroStrategy (MSTR) Valuation After a Year of Strong Gains and Recent Pullback": 0.5,
  "How Investors May Respond To Take-Two Interactive (TTWO) Analyst Optimism Ahead of GTA VI Release": 0.5,
  "Trade Desk (TTD) Is Down 13.2% After Netflix Opens Ad Inventory to Amazon—Has the Competitive Edge Shifted?": -0.6,
  "OKLO's Tennessee Bet Lifts Hype - But Should Investors Buy?": 0.5,
  "Absci (ABSI) Valuation in Focus Following Partnership With Oracle Cloud and AMD for AI Drug Discovery": 0.5,
  "1 Reason Wall Street Is Obsessed With Vertex Pharmaceuticals": 0.5,
  "Intel trims 2025 operating expenses outlook after Altera deconsolidation": -0.5,
  "Latest News In AI Chips - Alpha Modus Sues MNTN Over AI Patent Infringement": -0.5,
  "Exploring High Growth Tech Stocks in the US Market September 2025": 0.5,
  "Versa Announces New Integrations with CrowdStrike Falcon Platform": 0.5,
  "Side Income From Airbnb, Turo, and Gig Platforms Could Spark IRS Action - Clear Start Tax Warns Short-Term Renters and Car Hosts": -0.5,
  "Sercomm Showcases Next-Gen RDK Video Accelerator STB Based on Broadcom BCM74116 at the RDK Global Summit 2025": 0.5,
  "Chase Freedom® Closes 2025 with Latest Cash Back Categories: Chase Travel, Department Stores, Old Navy & PayPal": 0.5,
  "Cognizant and the North Carolina Turnpike Authority Collaborate to Modernize Toll Operations": 0.5,
  "Longroad Energy Achieves Financial Close of 1000 Mile Solar, a 400 MWdc Project": 0.5,
  "Is Keurig Dr Pepper Inc.'s (NASDAQ:KDP) Recent Performance Underpinned By Weak Financials?": -0.5,
  "Analysts Predict 4 S&P 500 Stocks Will Outgrow Nvidia And Palantir": 0.5,
  "Zscaler CEO warns that AI could spark new cyberattacks": -0.5,
  "Cadence Design Systems (NASDAQ:CDNS) Has A Rock Solid Balance Sheet": 0.8,
  "AstraZeneca halts £200m research investment in Cambridge": -0.8,
  "Strategy Adds 525 Bitcoin in Latest Purchase": 0.5,
  "Canalys Study Finds Every $1 of Falcon Platform Sales Leads Up to $7 in Partner Services Revenue": 0.8,
  "CrowdStrike and Meta Deliver New Benchmarks for the Evaluation of AI Performance in Cybersecurity": 0.5,
  "Samsung Biologics, Amgen and Biocon invest in US pharma sites": 0.5,
  "BMO Capital Maintains a Buy on Regeneron Pharmaceuticals (REGN)": 0.5,
  "Deep Blue to Acquire Environmental Disposal Systems from Diamondback Energy (FANG)": 0.1,
  "Investors in Cognizant Technology Solutions (NASDAQ:CTSH) have unfortunately lost 9.8% over the last year": -0.7,
  "Dear Costco Stock Fans, Mark Your Calendars for September 25": 0.5,
  "Wipro Targets Rising Cyber Threats With New CrowdStrike Backed Service": 0.6,
  "Texas Instruments, Analog Devices Stocks Fall. China Inquiry Targets U.S. Chip Makers.": -0.7,
  "Intuit and Clair Partner to Deliver On-Demand Pay, Helping Companies Attract and Retain Employees While Giving Employees Financial Peace of Mind": 0.8,
  "Palantir Stock Jumps 10% Over the Week -- What's Driving The Rally?": 0.6,
  "Eaton Accelerates Transformation of Building and Data Center Infrastructure With Autodesk to Deliver AI-Powered Digital Energy Twin and Software Tools": 0.5,
  "FORMER META PAYMENTS LEADER AND GRUBHUB EXEC AKSHAT THANAWALA JOINS CARIBOU AS CHIEF PRODUCT OFFICER": 0.5,
  "Autodesk Will Partner With the Kraft Group as the Official Design and Make Platform for the New England Patriots": 0.5,
  "China Targets Nvidia in Surprise Antitrust Move Amid High-Stakes US Trade Talks": -0.5,
  "Latest News In Digital Payment - Asia-Pacific E-Commerce Boom Drives Digital Transformation": 0.5,
  "PNK Group Acquires 37 Acres of Land in Connecticut": 0.5,
  "Will New Big Technology Engagements Reshape Innodata's Growth Path?": 0.5,
  "Lululemon Stock May Be Down 57% This Year, But Is It Out?": 0.1,
  "September Calls: Oil and Platinum Outlook": 0.0,
  "WorkBoard Posts Record 1H Growth Accelerated by AI Agents": 0.6,
  "NIQ Continues Investment in Retail Media Sector with New Leadership Appointment in North America": 0.5,
  "PayPal Ushers in a New Era of Peer-to-Peer Payments, Reimagining How Money Moves to Anyone, Anywhere": 0.8,
  "Remedio Raises $65 Million in Its First-Ever Funding Round to Set a New Standard in Device Posture Management": 0.8,
  "Chatmeter Integrates With Uber Eats, DoorDash and GrubHub to Enhance Multi-Location Restaurant Customer Intelligence": 0.6,
  "NinjaOne Now Available for Purchase on the CrowdStrike Marketplace": 0.5,
  "Investors Heavily Search Palo Alto Networks, Inc. (PANW): Here is What You Need to Know": 0.5,
  "Amgen Inc. (AMGN) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Palantir Technologies Inc. (PLTR) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Here is What to Know Beyond Why Advanced Micro Devices, Inc. (AMD) is a Trending Stock": 0.2,
  "Cintas Insiders Sold US$4.0m Of Shares Suggesting Hesitancy": -0.5,
  "Is Now An Opportune Moment To Examine Ross Stores, Inc. (NASDAQ:ROST)?": 0.2,
  "ISRG Stock Down More than 13% in 3 Months: How to Play the Stock?": -0.5,
  "Trump announces TikTok deal, impacting U.S. social media stocks": 0.5,
  "Beat the Market the Zacks Way: CommScope, Micron, Oracle in Focus": 0.5,
  "CEG Rises 62.3% in a Year: Should You Buy, Sell, or Hold the Stock?": 0.2,
  "H.C. Wainwright Affirms Biogen Inc. (BIIB) Buy Rating on Lupus Franchise Prospects": 0.6,
  "AstraZeneca PLC (AZN) Receives Tagrisso Boost in Lung Cancer Trials": 0.8,
  "Keurig Dr Pepper Inc. (KDP) Strengthens Coffee Business with JDE Peet’s Acquisition": 0.8,
  "Traders Cautious Ahead of Fed Meeting, Driving Muted Premarket Action for US Equity Futures": 0.1,
  "Fed meeting, Tesla stock, US-China trade talks: 3 Things": 0.2,
  "Intel Wraps Up Altera Stake Sale In Bid To Streamline Business": 0.5,
  "3 Top Buffett Stocks to Buy and Hold for the Long Haul": 0.5,
  "Oracle's AI Gains 'Are Clear.' Here's How Its Cloud Stacks Up Against Amazon, Microsoft, Google.": 0.5,
  "Do You Believe in Datadog’s (DDOG) Growth Potential?": 0.5,
  "Zscaler CEO says companies need AI to fight AI threats": 0.5,
  "Use ATR to Spot Breakouts & Volatility Shifts: Level Up Your Trading With This Chart Indicator": 0.5,
  "Earnings Growth & Price Strength Make Walmart (WMT) a Stock to Watch": 0.8,
  "Strategy pauses MSTR ATM for the first time since revising guidance": 0.1,
  "Why Labubu maker Pop Mart may see its stock bubble burst": -0.7,
  "Is Fortinet Stock Underperforming the Nasdaq?": -0.5,
  "Musk buys Tesla, China vs. US chips, Hims: Trending Tickers": 0.0,
  "Stocks are going up today because world's richest person bought his own stock! - It is becoming a self full-filling setup. Mr. Musk buys $1B worth of TSLA stock, which he is employed with, earned that $1B from TSLA, and will get $1B performance pay from TSLA. So, the same money is circulated. Earlier ORCL and top few companies teamed up to buy/sell among each other to boost their own stock evaluations. It is circular": 0.2,
  "How Is Xcel Energy's Stock Performance Compared to Other Utilities Stocks?": 0.0,
  "Broadcom initiated, Beyond Meat downgraded: Wall Street's top analyst calls": 0.1,
  "These 2 AI Cloud Stocks Have Outperformed Nvidia and Palantir This Year, and Microsoft Is Throwing Billions at Them. Are They Buys?": 0.5,
  "Why Adobe Systems (ADBE) is a Top Growth Stock for the Long-Term": 0.6,
  "Why Booking Holdings (BKNG) is a Top Growth Stock for the Long-Term": 0.6,
  "Why Meta Platforms (META) is a Top Growth Stock for the Long-Term": 0.8,
  "Warner Bros (WBD) Climbs 55.8% on Paramount Skydance (PSKY) Bid Report": 0.8,
  "Opendoor (OPEN) Grows 36% on Turnaround, Revival Optimism": 0.8,
  "Bitmine (BMNR) Surges 31% as Firm Raises ETH Treasury to $9 Billion": 0.8,
  "r/Stocks Daily Discussion Monday - Sep 15, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.0,
  "Japan Building Automation System Forecast and Company Analysis Report 2025-2033 Featuring Cisco, Hitachi, Mitsubishi, Honeywell, Emerson Electric, United Technologies, Trane, Huawei, Hubbell": 0.5,
  "REGN Loses 21.1% Year to Date: Buy, Sell or Hold the Sock?": -0.5,
  "Company News for Sep 15, 2025": 0.0,
  "Forward Industries Buys $1.58 Billion In SOL, As Michael Saylor's Strategy Continues BTC Accumulation": 0.5,
  "BigBear.ai Stock Trades at a Discount: Is This a Hidden Opportunity?": 0.5,
  "EA SPORTS FC™ Reveals Star-Studded FC 26 Soundtrack, Featuring First-Ever Professional Footballer on an FC Soundtrack": 0.8,
  "What Is Automatic Data Processing, Inc.'s (NASDAQ:ADP) Share Price Doing?": 0.0,
  "BitMine's Ether Treasury Crosses 2.15M, Stake in Worldcoin Vehicle Rises 10-Fold": 0.6,
  "Stocks to Watch Monday: Nvidia, Tesla, Corteva, Onsemi": 0.5,
  "Nvidia Falls Amid China Probe; Is Nvidia A Buy Or Sell Now?": 0.1,
  "Is Costco's 5.7% Q4 Comparable Sales Growth a Bullish Signal?": 0.6,
  "ASYS vs. AMAT: Which Semiconductor Equipment Stock is the Better Buy?": 0.5,
  "Intel Stock Rises After Chipmaker Cuts Forecast for Expenses": 0.6,
  "The 2026 Investor’s Dilemma: Play It Safe or Chase the AI Boom?": 0.2,
  "Alphabet becomes fourth company to reach $3 trillion market cap - Alphabet has joined the $3 trillion club. Shares of the search giant jumped more than 4% on Monday, pushing the company into territory occupied only by Nvidia, Microsoft and Apple. The stock got a big lift in early September from an antitrust ruling by a judge, whose penalties came in lighter than shareholders feared. The U.S. Department of Justice wanted Google to be forced": 0.6,
  "1 Growth Stock to Buy Before the End of 2025": 0.5,
  "Target (TGT) advice - I have owned Target stock for 4 years. Cost averaged lower as the stock has plummeted but now sitting on 24k in long term losses. Starting to lose hope for a turnaround especially with the internal promotion for CEO- kind of feels like nothing is going to change. Walmart has dominated the space and even my wife says she doesn’t shop at target any more because it’s boring and she never": -0.6,
  "Form 8.3 - Aqua Acquisition Sub LLC (an indirect wholly-owned subsidiary of Qualcomm Incorporated)": 0.0,
  "Canadian AI firm Cohere targets growth in Europe with Paris office": 0.5,
  "Trump advocates end to quarterly earnings reports - President Donald Trump floated the idea Monday of companies no longer providing earnings report on a quarterly basis and switching to semiannual instead. In a Truth Social post, Trump said the idea is “subject to SEC approval” and would “save money, and allow managers to focus on properly running their companies.” “Did you ever hear the statement that, ‘China has a 50 to 100 year view on": 0.2,
  "Micron, The RealReal, Beyond Meat: Top Analyst Calls": 0.2,
  "Google's market cap tops $3 trillion for the first time": 0.8,
  "Workday Teams Up With Kinaxis to Streamline Operational Silos": 0.5,
  "CoreWeave-Nvidia deal, Oracle & TikTok, Corteva explores breakup": 0.2,
  "How Much Growth is Too Much? - I'm invested mostly in tech stocks like Google, Nvidia and AMD, but also some banks. As of the last year I've been seeing an average rate of growth of 2.6%. That seems pretty unsustainable. Historically, my portfolio was only doing an average of 1.4% over 9 years. Is this a warning sign of a big correction?": -0.6,
  "Want To Earn What Your CEO Makes? 5 Shocking Truths About Your Paycheck Differences": -0.7,
  "Jim Cramer Says Amazon.com, Inc. (AMZN) Was Added To Morgan Stanley’s Vintage List": 0.5,
  "Jim Cramer Says Taiwan Semiconductor Manufacturing Company (TSM) Is A “National Treasure”": 0.8,
  "Jim Cramer Thought Broadcom Inc. (AVGO) “Would Be Up More” After Oracle’s Conference Call": 0.2,
  "PayPal Adding Crypto to Peer-to-Peer Payments, Allowing Direct Transfer of BTC, ETH, Others": 0.5,
  "Palantir’s Execution Has Been ‘Stunning.’ Why It Isn’t Time to Buy the Stock.": 0.2,
  "Palantir's Commercial Boom: The AI Growth Engine Driving Its Future": 0.6,
  "Micron Hits New 52-Week High: Is the Stock Still Worth Buying?": 0.5,
  "Micron Technology 'Well Positioned' to Maintain HBM Market Share, Deutsche Bank Says": 0.6,
  "Honeywell And Redwire Join Forces To Build Quantum Secure Satellite For Europe": 0.6,
  "LENZ Therapeutics - A high risk, high reward biotech stock - Hello r/stocks I have a small cap company I want to share. Firstly I want you all to be aware of the risks associated with small caps. Mainly low volume and low liquidity leading to larger spreads on the bid/ask. Along with if the float is small then it is possibly easier for bigger players to manipulate price action. Okay great now that we": 0.2,
  "Google hits $3 trillion after antitrust ruling and cloud boom": 0.8,
  "Robotaxi Showdown: GOOGL, TSLA and AMZN Accelerate Driverless Race": 0.5,
  "Will Mag 7 Stocks Rally Post Fed? What the Charts of Microsoft, Tesla, Meta Say.": 0.2,
  "How might lower interest rates affect gold prices? - I bought a bunch of gold several months ago and want to better understand the economics behind how the interest rate changes will affect gold prices. I’m thinking of it in an opportunity cost scenario where lower interest rates will cause people to sell gold because they want to use that money to buy other things, but am I mistaken? What are the other possibilities?": 0.2,
  "Google Parent Alphabet's Market Cap Hits $3 Trillion for First Time": 0.8,
  "BitMine Reports $10.8 Billion Ethereum, Bitcoin, 'Moonshot' Crypto Holdings": 0.8,
  "How do I (27M) convince my dad (68M) to stop gambling on individual stocks? - My dad comfortably retired around 13 years ago from a good business he owned. He was able to build a strong nest egg to coast through retirement easily, even if he just kept it in lower-interest assets yielding 3-4% per annum. As for me, I've began my investing journey around 3 years ago and adopted a relatively conservative approach. By": -0.5,
  "Union Pacific, Norfolk Southern roll out new domestic intermodal": 0.2,
  "Top Stock Movers Now: Tesla, Intel, Nvidia, and More": 0.5,
  "ReBound Returns Announces Premier Partnership With Shopify to Deliver Seamless Omnichannel Returns Solution": 0.8,
  "Palo Alto Networks added to Wedbush Best Idea List, sees golden buying opportunity": 0.8,
  "This Tech Stock Has Delivered Palantir-Like Gains. Should You Buy It Now?": 0.5,
  "Baidu's Rising Costs Erode Profits: Can Future AI Gains Offset Strain?": -0.5,
  "Strategy Adds $60 Million to Bitcoin Treasury in Smallest Buy in a Month": 0.5,
  "Is DoorDash Stock Outperforming the Nasdaq?": 0.2,
  "DexCom (DXCM) Stock Is Up, What You Need To Know": 0.5,
  "Opendoor (OPEN) Stock Trades Up, Here Is Why": 0.5,
  "Why Intel (INTC) Stock Is Up Today": 0.5,
  "Why Texas Instruments (TXN) Stock Is Down Today": -0.5,
  "Rumble (RUM) Stock Trades Up, Here Is Why": 0.5,
  "ProsperOps Announces General Availability of Autonomous Discount Management for Microsoft Azure": 0.5,
  "A TikTok Deal Near? Meta, Oracle, Snap Among Stocks To Watch.": 0.5,
  "Intel Cuts 2025 Spending Target After Altera Sale to Silver Lake": 0.1,
  "lululemon's Fresh Styles, Soft Sales: Is Innovation Falling Short?": -0.5,
  "Mexican Watchdog: Amazon, Mercado Libre Limit Competition Among Sellers": -0.6,
  "T vs TMUS: Which Telecom Stock is a Smart Investment Right Now?": 0.5,
  "Why California’s biopharma boom is critical for logistics": 0.5,
  "Alphabet hits $3T, Robinhood's new fund, Broadcom bulls": 0.5,
  "Does Crypto-Offering Hold the Key to PayPal Stock's Future?": 0.2,
  "Oracle stock jumps as US and China agree to preliminary TikTok deal": 0.8,
  "PayPal adds new one-to-one payment links that will soon support crypto": 0.5,
  "MEDIA ALERT: Cisco's WebexOne Event Spotlights Global AI Brands and Ryan Reynolds, Acclaimed Actor, Film Producer, and Entrepreneur": 0.5,
  "Netflix to Announce Third Quarter 2025 Financial Results": 0.0,
  "Baker Hughes Secures Subsea Contract for Sakarya Gas Field": 0.5,
  "Strive Taps Crypto Veterans To Guide $1.5 Billion Bitcoin Treasury Expansion": 0.5,
  "Corteva shares fall as potential split report stirs worries over operational disruptions": -0.6,
  "Alphabet hits $3T market cap, Figure gains, meme stock rally": 0.5,
  "Trillion-dollar companies: 10 most valuable mega-cap stocks": 0.5,
  "ADBE's AI Push Gains Traction: Buy or Hold the Stock Post Q3 Earnings?": 0.5,
  "Alphabet reaches $3 trillion market capitalisation, after shares rally in September": 0.8,
  "Billionaire Michael Saylor Purchases 525 BTC for $60.2M, Lifting Holdings to 638,985 BTC": 0.8,
  "PayPal Is Making It Much Easier to Send Bitcoin, Ethereum and Other Crypto Tokens": 0.8,
  "PayPal to integrate Bitcoin into latest P2P payments": 0.8,
  "Apple Stock Gains. What Preorders Say About iPhone 17 Demand.": 0.5,
  "iOS 26: 26 Tips and Tricks for Apple’s New iPhone Software": 0.5,
  "Apple's TV+ Business Gets a Boost With 22 Emmy Wins: What's Ahead?": 0.6,
  "Google Parent Alphabet Just Hit $3 Trillion — Here's What Drove It Higher": 0.8,
  "US, China have framework for TikTok deal": 0.5,
  "Meta Expands WhatsApp Status Ad Options": 0.5,
  "Can PepsiCo's Diverse Portfolio Outperform in a Soft Market?": 0.2,
  "U.S., China Close In On TikTok Deal But Punt on Tariffs, Export Controls, and Other Frictions": 0.2,
  "Will Weak Market Conditions Keep MercadoLibre's Costs Elevated?": -0.5,
  "AppLovin Sees Stronger Non-Gaming Momentum As Expansion Accelerates": 0.8,
  "iOS 26: Liquid Glass Is Here and Your iPhone Will Never Be the Same": 0.8,
  "Elon Musk boosts Tesla stake by $1B, Oracle gains on TikTok deal": 0.5,
  "Uber, Shopify, and 11 Other Stocks Growing Free Cash Flow Margins": 0.5,
  "Intuit (INTU) Unveils Clair On-Demand Pay To Empower QuickBooks Payroll Users": 0.5,
  "China Targets Nvidia Over 2020 Deal, Straining Trade Talks": -0.6,
  "Adobe Produces Strong FCF - ADBE Stock Could Be Over 20% Too Cheap": 0.8,
  "Are tech stocks the new consumer staples? - During the last few recessions, investors were always running to consumer staples like WMT, PG, MCD, KO, PEP, because tech stocks were too risky to hold and they always crashed hard. This is the first time tech stocks are actually going up during a recession while consumer staples are going down. People are addicted to technology and they would rather go to a food bank than cancel": 0.2,
  "Meta Platforms (META) Partners With CrowdStrike For AI-Powered Cybersecurity Benchmark Initiative": 0.8,
  "Sector Update: Tech Stocks Rise in Afternoon Trading": 0.6,
  "Why Intel Rallied Today": 0.5,
  "Communication Services, Consumer Discretionary Help Push US Equity Indexes Higher": 0.5,
  "China’s tariff investigation could shift analog chip market dynamics: Bernstein": 0.1,
  "McDonald's plans $200 million investment to promote regenerative practices on US cattle ranches": 0.8,
  "Gold hits record high, bitcoin slips, new call on Broadcom": 0.5,
  "Nosebleed Valuation: Why Nebius's Microsoft Deal Changes Everything": 0.6,
  "The Case for Buying Broadcom Stock Now, According to an Analyst": 0.5,
  "As Digital Asset Treasury Companies Reach Fever Pitch, Strategy Stock Is Down 11%. Should You Buy the Dip?": -0.5,
  "Shopify (SHOP) Stock Is Up, What You Need To Know": 0.5,
  "Utilities, nuclear stocks to benefit from lower rates. Here's how.": 0.5,
  "PayPal Launches Shareable ‘PayPal links’ P2P Payment Service With Upcoming Crypto Support": 0.8,
  "Strategy Stock Has Underperformed Bitcoin. How To Profit From Potentially Further Weakness.": 0.2,
  "CrowdStrike Secures the Future of AI Across the Enterprise Ecosystem": 0.5,
  "Neoclouds see strong demand but heavy costs": -0.5,
  "Sector Update: Tech Stocks Higher Late Afternoon": 0.5,
  "China probes Texas Instruments, CoreWeave & Nvidia, Union Pacific": 0.0,
  "As Netflix Stock Falls Below $1,250, Should You Binge Watch Or Keep Chilling?": 0.2,
  "Mercado Libre's Incoming CEO Lays Out Vision": 0.5,
  "Netflix Joins Google On Two Elite Lists. Now The Trial Begins.": 0.2,
  "Wedbush Just Added These Two Tech Stocks to Its 'Best Ideas' List": 0.5,
  "Why Intel (INTC) Stock Is Climbing Today": 0.5,
  "Jamf announces same day support for macOS Tahoe 26, iOS 26, and other OS 26 releases": 0.5,
  "These Stocks Moved the Most Today: Nvidia, Tesla, Texas Instruments, Oracle, CoreWeave, Gemini Space Station, and More": 0.5,
  "Tesla Stock Surge Leads to Downgrade. Why Elon Musk Is a ‘Wartime’ CEO.": -0.5,
  "Stock Market Today: Dow Up As Buffett Stock Tests Entry; Tesla Jumps On Musk Move (Live Coverage)": 0.5,
  "Nvidia Stock Falls As China Pressures U.S. Chipmakers": -0.6,
  "Alger Russell Innovation Index Updates for Third Quarter 2025": 0.0,
  "This Railroad Stock Is On Track for Gains After Merger Mania. The Case to Buy.": 0.8,
  "Apple Stock Rises Amid Strong iPhone 17 Preorders": 0.8,
  "StubHub IPO Puts Direct Ticket Sales Plan in the Spotlight": 0.5,
  "Micron Stock Notches Record High Ahead Of Earnings Report": 0.8,
  "Broadcom Just Hit New All-Time Highs Again. Where Will AVGO Stock Go Next?": 0.5,
  "CoreWeave Shares Jump on Cloud Computing Capacity Order From Nvidia": 0.8,
  "Google Tops $3 Trillion Market Cap As Gemini Takes Top Spot In Apple Store": 0.5,
  "Why ASML Rallied on Monday": 0.5,
  "EchoStar (SATS) seems massively undervalued after the $17B SpaceX deal - I look at EchoStar (SATS), and I see something very interesting. A big thing happened and I think many people do not see the real story. I think maybe the price is too low now. So, this company had a very big problem. It had too much debt. Like a huge credit card bill that is hard to pay. But then, they sell something": 0.8,
  "Alphabet Hits $3 Trillion Valuation. What to Do With the Stock Now.": 0.5,
  "Stocks Rally as Bond Yields Fall Before FOMC Meeting": 0.8,
  "Tech Buying Pushes S&P 500, Nasdaq to Fresh Records": 0.8,
  "Tesla erases 2025 losses: What technicals signal about the stock": 0.5,
  "U.S. Stocks Edge Higher on Tesla Surge, Fed Decision in Focus": 0.5,
  "US Equity Indexes Rise, Paced by Gains in Communication Services, Consumer Discretionary": 0.6,
  "Heard on the Street Recap: Google’s Finally Clicking": 0.6,
  "Tesla Surge, Alphabet's $3T Milestone Push Nasdaq to Record Highs Ahead of Fed": 0.8,
  "Auto & Transport Roundup: Market Talk": 0.0,
  "Nasdaq, S&P 500 Hit New Highs Amid Optimism Around China Trade Talks": 0.8,
  "CRWV: Nvidia $6.3 Billion AI Cloud Deal Sends Coreweave Stock Soaring": 0.8,
  "Alphabet Became the Fourth Company to Hit $3 Trillion Joining Nvidia, Microsoft, Apple": 0.5,
  "Alphabet Stock Rallies to a $3 Trillion Market Cap": 0.8,
  "Alphabet's Market Cap Tops $3 Trillion": 0.8,
  "iPhone 17 Pre-Orders Run Hot Despite Air Delay": 0.6,
  "China Says Nvidia Broke Rules In $7 Billion Mellanox Deal": -0.5,
  "OpenAI Chair Calls AI A Bubble With Real Staying Power": 0.5,
  "Podcast: U.S. Stocks Close Higher Following TikTok Deal": 0.6,
  "With no DOJ breakup, Alphabet becomes a $3 trillion company": 0.8,
  "Tesla shares rally after Elon Musk buys about $1bn of stock": 0.8,
  "CSC Digital Brand Services Announces Integration into CrowdStrike Falcon Adversary Intelligence’s Recon to Accelerate Detection and Enforcement Against Malicious Domains": 0.2,
  "Here’s how investors can play latest wave of corporate breakups": 0.5,
  "Anthony Scaramucci Says A Tesla–xAI Merger 'Feels Inevitable' As Shareholders Push For Investment In Grok Parent": 0.5,
  "Review & Preview: Stocks Jump Again. Will the Rally End With a Rate Cut?": 0.5,
  "Amazon Expects Kuiper to Serve Five Countries by Early 2026": 0.5,
  "Meta Platforms (META) Outperforms Broader Market: What You Need to Know": 0.6,
  "Netflix (NFLX) Rises Higher Than Market: Key Facts": 0.5,
  "Amazon (AMZN) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Airbnb, Inc. (ABNB) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.2,
  "Cadence Design Systems (CDNS) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Strategy (MSTR) Stock Declines While Market Improves: Some Information for Investors": -0.5,
  "Texas Instruments (TXN) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "Why Booking Holdings (BKNG) Outpaced the Stock Market Today": 0.2,
  "Kraft Heinz (KHC) Stock Falls Amid Market Uptick: What Investors Need to Know": 0.1,
  "New Record Highs on S&P, Nasdaq: Tech Stocks Still Lead": 0.8,
  "Microsoft announces quarterly dividend increase": 0.5,
  "Google tops $3 trillion for the first time, joining select market-cap club with only 3 other members": 0.8,
  "Trump Advisers Prepare to Target Left-Leaning Groups After Kirk Shooting": -0.8,
  "Wall Street indexes end higher ahead of Fed meeting; Tesla rallies": 0.7,
  "Berkshire Could See $3 Billion Hit to Interest Income If Fed Slashes Rates in Next Year": -0.6,
  "Is Nvidia Stock Still a Buy Amid Increased Competition & China Headwinds": -0.5,
  "94-year-old legacy fund turns $6.2B from $500M with popular crypto stock": 0.8,
  "Fmr. Tesla President: Musk, Board Betting on AI": 0.5,
  "Nano Banana Saves Google: Gemini Dethrones ChatGPT as GOOG Hits $3 Trillion": 0.6,
  "Microsoft Raises Quarterly Dividend by 9.6%": 0.8,
  "Seeking Outsized Gains? 3 Traits Outperfoming Stocks Possess": 0.5,
  "Lam Research and JSR Corporation/Inpria Corporation Enter Cross-Licensing, Collaboration Agreement to Advance Semiconductor Manufacturing": 0.5,
  "Bright Green Corporation Merges with PharmAGRI Capital Partners; Lynn Stockwell Appointed CEO and Chairwoman": 0.5,
  "Appeals court declines to let Trump remove Fed Governor Cook - https://www.reuters.com/legal/government/appeals-court-declines-let-trump-remove-fed-governor-cook-2025-09-16/ > Sept 15 (Reuters) - A U.S. appeals court declined on Monday to allow Donald Trump to fire Federal Reserve Governor Lisa Cook - the first time a president has pursued such action since the central bank's founding in 1913 - in the latest step in a legal battle that threatens the Fed's longstanding independence. > > The decision by the U.S. Court": 0.1,
  "Market Wrap today: Alphabet and Tesla gain while Texas Instruments slips": 0.5,
  "Dow Jones Futures: Nvidia, Shopify, Uber In Buy Zones; Fed Meeting Next": 0.5,
  "Q2 Earnings Highs And Lows: AMD (NASDAQ:AMD) Vs The Rest Of The Processors and Graphics Chips Stocks": 0.5,
  "If there really is a rate cut this time, just as Trump wants, I’ll continue betting on gold. - Someone who supports tariff policies can actually join the Fed how incompetent must this person really be? If the other Fed members are willing to cave to a rate cut, risking being seen as Trump’s puppets and not defending their independence, then the Fed’s credibility is finished everyone might as well just follow Trump’s orders from": -0.8,
  "The Japanese Business Philosophy Fueling Microsoft’s AI Transformation": 0.5,
  "Google Opens Waltham Cross Data Centre as Part of Two-year £5 Billion Investment in the UK to Help Power its AI Economy": 0.8,
  "Google to invest £5bn in UK over next two years": 0.8,
  "Google sets out $6.8 billion UK investment ahead of Trump's state visit": 0.8,
  "3 Reasons GILD is Risky and 1 Stock to Buy Instead": -0.5,
  "Nvidia suffers a major blow from China": -0.8,
  "2 Reasons to Watch DDOG and 1 to Stay Cautious": 0.5,
  "Google Pledges Nearly $7 Billion in U.K. Investments": 0.8,
  "Smartphone maker Nothing raises $200 million at $1.3 billion valuation": 0.8,
  "1 High-Flying Stock to Own for Decades and 2 We Turn Down": 0.2,
  "1 Nasdaq 100 Stock for Long-Term Investors and 2 We Turn Down": 0.0,
  "1 Consumer Stock with Promising Prospects and 2 We Find Risky": 0.5,
  "2 Nasdaq 100 Stocks with Impressive Fundamentals and 1 Facing Headwinds": 0.5,
  "3 Unprofitable Stocks That Fall Short": -0.8,
  "3 Internet Stocks to Target This Week": 0.0,
  "3 Market-Beating Stocks to Consider Right Now": 0.5,
  "OpenAI hires former xAI CFO Mike Liberatore as business finance officer": 0.5,
  "Prime Big Deal Days Returns October 7-8, To Kick Off the Holiday Shopping Season Delivering Millions of Early Deals Exclusively for Prime Members": 0.8,
  "Why lifelong housing costs are derailing retirement planning for older people": -0.6,
  "Senate confirms Trump Adviser Miran as Fed Governor right before this week's Fed Meeting. - Stephen Miran is the new nominee to the Federal Reserve Board in an incredibly tight 48-47 vote on Monday evening. He'll be just in time to cast a crucial vote in this week's central bank policy meeting. The Fed is widely expected to lower its benchmark interest rate for the first time this year. \"Miran's confirmation is part of a": 0.6,
  "Semarchy Announces Microsoft Fabric Integration to Power Trusted Data Insights in Microsoft Power BI and GitHub Copilot": 0.5,
  "Nedap enables mobile credentials in Google Wallet": 0.5,
  "Nvidia violated antitrust laws, China says, amid trade talks with the US": -0.5,
  "UK pay growth slows as jobs market continues to cool": -0.5,
  "Nazhar Adnan, Former CBO at Sonocharge and Director at Temasek, Joins TeraWatt Technology as Chief Commercial Officer": 0.5
}