{
  "Zacks Investment Ideas feature highlights: AppLovin, Meta Platforms and Alphabet": 0.5,
  "History Says the Nasdaq Will Soar: 2 Artificial Intelligence (AI) Stocks to Buy Now, According to Wall Street": 0.8,
  "Zacks.com featured highlights include AppLovin, Build-A-Bear Workshop and Tenet Healthcare": 0.2,
  "8x8 Appoints Mary Murray as Country Lead for Ireland, Strengthening Local Commitment and Growth": 0.6,
  "Venbrook and Cognizant collaborate to improve insurance claims processing": 0.5,
  "Deliveroo CEO Will Shu to step down after DoorDash takeover": -0.5,
  "Wedbush Bullish on Palo Alto Networks (PANW), Calls CyberArk Acquisition a “Game Changer”": 0.8,
  "Deliveroo founder Will Shu to step down as boss amid DoorDash takeover": -0.5,
  "CSX, CN agree to develop intermodal service into Tennessee": 0.5,
  "Quantinuum Trims the Timeline for Quantum Computing": 0.5,
  "Families Sue Boeing And Honeywell Over Catastrophic Air India Crash": -0.8,
  "Deliveroo CEO to step down following DoorDash takeover": -0.5,
  "Marengo Therapeutics Advances STARt-002 Clinical Trial into Phase 2 Cohort Expansion Evaluating Invikafusp Alfa with TROP2-directed ADC TRODELVY® in Metastatic Breast Cancer": 0.5,
  "Biogen to buy startup Alcyone, eyeing easier delivery of RNA drugs": 0.5,
  "Biogen’s Zurzuvae approved as first postpartum depression drug in Europe": 0.8,
  "Is Axon Enterprise Stock Outperforming the Dow?": 0.2,
  "September 2025's Top Insider-Owned Growth Companies": 0.0,
  "How Honeywell’s Three-Way Split Could Impact Its 2025 Share Price Outlook": 0.5,
  "This Week In Energy Transition - Elcogen's New Factory Powers Europe's Clean Energy Future": 0.8,
  "Biogen to Acquire Alcyone Therapeutics, Expanding Drug Delivery Solution Portfolio for Key Product and Pipeline Candidates": 0.6,
  "Shrinking Sales and Margin Pressures Might Change The Case For Investing In Kraft Heinz (KHC)": -0.5,
  "Those who invested in Microchip Technology (NASDAQ:MCHP) five years ago are up 48%": 0.5,
  "What Catalysts Are Shifting the Synopsys Narrative Amid IP Headwinds and Ansys Integration": 0.2,
  "Microchip Introduces Flexible New Family of Gigabit Ethernet Switches with TSN/AVB and Redundancy For Industrial Applications": 0.6,
  "Resilience Investments Unveils Leadership from Airbnb, Ethic to Launch Resilient Affordable Housing Strategy": 0.5,
  "Quantum Computing Stocks Rally. D-Wave Hits Record High Amid Tokyo Conference.": 0.8,
  "Taiwan Semiconductor sinks after Nvidia forges pact with rival Intel": -0.7,
  "Palo Alto Networks Unveils AI-Generated Ad Campaign, Showcasing Secure Innovation in Action": 0.6,
  "Vertex Announces CASGEVY® Reimbursement Agreement for the Treatment of Transfusion-Dependent Beta Thalassemia and Sickle Cell Disease in Italy": 0.8,
  "What Makes Verisk Analytics (VRSK) a Must-Have For Major Insurance Companies?": 0.6,
  "Deliveroo boss steps down after near £200m payday": 0.2,
  "AppLovin Corporation (APP) Delivered Exceptional Results in Q2": 0.8,
  "CSX Corp. Announces Date for Third Quarter Earnings Release and Earnings Call": 0.0,
  "Atlassian acquires DX, a developer productivity platform, for $1B": 0.5,
  "Atlassian Enters Into Definitive Agreement to Acquire DX": 0.0,
  "Intuit Hosts Investor Day, Reaffirms First-Quarter and Fiscal 2026 Guidance": 0.5,
  "Is Warner Bros Discovery Stock a Buy Amid Reports of a Potential Paramount Bid?": 0.5,
  "Investors Heavily Search Intuit Inc. (INTU): Here is What You Need to Know": 0.5,
  "Booking Holdings Inc. (BKNG) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Axon Enterprise, Inc (AXON) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Investors Heavily Search Gilead Sciences, Inc. (GILD): Here is What You Need to Know": 0.5,
  "Investors Heavily Search Airbnb, Inc. (ABNB): Here is What You Need to Know": 0.5,
  "Marvell Technology, Inc. (MRVL) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Why You Should Care About Monster Beverage's (NASDAQ:MNST) Strong Returns On Capital": 0.5,
  "Fastenal's (NASDAQ:FAST) investors will be pleased with their impressive 143% return over the last five years": 0.8,
  "CRDO Deepens Ties With Hyperscalers: Key to Next Growth Phase?": 0.6,
  "Atlassian to acquire developer productivity platform DX for $1 billion": 0.5,
  "Intuitive Surgical Stock Is Trading Near Its 52-Week Low. Could This Be a No-Brainer Buy for the Long Haul?": 0.5,
  "Biogen Gets EU Nod for First Postpartum Depression Drug": 0.6,
  "Is Cadence (CDNS) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Novo Nordisk, Google's Android, GE Healthcare: Trending Tickers": 0.0,
  "Target initiated, Nike upgraded: Wall Street's top analyst calls": 0.5,
  "TSMC, Arm, AMD: Winners and Losers After Nvidia’s Intel Investment": 0.2,
  "Here's Why Workday (WDAY) is a Strong Momentum Stock": 0.8,
  "Deliveroo CEO Will Shu turned 100-hour weeks on Wall Street into a $4 billion food empire. Now he’s cashing out with $250 million": 0.8,
  "Gorilla Swings 13% Higher on $1.4B Freyr Deal in Southeast Asia": 0.5,
  "Airbus, Honeywell, Lockheed Martin, RTX, and Safran Lead in Digital Transformation Among Aerospace and Defense Manufacturers, According to ABI Research Index": 0.5,
  "Synopsys shares rise on chip sector developments": 0.6,
  "RBC upgrades CSX, says shares gain under most rail merger outcomes": 0.6,
  "National Advertising Division Finds Certain “AT&T Guarantee” Claims Supported; Recommends Other Claims be Modified or Discontinued": 0.2,
  "Intel–Nvidia pact leaves these stocks behind": -0.5,
  "Is Warner Bros. Discovery Stock Outperforming the S&P 500?": 0.2,
  "Axon's Connected Devices Unit Gains Momentum: Can It Sustain?": 0.5,
  "TJX Trading Cheaper Than Industry: What's the Next Best Move?": 0.2,
  "MRVL vs. MU: Which Semiconductor Stock Should You Consider Now?": 0.5,
  "Will Live Sports Be the Next Revenue Driver for TTD's CTV Business?": 0.2,
  "Intuit Sticks To Bold 2026 Outlook With AI Driving Growth": 0.6,
  "Broadcom (AVGO) Sheds 3.8% on China Probe": -0.6,
  "European Equities Traded in the US as American Depositary Receipts Rise in Thursday Trading": 0.5,
  "J&J Expects Innovative Medicines Growth Despite Stelara LOE: Here's Why": 0.5,
  "CSX Well-Positioned to Benefit From All Potential Rail Merger Scenarios, RBC Says": 0.8,
  "Why onsemi (ON) Stock Is Trading Up Today": 0.5,
  "JD vs. PDD: Which Chinese E-Commerce Stock is the Better Buy?": 0.2,
  "Why Arm Holdings Stock Was Sliding Today": -0.5,
  "Nvidia–Intel hits AMD, Arm; mortgage rates fall; Bullish in US": 0.5,
  "Lyft (LYFT) Surges 13.1%: Is This an Indication of Further Gains?": 0.6,
  "Numeral raises $35M to automate sales tax with AI": 0.5,
  "Intuitive Surgical (ISRG) is an ‘Outperform’ Ahead of Key Product Launches: Bernstein SocGen Group": 0.6,
  "Intuit Inc. (INTU) Focused on AI Innovation to Target 100M Customer Base": 0.6,
  "Booking Holdings Inc. (BKNG) Taps AI Innovation to Enhance Booking Experiences": 0.6,
  "Insulet gets artistic with Omnipod Mango Pantone colour creation": 0.5,
  "Here's Why Shares in Synopsys Soared Today": 0.5,
  "Etsy Stock Earns Relative Strength Rating Upgrade": 0.5,
  "ARM's Powerful Lumex Launch Poised to Accelerate AI Leadership": 0.8,
  "MercadoLibre Stock Scores Relative Strength Rating Upgrade": 0.5,
  "Intuit's (NASDAQ:INTU) Upcoming Dividend Will Be Larger Than Last Year's": 0.6,
  "TI increases dividend 4% to $1.42 per share, marking 22 consecutive years of increases": 0.8,
  "Cybersecurity Stocks: Netskope IPO Jumps In First Day Of Trading": 0.5,
  "These Stocks Moved the Most Today: Intel, Nvidia, Micron, Novo Nordisk, 89bio, CrowdStrike, Bullish, Nucor, and More": 0.5,
  "Why KLA Stock Triumphed on Thursday": 0.5,
  "Heard on the Street Recap: Nvidia Goes Big on Intel": 0.5,
  "Tech Deal, Rate Cut Push Stocks to Records": 0.8,
  "Latino families are building wealth through short-term rentals, according to new survey": 0.6,
  "Expedia CEO says any quarterly reporting change won't affect internal decisions": 0.1,
  "MercadoLibre (MELI) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Datadog (DDOG) Rises Higher Than Market: Key Facts": 0.5,
  "AppLovin (APP) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "JFrog, Amplitude, Freshworks, Intuit, and Cloudflare Stocks Trade Up, What You Need To Know": 0.5,
  "Integral Ad Science, SoundHound AI, Fastly, Five9, and Cadence Design Systems Shares Are Soaring, What You Need To Know": 0.6,
  "Health Catalyst, Twilio, Palantir Technologies, Zscaler, and Appian Shares Skyrocket, What You Need To Know": 0.8,
  "Comcast (CMCSA) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Gilead Sciences (GILD) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "NXP Semiconductors (NXPI) Rises Higher Than Market: Key Facts": 0.5,
  "Former Facebook Engineer Quickly Becomes VC Partner After Building $250M Revenue Engine At AI Startup Glean": 0.8,
  "General Mills vs. Kraft Heinz: Bite the Dip in these Popular Food Stocks?": 0.1,
  "(Item 8.01) Other Events. On September 19, 2025, Marvell Technology, Inc. (the “Company”) announced that its Board of Directors had declared the payment of its quarterly dividend of $0.06 per share to be paid on October 30, 2025 to all stockholders of record as of October 10, 2025. A copy of the press release is furnished herewith as Exhibit 99.1 and is incorporated by reference herein. The payment of future quarterly cash dividends is subject to, among": 0.2,
  "(Item 1.01) Entry into a Material Definitive Agreement. On September 18, 2025, Applied Materials, Inc. (“Applied”) completed a registered public offering of $550 million in aggregate principal amount of 4.000% senior unsecured notes due 2031 (the “2031 Notes”) and $450 million in aggregate principal amount of 4.600% senior unsecured notes due 2036 (the “2036 Notes” and, collectively with the 2031 Notes, the “Notes”) pursuant to an underwriting agreement (the “Underwriting Agreement”) with Citigroup Global Markets Inc., Mizuho\n\n(Item 8.01) Other Events. On September 15, 2025, Applied entered into the Underwriting Agreement for the sale of the Notes. The Underwriting Agreement contains customary representations, warranties and agreements by Applied, and customary closing conditions, indemnification rights and termination provisions. The above description of the Underwriting Agreement does not purport to be complete and is qualified in its entirety by reference to the full text of the Underwriting Agreement, which is filed as Exhibit 1.1 to this": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Approval of Amendment and Restatement of the 2017 Stock Incentive Plan On September 18, 2025, the stockholders of Take-Two Interactive Software, Inc. (the “Company”) approved and adopted an amendment and restatement of the Amended and Restated Take-Two Interactive Software, Inc. 2017 Stock Incentive Plan (the “2017 Plan”) at the Company’s annual meeting of stockholders (the “Annual Meeting”).\n\n(Item 5.07) . The amendment and restatement of the 2017 Plan (i) increases the shares reserved under the 2017 Plan by 5,200,000 shares, and (ii) extends the term of the 2017 Plan to September 18, 2035. No other changes were made to the 2017 Plan. The foregoing description of the amendment and restatement of the 2017 Plan is qualified in its entirety by the full text of the 2017 Plan, as amended and restated, which is attached\n\n(Item 5.07) Submission of Matters to a Vote of Security Holders. On September 18, 2025, the Company held its Annual Meeting virtually via live audio-only webcast. As of the record date for the Annual Meeting, the Company had 184,467,164 shares of its common stock, par value $0.01 per share (the “Common Stock”), issued and outstanding. At the Annual Meeting, 162,145,195 shares of Common Stock were represented in person or by proxy. The following matters were submitted to": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Retirement of Chief Accounting Officer and Controller On September 17, 2025, Booking Holdings Inc. (the “Company”) announced that Susana D’Emic, the Company’s Chief Accounting Officer and Controller, intends to retire at the end of March 2027. In advance of that date, she will be transitioning to the role of Senior Vice President of Finance in connection": 0.1,
  "'Against The Principles Of The Fourth Amendment' 80,000 AI Cameras Track Americans Daily As CEO Claims He Can Eliminate All Crime In 10 Years": -0.8,
  "Explore Asia's Aquatic Wonders with Agoda's Curated Aquarium Picks": 0.5,
  "Jim Cramer Highlights Potential Warner Bros. Acquisition": 0.5,
  "Jim Cramer Says “I Think You Buy Airbnb”": 0.6,
  "Jim Cramer Says Axon “Could Continue to Rally for a Very, Very Long Time”": 0.8,
  "Jim Cramer Explains Why Cisco Remains in the Charitable Trust Portfolio": 0.5,
  "Jim Cramer on Keurig Dr Pepper: “They’re Right to Break Up the Business”": 0.5,
  "Jim Cramer on Resideo Technologies: “Precisely the Kind of Stock That You Should be Buying”": 0.6,
  "Jim Cramer Says “Canadian National is Way Too Cheap”": 0.8,
  "Q2 Earnings Highs And Lows: Atlassian (NASDAQ:TEAM) Vs The Rest Of The Productivity Software Stocks": 0.5,
  "Jim Cramer Advises Holding Warner Bros. Discovery for at Least $20": 0.5,
  "2 Reasons to Watch INTU and 1 to Stay Cautious": 0.5,
  "3 Reasons to Sell ADI and 1 Stock to Buy Instead": -0.5,
  "Canadian National Railway, CSX Sign MOU to Launch New All-Rail Intermodal Service to Nashville": 0.5,
  "3 Consumer Stocks with Warning Signs": -0.5,
  "2 Cash-Producing Stocks with Exciting Potential and 1 We Ignore": 0.6,
  "1 Large-Cap Stock with Impressive Fundamentals and 2 We Turn Down": 0.5,
  "2 Profitable Stocks on Our Watchlist and 1 We Turn Down": 0.2,
  "Mexico’s Antitrust Watchdog Investigates MercadoLibre (MELI)": 0.1,
  "Analysts Stay Positive on Intuitive Surgical (ISRG) Despite Stock Dip": 0.8,
  "Intuit (INTU) Partners with Clair to Offer On-Demand Pay": 0.5,
  "Exelon (EXC): ComEd Announces Start of V2G Charging Pilot’s Testing Phase": 0.5,
  "Update on intended recommended public offer by KDP for JDE Peet's": 0.5,
  "Is Opendoor Technologies Stock a Buy Below $10?": 0.2,
  "Heard on the Street Thursday Recap: Nvidia Goes Big on Intel": 0.5,
  "US chip independence is a 'vital necessity': Gary Cohn on AI": 0.5,
  "Regeneron Donates Ebola Treatment for Use in Countries Most at Risk of Outbreaks": 0.8,
  "Intellum Announces 2025 Growth Makers Awards Winners": 0.0,
  "Investors in Baker Hughes (NASDAQ:BKR) have seen enviable returns of 306% over the past five years": 0.8,
  "Arvinas reboots, cuts more staff; Porges joins Lazard": -0.2,
  "Trump-Xi Phone Call Steadies Wall Street Pre-Bell; Asia Off, Europe Flat": 0.5,
  "Deliveroo CEO to step down following acquisition by DoorDash": 0.1,
  "3 Incredible Growth Stocks to Buy Now": 0.8,
  "Analysts positive on INTU after analyst day": 0.8,
  "Mercado Pago to acquire Nikos DTVM in Brazil – report": 0.5,
  "High Growth Tech Stocks In The US Market September 2025": 0.5,
  "Nvidia Stock Can’t Keep Up With Micron and Other AI Plays. Here’s Why.": -0.5,
  "IRS to Monitor Vacation Home Rentals More Closely - Clear Start Tax Explains How Short-Term Use Can Spark Tax Liability": -0.5,
  "Constellation’s Clean Energy Centers Deliver Near-Perfect Summer Reliability, Backed by $7 Billion in Investments Over the Past Decade": 0.8,
  "Returns At Keurig Dr Pepper (NASDAQ:KDP) Appear To Be Weighed Down": -0.6,
  "Should You Think About Buying Marvell Technology, Inc. (NASDAQ:MRVL) Now?": 0.2,
  "How Is CEG leveraging Natural Gas to Support Growth & Grid Stability?": 0.5,
  "Dow Jones Futures Rise Amid Trump-Xi Call; Palantir Leads 7 New Buys": 0.5,
  "Workday CFO on why $1.1 billion Sana deal aligns with M&A strategy": 0.5,
  "PFE vs. AZN: Which Cancer-Focused Drug Giant Is the Better Pick?": 0.5,
  "Exchange-Traded Funds Higher, Equity Futures Mixed Pre-Bell Friday Ahead of Trump, Xi Talks": 0.5,
  "2 Dividend Powerhouses to Buy Right Now": 0.5,
  "Analyst on Adobe Inc (ADBE): ‘I’m on My Last Nerve With This Stock’": -0.6,
  "Cathie Wood Just Bought the Dip in Synopsys Stock. Should You?": 0.5,
  "Investors in Cadence Design Systems (NASDAQ:CDNS) have seen strong returns of 257% over the past five years": 0.8,
  "Ozen Engineering Merges with SimuTech Group, Uniting Two Leading Partners of Ansys and Synopsys Across North America": 0.5,
  "Will Strength in Aerospace Technologies Continue to Drive HON's Growth?": 0.5,
  "Wall Street Set to Open Slightly Higher Friday as Equities Level Out Following Record Sessions": 0.5,
  "Prediction: This AI Growth Stock Will Become Europe's First $1 Trillion Company by 2035": 0.8,
  "Should You Invest in Workday (WDAY) Based on Bullish Wall Street Views?": 0.5,
  "Earnings Growth & Price Strength Make Adobe Systems (ADBE) a Stock to Watch": 0.6,
  "Wall Street Analysts Think Booking Holdings (BKNG) Is a Good Investment: Is It?": 0.5,
  "Axon (AXON) Is Considered a Good Investment by Brokers: Is That True?": 0.5,
  "Josh Brown Highlights His Top Cheap Stock Pick With ‘Best Long-Term Charts’": 0.6,
  "Amgen's Uplizna Receives European Human Medicines Committee Recommendation for IgG4-Related Disease": 0.5,
  "DAT: Truckload volumes, spot rates dipped in August": -0.5,
  "Liver Cancer Therapeutics Market Size Surpasses USD 13.16 Billion by 2032, Increasing at a CAGR of 16.5% from 2025 to 2033": 0.8,
  "Baker Hughes secures multi-year contract with Petrobras for offshore stimulation vessels": 0.8,
  "BizClik Brings Global Leaders Together at Sustainability LIVE: Climate Week NYC 2025": 0.8,
  "Smart Medical Devices Market Size to Reach $180.4 Billion by 2033 - Strategic Growth Opportunities in Chronic Disease Management, Digital Health, and Connected Care": 0.8,
  "Can Credo Sustain Momentum in Optical Business Amid Competition?": 0.1,
  "Intuit Core Business Positioned Well Amid 'Ample' Runway for Growth, Oppenheimer Says": 0.8,
  "Intel (INTC) Moves 22.8% Higher: Will This Strength Last?": 0.6,
  "Intuitive Surgical: How To Find & Own America's Greatest Opportunities": 0.5,
  "Petrobras Expands Offshore Capabilities With Baker Hughes Partnership": 0.5,
  "LRCX Bets on TEOS 3D: Will it Strengthen Packaging Leadership?": 0.5,
  "Analog Devices (ADI) Up 0.9% Since Last Earnings Report: Can It Continue?": 0.6,
  "Elliott Management Is Betting Big on Workday Stock. Should You?": 0.5,
  "Paramount and WBD, UPS, Apple iPhone 17: Trending Tickers": 0.0,
  "GEHC or A: Which Is the Better Value Stock Right Now?": 0.0,
  "BYD or TTWO: Which Is the Better Value Stock Right Now?": 0.5,
  "Advanced Energy (AEIS) Soars 7.6%: Is Further Upside Left in the Stock?": 0.6,
  "Intuit Reaffirms Q1 & Fiscal 2026 Guidance: Is It on Track to Deliver?": 0.2,
  "Comcast Opens New Xfinity Store in Canton, Georgia": 0.0,
  "Will Qualcomm's Deep Foray Into AI Realm Work Wonders for the Stock?": 0.5,
  "Why DexCom (DXCM) Shares Are Trading Lower Today": -0.5,
  "NTLA Completes Enrollment in Pivotal Study on HAE Candidate, Stock Up": 0.8,
  "Identify Outliers Like KLA with Money Flows": 0.2,
  "Why Is Workday Stock Surging This Week?": 0.5,
  "Can Regeneron Change The Paradigm In Multiple Myeloma — And Undercut J&J?": 0.1,
  "EMA Backs Amgen Drug For Rare Autoimmune Disorder": 0.5,
  "U.S. Oil Rig Count Rises for Third Consecutive Week": 0.2,
  "Synopsys, Inc. (SNPS): A Bull Case Theory": 0.5,
  "Exploring High Growth Tech Stocks In The US Market September 2025": 0.5,
  "Marvell Technology, Inc. (MRVL): A Bull Case Theory": 0.5,
  "Could Intel Be the Comeback Story of the Decade After Nvidia's Multibillion-Dollar Endorsement?": 0.8,
  "The 4 industries worst hit by tariffs so far": -0.5,
  "Is the Kansas City Chiefs’ NFL dynasty officially over?": -0.5,
  "Oil Rig Count Rises by 2; Crude Prices Fall for Third Straight Session": -0.7,
  "US Equity Indexes Higher on Easing US-China Trade Standoff": 0.8,
  "CoreWeave, nuclear energy stocks, Fiverr: Trending Tickers": 0.1,
  "Atlassian Corporation (TEAM): A Bull Case Theory": 0.5,
  "Copart, Inc. (CPRT): A Bull Case Theory": 0.5,
  "Sector Update: Health Care Stocks Mixed Late Afternoon": 0.0,
  "Marvell Technology, Inc. Declares Quarterly Dividend Payment": 0.0,
  "Why Amgen (AMGN) Stock Is Trading Up Today": 0.5,
  "Snowflake (SNOW) Stock Trades Up, Here Is Why": 0.5,
  "US Equity Indexes Hit Record Highs This Week After Fed Rate Cut, Warmer US-China Trade Relations": 0.8,
  "Beware This ‘Bull Trap’ as Stocks Keep Hitting New Highs": -0.6,
  "2 Stocks That Are Crushing the Market This Year But Have More Room to Run": 0.8,
  "S&P 500 Gains and Losses Today: Paramount Surges Amid Deal Buzz, Apple Rises as iPhone 17 Goes on Sale": 0.6,
  "Why Constellation Energy Corporation (CEG) Outpaced the Stock Market Today": 0.5,
  "ON Semiconductor Corp. (ON) Stock Dips While Market Gains: Key Facts": 0.1,
  "Trump unveils gold, platinum visas to cost up to $5 million": -0.5,
  "ABNB Stock Price Prediction: Where Airbnb Could Be by 2025, 2026, and 2030": 0.5,
  "Astrazeneca (AZN) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.2,
  "Exclusive-Comcast plans to cut jobs at its biggest unit, housing broadband and pay TV, to centralize operations, source says": -0.6,
  "Adding Texas Instruments Incorporated (TXN) to Your Dividend Stock Portfolio for Long-Term Income": 0.5,
  "Building a Dividend Stock Portfolio: PepsiCo’s (PEP) Stability and Growth Potential": 0.6,
  "Why QUALCOMM (QCOM) Belongs in a Dividend Stock Portfolio for Steady Income": 0.5,
  "Mondelez International (MDLZ): A Sweet Spot in Dividend Stocks to Buy Under $100": 0.8,
  "Jim Cramer Calls Workday an Enterprise Software Powerhouse": 0.8,
  "Jim Cramer Says He Stopped Liking lululemon When They Sued Costco": -0.5,
  "Jim Cramer Says “Marriott Was Crushed” But it “Makes No Sense at All”": 0.2,
  "2 Stocks That Could Create Lasting Generational Wealth": 0.8,
  "3 Top Tech Stocks to Buy in September": 0.5,
  "Prediction: These Could Be the Best-Performing Value Stocks Through 2030": 0.5,
  "Is Constellation Energy Stock a Buy Now?": 0.2,
  "Buy the Dip in These 2 Underperforming Cloud Software Stocks, Say Analysts": 0.5,
  "These 5 Side Hustles Are On Their Way Out In the Trump Economy": -0.5,
  "Evaluating Atlassian (TEAM) Valuation After Unusual Share Price Swings This Week": 0.1,
  "The Bull Case For DoorDash (DASH) Could Change Following New Partnerships in Hardware, Beauty, and Business": 0.6,
  "Is There Now an Opportunity in Paramount Skydance After Potential Warner Bros. Bid?": 0.5,
  "3 Red-Hot Stocks to Buy Right Now": 0.5,
  "Exelon Corporation (NASDAQ:EXC) is a favorite amongst institutional investors who own 87%": 0.5,
  "A Fresh Look at Intuitive Surgical (ISRG) Valuation Following New da Vinci 5 Software Innovations": 0.5,
  "GE HealthCare Technologies (GEHC): Valuation Insights Following New AI Ultrasound Launches and Flyrcado Imaging Agent Deal": 0.5,
  "Will Airbnb’s (ABNB) AI-Powered ‘Everything App’ Ambition Redefine Its Diversification Narrative?": 0.5,
  "Is There Now an Opportunity in Lululemon After Shares Drop Over 50% in 2025?": 0.2,
  "AstraZeneca (LSE:AZN): Exploring Current Valuation Signals and Analyst Narratives": 0.2,
  "Does Fortinet's (FTNT) Cautious Guidance Reveal Shifting Enterprise Security Priorities?": 0.1,
  "How the Narrative for Regeneron Has Shifted with Pipeline Wins and Analyst Optimism": 0.6,
  "Is Starbucks Stock Worth Another Look After Record-Breaking Fall Sales Surge?": 0.5,
  "What Is One of the Best Consumer Goods Stocks to Buy Right Now?": 0.2,
  "Healthcare Stocks Are at an Historic Low and a Turnaround Is on the Horizon": 0.8,
  "My 2 Favorite Stocks to Buy Right Now": 0.5,
  "Insiders At Analog Devices Sold US$15m In Stock, Alluding To Potential Weakness": -0.6,
  "3 Dirt Cheap Stocks to Buy With $500 Right Now": 0.5,
  "Trump to impose $100,000 fee per year for H-1B visas, in blow to tech - https://www.reuters.com/business/media-telecom/trump-mulls-adding-new-100000-fee-h-1b-visas-bloomberg-news-reports-2025-09-19/ > SAN FRANCISCO/WASHINGTON, Sept 19 (Reuters) - The Trump administration said on Friday it would ask companies to pay $100,000 per year for H-1B worker visas, prompting some big tech companies to warn visa holders to stay in the U.S. or quickly return. > The change could deal a big blow to the technology sector that relies heavily on": -0.8,
  "Anatoly Yakovenko Net Worth: Solana CEO's Wealth In Spotlight As ETF Deadline Nears": 0.2,
  "American Express Reveals New Platinum Card Retail and Wellness Benefits, Revamps Amex App": 0.5,
  "I'm predicting that Trump's $100k H1b nuclear bomb is just a market manipulation ploy - We've seen this before. Trump drops a figurative nuclear bomb on Friday afternoon, the media panics about it over the weekend, markets plummet on Monday, and then he reverses course on Wednesday and everything is back to normal. Trump and his insiders make millions while everyone else gets screwed. This H1b policy is so ludicrous, there's no way it can": -0.8,
  "Why Lululemon's Battle With Costco Could Make or Break Its Stock": 0.1,
  "These 2 Growth Stocks Have Been Hammered. Time to Buy?": 0.5,
  "Cheap Dividend Stocks With Defensive Characteristics: Spotlight on The Kraft Heinz Company (KHC)": 0.5,
  "Honeywell International Inc. (HON): “The Breakup Is Extraordinarily Good,” Says Jim Cramer": 0.8,
  "CrowdStrike (CRWD) Poised for Growth: Analysts Project 20%+ ARR Growth by 2027": 0.8,
  "Disney+ and Hulu face mass cancellations after Jimmy Kimmel suspension sparks coordinated boycott across social media - No paywall: [https://www.usatoday.com/story/entertainment/tv/2025/09/19/disney-plus-cancellations/86249954007/](https://www.usatoday.com/story/entertainment/tv/2025/09/19/disney-plus-cancellations/86249954007/) >Celebrities have also weighed in on the controversy, which include notable Disney actors and public figures such as David Letterman and former Vice President Mike Pence. >Former \"Supernatural\" actor Misha Collins posted on X to his more than 2.6 million followers he would cancel his DisneyPlus subscription \"indefinitely.\" Edit: “Surge in cancellations” would be more": -0.8,
  "AAPL: Strong iPhone 17 demand - **Apple has asked suppliers to boost production of iPhone 17 model, the Information reports** https://www.reuters.com/business/apple-has-asked-suppliers-boost-production-iphone-17-model-information-reports-2025-09-19/ \"Apple this week asked Luxshare Precision, one of its two main iPhone assemblers in China, alongside Foxconn, to boost daily output of the standard iPhone 17 by about 40%\" **Apple’s iPhone 17 Sales Open to Strong Demand for Pro Models** https://www.bloomberg.com/news/articles/2025-09-19/apple-s-iphone-17-air-go-on-sale-to-years-of-demand-for-new-look \"The new phones, which bring a fresh look in addition to battery life": 0.8,
  "Needham Raises Arista (ANET) Price Target to $160 After Analyst Day": 0.8,
  "BofA Sees Stronger Demand for ASML’s Chipmaking Tools Amid AI Boom": 0.8,
  "Dividend Paying Stocks With Consistency: What Sets Cisco Systems (CSCO) Apart": 0.5,
  "Analog Devices’ (ADI) Dividend History and its Impact on Dividend Paying Stocks Portfolios": 0.1,
  "Why Income Investors Look to Comcast Corporation (CMCSA) When Choosing Dividend Paying Stocks": 0.5,
  "Atlassian Appoints AI Entrepreneur Jason Warner to Board": 0.5,
  "Comcast (CMCSA) Faces Broadband Competition Despite Strong Performance, Says RBC Capital": 0.5,
  "Wells Fargo Raises Warner Bros. Discovery (WBD) Price Target, Sees M&A Potential": 0.8,
  "Piper Sandler Lowers Adobe (ADBE) PT to $470 on AI Uncertainty Despite Record $5.99B Q3 Revenue": -0.5,
  "The Trade Desk (TTD) Draws Overweight Rating Despite Competitive Concerns": 0.5,
  "Charter Communications (CHTR) Highlights Broadband Growth and Synergies After Cox Acquisition": 0.6,
  "BTIG Raises AppLovin (APP) Price Target Amid Strong Non-Gaming Revenue Forecasts": 0.8,
  "Autodesk (ADSK) Partners With New England Patriots as Official Design and Make Platform": 0.5,
  "My 3 Favorite Dividend Stocks to Buy Right Now": 0.5,
  "Innovative Solutions and Support (ISSC) Down 41.5% Since Q3 2025 Release": -0.7,
  "QUALCOMM Incorporated (QCOM) Partners With HARMAN": 0.5,
  "Cognizant Technology Solutions (CTSH) Partners With the North Carolina Turnpike Authority": 0.5,
  "Why I Think Domino's Pizza (DPZ) Is a Warren Buffett-Worthy Investment": 0.8,
  "Over diversification - How many stocks are you invested in? - Been thinking about this lately as there are a handful of stocks that I'm looking at investing but wondering if I am over doing it rather than sticking with what I have. So, how many stocks do you have a position in currently? Is there a general rule of thumb? Ones i'm specifically monitoring KSS, UPS, OKLO, SMR, LULU": -0.2,
  "1 Genius Artificial Intelligence (AI) Stock That Will Be Worth More Than Palantir 3 Years From Now": 0.8,
  "Better Stablecoin Buy: Ripple USD vs. PayPal USD": 0.2,
  "Could DoorDash Partnership Reveal a New Strategy for Sally Beauty’s (SBH) Urban Consumer Reach?": 0.5,
  "Is Palo Alto Networks, Inc. (NASDAQ:PANW) Potentially Undervalued?": 0.5,
  "Shopify (SHOP) forges AI Commerce Partnership with LTIMindtree—Is Its Enterprise Strategy Gaining Momentum?": 0.5,
  "Confluent (CFLT): Valuation Insight After CTO Appointment and Bold Enterprise AI Platform Moves": 0.5,
  "This couple says they’re $12M in debt after buying 12 Airbnbs — but the risky move gave them financial freedom": 0.5,
  "PayPal Expands Peer-to-Peer Payments With Bitcoin, Ethereum Integration – Exec Says It's the 'Next Major Step' in Global Money Movement": 0.8,
  "Gilead Sciences, Inc. (GILD) Expands U.S. Manufacturing Capacity With $32B Investment Through 2030": 0.5,
  "Analysts Push Cisco's Target Price Higher - Shorting CSCO Puts Works Here": 0.5,
  "Is Kevin Plank Gearing Up To Take Under Armour (UAA) Private - UAA stock is down 40% ytd. It’s down 90% the past 10 years. UAA market cap is down to just over $2 billion! Kevin Plank, founder & CEO, is focused on rebuilding the brand. This takes a longer term vision that can be at odds with Wall Street’s focus on quarterly results. It’s definitely easier to do as a private company. Plank currently": 0.2,
  "Nuclear energy could be a $10T market as OKLO (+500% YTD) and SMR (+150% YTD) soar on rising AI data center power demand - No paywall: [https://finance.yahoo.com/news/nuclear-power-could-be-a-10-trillion-industry-that-holds-the-answer-to-the-worlds-power-shortages-090015624.html](https://finance.yahoo.com/news/nuclear-power-could-be-a-10-trillion-industry-that-holds-the-answer-to-the-worlds-power-shortages-090015624.html) >To meet the growing demand for global electrification stoked by energy-intensive projects like the data centers underpinning the AI arms race, global nuclear capacity will have to triple by 2050, the firm estimated. Investment is expected to reach more than $3 trillion in the next 25 years. >NuScale": 0.6,
  "$MTDR Boring Insider Trading by C-suite outperforms stock by 9x - This is really interesting to me - for the stock $MTDR, insider traders have been buying for years, and it just seems that they average down on every dip. . I call it \"boring\" because they just simply keep averaging in on the lows, it's not a flashy trade. To evaluate their effectiveness, I ran a backtest where I took a 1000 dollar investment,": 0.6,
  "1 Reason to Buy PepsiCo (PEP) Stock That's Been a Good Reason for More Than 50 Years": 0.8,
  "Bad news for coffee drinkers: The record-high prices you’re paying will go even higher when tariffs take their toll": -0.8,
  "If You Buy Starbucks With $10,000 in 2025, Will You Become a Millionaire in 10 Years?": 0.2,
  "How often do you guys skim off the top - The last few weeks have posted strong returns, maybe too strong and nothing goes up forever. Obviously no one has a crystal ball, but I am feeling I should maybe cash in on some of my gains, but trying to time the market has screwed me in the past, what rules do you guys follow when you guys cash in?": -0.2,
  "Why World Thinks the Internet Can’t Survive Without Proof of Human": -0.5,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On September 19, 2025, the Board of Directors (the “Board”) of T-Mobile US, Inc. (“T-Mobile,” the “Company,” or “us”) appointed Srinivasan Gopalan as President and Chief Executive Officer (“CEO”) of T-Mobile and as a member of the Board, effective November 1, 2025 (the “Effective Date”). Following the Effective Date, G. Michael Sievert, our current President and CEO,": 0.2,
  "(Item 8.01) Other Events Attached as Exhibit 99.1 and incorporated by reference herein is a press release dated September 22, 2025, issued by Comcast Corporation.": 0.0,
  "(Item 8.01) Other Events. ATM Updates On September 22, 2025, Strategy Inc (“Strategy” or the “Company”) announced updates with respect to its at-the-market offering programs: ATM Program Summary During Period September 15, 2025 to September 21, 2025 As of September 21, 2025 Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) STRF ATM 173,834 STRF Shares $17.4 $19.4 $1,730.1 $2.1 billion of 10.00% series A perpetual strife": 0.1,
  "MIPS Appoints Alan Li as Head of Business Development to Accelerate China Growth": 0.6,
  "The reason I’m shorting Harley-Davidson (HOG) - I decided to buy the $23, 1/15/27 puts for Harley-Davidson. I’ve been doing some research and have come to the conclusion that this would make a good short: 1. As a whole, they have failed to market to a younger demographic for the past decade or longer. The only people who I ever see on Harley’s are all older and have had their bikes for 10+ years. As": -0.6,
  "Reflecting On Online Marketplace Stocks’ Q2 Earnings: MercadoLibre (NASDAQ:MELI)": 0.2,
  "A Look Back at Consumer Subscription Stocks’ Q2 Earnings: Netflix (NASDAQ:NFLX) Vs The Rest Of The Pack": 0.2,
  "Dupixent® (dupilumab) to Treat Chronic Spontaneous Urticaria (CSU) Advances in EU with Positive CHMP Opinion": 0.6,
  "1 Unpopular Stock That Deserves Some Love and 2 That Underwhelm": 0.2,
  "1 Mooning  Stock Worth Your Attention and 2 Facing Headwinds": 0.2,
  "VOO or other index funds? - This thread says stocks but everybody talks about Voo. Nothing magical here, no offense but who cares, it’s just the index. If all you do is index investing then why are you here? I want to hear about the great stocks you’re discovering and making money on. Are AI stocks working for you? What’s your strategy? What keeps you up at night? What are the contrarian views out there?": 0.2,
  "2 Large-Cap Stocks to Target This Week and 1 We Brush Off": 0.2,
  "1 Surging  Stock to Own for Decades and 2 We Question": 0.2,
  "Fears for pharma slump as labs stand empty": -0.6,
  "Cerence Integrates Audio AI Suite into DSP Concepts’ Audio Weaver to Transform In-Car Sound": 0.5,
  "Which Dividend Stock or ETF - Hi folks , i have separated my portfolio into two sides, one for safer growth and other for aggressive speculative growth. I am already trading with my high risk portfolio and I was looking for some safe investing opportunities for other half. I would like to get your advice on high dividend vs low dividend but promising stock price growth. Also feel free to add your own portfolio under": 0.2,
  "Jim Cramer on Starbucks: “I Think You Buy More”": 0.6,
  "Rolls-Royce (RYCEY) is on a Roll ! - So much positive news in the past few weeks alone… - Rolls Royce CEO was with US President Donald Trump and UK Prime Minister Keir Starmer at the Windsor Castle Banquet last week. https://www.reddit.com/r/RYCEY/comments/1nk92wl/was_tufan_erginbilgic_at_the_uk_state_dinner/ - Nuclear energy stocks are roaring upwards, sending nuclear energy speculative stocks soaring despite being loss-making, and despite no revenues in some cases (OKLO!), so it’s only a matter of time before attention": 0.8,
  "Meet the Monster Stock that Continues to Crush the Market": 0.8,
  "How SS Innovations is expanding robotic surgery’s reach": 0.5,
  "Stock Market News for Sep 22, 2025": 0.0,
  "Trending tickers: Snap, Pfizer, Tata Consultancy Services, Samsung Electronics and Oklo": 0.0,
  "Marriott bets on independent hotels with collection brand expansion": 0.5,
  "Starbucks strengthens presence in Peru with two new outlets": 0.6,
  "India’s Pine Labs eyes up to $700m in IPO – report": 0.5,
  "1 Reason I Can't Stop Thinking About Chevron Stock in 2025": 0.5,
  "Shopify wants court to toss Sezzle lawsuit": -0.5,
  "Robinhood, AppLovin, EMCOR joining S&P 500. What does EMCOR do?": 0.2,
  "ASML rises after Morgan Stanley upgrade on positive growth inflection": 0.8,
  "Did Gilead's (GILD) $32 Billion AI Bet Just Transform Its Innovation and Global Health Narrative?": 0.6,
  "Assessing Mondelez (MDLZ) Valuation After Recent Momentum Shift in 2024": 0.2,
  "AB InBev and Netflix Announce Global Brand Partnership": 0.5,
  "Ensoma Announces $53 Million Financing to Support Key Clinical Milestones for EN-374 and Continued Development of In Vivo Hematopoietic Stem Cell Engineering Pipeline": 0.5,
  "Great week for Adobe Inc. (NASDAQ:ADBE) institutional investors after losing 31% over the previous year": 0.2,
  "Texas Instruments (NASDAQ:TXN) Could Be Struggling To Allocate Capital": -0.5,
  "This Week In AI Chips - Vikk AI Joins Elite AWS Startup Program With Meta's Llama": 0.5,
  "Discover 3 Stocks That Might Be Trading Below Their Estimated Fair Value": 0.5,
  "US High Growth Tech Stocks to Watch for Potential Expansion": 0.5,
  "Why Japanese Real Estate Small Caps Might Be the Best Value in Global Markets Right Now - The Japanese stock market has finally climbed back to the highs it set during one of the largest financial bubbles in history (the 1980s). After three decades of deflation, several big shifts have changed the investment landscape in Japan: • Urban land prices have finally recovered and are now growing again. • Inflation has returned (modest, but enough": 0.8,
  "Morgan Stanley revisits semicap calls: AMAT, LAM lifted; KLAC downgraded": 0.2,
  "Microchip Technology Incorporated (MCHP) Benefited from the Improved Semiconductor Cycle": 0.8,
  "Comcast Announces Debt Exchange Offers and Tender Offers": 0.0,
  "SOPHiA GENETICS Expands Collaboration with AstraZeneca to Enhance Detection of Breast and Prostate Cancer": 0.8,
  "CrowdStrike Powers Cyber Services, Accelerates SOC Transformation with KPMG": 0.5,
  "Buy and Hold: 2 Artificial Intelligence (AI) Stocks Built for the Long Haul": 0.5,
  "Lululemon’s ‘downward spiral’ — and how the brand plans to break out of it": 0.1,
  "Latest News In Digital Payment - Driving Growth With Real-Time And Recurring Payment Innovations": 0.6,
  "TikTok’s Algorithm to Be Secured by Oracle in Trump-Backed Deal - No paywall: [https://finance.yahoo.com/news/tiktok-algorithm-secured-oracle-trump-100000512.html](https://finance.yahoo.com/news/tiktok-algorithm-secured-oracle-trump-100000512.html) >Oracle Corp. (ORCL) would recreate and provide security for a new US version of TikTok’s algorithm under a deal taking shape to sell the popular Chinese-owned app to a consortium of American investors, a White House official said, addressing a key concern raised by lawmakers in Washington. >Data from US users would be stored in a secure cloud managed by Oracle": 0.2,
  "Netflix signs co-marketing deal with AB InBev to promote TV shows and beer": 0.5,
  "Cellares Appoints Former Kite Global Ops Leader, Christopher McDonald, to Board of Advisors": 0.5,
  "Boomi Appoints Keyur Ajmera as Chief Information Officer": 0.5,
  "Monster Beverage (NASDAQ:MNST) shareholders have earned a 9.8% CAGR over the last five years": 0.8,
  "Here’s What Lifted Intuit (INTU) in Q2": 0.5,
  "Costco (COST) Q4 Earnings Preview: What You Should Know Beyond the Headline Estimates": 0.5,
  "Comcast Corporation (CMCSA) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Is Trending Stock PayPal Holdings, Inc. (PYPL) a Buy Now?": 0.2,
  "Cadence Design Systems, Inc. (CDNS) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Shopify Inc. (SHOP) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "QUALCOMM Incorporated (QCOM) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Investors Heavily Search PDD Holdings Inc. Sponsored ADR (PDD): Here is What You Need to Know": 0.5,
  "Circuit & Chisel Secures $19.2 Million and Launches ATXP, a Web-Wide Protocol for Agentic Payments": 0.6,
  "Why Lam Research (LRCX) is a Top Stock for the Long-Term": 0.8,
  "Is Lam Research (LRCX) a Buy as Wall Street Analysts Look Optimistic?": 0.6,
  "Humana initiated, Paycom upgraded: Wall Street's top analyst calls": 0.5,
  "This Top Computer and Technology Stock is a #1 (Strong Buy): Why It Should Be on Your Radar": 1.0,
  "The Zacks Analyst Blog Highlights Costco Wholesale, Morgan Stanley and Caterpillar": 0.0,
  "r/Stocks Daily Discussion Monday - Sep 22, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.0,
  "TSLA bulls are celebrating rn. - ATHs of 488 to be hit this week. Absolute no reason for this pump but it is how it is. The more people hate him, the higher it will just go. Likely to see another repeat of last year where the stock shot up in the last quarter of the year. Stock is just insane. Classic example of irrational behaviour.": 0.2,
  "Strength in Network Software Drives Roper: Can the Momentum Sustain?": 0.5,
  "Amgen (AMGN) Moves 3.5% Higher: Will This Strength Last?": 0.5,
  "Plant-Based Dairy Products Market to Reach USD 34 Billion by 2030 | Insights on Milk, Cheese, Yogurt, and Emerging Alternatives: MarkNtel Advisors": 0.5,
  "Brinker, Apple, Keurig Dr Pepper: Top Analyst Calls": 0.0,
  "Costco vs. TJX Companies: Which Discount Retail Stock Is a Buy?": 0.5,
  "Netflix Strikes Global Deal With AB InBev to Pair Hit Shows With Beer Brands": 0.5,
  "Elizabeth Stone on what’s next for Netflix — and streaming itself — at TechCrunch Disrupt 2025": 0.5,
  "7 AI Startups Backed by Jeff Bezos — Should You Invest?": 0.5,
  "Golden Triangle Ventures, Inc. Signs LOI to Acquire Leading Texas Electrical Contractor in Expansion of GoldenEra Development": 0.8,
  "Strong Momentum in DRAM and NAND to Propel MU's Q4 Earnings": 0.8,
  "Can Google Avoid a Breakup Twice? - In a landmark decision this month, a federal judge spared Google from a breakup proposed by the government to rein in the company’s monopoly in search. Now, the company wants a second win. Starting on Monday, Judge Leonie M. Brinkema will hear arguments in the U.S. District Court for the Eastern District of Virginia on how to fix Google’s monopoly over some online advertising technology. The judge ruled": 0.2,
  "Advanced Connectivity Landscape Research Report 2025: 5G-Advanced Sets the Stage for the 6G Revolution": 0.8,
  "South Korea's President Lee says US investment demands would spark financial crisis - https://www.reuters.com/world/china/south-koreas-president-lee-says-us-investment-demands-would-spark-financial-2025-09-21/ >SEOUL, Sept 22 (Reuters) - South Korea's economy could fall into crisis rivalling its 1997 meltdown if the government accepts current U.S. demands in stalled trade talks without safeguards, President Lee Jae Myung told Reuters. > >Seoul and Washington verbally agreed to a trade deal in July in which the U.S. would lower President Donald Trump's tariffs on South Korean goods": -0.6,
  "Top Midday Stories: Pfizer to Acquire Metsera for $4.9 Billion; Oracle to Secure TikTok Algorithm in Proposed Deal": 0.5,
  "Markets And Gold Are Both Hitting ATHs. Last Time That Happened Was... - COVID, which as a rare global event driven by a pandemic. Then, before that, in 2007. Right before it hit the fan in 2008 with the financial crisis. Historically, gold and the markets have been divergent. When people are optimistic, they pile into the markets. When they get worried, they move into gold. It's pretty rare to see them both hitting ATHs": 0.2,
  "AMAT Trades 54% Above Its 52-Week Low: Time to Hold or Fold the Stock?": 0.2,
  "$LULU and $UNH seem to be my biggest value plays - I bought shares in both of these a few months ago after Buffet and Burry filed their 13-Fs. Looking at both, I'm up 25% on United Health and down 16% on Lululemon and i bought calls on both again this morning. They're great value plays, will only improve in the future. Rate cuts inevitably help UNH along with the new 4 stra rating, and": 0.8,
  "Disney vs. Netflix: Which Streaming Giant Has an Edge Right Now?": 0.2,
  "Should You Buy the 3 Highest-Paying Dividend Stocks in the Nasdaq?": 0.2,
  "Apple, Teradayne, Netflix & AB InBev deal: Trending Tickers": 0.2,
  "Vantiva’s Cobra 5G Router Earns T-Mobile Certification, Expanding 5G Access for MVNO Ecosystems": 0.6,
  "Baker Hughes Extends Stimulation Vessels Deal with Petrobras": 0.5,
  "SNY & REGN's Dupixent Receives CHMP Backing for Urticaria in EU": 0.5,
  "ODFL Stock Down 26.2% Y/Y: Will the Plunge Continue Throughout 2025?": -0.6,
  "Will Paychex (PAYX) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Cocoa Prices Sink as Ivory Coast Cocoa Crop Prospects Improve": -0.8,
  "Magnum ice cream company to use NotCo AI for new products": 0.5,
  "Nvidia will Invest up to $100 Billion in OpenAI - https://www.cnbc.com/2025/09/22/nvidia-openai-data-center.html >\"Nvidia will invest $100 billion in OpenAI as the artificial intelligence lab sets out to build hundreds of billions of dollars in data centers based around Nvidia’s AI chips, the companies said on Monday. >OpenAI plans to operate Nvidia systems that require 10 gigawatts of power, the companies said on Monday. A gigawatt is a measure of power that is increasingly being used to": 0.6,
  "T-Mobile Is Moving Gopalan to CEO, Replacing Sievert": 0.1,
  "Coca-Cola Builds on Away-From-Home Recovery: How Durable Is It?": 0.2,
  "lululemon Trades Near 52-Week Low: Buy Opportunity or Time to Sell?": 0.2,
  "Tom Lee's BitMine Buys $1.1 Billion in Ethereum and Sells Stock, Shares Fall 10%": -0.6,
  "Is PepsiCo's Gatorade Strategy Enough to Fend Off Its Rivals?": 0.2,
  "A comprehensive list of 2025 tech layoffs": -0.5,
  "T-Mobile's new CEO Srini Gopalan faces pressure to fend off rivals": -0.5,
  "The Only Mag 7 to not hit all time highs this year: Apple and Tesla - Looks like Tesla is about 40 points off its all time high and Apple about $4-5 as of this post. Heard Joe Teranova say that money managers will be chasing these two names until years end to get performance as they other 5 have already outperformed. What do you think? Buy Apple and Tesla into years end and play": 0.6,
  "Coca-Cola vs. Keurig Dr Pepper: Which Beverage Stock Has the Edge?": 0.2,
  "ASML Invests 1.3B Euro in Mistral AI: Will it Deliver Growth?": 0.5,
  "Better Home & Finance stock soars again as investor behind Opendoor rally calls it 'Shopify of mortgages'": 0.8,
  "MercadoLibre launches new B2B unit to tap corporate market": 0.5,
  "3 oncology stocks I’m watching right now! - Barclays recently highlighted several opportunities in the Oncology and I&I sector, which made me take a closer look at healthcare stocks. After digging, I narrowed it down to 3 that caught my attention: 1. Eli Lilly (LLY) – With its advanced immuno-oncology pipeline and existing blockbusters, it feels almost unavoidable. What stands out is their ability to diversify revenue while staying a leader in such a competitive": 0.8,
  "Adobe vs. Figma: Which Creative Software Stock Holds an Edge?": 0.2,
  "Why Applied Materials (AMAT) Stock Is Up Today": 0.5,
  "Why Is Teradyne (TER) Stock Soaring Today": 0.5,
  "Where does the massive Nvidia-OpenAI deal leave Microsoft? - With the news that Nvidia is investing up to $100 billion into OpenAI, primarily for infrastructure, I'm trying to understand the strategic implications for Microsoft. For years, Microsoft has been seen as OpenAI's exclusive partner, providing the Azure cloud infrastructure and integrating OpenAI's models deeply into its ecosystem. They had a deal for a huge chunk of OpenAI's profits and seemed to be in the driver's": 0.2,
  "Better Home & Finance stock soars after Eric Jackson’s bullish call": 0.8,
  "Chip Equipment Sales Are Booming. These Two Stocks Just Got an Upgrade.": 0.8,
  "Netflix signs co-marketing deal with AB InBev": 0.2,
  "IREN Expands AI Cloud Capacity: Is the Growth Thesis Strengthening?": 0.5,
  "Profit questions - This might be a dumb question but bear with me please. When should you take out profits? Is there a % like once you have 10% gains sell and then buy back when it dips again? Or if it’s something you plan on holding do you just ignore profits? I have different stocks where I only have 4 or 5 shares so my profit is $10-50. Seems kinda silly to cash out": -0.5,
  "In a low rates environment, nearly all equities are winners. Why stocks only go up. (For now). - It feels like, no matter the bad news, equities just keep climbing. Here’s the(my) reasoning as to why this is happening and why it'll likely continue. First, let’s state the obvious: we’re not in a low-rate environment right now. However there are some things happening that are leading to one. Regardless of your views of the current": 0.6,
  "What's to stop AI companies from just continuing to invest in each other? Do we think profit will eventually matter? - A lot of people were dubious about how OpenAI would be able to afford the (up to) $300 billion contract they signed with Oracle.. well now we know part of the answer is Nvidia investing (up to) $100 billion into OpenAI And both companies (OpenAI and Oracle) will spend the majority of their compute": 0.2,
  "Bitcoin, Ethereum, and XRP Tumble. Why Cryptos Are Slumping Today.": -0.7,
  "Is Workday Stock Underperforming the S&P 500?": -0.5,
  "Have extra cash, NBIS or HOOD? - Hey fam, have some extra cash gonna trim from high yield savings. I’ve been long on Robinhood and Nbis, but both have been running lately. I am still bullish on both, but wondering where I can put this cash to use. Hold length is anywhere from 1-3 years.": 0.5,
  "Can Strategy's Expanding Bitcoin Balance Push the Stock Higher?": 0.5,
  "What to Know in Tech: iPhone Sales Deliver, AI Dominates": 0.5,
  "Cocoa Prices Fall Sharply on Beneficial Rains in the Ivory Coast": -0.8,
  "Budweiser Maker Is Teaming Up With Netflix. It Needs a Wider Audience to Boost Slumping Sales.": 0.2,
  "What are you looking for when options trading? - Ive been dicking around on the stock market for several years now and am starting to give options trading a try. I think i understand the fundamentals of it now im just curious to see what people look for in companies when deciding whether to buy calls or puts? All ears over here.": 0.2,
  "Stock suggestion for a 12 year girl as birthday present - Perhaps a bit weird question but I’m thinking of giving away a stock, or stocks, depending on price, as a birthday present for a 12 year old girl as a sort of “investment” starter kit. I think in time she will appreciate it and actually see the benefits of it as she is pretty “economical” in her thinking already and she is asking me": 0.5,
  "Bitcoin Treasury Firms Are Buying The Dip": 0.6,
  "Bitcoin could join gold on central bank balance sheets in the future, Deutsche Bank says": 0.5,
  "T-Mobile US (NASDAQ:TMUS) Is Paying Out A Larger Dividend Than Last Year": 0.5,
  "Netflix Stock Is Up 40% in 2025 But Wall Street Isn’t Backing Down. Should You Buy NFLX Now?": 0.5,
  "Buying TEVA on Autism Announcement? - Looks like this major announcement is already moving some stocks. Kenvue (Tylenol) stock is taking a beating. I'm reading that the Administration will be stating Leucovorin as a benefit/way to reduce risk. Thoughts on how companies like Teva Pharmaceutical will benefit from this news, since they are a major player on this treatment? By no means am I advocating one way or another as I'm no scientist/doctor, nor asking": 0.2,
  "Sector Update: Consumer Stocks Decline Late Afternoon": -0.5,
  "Sector Update: Health Care Stocks Advance Late Afternoon": 0.5,
  "Remember Luckin Coffee Stock? China’s Viral Coffee Company Is Now in the U.S., and LKNCY Shares Are Up 46% This Year.": 0.6,
  "Stock Market Today: Dow Up As Nvidia Pops; EV Play Skids On Warren Buffett Move (Live Coverage)": 0.5,
  "AppLovin's Ad Product Growing Fast, Taking Market Share": 0.8,
  "Charter to Hold Webcast to Discuss Third Quarter 2025 Financial and Operating Results": 0.0,
  "Michael Saylor Says This Is The Reason Why Bitcoin Is Stuck Sideways And Not Breaking Out": 0.1,
  "Heard on the Street Recap: Even Tylenol Can’t Cool This AI Fever": 0.2,
  "Why Lam Research (LRCX) Stock Is Trading Up Today": 0.5,
  "Why The Trade Desk (TTD) Stock Is Up Today": 0.5,
  "Why Keurig Dr Pepper (KDP) Stock Is Down Today": -0.5,
  "Why MicroStrategy (MSTR) Stock Is Down Today": -0.5,
  "Mizuho Raises CrowdStrike (CRWD) Price Target to $475, Maintains Neutral": 0.2,
  "Long Term AI Strategy - AI has been developing rapidly for the last few years and it's becoming clear that it is not going away anymore. Let's zoom out a bit. What is a good strategy to capitalize on a still very young industry with new players joining every day? I'm currently seeing three main segments that drive revenue with a TAM that's rapidly expanding across all three segments: **Infrastructure** Companies like Nvidia, AMD, Microsoft": 0.6,
  "Heineken to buy FIFCO businesses for $3.2 billion in Central America push": 0.5,
  "Piper Sandler Turns Less Bearish on Workday (WDAY) Following Workday Rising": 0.5,
  "Do you think the stock market is in a euphoric stage right now? I'm slightly scared now.. - I’ve been following some recent data and commentary, and it looks like a lot of indicators are flashing “froth” or even outright euphoria. Like the openAI, oracle, nvidia deals. And the everything AI boom with no earnings to back it yet stocks keep going to the moon. It's crazy. Retail traders are very active, margin debt is": -0.6,
  "Starbucks workers take legal action after company refuses to reimburse them for items purchased after dress code changes": -0.8,
  "American Express Platinum Refresh Seen Offering Growth Potential Despite Customer Fatigue: Analyst": 0.5,
  "QUALCOMM Incorporated (QCOM) Collaborates with HARMAN to Reshape the Automotive Cockpit": 0.5,
  "BofA Reaffirms Buy on Workday (WDAY), Maintains $265 Price Target After Analyst Day": 0.6,
  "ASML (ASML) Rises Higher Than Market: Key Facts": 0.5,
  "Can anyone explain why comfort systems USA (FIX) is doing so well? - I got into investing around the GME fiasco and nowadays I invest into index funds (got burned from most things) but I’m up ~900% on FIX. Honestly, it was luck. I had a very basic caveman level idea of ok, global warming, air conditioning, durrrr. I bought FIX because I knew the name. But anyway, these returns are crazy and outlooks are": 0.6,
  "CrowdStrike (CRWD) Gains Momentum as Jefferies Raises Target After Fal.Con": 0.6,
  "Airbnb, Inc. (ABNB) Stock Falls Amid Market Uptick: What Investors Need to Know": 0.1,
  "Warner Bros. Discovery (WBD) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "Intuitive Surgical, Inc. (ISRG) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Strategy (MSTR) Stock Declines While Market Improves: Some Information for Investors": -0.5,
  "Alphabet Inc. (GOOGL) and PayPal announced a Multiyear Strategic Partnership to Advance Commerce Solutions Across Google’s Platforms and Devices": 0.6,
  "Oklo Breaks Ground on First Aurora Powerhouse - https://www.foxbusiness.com/video/6379935505112 *Oklo Inc today holds a groundbreaking ceremony at Idaho National Laboratory (INL) for its first Aurora powerhouse, the Aurora-INL. The event will feature opening remarks from Oklo co-founder and CEO Jacob DeWitte and INL Director John Wagner, keynote remarks from U.S. Environmental Protections Agency Administrator Lee Zeldin, and brief remarks from officials including Idaho Governor Bradley Little, Utah Governor Spencer Cox, U.S. Senators Mike Crapo and": 0.6,
  "QUALCOMM Incorporated (QCOM)’s SVP & CAO Patricia Y. Grech Sells Roughly $44,067 Worth of Shares Under a Pre-Arranged Rule 10b5-1 Plan": -0.5,
  "Axon Enterprise, Inc. (AXON)’s CEO Patrick W. Smith Sells Roughly $7.4 Million Worth of Shares Under a Pre-Arranged Rule 10b5-1 Trading Plan": -0.5,
  "KLA (KLAC) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "T-Mobile Names Srini Gopalan Next CEO In Succession Plan": 0.5,
  "TradFi Dump MSTR Stock on Saylor’s Head After 100M Bid": -0.6,
  "Amazon.com, Inc. (AMZN)’s Amazon Web Services (AWS), Sony Honda Mobility (SHM), and Qualcomm Announces Major Progress on SHM’s Next-Generation AFEELA Smart EV": 0.6,
  "Mirror founder Brynn Putnam to unveil her gaming hardware startup at TechCrunch Disrupt 2025": 0.5,
  "The Boeing Company (BA) and Honeywell Sued by Air India Crash Victim Families": -0.8,
  "Axon Enterprise, Inc. (AXON) In Advanced Talks to Buy Emergency Response Startup, Prepared: Report": 0.5,
  "Chinese Coffee Chain Wants To De-Throne Starbucks, But Experts Say Its Business Model Will Never Work": -0.6,
  "Gold hit a record and silver’s at a 14-year high, analyst says two other commodities will join the party - https://www.marketwatch.com/story/gold-hit-a-record-and-silvers-at-a-14-year-high-this-wall-street-bank-says-two-other-commodities-will-join-the-party-76453ced “We see the gold and silver bull market broadening and eventually shifting into copper and aluminum during 2026, driven by the prospect of new dovish Fed leadership (by May/June 2026) and related lower U.S. real interest rates and downward pressure on the dollar,” wrote a team led by Maximilian Layton, global head of commodities.": 0.6,
  "Why Earnings Season is Critical": 0.0,
  "You’re just getting scraps from the stock market. Here’s where the big money is made.": 0.2,
  "(Item 1.01) Entry into a Material Definitive Agreement On September 23, 2025, Semiconductor Components Industries, LLC, a wholly-owned subsidiary (“ SCI LLC ”) of ON Semiconductor Corporation (“ onsemi ”), entered into a Master Framework Agreement (the “ Master Framework Agreement ”) with Ningbo Aura Semiconductor Co., Ltd., Aura Semiconductor Pvt. Ltd., Shaoxing Yuanfang Semiconductor Co. Ltd., Aura Semiconductor Limited and Aim Core Holdings Limited (collectively, the “ Aura Entities ”) whereby, among other things, SCI LLC": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On September 23, 2025 , Micron Technology, Inc. (the \"Company\", \"we\" or \"our\") announced the financial results for our fourth quarter and full year of fiscal 2025 ended August 28, 2025. The full text of the press release issued in connection with the announcement is attached as Exhibit 99.1 to this Current Report on Form 8-K. The information in\n\n(Item 2.02) and Exhibit 99.1 of this Current Report on Form 8-K shall not be deemed \"filed\" for the purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), or otherwise subject to the liabilities of that section. The information in\n\n(Item 2.02) and Exhibit 99.1 of this Current Report on Form 8-K shall not be incorporated by reference into any filing or other document pursuant to the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such filing or document.": 0.1,
  "3 Top Dividend Stocks I Wouldn't Hesitate to Buy With $1,000 Right Now": 0.5,
  "This Ridiculously Cheap Warren Buffett Stock Could Make You Richer": 0.8,
  "Was ORCL jump on Sept 9 just insider trading? - Oracle is up 87% in just a few months. Its biggest surge was on Sept 9 when it jumped from 240 to 345. Now the media on that day had about a million explanations for the outsized jump including Ai, backlogs and the projected outlook. I just cant help but think the TikTok deal was built into that outlook. Oracle said they signed 3 multi": 0.2,
  "Heineken Buys Central American Assets in $3.2 Billion Deal": 0.5,
  "Is Costco a Buy, Sell, or Hold in 2025?": 0.0,
  "All Aboard: Agoda Unveils Asia's Most Scenic Train Journeys": 0.8,
  "Using documentaries to find opportunities - So I just today watched this documentary about the rising space industry that aired last year https://www.rottentomatoes.com/m/wild_wild_space And can’t help but notice of the 3 companies mentioned, 2 (RocketLab and Planet Labs) have been 10-baggers since with room to grow. Is there any source for such documentaries/films which allows us to learn about potential investments before the hype wave catches them? Does anyone have a watchlist of production companies/series": 0.6,
  "Cintas Earnings: What To Look For From CTAS": 0.0,
  "Build-A-Bear (BBW) is on a bull run! - BBW is up 66% YTD, up 119% over the last year, and up 2,481% over the last 5 years. All of your wives, girlfriends, and kids are buying Labubu's, but you should be buying some BBW. Why isn't BBW getting coverage here yet? Is this just the start, or time to buy some puts?": 0.6,
  "ASML Stock Upgraded: Morgan Stanley Sees Big Upside Ahead": 0.8,
  "Applied Materials (AMAT) in Focus: Morgan Stanley Hikes Price Target to $209": 0.8,
  "Unpacking Q2 Earnings: Vertex Pharmaceuticals (NASDAQ:VRTX) In The Context Of Other Therapeutics Stocks": 0.2,
  "I Believe it’s Possible For Kenvue ($KNVU) To Sue The Administration And Win Sending The Stock Price - let’s dive into the latest drama surrounding Kenvue (KVUE), the consumer goods giant that spun off from Johnson & Johnson. The stock has taken a beating recently due to President Trump and RFK Jr’s comments linking Tylenol use during pregnancy to autism. Here’s a breakdown of the situation and what it might mean for investors. The Controversy:": 0.5,
  "Q2 Rundown: Take-Two (NASDAQ:TTWO) Vs Other Consumer Internet Stocks": 0.1,
  "3 Reasons ZS Has Explosive Upside Potential": 0.8,
  "3 Reasons to Sell ON and 1 Stock to Buy Instead": -0.5,
  "KLA Corporation (KLAC): Buy, Sell, or Hold Post Q2 Earnings?": 0.2,
  "Eaton and Westcon-Comstor Malaysia partner to enhance power quality for customers": 0.5,
  "1 Growth Stock with All-Star Potential and 2 We Question": 0.2,
  "3 Consumer Stocks We Think Twice About": -0.5,
  "3 Market-Beating Stocks with Exciting Potential": 0.8,
  "3 Volatile Stocks We Steer Clear Of": -0.5,
  "1 Safe-and-Steady Stock with Exciting Potential and 2 We Question": 0.5,
  "How the $100K H-1B Visa Fee Will Hurt U.S.-India Ties—and Companies": -0.5,
  "Heard on the Street Tuesday Recap: Even Tylenol Can’t Cool This AI Fever": 0.2,
  "Powell Speech, Inflation Data, Costco Earnings: What to Watch This Week": 0.5,
  "Should You Forget Starbucks? Why You Might Want to Buy This Unstoppable Growth Stock Instead.": 0.5,
  "1 Unstoppable Artificial Intelligence (AI) Stock That Could Soar 325% by 2036": 0.8,
  "Where Will Constellation Energy Be in 5 Years?": 0.2,
  "MSFT, OpenAI and NVDA: Tightly integrated - 21 Aug 2025: MSFT, OpenAI and NVDA co-authored and published this paper. **Power Stabilization for AI Training Datacenters** https://arxiv.org/abs/2508.14318 \"Power stabilization is emerging as a critical bottleneck in the continued scaling of AI training workloads. In this paper, we detailed the impact such workloads can lead to, and gave examples of the specifications needed for mitigation. We have presented a cross-stack approach that combines software-based smoothing, GPU-level controls,": 0.5,
  "Crypto treasury buybacks signal ‘death rattle’ for Strategy copycats, analyst says": -0.6,
  "Warren Buffett Sold 6 Stocks in Q2. Here's Why 1 of Them Could Still Be a No-Brainer Buy.": 0.5,
  "Is ASML Stock a Buy Now?": 0.0,
  "Trending tickers: Nvidia, Better Home & Finance, TUI, Kingfisher and Raspberry Pi": 0.0,
  "KPMG integrates CrowdStrike tech to strengthen cybersecurity": 0.5,
  "Can someone try to explain the uptrend of the market to me? - Hi fellow investors, I am probably not the only one that sees the gap between perceived reality and the market. Still, I am wondering if there are factors I do not take into consideration. It makes sense that the ones with money made the most since Covid and that there are sectors such as AI, that serve as investment vehicle. But is": 0.1,
  "$WRD highlights of Sep 2025 - Singapore launch with Grab: weride is actually rolling GXRs + robobus in SG now under grab's Ai.R thing. LTA picked them as the only av service for 2 routes in punggol. both cars already passed milestone 1 safety test which is no joke in SG, service supposed to take real passengers early 2026 but they're already doing route familiarization this week. got safety ops onboard for now but tech": 0.6,
  "Should You Buy CrowdStrike Stock Before 2035?": 0.1,
  "r/Stocks Daily Discussion & Technicals Tuesday - Sep 23, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on technical analysis (TA), but if TA is not your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly": 0.2,
  "AB InBev teams with Netflix for co-branded campaigns around live events": 0.5,
  "Huawei unveils 3-year plan to challenge Nvidia’s AI chip dominance with “SuperPod” clusters and faster interconnect tech - No paywall: [https://finance.yahoo.com/news/huawei-plans-three-campaign-overtake-052622404.html](https://finance.yahoo.com/news/huawei-plans-three-campaign-overtake-052622404.html) >(Bloomberg) -- Huawei Technologies Co. openly admits its silicon can’t match Nvidia Corp.’s in raw power and speed. So to pack the same punch, China’s national champion is counting on its traditional strengths: brute force, networking, and policy support. >Huawei on Thursday took the rare step of publicizing a three-year vision for eroding Nvidia’s": 0.2,
  "onsemi to Acquire Vcore Power Technology from Aura Semiconductor to Strengthen AI Data Center Leadership": 0.6,
  "De minimis elimination strains Lululemon’s fulfillment model": -0.5,
  "Stock Index Futures Muted Ahead of U.S. PMI Data and Powell’s Speech": 0.2,
  "Some PepsiCo investors are still cautious about Elliott's plan to spin out bottling": -0.5,
  "Some PepsiCo investors cautious of Elliott's plan to spin out bottling": -0.5,
  "Bear of the Day: Synopsys (SNPS)": 0.0,
  "How to manage my Ørsted holdings - I have a small holding in the Danish energy engineering company Ørsted A/S (ORSTED:CPH). Recently, Interactive Brokers notified me of the subscription rights offering, and I chose a number of share rights that I'd like to participate. What I thought would happen next, is that I'd need to have cash in the account on the upcoming date September 29th in order to get the new \"ORSTED T\" shares.": 0.2,
  "Exclusive-Accenture proposes new campus in India's Andhra Pradesh, eyes adding 12,000 jobs": 0.8,
  "Silicon Valley Confusion Over H-1B Visa Spurs Tech Plunge in India": -0.5,
  "Better Crypto Buy: Bitcoin vs. Strategy (MicroStrategy)": 0.5,
  "PayPal probed on China ties": -0.5,
  "Stable integrates PayPal USD to expand financial transactions": 0.5,
  "Keurig Dr Pepper (NASDAQ:KDP) Has Affirmed Its Dividend Of $0.23": 0.5,
  "Marvell Technology (NASDAQ:MRVL) delivers shareholders favorable 14% CAGR over 5 years, surging 12% in the last week alone": 0.8,
  "A Look At The Fair Value Of Honeywell International Inc. (NASDAQ:HON)": 0.2,
  "Amgen (NASDAQ:AMGN) jumps 4.2% this week, though earnings growth is still tracking behind three-year shareholder returns": 0.2,
  "MercadoLibre (NasdaqGS:MELI) Valuation: Exploring Impact of New B2B Launch and Strong Growth Momentum": 0.8,
  "Could Rising Intel Investment Spur a New Demand Cycle for KLA (KLAC) Equipment?": 0.5,
  "PepsiCo (PEP): Assessing Valuation After Recent Share Price Fluctuations": 0.1,
  "A Fresh Look at Qualcomm (QCOM) Valuation Following New Automotive AI Partnerships": 0.6,
  "Does Cisco Stock Still Offer Value After 33% Gain and Digital Infrastructure Push?": 0.5,
  "Reviewing PDD Holdings (NasdaqGS:PDD): Is There More Value Ahead After Recent Share Price Movement?": 0.5,
  "IonQ Achieves Significant Quantum Internet Milestone, Demonstrates Quantum Frequency Conversion to Telecom Wavelengths": 0.8,
  "Netflix (NFLX): Assessing Valuation as Growth Slows After a Year of Strong Returns": 0.5,
  "Is Applied Materials’ Surge Justified After US Chip Investment News in 2025?": 0.2,
  "Is Comcast Primed for a Rebound After Job Cuts in Its Largest Division?": 0.5,
  "US FDA declines to approve Scholar Rock's muscle weakness drug; shares fall": -0.8,
  "How T-Mobile’s CEO Transition at Deutsche Telekom (XTRA:DTE) Has Changed Its Investment Story": 0.2,
  "Best Stock to Buy Right Now: Amazon vs. MercadoLibre": 0.5,
  "AppLovin (APP): Exploring Valuation After Recent Surge in Investor Interest": 0.5,
  "5 Cybersecurity Stocks to Buy for a Strong and Secured Portfolio": 0.8,
  "Down 42%, Should You Buy This Top Growth Stock With $10,000 Right Now?": 0.2,
  "Spotlighting AAON And 2 Other Top Growth Stocks With Insider Ownership": 0.5,
  "This Week In Energy Transition - Battery Storage Powers Forward With Project Alamo City": 0.5,
  "3 Stocks That May Be Undervalued By Up To 49%": 0.5,
  "Innovation Beverage Group Announces Reverse Stock Split": 0.1,
  "ON Semiconductor To Acquire Aura's Vcore Power Tech": 0.5,
  "Medallia Expands Strategic Partnership with Adobe, Integrating with New AI Agents for Enhanced Customer Experiences": 0.8,
  "GraniteShares launches new YieldBOOST ETFs on MSTR (MTYY) and PLTR (PLYY).": 0.5,
  "Empower Appoints Sangita Woerner as Chief Marketing Officer": 0.5,
  "One Year Later: Crane Clean Energy Center Still in the Spotlight and Ahead of Schedule": 0.8,
  "Estimating The Fair Value Of Baker Hughes Company (NASDAQ:BKR)": 0.1,
  "Baird downgrades Lululemon on low growth and margin visibility": -0.7,
  "ISRG SP Platform's Expansion in Korea and Europe Gains Traction": 0.6,
  "American Superconductor (AMSC): real revenue, big cash, defense/grid tech, and increasing power demands but next to no discussion? - AMSC posted Q1 FY2025 revenue of $72.4M (≈ +80% YoY), GAAP net income of about $6.7M, and $213 million cash on hand after a $115M offering, a multi-year $200 million backlog from defense and industrial orders, and an accretive acquisition that improves margins. That combination makes AMSC one of the cleaner mid-cap growth plays I’ve seen": 0.8,
  "Chicago Fed releases interim unemployment estimate, with September at 4.3%": 0.2,
  "Analyst Says You Should Buy This Non-AI Stock With ‘Huge’ Market Share": 0.8,
  "Aurigo Software Expands Autodesk Integration to Offer Integrated Capital Planning to Facility Owner-Operators": 0.5,
  "Vertex Partners with Basketball World Champion Jayson Tatum to Raise Awareness of JOURNAVX®, a Non-Opioid Medicine Approved for the Treatment of Moderate-to-Severe-Acute Pain": 0.8,
  "Marriott International and Hawkins Way Capital Announce Five Signed Agreements to Launch Series by Marriott™ in the United States": 0.5,
  "Intuit Rapidly Advances GenOS to Accelerate Development of Agentic AI Experiences at Scale": 0.6,
  "Comcast Connects First Homes in the Town of Buchanan, VA to Reliable, High-Speed Internet From Xfinity": 0.6,
  "AHEAD Achieves Zscaler Data Security Delivery Specialization": 0.5,
  "Testkube Raises $8M Series A to Help Software Quality Keep Pace With AI Development Velocity": 0.6,
  "Investors Heavily Search Datadog, Inc. (DDOG): Here is What You Need to Know": 0.5,
  "Zscaler, Inc. (ZS) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "These 2 Computer and Technology Stocks Could Beat Earnings: Why They Should Be on Your Radar": 0.6,
  "Cisco Systems, Inc. (CSCO) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Here is What to Know Beyond Why Applied Materials, Inc. (AMAT) is a Trending Stock": 0.2,
  "CrowdStrike (CRWD) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Here is What to Know Beyond Why Constellation Energy Corporation (CEG) is a Trending Stock": 0.2,
  "From the First Tee to Final Roar, T-Mobile Supercharges the Ryder Cup with 5G": 0.6,
  "Costco Q4 Earnings Preview: Is Now the Right Time to Buy the Stock?": 0.5,
  "Keepr.Co Closes $400,000 Crowdfund, surpassing $1.3 Million in Total Funding": 0.8,
  "Companies are loudly calling themselves ‘AI-first.’ Are they helping or hurting their own brands?": 0.2,
  "Quantum Computing Stocks: IonQ Claims Telecom Advance": 0.5,
  "Semler Scientific Still Has Nearly 170% Upside After Strive Buyout Deal: Benchmark": 0.8,
  "CrowdStrike to Buy Pangea: Will AIDR Unlock a New Growth Engine?": 0.5,
  "Lung Cancer Research Foundation and Oncology Advocates United for Climate and Health - International Announce New Research Collaboration": 0.5,
  "Network API Market Surges to $6.13 billion by 2030 - Dominated by Ericsson (Sweden), Nokia (Finland), Cisco (US)": 0.5,
  "Is It Worth Investing in Intuit (INTU) Based on Wall Street's Bullish Views?": 0.5,
  "Wall Street Analysts See Analog Devices (ADI) as a Buy: Should You Invest?": 0.5,
  "Is CSX (CSX) Outperforming Other Transportation Stocks This Year?": 0.5,
  "CoreWeave upgraded, Lululemon downgraded: Wall Street's top analyst calls": 0.2,
  "1 Growth Stock Down 40% to Buy Hand Over Fist Right Now": 0.6,
  "Sustainability 101 at Cisco: What Is Packaging Sustainability?": 0.2,
  "Blockchain That Scales Like Netflix: 'Trust In This Industry Doesn't Come From Slogans,' Shardeum Founder Nischal Shetty Tells Benzinga": 0.5,
  "Here's Why Lam Research (LRCX) is a Strong Momentum Stock": 0.6,
  "Keybanc bearish on Lam Reaserch, positive on Applied Material": 0.5,
  "Fold Teaming With Stripe for Its Bitcoin Rewards Credit Card": 0.5,
  "Update: Market Chatter: European Union to Scrutinize Microsoft, Apple, Google Over Online Financial Scams": -0.5,
  "Paychex (PAYX) Reports Next Week: Wall Street Expects Earnings Growth": 0.5,
  "The 7.5% return this week takes Warner Bros. Discovery's (NASDAQ:WBD) shareholders one-year gains to 136%": 0.8,
  "The AI boom is unsustainable unless tech spending goes ‘parabolic,’ Deutsche Bank warns: ‘This is highly unlikely’ - https://fortune.com/2025/09/23/ai-boom-unsustainable-tech-spending-parabolic-deutsche-bank/ > On the heels of Nvidia’s $100 billion investment in OpenAI, two research notes out today suggest the current boom in AI may be unsustainable. > > “AI machines - in quite a literal sense - appear to be saving the U.S. economy right now,” George Saravelos of Deutsche Bank wrote to clients. “In the absence": 0.1,
  "Accel Entertainment taps Kraft Heinz alum as CFO": 0.5,
  "Baidu or Alibaba? Why This Is the Stock to Play China’s AI Boom.": 0.5,
  "Pre-markets Flat Following AI Tech Boost": 0.2,
  "Fortinet's Geographic Mix Improves: Can EMEA Drive More Upside?": 0.5,
  "lululemon Q2 Metrics: Margin Squeezes as Tariffs & Markdowns Bite": -0.6,
  "Here’s Why T-Mobile (TMUS) Slid 10% in Q2": -0.5,
  "Zoom's Global Expansion Picks Up: A Sign of More Upside?": 0.6,
  "Indian EV startup Ultraviolette open to licensing battery tech to add revenue stream": 0.5,
  "Pre-Markets Flat After Record-High Level": 0.2,
  "/C O R R E C T I O N -- Testkube/": 0.0,
  "Harnessing the Sun at Kingsburg": 0.0,
  "Trump’s paracetamol claims wipe billions off UK drugmakers": -0.7,
  "AutoZone Stock Falls After 5th Straight Earnings Miss. Why It’s Still Up 29% This Year.": -0.5,
  "Axon to acquire AI-powered 911 communications company Prepared, strengthening the public safety ecosystem from call to closure": 0.6,
  "Honeywell's Industrial Automation Weakness Persists: What's the Road Ahead?": -0.5,
  "Zacks Investment Ideas feature highlights: Nvidia, CoreWeave, Nebius, Apple, T-Mobile US, Intel and CrowdStrike": 0.2,
  "Implied Volatility Surging for Automatic Data Processing Stock Options": 0.5,
  "Some value names for people who feel everything is expensive - All I see is posts about how expensive everything is and how the market is a bubble, so I figured I'd post some names that are trading at reasonable forward multiples and many which are well off their recent highs. I'm long most of these names and am happy to explain the rationale for each in the comments. The majority trade at a significant": 0.5,
  "Media companies have 'moral obligation' to uphold free speech": 0.5,
  "CoStar Group Named Among CRE’s Best Places to Work by GlobeSt.": 0.6,
  "Tesla, Lululemon, Johnson & Johnson: Top analyst calls": 0.5,
  "Mid-Market Growth: Will Intuit Unlock Its Biggest Lever?": 0.5,
  "Costco's Supply Chain Strength Could Be Its Secret Weapon Against Tariff Pressures": 0.6,
  "Jim Cramer Wonders Whether There’s More To Warner Bros. Discovery (WBD) Reported Deal Than Meets The Eye": 0.2,
  "Jim Cramer Discusses Reports Of Paramount Skydance (PSKY) Acquiring Warner Bros.": 0.5,
  "CRSP & Sirius Begin Dosing in Thromboembolic Disorder Study in EU": 0.5,
  "NY Cocoa Prices Rebound as Nigerian Cocoa Exports Fall": 0.5,
  "Even if the AI bubble bursts its value will remain": 0.5,
  "T-Mobile Seen Adding Millions Of New Customers Each Year Despite Sluggish Economy": 0.8,
  "BofA starts Atlassian at Neutral; growth story clouded by transition and deals": -0.5,
  "Y Combinator, Base and Coinbase Ventures Launch ‘Fintech 3.0’ as Finance Goes On-Chain": 0.5,
  "Metals and minerals etf - Does anyone know a similar metals and minerals etf like ‘Sprott Active Metals and Miners ETF’. I can’t buy that one - it’s quite new. Not supported on my platforms. I was looking for a mix of miners in metals (uranium and lithium) and rare earth minerals for long term hold due to the need of a range of these substances for chips. I’m quite new to investing so not": 0.2,
  "EU targets Apple, Google and Microsoft over online financial scams": -0.5,
  "Atlassian (TEAM) Stock Trades Down, Here Is Why": -0.5,
  "Fold Stock Pops, Then Plunges After Revealing Bitcoin Rewards Visa Credit Card Plans": -0.5,
  "Is This Mean Reversion in MicroStrategy Stock a Buying Opportunity in the Bitcoin Proxy?": 0.2,
  "Credit Card Giants Visa and Stripe Team Up With Fold to Launch Bitcoin Rewards Card – Wall Street Coming to Crypto?": 0.5,
  "Update: Market Chatter: EU Set to Examine Microsoft, Apple, Google on Financial Scam Risks": -0.5,
  "Lululemon Downgraded. Decades-Low Valuations Aren’t Tempting This Analyst.": -0.7,
  "T-Mobile CEO sends Apple iPhone message": 0.1,
  "Exelon to intensify push to own Mid-Atlantic power plants, CEO says": 0.2,
  "NY Cocoa Prices Climb as Supplies Tighten": 0.5,
  "Fashion Retail’s $6 Billion Potential in AI Cost Savings": 0.5,
  "Fed Chief Powell says stock prices appear 'fairly highly valued' - https://www.cnbc.com/2025/09/23/fed-powell-stock-prices-appear-fairly-highly-valued.html > Federal Reserve Chair Jerome Powell on Tuesday noted that asset prices, a category that typically includes stocks and other risk instruments, are at elevated levels. During a speech in Providence, Rhode Island, the central bank leader was asked how much emphasis he and his colleagues place on market prices and whether they have a higher tolerance for higher values. > “We do": -0.6,
  "Poppi soda’s $8.9 million settlement: Customers can claim payouts—but the deadline is this week. Here’s how to file": 0.1,
  "Robinhood CIO says investors should watch Opendoor and Better Home stocks carefully": 0.5,
  "Intel (INTC) Stock Trades Up, Here Is Why": 0.5,
  "Why Regeneron (REGN) Stock Is Down Today": -0.5,
  "Why Sally Beauty (SBH) Stock Is Up Today": 0.5,
  "EU seeks fresh delay to deforestation rules amid IT headaches": -0.5,
  "Upland Software, Shopify, Domo, Five9, and GoDaddy Stocks Trade Down, What You Need To Know": -0.5,
  "Sector Update: Energy Stocks Rise Late Afternoon": 0.5,
  "Palantir Stock Has Done This For Five Straight Months. Trump's UK Visit Could Extend That.": 0.2,
  "This Nuclear Stock Isn't Expected To Report Revenue Until 2027 But Has Surged 570% This Year": 0.5,
  "Boeing's defense and space unit partners with Palantir for AI adoption": 0.5,
  "These Stocks Moved the Most Today: Kenvue, Nvidia, Firefly Aerospace, Boeing, Halliburton, Micron, Vistra, and More": 0.2,
  "Selling Bad Stock to Offset Taxes - I made about 20k in a stock this year, sold it a few days ago, which means I'll be taxed on the profits. I bought a new stock, and it's down about 2k already. At first glance, things look bad on the new stock, but if I sell and take the 2k loss, aren't I simply helping offset the taxes I'll have to pay on the 20k gain?": 0.2,
  "Biogen Provides Regulatory Update on High Dose Regimen of Nusinersen": 0.2,
  "Stock Market Today: Nasdaq, S&P 500 End Winning Streaks; Nvidia, Amazon Weigh On Dow (Live Coverage)": -0.5,
  "US FDA declines to approve higher dose of Biogen's genetic disorder drug": -0.8,
  "META: WhatsApp introducing Message Translations on Android and iPhone - https://blog.whatsapp.com/introducing-message-translations \"With more than 3 billion users in over 180 countries, we’re always working to keep our users closely connected, no matter where they are in the world. But we understand that sometimes language can be a barrier to getting things done or expressing how you truly feel. That's why we’re excited to bring message translations to WhatsApp, so you can more easily communicate across": 0.8,
  "Tech, Media & Telecom Roundup: Market Talk": 0.0,
  "Analyst Says Nvidia ‘Getting Into’ Advanced Micro Devices (AMD) Business With Intel Deal": 0.5,
  "S&P 500 Gains & Losses Today: Vistra Stock Falls; Halliburton Shares Climb as Oil Rises": 0.2,
  "Why Micron's Record Sales and Strong Outlook Are a Bullish Signal for the AI Trade": 0.8,
  "Palantir Technologies Inc. (PLTR) Increases Despite Market Slip: Here's What You Need to Know": 0.5,
  "The Trade Desk (TTD) Gains As Market Dips: What You Should Know": 0.5,
  "GlobalFoundries and Egis Partner to Develop Next-Generation Smart Sensing Technology for Mobile and IoT Applications": 0.6,
  "Cadence Design Systems (CDNS) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "Texas Instruments (TXN) Gains As Market Dips: What You Should Know": 0.5,
  "Diamondback Energy (FANG) Gains As Market Dips: What You Should Know": 0.5,
  "Micron's Q4 earnings surpass Wall Street's expectations in latest test of AI trade": 0.6,
  "Fedspeak, KB Home earnings, new home sales: What to Watch": 0.2,
  "Keurig Dr Pepper Moves to Acquire JDE Peet’s While Planning Company Split and Sustaining Dividend": 0.5,
  "VOO vs VYM Long-Term - Hi, Been looking at some periodic rebalancing of my holdings in my long-term portfolio, and I'm both in VOO and VYM. I liked having a mix, and VYM is known for its dividend yield, AND also how it weathered the 2022 bear market. I'm having trouble finding the tools on Fidelity to compare both, including their dividends. While VYM only did +76% over the last 5yrs, and VOO around +101%,": 0.2,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On September 19, 2025, Abdurazak Mudesir was elected to the Board of Directors (the “Board”) of T-Mobile US, Inc. (the “Company”), effective immediately. Mr. Mudesir was selected as a designee of Deutsche Telekom AG (“Deutsche Telekom”) pursuant to that certain Second Amended and Restated Stockholders’ Agreement, dated June 22, 2020, by and among the Company, Deutsche Telekom": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On September 24, 2025, Cintas Corporation issued a press release announcing its financial results for the quarter ended August 31, 2025. A copy of the press release is furnished as Exhibit 99 to this Current Report on Form 8-K and is incorporated herein by reference.": 0.0,
  "VeriSilicon Introduces FD-SOI Wireless IP Platform for Diverse IoT and Consumer Electronics Applications": 0.5,
  "(Item 8.01) Other Events. On September 24, 2025, Marvell Technology, Inc. (the “Company”) announced that its Board of Directors authorized a $5 billion addition to the balance of its existing stock repurchase program. In addition to this stock repurchase authorization, the Company announced that it is entering into confirmations, including a supplemental confirmation (collectively, the “ASR Agreement”), of an accelerated share repurchase transaction with a counterparty financial institution (the “Dealer”). Under the ASR Agreement, the Company will": 0.2,
  "(Item 8.01) . Other Events Marshall Wildfire Litigation As previously disclosed, multiple complaints were filed against Public Service Company of Colorado (PSCo) and Xcel Energy Services Inc. (both wholly owned subsidiaries of Xcel Energy Inc. and, together, Xcel Energy) related to the Marshall Fire, which ignited in Boulder County, Colorado in December 2021. On September 23, 2025, Xcel Energy, Qwest Corporation and Teleport Communications America, LLC reached settlement agreements in principle that resolve all claims asserted by": 0.1,
  "This Crypto Stock Has a Business Beyond Digital Currency": 0.5,
  "Prediction: CrowdStrike Will Soar Over the Next 5 Years. Here's 1 Reason Why.": 0.8,
  "Mondelez International Posts Solid Results, Raises Dividend, and Expands Product Line": 0.8,
  "Texas Instruments Delivers Dividend Boost Amid Strong Quarter and Confident Analyst Outlook": 0.8,
  "3 reasons why gold's record-shattering hot streak is still going": 0.5,
  "This recent S&P 500 addition is now the best-performing stock in the index": 0.8,
  "Costco (COST) To Report Earnings Tomorrow: Here Is What To Expect": 0.5,
  "ECB Sees 2029 As Realistic Timeline For Digital Euro Launch, Says Cipollone": 0.2,
  "Starbucks Corporation (SBUX) Dividend Growth Story and its Place in the Best S&P 500 Dividend Stocks": 0.5,
  "Why Honeywell International (HON) Earns a Spot Among the Best S&P 500 Dividend Stocks": 0.6,
  "Analog Devices (ADI) Combines Innovation and Income in the Best S&P 500 Dividend Stocks": 0.8,
  "Applied Materials and GlobalFoundries Partner to Accelerate AI-Powered Photonics": 0.5,
  "Spotting Winners: Datadog (NASDAQ:DDOG) And Software Development Stocks In Q2": 0.5,
  "Q2 Earnings Highlights: Intuit (NASDAQ:INTU) Vs The Rest Of The Finance and HR Software Stocks": 0.2,
  "Q2 Data Analytics Earnings: Palantir Technologies (NASDAQ:PLTR) Earns Top Marks": 0.8,
  "Atlassian (TEAM): Buy, Sell, or Hold Post Q2 Earnings?": 0.2,
  "3 Reasons ADSK is Risky and 1 Stock to Buy Instead": -0.5,
  "1 Nasdaq 100 Stock on Our Buy List and 2 We Avoid": 0.2,
  "1 Safe-and-Steady Stock with Solid Fundamentals and 2 That Underwhelm": 0.2,
  "3 Unpopular Stocks We Keep Off Our Radar": -0.7,
  "Mizuho Reduces PT on Diamondback Energy (FANG) Stock to $176": -0.5,
  "Strategy Inc. (MSTR) to Target $80 Trillion Global Credit Market Opportunity": 0.6,
  "TD Cowen Stays Bullish on Broadcom (AVGO), Backed by Strong Order Momentum": 0.8,
  "Google, PayPal Announce Multiyear Partnership to Revolutionize Digital Commerce with Agentic AI Shopping": 0.8,
  "Broadcom, Lloyds Banking Group Expand Partnership to Accelerate Digital Transformation with VMware, Mainframe Solutions": 0.5,
  "Salesforce, CrowdStrike Partner to Boost AI Security on Agentforce with Falcon Shield, Charlotte AI Integration": 0.6,
  "Cisco, Tata Communications Partner to Integrate Global eSIM Orchestration into IoT Control Center": 0.5,
  "Workday Unveils Data Cloud with Zero-Copy Integration to Databricks, Salesforce, Snowflake for Real-Time Insights": 0.6,
  "Regeneron’s Phase 2 COURAGE Trial Shows Trevogrumab Combination Preserves Lean Mass in Obesity Patients on Semaglutide": 0.5,
  "AMD, VDURA Launch Scalable Instinct GPU Reference Architecture to Boost AI/HPC Performance": 0.6,
  "Datadog Appoints Former WhatsApp, Meta Product Leader Ami Vora to Board of Directors": 0.5,
  "CrowdStrike Launches ‘Threat AI,’ Industry’s First Agentic Threat Intelligence System, to Automate Security Workflows": 0.6,
  "Paramount Skydance Corporation Considering a Bid to Acquire Warner Bros. Discovery (WBD)": 0.5,
  "Wall Street Has a Mixed Opinion About ​Copart, Inc (CPRT), Here’s Why": 0.1,
  "Arthur Hayes Fuels Tether IPO Speculations Amid $500 Billion Valuation Buzz": 0.5,
  "Insider trading - I have a rather interesting question about insider trading. Let's say you love lab testing food at the grocery store for microbes/ contaminants in your own home lab for fun. You dont even work as a scientist for your career, let's say you are a healthcare worker on a hospital. If you detect let's say a very nasty strain of E. Coli on some salad. Nothing in the news has been said": 0.2,
  "Why One Top International Fund Likes Novo Nordisk Stock": 0.5,
  "UK's September 2025 Stock Picks Possibly Trading Below Fair Value": 0.5,
  "Loop 2025 State of Ecommerce Returns Report: UK retailers risk loyalty loss with 78% of returns ending in refunds and lowest exchange rates globally": -0.7,
  "A Once-in-a-Decade Opportunity: 10 Billion Reasons to Pay Attention to This Monster Quantum Computing Company (Hint: Not IonQ)": 0.6,
  "r/Stocks Daily Discussion Wednesday - Sep 24, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.2,
  "Inflation Data, Costco Earnings, Home Sales: Still to Come This Week": 0.2,
  "Zacks Investment Ideas feature highlights: Nvidia, Broadcom, CoreWeave, Dell Technologies and Oracle": 0.5,
  "Zacks Investment Ideas feature highlights: Intel, Advanced Micro Devices, Nvidia and Super Micro Computer": 0.5,
  "Billionaire Stanley Druckenmiller Jettisoned His Fund's Entire Stake in Palantir and Loaded Up on His Favorite Artificial Intelligence (AI) Stock for a 4th Straight Quarter": 0.8,
  "Pharma’s next generation of blockbuster antibodies takes a ‘more is better’ approach": 0.5,
  "Big Tech's AI ambitions are straining the US power grid. Natural gas might be its answer.": 0.1,
  "5 Reasons Costco Stock Deserves a High Valuation": 0.8,
  "Lululemon Is Down 57% in 2025. Is This a Once-in-a-Lifetime Buying Opportunity Before the Stock Goes Parabolic?": 0.5,
  "Mizuho Securities Downgrades Applied Materials (AMAT) to Neutral, Reduces PT": -0.5,
  "Wall Street Bullish on Broadcom Inc (AVGO), After Q3 2025": 0.6,
  "Bank of America Securities Reiterates a Buy on Advanced Micro Devices (AMD)": 0.6,
  "Bank of America Securities Maintains Buy on Intuit Inc (INTU)": 0.6,
  "Wall Street Bullish on Adobe Inc (ADBE), After Q3 2025": 0.8,
  "Lam Research Corporation (LRCX) Collaborates With JSR Corporation": 0.5,
  "Bank of America Securities Raises PT on ​ASML Holding (ASML), Keeps a Buy Rating": 0.6,
  "Eli Lilly's boss calls UK the 'worst' European country for drug prices": -0.8,
  "RF Power Dividers Market Trends, Competitive Strategies and Forecasts Report 2025-2033: Analog Devices, MACOM, Rohde & Schwarz and Marki Microwave Lead Innovation Across Telecom, Aerospace and Defense": 0.6,
  "3 Dividend Stocks Perfect for Millennial Investors": 0.5,
  "3 No-Brainer Growth Stocks to Buy With $1,000 Right Now": 0.8,
  "Is Palantir Stock Still a Buy After Its 135% Gain in 2025? History Says This Will Happen Next.": 0.5,
  "Jim Cramer on Costco: “I’m Willing to Hold it All I Want”": 0.5,
  "Jim Cramer on Adobe: “Organic Growth is What We Want, Not Price-Driven Growth”": 0.5,
  "Jim Cramer on Pepsi: “You Own That Stock, Do Not Trade It”": 0.6,
  "Jim Cramer Recommends DoorDash for Young Investors": 0.5,
  "Jim Cramer Says He Like Okta Because He Likes Identity Management": 0.6,
  "Why ASML, Applied Materials, and Lam Research Are Soaring on Nvidia's Deal With Intel": 0.5,
  "Jim Cramer on Cintas: “I Like it Very Much at These Levels”": 0.8,
  "The Zacks Analyst Blog Highlights Costco Wholesale, Ross Stores, Target and Dollar General": 0.5,
  "Costco's Earnings Are Coming Up. Analysts Like the Stock, But Expect Volatility Ahead.": 0.5,
  "Coming soon: Mars, ABF, Greencore to feature at Next Generation Ingredients conference": 0.5,
  "3 Reasons Palantir Stock Is Massively Overvalued": -0.8,
  "Series by Marriott enters US amid demand for upscale collection brands": 0.5,
  "Prediction: This Stock Will Be Worth More Than Palantir 5 Years From Now": 0.8,
  "Got $3,000? 3 Top Growth Stocks to Buy That Could Double Your Money": 0.8,
  "Kevin O'Leary Says Trump's $100,000 H1B Visa Will Push Innovation Abroad, Points Out Apple, Google Started In A Garage Once": 0.5,
  "Could a $50,000 Investment in This Vanguard AI ETF Turn Into a Million?": 0.5,
  "China's Jiangsu Hengrui to grant license for cancer drug to unit of India's Glenmark": 0.5,
  "Applied Materials Partners With GlobalFoundries To Accelerate Photonics": 0.5,
  "PayPal: A Forgotten Fintech Gem Trading at a Bargain": 0.6,
  "Better Artificial Intelligence (AI) Stock: Palantir vs. Oklo": 0.5,
  "Software sector is a 'great place to make money': How to play": 0.6,
  "Cintas Earnings Preview: What to Expect": 0.0,
  "WeRide was just added to the Nasdaq Golden Dragon Index - Saw this come across the wire earlier and this is certainly a unique one. WeRide, the company that has been creating quite the buzz with their global deployments, and partnerships, has just added themselves to the Nasdaq Golden Dragon Index. What I find interesting is that this index is referenced by a lot of funds seeking exposure to a specific investible tech sector of": 0.6,
  "PayPal Announces a Multi-Year Relationship for U.S. Buy Now, Pay Later Receivables with Funds Managed by Blue Owl Capital": 0.5,
  "Baker Hughes Announces Dates for Third-quarter Earnings Release and Webcast": 0.0,
  "ENHERTU® (fam-trastuzumab deruxtecan-nxki) plus pertuzumab granted Priority Review in the US as 1st-line treatment for patients with HER2-positive metastatic breast cancer": 0.8,
  "Analog Devices (NASDAQ:ADI) Seems To Use Debt Rather Sparingly": 0.5,
  "Shareholders in Atlassian (NASDAQ:TEAM) have lost 23%, as stock drops 3.7% this past week": -0.6,
  "FIS Acquires Goldman Sachs-Backed Start-Up Amount": 0.2,
  "Don’t See This Crypto as a Risk? ‘You’re Dumb,’ According to Dave Ramsey": -0.6,
  "Indian drugmakers Dr Reddy's, Hetero to sell generic HIV prevention drug for $40 a year": 0.5,
  "Nvidia's $100 Billion OpenAI Pact Buys Time in the Custom Chip Race": 0.5,
  "Starbucks (SBUX): Exploring Its Valuation After Recent Share Price Weakness": 0.2,
  "Stocks Mostly Up Pre-Bell as Investors Digest Fed Chair Powell's Latest Comments on Monetary Policy": 0.5,
  "Luckin Coffee (OTCPK:LKNC.Y): Assessing Valuation After Its U.S. Debut and China Market Leadership": 0.5,
  "Market Chatter: NFL Could Reportedly Begin Media Rights Renegotiations in 2026": 0.2,
  "Best Stock to Buy Right Now: Coca-Cola vs. Monster Beverage": 0.5,
  "Are AMD Shares Still Worth the Price After Fresh China Trade Probe?": -0.5,
  "LEQEMBI® (Lecanemab) Approved for the Treatment of Alzheimer’s Disease in Australia": 0.8,
  "'Is OpenAI the next Google or the next Ask Jeeves?', expert asks": 0.2,
  "FDA to priority-review Daiichi Sankyo and AZ’s Enhertu sBLA": 0.2,
  "How the Narrative Around Lam Research Is Shifting With Emerging AI and Semiconductor Trends": 0.5,
  "AI Chips Update - Patmos Transforms Kansas City With AI Datacenter Expansion": 0.6,
  "Will Weaker Freight Volumes Shift the Efficiency Edge at Old Dominion (ODFL)?": 0.1,
  "Exploring 3 High Growth Tech Stocks in the US Market": 0.5,
  "Q3 is poised to be a strong quarter for Tesla: Wolfe": 0.8,
  "Marriott signs agreements to launch Series hotel brand in US": 0.5,
  "The Bull Case For Marriott (MAR) Could Change Following Launch of Series Brand in Five Key US Cities": 0.5,
  "BofA Hikes Palantir Price Target. Boeing Defense Factories Tap Palantir Software.": 0.5,
  "CrowdStrike (CRWD): Reassessing Valuation as Investor Interest Grows Without Clear Catalyst": -0.5,
  "Fastenal Company (FAST) is Growing Amid End Market Weakness": 0.2,
  "Is Samsung Still a Bargain After Tesla’s AI Chip Order Boosts Its Stock in 2025?": 0.2,
  "Does Diamondback Energy’s Share Price Drop Signal Opportunity After Q1 2025 Earnings?": 0.2,
  "Sunrun and BGE Operate Nation’s First Residential Vehicle-To-Grid Distributed Power Plant Using Ford F-150 Lightning Trucks": 0.5,
  "James Moore Technology Services to Expand Regional Footprint Through New Partnership Initiative": 0.5,
  "VoIP-Pal Has Filed and Served Amended Antitrust Complaints Against Apple, Google, and Samsung": -0.5,
  "Apica Addresses Enterprise Observability Cost Crisis with Anti-Vendor-Lock-In Telemetry Pipeline Solution": 0.5,
  "AMD and Cohere Expand Global AI Collaboration to Power Enterprise and Sovereign Deployments with AMD AI Infrastructure": 0.5,
  "A Look at Constellation Energy’s Valuation After Accelerated Nuclear Restart and Microsoft Power Deal": 0.5,
  "How Investors Are Reacting To Booking Holdings (BKNG) Facing EU Scrutiny Under Digital Services Act": 0.1,
  "A Fresh Look at Lululemon (LULU) Valuation as Growth Slows and Competition Heats Up": 0.1,
  "Posthaste: Toronto's condo 'deep freeze' could reshape the housing landscape for years to come, warns RBC": -0.5,
  "Buy 5 Financial Technology Giants Amid Fed's Low-Interest-Rate Regime": 0.6,
  "5 Things to Know Before the Stock Market Opens": 0.0,
  "Lithium america ticker lac question..?? - So I have a question about a position I recently took on lac stock. Apparently after hours there was a trump catalyst and the stock pumped almost 90% h I wanted to sell but I own the canadian exchange ticker so that wasn't an option..since rhen in premarket its fallen abit and hovering around that 65-70% up pre market. from my initial buy in I'm up 100% and I": 0.2,
  "nVent Electric and MarineMax have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Better Artificial Intelligence Stock: ASML vs. Nvidia": 0.5,
  "Cintas Corporation Announces Fiscal 2026 First Quarter Results": 0.0,
  "Here's How Much a $1000 Investment in Autodesk Made 10 Years Ago Would Be Worth Today": 0.5,
  "Here's How Much a $1000 Investment in KLA Made 10 Years Ago Would Be Worth Today": 0.5,
  "PayPal Teams Up With Blue Owl In $7 Billion Buy Now, Pay Later Deal": 0.8,
  "PepsiCo pressured by Elliott to weigh bottling spin-off": 0.1,
  "Latest News In Electric Vehicles - Battery Testing Market Poised for Significant Global Expansion": 0.8,
  "Cintas: Fiscal Q1 Earnings Snapshot": 0.0,
  "4 Crypto-Centric Stocks to Grab Before Bitcoin's Next Rally": 0.5,
  "Boeing Joins Forces With Palantir on AI in Defense": 0.5,
  "Wedbush Adds Palo Alto Networks (PANW) to Best Ideas List, Reaffirms Outperform Rating": 0.8,
  "Truist Sees Strong AI-Driven Growth for CrowdStrike (CRWD)": 0.6,
  "Cantor Fitzgerald Maintains Tesla (TSLA) Buy Rating, Highlights Musk’s Long-Term Incentives": 0.6,
  "Cintas’s (NASDAQ:CTAS) Q3 Sales Beat Estimates But Full-Year Sales Guidance Misses Expectations Significantly": -0.5,
  "Costco Wholesale's Quarterly Earnings Preview: What You Need to Know": 0.2,
  "Exchange-Traded Funds, Equity Futures Higher Pre-Bell Wednesday Amid Fed's Mixed Messaging, AI Hype": 0.2,
  "Cintas Raises Full-Year Guidance. The Stock Sinks Anyway.": -0.5,
  "Here’s What It Costs To Charge a Tesla Monthly vs. Using Gas for a Chevy Silverado": 0.0,
  "Dave Myers, Ex-Palantir Executive, Joins Seekr as EVP to Expand AI Adoption and Customer Integration": 0.5,
  "Digi Z45 Industrial Controller Now Certified on T-Mobile": 0.2,
  "Voxpopme Expands AI Moderator With Smart Probing and Stimulus Testing": 0.5,
  "Global AI In Cybersecurity Market Size Projected to Reach $93 Billion By 2030 Due To Frequent High-Profile Cyberattacks": 0.8,
  "AI Adoption Sees Rapid YoY Growth in Canadian Workplaces": 0.8,
  "Is Most-Watched Stock Intuitive Surgical, Inc. (ISRG) Worth Betting on Now?": 0.2,
  "Tesla, Inc. (TSLA) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Is Trending Stock Strategy Inc (MSTR) a Buy Now?": 0.0,
  "Stocks rebound, Micron earnings, Alibaba AI budget: 3 Things": 0.5,
  "Marvell Announces Additional $5 Billion Stock Repurchase Authorization and $1 Billion Accelerated Share Repurchase Program": 0.8,
  "PayPal Trades Cheaper Than Industry: How to Play the Stock?": 0.5,
  "The Trade Desk vs. Magnite: Which Ad-Tech Stock is the Better Buy Now?": 0.5,
  "Cintas beats Q1 expectations, raises full-year guidance": 0.8,
  "Lam Research Soars 71% in Six Months: Book Profit or Hold LRCX Stock?": 0.5,
  "Sector Update: Financial Stocks Edge Higher Premarket Wednesday": 0.5,
  "TTD's JBP Momentum Hits Record High: Unlocking Durable Growth Ahead?": 0.6,
  "$PATH Toward a Multi-bagger - I have been building my position in PATH for about a year now and am starting to see a recent surge in interest. After noticing a bunch of \"why PATH?\" posts across various subreddits, I decided to provide my thesis: * UiPath's flagship legacy product is currently the MARKET LEADER in enterprise Robotic Process Automation (RPA) - automating repetitive, generally clerical tasks for enterprises by leveraging PATH's \"software robots\" which": 0.6,
  "Micron beats on earnings as company sales rise 46% on AI boom - https://www-cnbc-com.cdn.ampproject.org/v/s/www.cnbc.com/amp/2025/09/23/micron-mu-q4-2025-earnings-report.html?amp_js_v=0.1&amp_gsa=1#webview=1&cap=swipe Micron shares have nearly doubled so far in 2025. The company makes memory and storage, which are important components for computers. Micron has been one of the winners of the artificial intelligence boom. That's because high-end AI chips such as those made by Nvidia require increasing amounts of high-tech memory called high-bandwidth memory, which Micron makes.": 0.8,
  "Just a couple ideas... - Short DIS and go long/calls for RCAT. It's a sad state but... Entertainment and broadcasting companies led the way in previous unsettling times they seem to be doing the same again. We cannot allow this to happen. On the other side of the same coin... We are indeed in unsettling times - RCAT is a maker of unmanned vehicles. They've just unveiled a plan to begin producing watercraft.": 0.2,
  "$CDTX: FDA Minutes Confirm Expanded + Accelerated Phase 3 for Cidara’s Flu Prophylaxis CD388 - In my first post ([CDTX – Is their CD388 “universal flu prophylaxis” the most undervalued clinical-stage blockbuster on the market, or am I missing something?](https://www.reddit.com/r/stocks/comments/1ndt2go/cdtx_is_their_cd388_universal_flu_prophylaxis_the/)) I hinted (very strongly!) that FDA minutes for Cidara's \"End of Phase 2\" meeting could be a major turning point for Cidara. That news is now official, and it’s even stronger than expected: **1. Phase": 0.8,
  "Brokers Suggest Investing in CrowdStrike (CRWD): Read This Before Placing a Bet": 0.5,
  "Amazon upgraded, Adobe downgraded: Wall Street's top analyst calls": 0.2,
  "Why Coinbase Could Be the Netflix of Crypto": 0.6,
  "Here's Why Astrazeneca (AZN) is a Strong Value Stock": 0.8,
  "Cintas (CTAS) Q1 Earnings and Revenues Top Estimates": 0.8,
  "Why This 1 Growth Stock Could Be a Great Addition to Your Portfolio": 0.8,
  "1 AI Stock to Buy and 1 to Avoid in 2025": 0.0,
  "Morgan Stanley downgrades Adobe on GenAI monetization concerns": -0.5,
  "PayPal, Circle and Tether Are Backing Stablecoin L1s": 0.5,
  "Amazon (AMZN) Launches Multi-Channel Fulfillment for Non-Amazon Marketplaces, Boosting Retailer Sales": 0.8,
  "HSBC Downgrades lululemon athletica (LULU) Stock to Hold": -0.5,
  "Meta (META) Unveils AI Glasses at Connect Conference, Stifel Maintains Buy Rating": 0.6,
  "TD Cowen Reduces PT on Strategy (MSTR) Stock": -0.5,
  "Uniform retailer Cintas raises annual forecasts on resilient demand": 0.6,
  "3 days left: Don’t miss your last chance to lock $668 of savings for TechCrunch Disrupt 2025": 0.5,
  "SOUR PATCH KIDS Glow Ups Are Coming to Canada: An Experiential Gummy Candy That Glows Under Blacklight": 0.6,
  "Edgecore Networks Launches AGS8600 – High-Performance GPU AI Server for AI and HPC Workloads": 0.6,
  "Cintas (CTAS) Q1 Earnings: How Key Metrics Compare to Wall Street Estimates": 0.5,
  "'They Want Their Own DoorDash, They're Gonna Be the Ones That Are Paying for It.' Influencer Defends Teaching Money by Making Her Tweens Cover Extras": 0.2,
  "AMD Expands Cohere Partnership To Power Enterprise AI On Instinct Chips": 0.8,
  "The First National Bank & Trust Company of Newtown Expands Partnership with Comcast Business to Support Banking Across Bucks County, PA": 0.5,
  "Is an AI bubble forming? We could be pouring gas 'on the fire.'": -0.6,
  "Gilead Sciences Surges 26.5% YTD: Buy, Sell or Hold the Stock?": 0.2,
  "Tesla Stock Is Rising. Elon Musk Speaks Out on $1 Trillion Pay Package.": 0.5,
  "Cintas Lifts Fiscal 2026 Outlook Following First-Quarter Beat": 0.6,
  "Alibaba Stock Jumps After Chinese Tech Titan Boosts AI Bet": 0.8,
  "Adobe Facing Decelerating Digital Media Recurring Revenue, Morgan Stanley Says": -0.6,
  "Form 8.3 - Aqua Acquisition Sub LLC (an indirect wholly-owned subsidiary of Qualcomm Incorporated)": 0.0,
  "BigBear.ai vs. Palantir: Which AI Defense Stock Is the Better Bet?": 0.5,
  "GLW's Diverse Portfolio Fuels Customer Growth: Will it Drive Revenues?": 0.5,
  "Barclays downgrades Keurig Dr Pepper: Sees elevated noise and uncertainty": -0.6,
  "Micron, Instacart, ServiceNow: Top Analyst Calls": 0.0,
  "MRVL's Carrier Infrastructure Segment Recovering: What Lies Ahead?": 0.5,
  "Micron Forecast Fails to Satisfy Investors After AI-Fueled Rally": -0.5,
  "CRDO vs. MRVL: Which Connectivity Stock Has More Upside in the AI Era?": 0.5,
  "Marvell Tech To Buyback Almost 10% Of Outstanding Stock": 0.8,
  "1 Reason Wall Street Is Obsessed With Synopsys Stock": 0.5,
  "AVGO's Infrastructure Software Sales Rise: A Sign of More Upside?": 0.6,
  "Waymo is getting into the corporate travel business": 0.2,
  "Q3 ad spending is trending ahead of initial expectations: expert": 0.6,
  "Must-Watch Robotics Stocks That Could Drive Future Growth Trends": 0.5,
  "80% of Gen Z and millennials are turning to AI for financial advice—but more than half say they’ve made a poor decision or mistake as a result": -0.5,
  "Are Nvidia, Oracle mega-deals signs of an AI bubble forming?": -0.5,
  "Marvell Stock Has Been Hot. Now the AI Chip Maker Is Buying Back Shares.": 0.6,
  "Google Launches SMB Resource Center Focused on AI": 0.5,
  "The Power of Reverse Logistics": 0.5,
  "SQQQ dividend, when is it safe to sell ? - I see that SQQQ trades lower today, and found out that that's because [they will pay dividend](https://www.marketbeat.com/instant-alerts/proshares-ultrapro-short-qqq-nasdaqsqqq-to-issue-024-quarterly-dividend-2025-09-24/) to *\"stockholders of record on September 24th\"*. SQQQ seems to be trading ex dividend today. Will I receive the dividend even if I sell my SQQQ stocks today ? What is the exact cutoff time ?": -0.2,
  "Fermi America IPO, is this Legit? - It seems like this company is well positioned to do what they say they would. They plan to supply the energy for data centers with a nuclear plant in Amarillo, Texas. It was founded by Rick Perry and Toby Neugebauer who both have deep ties to both the Texas government and Texas energy sector; which likely smooth permitting processes/timelines. Work and construction set to begin next year, and": 0.6,
  "Cintas' Q1 Earnings Surpass Estimates, Revenues Increase Y/Y": 0.8,
  "Cintas Raises Outlook As CEO Points To Strong Cash Flow": 0.8,
  "Rattled by Trump's Chaotic H-1B Policy, US Firms Quietly Wait Out Changes": -0.5,
  "Top Stock Movers Now: Lithium Americas, Alibaba, Freeport-McMoRan, Adobe, and More": 0.5,
  "Will Rising User Base Continue to Drive Axon's Software & Services Unit?": 0.2,
  "Lithium Americas stock surges, Adobe, GM: Trending Tickers": 0.5,
  "Bloom Energy's Fundamentals Fail to Justify Huge Stock Rally on AI Hype, BofA Says": -0.6,
  "Adobe Stock Gets Downgraded. Generative AI Isn’t All It’s Cracked Up to Be.": -0.6,
  "Meta launches lobbying effort to target state AI laws": -0.5,
  "Nvidia's $100 Billion Investment in OpenAI Won't Lead to 'AI Bubble,' Wedbush Says": 0.5,
  "MARUY or HON: Which Is the Better Value Stock Right Now?": 0.2,
  "EXC or OGE: Which Is the Better Value Stock Right Now?": 0.2,
  "Middlefield Canadian Income PCC - Holding(s) in Company": 0.0,
  "Keurig Dr Pepper Inc. (KDP) Rated ‘Overweight’ at Piper Sandler, Price Target Cut": 0.1,
  "PayPal Partners with Blue Owl. Is PYPL Stock Poised for a Rebound?": 0.5,
  "Meta CEO Zuckerberg says Instagram has grown to 3 billion monthly active users": 0.8,
  "Market Chatter: Meta Platforms' Instagram Reaches 3 Billion Monthly Active Users": 0.8,
  "Why Marvell Technology (MRVL) Stock Is Up Today": 0.5,
  "Why Adobe (ADBE) Shares Are Falling Today": -0.5,
  "How QUALCOMM (QCOM) Enhances Growth Potential in a Dividend Stock Portfolio": 0.6,
  "Why Take-Two (TTWO) Shares Are Trading Lower Today": -0.5,
  "Alibaba jumps on AI spending, Tesla, Marvell share buybacks": 0.5,
  "A New Way To Bet On Costco: Leverage Shares Unveils 2X ETF": 0.2,
  "Oracle is reportedly looking to raise $15B in corporate bond sale": 0.5,
  "AI startup Modular raises $250 million, seeks to challenge Nvidia dominance": 0.5,
  "Cocoa Prices Rebound as Low Prices Spur Demand": 0.6,
  "Instagram now has 3 billion monthly active users, will test features to help users control their feeds": 0.6,
  "Adobe's Digital Media Deceleration Sparks Doubts Around GenAI Monetization, Morgan Stanley Says": -0.5,
  "Stagflation Sell-off Incoming - Unemployment rate is ticking up and the Fed has described their dual mandate: lowering unemployment rate while making sure inflation doesn't run up on us. This is an extremely tricky situation. The Fed thinks they can rate-cut their way to lowering unemployment. This is not going to work. Lowering rates simply frees up capital - it doesn't guarantee job creation. There is currently no shortage of capital as evident by the": -0.6,
  "Job Candidate Floored By The 'Circus of the Job Market' After CEO Cancels Interview For Asking The Pay, Calling It A Red Flag That 'Lacks Judgment'": -0.8,
  "Question about a financial advisor’s choices - I have a general question for folks who have long-term experience with financial advisors. I have been with my advisor for a very long time. More than 20 years. Up until the last few years I was extremely busy, and mentally fully occupied, with a demanding career. I left things to the advisor, although I met with him annually. His approach has been very conservative for an extremely": 0.5,
  "If you ran an ETF based on your life, what would be the top holdings? - Let’s say you ran an ETF based on your life. Maybe you shop at Target, get Starbucks every morning, drive a Ford, and have a crippling sports betting addiction (Fanduel). What would be the top 5-10 holdings in your personal ETF? I think mine would be Target, DoorDash, Apple, Sony, Netflix, and maybe Uber. Second question; would you actually": 0.1,
  "BIIB's sNDA for Higher Dose of SMA Drug Spinraza Gets FDA's CRL": -0.5,
  "Executive Committee-level Changes Afoot at L’Oréal": 0.1,
  "Nvidia: How investors are trading stock fundamentals on AI deals": 0.2,
  "Biogen’s high-dose Spinraza turned down by FDA due to CMC troubles": -0.6,
  "Tech Forum 2025: ASICs, packaging, and HBM reshape the AI chip race": 0.5,
  "Intuit Boosts Agentic AI Development With Rapid GenOS Growth": 0.6,
  "Why Intel Stock Is Rallying Again Today": 0.5,
  "COHR vs. ARM: Which Tech Growth Stock Offers More Upside Now?": 0.5,
  "ALAB Rides on Strong Demand for PCIe Solution: A Sign of More Upside?": 0.6,
  "Trump’s big change to the H-1B visa is a $100,000 hit to entrepreneurs, startups": -0.6,
  "Intel Stock Soars Along With Unusual Put Options Activity - Is INTC Stock Overvalued?": -0.5,
  "Palantir lands surprise AI deal with 109-year-old titan": 0.5,
  "Microsoft Brings Anthropic Models Into Copilot, Expanding Beyond OpenAI": 0.5,
  "Why Is Tesla (TSLA) Stock Rising Today?": 0.2,
  "Meta Says Instagram Hits 3 Billion Monthly Users": 0.8,
  "Microsoft adds Anthropic’s AI to Copilot": 0.5,
  "APP vs DUOL: Which Mobile-Tech Growth Stock is the Better Buy Now?": 0.5,
  "Astera Labs Suffers Biggest Drop Since April On Intel--Nvidia Partnership Fears": -0.8,
  "Micron Forecasts Record $12.5 Billion Quarter on AI Memory Boom": 0.8,
  "Market Chatter: OpenAI, Tokio Marine Holdings Collaborate to Develop AI Agents for Insurance": 0.5,
  "Tether names ex-Google, Limestone executive as chief business officer": 0.5,
  "Cohere hits $7B valuation a month after its last raise, partners with AMD": 0.6,
  "Instagram hits 3B users, Intel rises, Keurig Dr Pepper downgrade": 0.2,
  "Market Chatter: Paramount Skydance Has Yet to Make Formal Bid for Warner Bros. Discovery": 0.2,
  "Nvidia Analysts See Up To Five Times Return On $100 Billion OpenAI Deal. Is Nvidia A Buy Now?": 0.8,
  "Xcel Energy Reaches Agreements in Principle to Resolve All Litigation Related to 2021 Marshall Fire": 0.5,
  "Amazon Shares Rise After Wells Fargo Upgrades Rating on Strong AWS Demand": 0.8,
  "Pivotal Manufacturing Partners and Declaration Partners Announce $74 Million Acquisition of Advanced Manufacturing Facility Serving as the Global Headquarters of Commonwealth Fusion Systems": 0.8,
  "Tesla Stock Just Hit a New 2025 High. Should You Buy the Run-Up in TSLA or Stay Far Away?": 0.5,
  "Bloom Energy Stock Is an AI Darling. Why Investors Should Sell Anyway.": -0.5,
  "This crypto miner is capitalizing on AI data center energy demands": 0.5,
  "Trump threatens ABC: Why telecom sector faces a 'bigger threat'": -0.6,
  "Microsoft Adds Anthropic's AI Models to Co-Pilot": 0.5,
  "Micron's Earnings Were 'Incredible': Bokeh's Forrest": 0.8,
  "Cocoa Prices Close Higher on Tighter Inventories": 0.6,
  "Cardlytics Shares Rise After Citron Research Says Company Has Multiple Opportunities to Rebuild": 0.8,
  "FINRA has approved amendments that would replace the long-standing minimum equity rule for pattern day trading - https://www.cnbc.com/2025/09/24/day-trading-is-about-to-get-easier-for-smaller-retail-investors.html > Regulators are moving to dismantle one of the most controversial barriers for active retail traders the $25,000 minimum equity rule for pattern day trading. The Financial Industry Regulatory Authority on Tuesday approved amendments that would replace the long-standing threshold, making active day trading more accessible to smaller accounts. The change is pending approval by the Securities": 0.6,
  "Stocks to Watch Wednesday: Alibaba, Lithium Americas, Micron, Baidu": 0.5,
  "AMD Stock Climbs on New Cohere AI Deal Supercharges Chip Momentum": 0.8,
  "Micron or NVIDIA: Which AI Stock Looks Attractive and Worth a Buy?": 0.5,
  "Value/Dividend Stock Reccomendations? - For the past 2 years most of my portfolio has been TSLA, META, NVDA, and a few other unicorns who've seen a bump in share price with the introduction of AI. I recently sold off most of my shares in these companies and am looking to put my money somewhere relatively more stable; so, does anyone have any thoughts or recommendations for dividend stocks to watch right now? Any insight is": 0.2,
  "Comcast Opens Flagship Lift Zone at the Aspire Center for Workforce Innovation in Chicago to Advance Digital Skills and Job Training Opportunities": 0.6,
  "Oracle Raises $18 Billion in Second-Biggest Bond Sale This Year": 0.8,
  "Trump administration wants 10% stake in American lithium miner that sells to GM": 0.2,
  "Marvell Rolls Out $5 Billion Buyback Amidst Investor Enthusiasm": 0.8,
  "Why Sandisk Bulls Are Becoming Even More Bullish After Micron’s Results": 0.8,
  "Applied And GlobalFoundries Team Up On AI Photonics": 0.5,
  "Micron Could Face Pressure From High Bandwidth Memory Competition With Samsung, BofA Says": -0.5,
  "Micron Guides Higher, Bets On AI-Driven Memory Demand": 0.6,
  "Zoox asks federal regulators for exemption to launch a commercial robotaxi service": 0.5,
  "Tesla Robotaxis Could Be Coming Soon to Arizona. Should You Buy, Sell, or Hold TSLA Stock Here?": 0.5,
  "Sector Update: Consumer Stocks Rise Late Afternoon": 0.5,
  "Sector Update: Energy Stocks Gain Late Afternoon": 0.5,
  "Sector Update: Tech Stocks Retreat Late Afternoon": -0.5,
  "Neon, the No. 2 social app on the Apple App Store, pays users to record their phone calls and sells data to AI firms": -0.6,
  "GOOGL: Waymo for Business - **Waymo launches corporate robotaxi accounts to court business travel** https://www.reuters.com/business/autos-transportation/waymo-launches-corporate-robotaxi-accounts-court-business-travel-2025-09-24/ \"Alphabet-owned (GOOGL.O) Waymo on Wednesday rolled out \"Waymo for Business,\" a corporate program that lets companies set up accounts so employees can hail its robotaxis in Los Angeles, Phoenix, San Francisco, Austin and Atlanta.\" \"Early customers include Phoenix-based online used-car seller Carvana (CVNA.N).\" \"Waymo has been focusing on airport access to woo frequent business travelers. The company already serves Phoenix": 0.6,
  "GE HealthCare announces cash dividend for third quarter of 2025": 0.2,
  "Synopsys Collaborates with TSMC to Drive the Next Wave of AI and Multi-Die Innovation": 0.6,
  "Top Funds Propel This AI Infrastructure Stock. Here's What's Fueling Demand.": 0.6,
  "Stock market today: Dow, S&P 500, Nasdaq slip for 2nd day in a row as Fed sends mixed signals, Alibaba plans AI push": -0.5,
  "Alibaba stock soars 8% on expected AI spend, Nvidia pact": 0.8,
  "Synopsys Collaborates with TSMC to Enable 2D and 3D Design Solutions": 0.5,
  "Intel seeks investment from Apple, Bloomberg News reports": 0.5,
  "Why Tesla (TSLA) Stock Is Trading Up Today": 0.5,
  "Why Lam Research (LRCX) Shares Are Sliding Today": -0.5,
  "Why Micron Stock Dropped Today": -0.5,
  "Trump Sets Sights On This Lithium Stock After Stakes In Intel And MP Materials": 0.5,
  "Micron Stock Slides Despite Flurry Of Price-Target Hikes After Report": -0.5,
  "Intel Said to Approach Apple About Securing Investment": 0.5,
  "Cadence Partners with TSMC to Power Next-Generation Innovations Using AI Flows and IP for TSMC Advanced Nodes and 3DFabric": 0.6,
  "3PLGuys Launches Specialized 3PL Peptide Fulfillment Solutions for Growing Market": 0.6,
  "Analysts Lift Workday (WDAY) Price Target But Say Growth Is Already Priced In": 0.2,
  "U.S. Stocks End Lower As Tech Continues to Recede": -0.6,
  "These Stocks Moved the Most Today: Alibaba, Micron, Lithium Americas, Freeport-McMoRan, uniQure, and More": 0.2,
  "Palo Alto Networks (PANW) Seen as Market Leader in Expanding Cybersecurity Market": 0.8,
  "Why Axon Enterprise Stock Was Falling Today": -0.5,
  "Why Analysts See Intel’s (INTC) Collaboration With Nvidia as a Game-Changer": 0.8,
  "How major US stock indexes fared Wednesday, 9/24/2025": 0.0,
  "How ‘Bout Them Apples? As AAPL Stock Flies, This Option Strategy Can Help You Squeeze Out Even More Juice.": 0.5,
  "Intel seeking an investment from Apple, Bloomberg reports": 0.5,
  "US Equity Indexes Lower on Rising Treasury Yields, Fed's Cautious Rate-Cut Approach": -0.5,
  "Fmr. OpenAI Exec: Competitive Landscape Moving Quickly": 0.5,
  "Apple approached by Intel for investment in chipmaker, shares gain": 0.6,
  "Stock Market Today: Dow Slides Ahead Of Inflation Data; Oracle, OpenAI Step Up Stargate Plan (Live Coverage)": 0.1,
  "Google (GOOGL) Unveils Biggest Chrome Upgrade Ever With AI Integration": 0.8,
  "NVIDIA (NVDA) Price Target Raised to $225 After $100B OpenAI Deal": 0.8,
  "Amazon Stock Upgraded To Buy By Analyst. Why Its AI Push Shouldn't Be Overlooked.": 0.6,
  "Waymo Unveils Corporate Self-Driving Taxis. The Technology Is Spreading.": 0.5,
  "Intel Stock Jumps on Report It Is Seeking an Investment From Apple": 0.8,
  "Alibaba Stock Surges On AI Spending Boost, Nvidia Partnership": 0.8,
  "Why Is Opendoor (OPEN) Stock Soaring Today": 0.5,
  "Lucid (LCID) enters the robotaxi race with Uber after delivering its first EV to Nuro - https://electrek.co/2025/09/24/lucid-lcid-enters-robotaxi-race-with-uber-after-delivering-first-ev/ > Lucid Motors (LCID) delivered the first Gravity Robotaxi EV to Nuro on Wednesday, marking a milestone in its partnership with Uber. In July, Lucid announced a partnership with Uber and Nuro to deploy 20,000 autonomous Gravity SUVs over the next six years. The alliance is already on the move. Lucid announced that it delivered the first Gravity": 0.6,
  "Why Intel (INTC) Stock Is Trading Up Today": 0.5,
  "Airbnb Services: What We Know 4 Months After Launch": 0.2,
  "AI Arms Race Intensifies Again. Here Are the 2 Big Takeaways For Investors.": 0.5,
  "Equities Fall For Second Straight Day, Yields Rise": -0.6,
  "Tech Stocks Post a Second Straight Decline": -0.5,
  "S&P 500 Gains & Losses Today: Intel Stock Extends Rally, Freeport-McMoRan Drops": 0.2,
  "\"5 Reasons Amazon Will Double\" - Joseph Carlson - Disclosure I'm a fan of Joseph Carlson and a holder of Amazon. Posting this so smarter people than myself can poke holes at the thesis and spark productive discussion. I can't post link to the youtube video per subreddit rules. Below is a Claude summary of the video transcripts. ## Amazon Stock Analysis - Main Thesis • **Current underperformance**: Amazon is the worst performing Mag 7": 0.5,
  "Intel Is Seeking an Investment From Apple as Part of Its Comeback Bid": 0.5,
  "Employees expect CFPB to terminate all enforcement actions": -0.5,
  "Top Research Reports for Broadcom, Oracle & Cisco Systems": 0.0,
  "Sapia.ai Appoints Kim Macdonald as Head of Growth": 0.5,
  "China’s AI Boom Could Outlast the U.S. Why Alibaba’s Bet Is Just the Start.": 0.5,
  "Disney Gears Up for Legal Fight With Trump Over Kimmel’s Return": -0.6,
  "Alphabet (GOOGL) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Netflix (NFLX) Suffers a Larger Drop Than the General Market: Key Insights": -0.5,
  "Qualcomm (QCOM) Ascends While Market Falls: Some Facts to Note": 0.5,
  "Starbucks (SBUX) Falls More Steeply Than Broader Market: What Investors Need to Know": -0.5,
  "AppLovin (APP) Falls More Steeply Than Broader Market: What Investors Need to Know": -0.5,
  "Lam Research (LRCX) Declines More Than Market: Some Information for Investors": -0.5,
  "Fortinet (FTNT) Dips More Than Broader Market: What You Should Know": -0.2,
  "Amgen (AMGN) Dips More Than Broader Market: What You Should Know": -0.5,
  "Take-Two Interactive (TTWO) Declines More Than Market: Some Information for Investors": -0.5,
  "Axon Enterprise (AXON) Suffers a Larger Drop Than the General Market: Key Insights": -0.5,
  "5 Passive Income Streams for Retirees To Build Wealth": 0.5,
  "UPS, is this a buy? - UPS has been floating around its 1 year low for a while now. In fact, it is now about $6 lower than its 10 year low. It has great cash flow, a low P/E, is executing a cost cutting effort, and has shed most of its low margin channels, like Amazon packages. So, with a 7.8% dividend yield, why isn't this a fantastic value and income buy? Full disclosure:": 0.8,
  "Could Intel's Next Big Investment Come From Apple?": 0.5,
  "Return Fees Now Standard as Ecommerce Brands Crack Down to Protect Margins, Loop Report Finds": 0.2,
  "Analyst makes major change to CoreWeave stock price target": 0.5,
  "Cintas Corp (CTAS) Q1 2026 Earnings Call Highlights: Strong Revenue Growth and Strategic ...": 0.8,
  "'I Don't Have Hundreds Of Thousands Of Dollars,' Says Elon Musk's 21-Year-Old Daughter Who Lives With Roommates To Save On Rent": 0.2,
  "Stock market today: Dow, S&P 500, Nasdaq futures trade flat after Wall Street's record-breaking rally fizzles out": -0.2,
  "Nvidia Stock, poised to surpass 230 by year end - Nvidia stock is very misunderstood. Many have been shorting at 180’s and buying at 170’s. It’s been doing this since July 28th. Consolidating for nearly two months. Nvidia’s key points 1. They’re not lying about demand. I haven’t heard anyone comment about China not being relevant to their success…the reason Nvidia isn’t concerned is simply because demand surpasses supply even without China. 2. Nvidia has": 0.6,
  "How Intel’s $28 Billion Pledge Left an Ohio Town in Limbo": -0.7,
  "Qualcomm showcases new PC chip with features aimed at business market": 0.5,
  "Oracle slips on reports of unexpected debt plan": -0.5,
  "Meta, Volvo and Writers at Work Lead the Conversation on WhatsApp with Omnichat": 0.2,
  "Rooted in Culture: T-Mobile Report Unveils Latino Trends in Work, Entertainment and Connection": 0.5,
  "Prediction: This AI Stock Will Be the Market's Next Trillion-Dollar Superstar": 0.8,
  "PINS - buy or hold; I won’t sell. - I love Pinterest (PINS) as a company and bought because it’s a fun story, and I truly feel it’s going to take off again. Today’s close was lower than I bought. So I’m wanting to buy more. But looking for community thoughts on why to buy now or to keep watch. So what’s the consensus? Looking for all the whys and why nots before tomorrows open!!!": 0.6,
  "Jefferies Increases Its Price Target on Constellation Energy Corporation (CEG) to $347, Keeps ‘Hold’ Rating": 0.5,
  "Jefferies Initiates Coverage on Entergy Corporation (ETR) with a ‘Buy’ Rating and a $109 Price Target": 0.8,
  "TSMC, chip design software firms tap AI to help chips use less energy": 0.5,
  "Top Stocks today: uniQure, Lithium Americas and Tesla soar": 0.8,
  "$1B Crypto Plan Announced as Jiuzi Shares Spike to 55.5%": 0.5,
  "CG Developers Global announces signing with Marriott International and the launch of the first JW Marriott Residence in Dubai": 0.8,
  "World Rivers Day: Agoda Highlights Asia's Most Captivating Waterways": 0.5,
  "Forget Nvidia—Tepper Just Banked $57 Million On This Under-The-Radar AI Play": 0.5,
  "Dow Jones Futures Rise; Indexes Hold But Astera Labs, Many Hot Stocks Tumble": 0.2,
  "Alibaba’s AI Ambitions Make It Top-Performing China Tech Stock": 0.8,
  "Bank of America reveals Palantir stock price target update": 0.5,
  "Apple pushes EU to repeal tech rules over feature delays, app vulnerabilities": -0.6,
  "Apple Asks EU to Repeal Bloc’s Landmark Digital Markets Act": 0.1,
  "BYD outsells Tesla in EU for second month, Stellantis returns to sales growth": 0.5,
  "Louisiana's $3B power upgrade for Meta project raises questions about who should foot the bill": -0.5,
  "China’s BYD Logged Sales Surge in Europe Last Month": 0.5,
  "It isn’t your imagination: Google Cloud is flooding the zone": 0.5,
  "Thoughts on Energy Fuels (UUUUU) - I have been looking into further diversifying my portfolio and the energy is one sector I do not have. I was doing some research as to which energy firms to invest in and UUUU caught my eyes. Investing in UUUU would offer me some exposure to the uranium market, which plays a key role in nuclear energy. It is also one of the largest US-based uranium producers. It appears": 0.6,
  "Shareholder Yields Are Better Than Dividend Yields. 10 Stocks That Fit the Bill.": 0.5,
  "Analysis-'ChatGPT, what stocks should I buy?' AI fuels boom in robo-advisory market": 0.5,
  "HSBC breaks new ground in quantum-enabled algorithmic trading with IBM quantum computers - >Global financial services company HSBC has announced the world’s first-known evidence for the potential of quantum computers to solve valuable problems in the field of algorithmic bond trading. In an ongoing collaboration with IBM®, researchers combined quantum and classical computational resources to analyze its own real-world, production-scale bond trading data. The hybrid quantum-classical methods employed by the HSBC-IBM team yielded up to": 0.8,
  "JDE Peet’s transfers shares and grants awards to participants under its employee incentive plans": 0.2,
  "Form 8.3 - Qualcomm Inc.": 0.0,
  "Intel seeks investment from Apple: report": 0.2,
  "Nasdaq and AWS to Advance Capital Markets and Banking Infrastructure Across the Financial System": 0.5
}