{
  "Leyad Acquires Niagara's Pen Centre for $140 Million in Landmark Deal": 0.5,
  "SonicWall Appoints Rajnish Mishra as Chief Development Officer to Drive Next Generation Security Portfolio": 0.6,
  "Cintas' Q4 Earnings Surpass Estimates, Revenues Increase Y/Y": 0.8,
  "O'Reilly Gears Up to Report Q2 Earnings: What's in the Cards?": 0.2,
  "DRAM Demand Powers Micron Technology's Growth: Will the Momentum Last?": 0.6,
  "Deutsche Bank backs Visa, Mastercard amid fintech sector slump": 0.5,
  "Can Amgen (AMGN) Keep the Earnings Surprise Streak Alive?": 0.2,
  "Intuit Stock Rises 19.3% Year to Date: Still a Buy or Time to Wait?": 0.2,
  "Can Category Expansion Help lululemon Escape Athleisure Saturation?": 0.1,
  "MRVL vs. MCHP: Which Ethernet PHY Transceiver Stock Has an Edge?": 0.2,
  "This week in 5 numbers: Companies aren’t being transparent about pay": -0.5,
  "Can Cybersecurity Boom Push FTNT Stock Past its 10.5% Gain in 6 Months?": 0.5,
  "Microvast vs. Arm Holdings: Which Tech Growth Stock is the Better Bet?": 0.5,
  "GSK’s Linerixibat Poised to Address Substantial Unmet Need for the Treatment of Pruritus Associated with Primary Biliary Cholangitis, According to Spherix Global Insights": 0.8,
  "How is MELI Holding its Lead in LATAM's Acquiring Business Space?": 0.5,
  "2025: Wall Street's Steep Ascent Up the Wall of Worry": 0.5,
  "Microchip Technology (MCHP) Partners With Delta to Innovate Energy Solutions": 0.8,
  "Starbucks (SBUX) Declares Quarterly Dividend of US$0.61 Per Share": 0.5,
  "Cintas (CTAS) Reports US$10 Billion Revenue, Confirms Guidance, Completes Buyback": 0.5,
  "Paychex (PAYX) Partners With SoFi To Enhance Flex®? Perks For Financial Independence": 0.6,
  "3 Unusually Active Cash-Secured Puts in Quality Companies for Attractive Income": 0.6,
  "Why Micron Stock Dropped Today": -0.5,
  "OpenAI Hires Entire Team From AI Startup Backed By Shopify And Radical Ventures 'To Ensure AGI Benefits All Of Humanity'": 0.6,
  "Why Datadog (DDOG) Stock Is Up Today": 0.5,
  "Micron Shares Tumble as Goldman Warns of HBM Price Trouble Ahead": -0.7,
  "Datadog Versus Chronosphere Inside OpenAI": 0.0,
  "BancFirst, Bath and Body Works, Brown-Forman, Warner Bros. Discovery, and Lululemon Shares Skyrocket, What You Need To Know": 0.6,
  "Resideo, Helios, AMN Healthcare Services, Cintas, and Williams-Sonoma Shares Are Soaring, What You Need To Know": 0.5,
  "The Trade Desk to Join the S&P 500 Index": 0.5,
  "Datadog Announces Date of Second Quarter Fiscal Year 2025 Earnings Call": 0.0,
  "onsemi to Announce Second Quarter Financial Results": 0.0,
  "Value-Investing Winner Bets Big on Out-of-Favor Energy Stocks. Think Conoco, APA.": 0.6,
  "High-bandwidth memory demand set to surge in 2026 as AI powers up: UBS": 0.5,
  "AppLovin (APP) Rises Higher Than Market: Key Facts": 0.5,
  "Airbnb, Inc. (ABNB) Rises Higher Than Market: Key Facts": 0.5,
  "Workday (WDAY) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Take-Two Interactive (TTWO) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Warner Bros. Discovery (WBD) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "MercadoLibre (MELI) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "Freelance, self-employed and gig workers: Here are 5 key provisions you should know about in the new tax law": 0.5,
  "Paccar (PCAR) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "Former Heads of Google Travel and Tripadvisor Form AI Startup to Head Off Online Travel Agencies": 0.5,
  "(Item 8.01) . Other Events SPS Resource Plan (IRP) — In October 2023, Southwestern Public Service Company (SPS), a New Mexico corporation and a wholly owned subsidiary of Xcel Energy, Inc., filed its IRP with the New Mexico Public Regulation Commission (NMPRC) which supports projected load growth and increasing reliability requirements, and secures replacement energy and capacity for retiring resources. SPS’ projected resource needs range from approximately 5,300 MW to 10,200 MW of nameplate capacity by 2030.": 0.2,
  "(Item 8.01) . Other Events. On July 8, 2025, United States District Court for the Northern District of California (the “Court”) preliminarily approved the settlement (“Settlement”) of a stockholder derivative action captioned In re Alphabet Inc. Shareholder Derivative Litigation, Consolidated Case No. 3:21-cv-09388-RFL (the “Action”). Pursuant to the Court’s order granting preliminary approval of the Settlement, Alphabet Inc. (the “Company”) is required to publish the Notice of Pendency and Proposed Settlement of Derivative Action (the “Notice”), attached": 0.1,
  "Take-Two (TTWO): Buy, Sell, or Hold Post Q1 Earnings?": 0.2,
  "Axon (AXON): 3 Reasons We Love This Stock": 0.6,
  "3 Cash-Producing Stocks with Warning Signs": -0.5,
  "CTAS Q1 Deep Dive: Margin Expansion and Operational Efficiency Drive Guidance Update": 0.8,
  "Data Centers Aren’t Just a U.S. Trend. These Stocks Could Benefit from Europe’s Power  Surge.": 0.5,
  "Cintas Corp (CTAS) Q4 2025 Earnings Call Highlights: Strong Revenue Growth and Optimistic ...": 0.8,
  "Jim Cramer Says AppLovin Has “No Real Competition”": 0.6,
  "Citi Raised the Firm’s PT on Applied Materials (AMAT), Kept a Buy Rating": 0.6,
  "The Trade Desk Set to Join S&P 500 Today": 0.5,
  "Luxurious Nashville home featured on Bravo TV show hits the market at $1.6M. See inside": 0.5,
  "CFOs On the Move: Week ending July 18": 0.0,
  "Charter (CHTR) Target Raised by UBS Despite Broadband Growth Concerns": 0.5,
  "Kraft Heinz (KHC) Considers $20 Billion Grocery Spinoff Amid Restructuring": 0.5,
  "Airbnb’s CEO studied Steve Jobs’s playbook to slash bureaucracy and build his $84 billion empire. Inside Brian Chesky’s 5-step hiring strategy to cut red tape": 0.5,
  "Weekly Recap: 12 Tech Press Releases You Need to See": 0.5,
  "China Stocks Hit 3-Year High as Global Rally Rolls On": 0.8,
  "The Trade Desk, Inc. (TTD)’s Got “A Really Good Product,” Says Jim Cramer": 0.8,
  "Albertsons Companies, Inc. (ACI): Jim Cramer Says He Prefers Costco": 0.2,
  "DoorDash, Inc. (DASH): “The Multiple’s Too High,” Says Jim Cramer": -0.5,
  "Exelon Corporation (NASDAQ:EXC) is favoured by institutional owners who hold 85% of the company": 0.5,
  "Applied Materials' (NASDAQ:AMAT) investors will be pleased with their solid 216% return over the last five years": 0.8,
  "What Is CDW Corporation's (NASDAQ:CDW) Share Price Doing?": 0.0,
  "Earnings Preview: What to Expect From Xcel Energy's Report": 0.5,
  "3 Growth Stocks With Significant Insider Ownership": 0.5,
  "Discover Datadog And Two Other Stocks That May Be Priced Below Estimated Value": 0.5,
  "Here’s Why Patient Capital Opportunity Equity Strategy Purchased Costco Wholesale Corporation (COST) Puts in Q2": 0.2,
  "lululemon Expands International Presence with First Store Opening in Italy": 0.8,
  "EBay Stock: How To Find & Own America's Greatest Opportunities": 0.5,
  "Is DexCom, Inc. (NASDAQ:DXCM) Trading At A 34% Discount?": 0.1,
  "Here's What to Expect From Biogen's Next Earnings Report": 0.2,
  "Booking Holdings' Q2 2025 Earnings: What to Expect": 0.0,
  "Lululemon Opening in Milan, Adding a Fashion Capital to Its International Push": 0.6,
  "Intel shares could squeeze higher during earnings, analyst says": 0.6,
  "Wedgewood Partners Continues to Hold Copart (CPRT)": 0.0,
  "Booking Holdings (BKNG) Benefited from Strong Travel Spending and Share Buybacks": 0.8,
  "The Trade Desk (TTD) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Zscaler, Inc. (ZS) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "PDD Holdings Inc. Sponsored ADR (PDD) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Stocks making big moves this week: The Trade Desk, Funko, Agilysys, Steven Madden, and Union Pacific": 0.5,
  "Head of $8 Billion Wealth Firm Has His Eye on These 3 Major Market Disruptors": 0.5,
  "Credo Technology and PVH have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Zacks Investment Ideas feature highlights: Microsoft, Nvidia, Alphabet, Arm Holdings and Advanced Micro Devices": 0.5,
  "Fastenal (FAST) Reliance on International Sales: What Investors Need to Know": 0.2,
  "Insights Into O'Reilly Automotive (ORLY) Q2: Wall Street Projections for Key Metrics": 0.2,
  "Snowflake initiated, Chipotle upgraded: Wall Street's top analyst calls": 0.5,
  "Are Computer and Technology Stocks Lagging  Intuit (INTU) This Year?": -0.2,
  "The Zacks Analyst Blog Highlights Costco Wholesale, Dollar General, Ross Stores and Target": 0.5,
  "Are You a Momentum Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Company News for Jul 18, 2025": 0.0,
  "Regeneron Stock Plunges 22.6% YTD: Should You Buy, Sell or Hold?": -0.5,
  "Stocks to watch this week: Tesla, Alphabet, Intel, Lloyds and JD Wetherspoon": 0.0,
  "Kymera Surges 70% in 3 Months: Buy, Sell or Hold the Stock?": 0.2,
  "Should You Buy Datadog (DDOG) After Golden Cross?": 0.2,
  "CoStar Group to Post Q2 Earnings: What's in Store for the Stock?": 0.2,
  "Solodev Achieves Latest AWS Government Competency, Powering Citizen Experiences with AI and Cloud Innovation": 0.8,
  "Charter Communications (CHTR) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "6 Frugal Living Lessons From the Great Recession": 0.5,
  "Talen Stock Soars on Plant Purchases. Why the Market Is Excited About the Nuclear Play’s Bet on Gas.": 0.8,
  "Security Service Edge (SSE) Company Benchmark Report 2025 | Top Companies Mapped Based on Revenue and Strategic Expansion": 0.0,
  "Intel Could Face a Short Squeeze and More Calls on Semi Stocks From Citi": 0.5,
  "Is a Recession Coming in 2025?": 0.0,
  "Robinhood, AppLovin Could Soon Join S&P 500 as Hess Deal Creates Opening in Index": 0.5,
  "Talen Energy Soars On $3.5 Billion Deal To 'Enhance' Data Center Load; S&P 500 Rivals Jump": 0.6,
  "Can Intuit Sustain Its Growth Momentum With Bold AI Push?": 0.5,
  "Keurig to Post Q2 Earnings: What Is in the Cards for Investors?": 0.2,
  "PYPL vs. MA: Which Stock Is the Better Value Option?": 0.0,
  "KLA Stock, Quanta Form This Chart Pattern, Giving The Green Light To Buy": 0.6,
  "Procore Technologies Stock Earns RS Rating Upgrade": 0.5,
  "Nvidia and 2 Other Chip Stocks to Play AI Into Earnings, Says J.P. Morgan": 0.5,
  "Clear Secure Stock Gets Relative Strength Rating Lift": 0.5,
  "Crypto pops on GENIUS Act, Chinese tech stocks, CRISPR": 0.5,
  "Analysts revamp Alphabet stock price target before key earnings": 0.5,
  "Industrial Power: Watch CSX, MMM, and Cintas": 0.2,
  "Comcast Honored With Mile High United Way's 2025 Social Impact Award": 0.6,
  "Marvell Technology (MRVL) Strengthens Leadership Team With Key Executive Promotions": 0.8,
  "QUALCOMM (QCOM) Confirms US$0.89 Dividend for September 2025 Payout": 0.5,
  "Synopsys (SNPS) Completes Acquisition Of Ansys, Expands Market Reach To US$31 Billion": 0.5,
  "Xcel Energy Announces Portfolio of New Power Projects to Meet Growing Demand in Texas and New Mexico": 0.6,
  "Shopify (SHOP) Sees 52% Price Move Over Last Quarter": 0.5,
  "GE’s 3 Offspring Are All Grown Up and Making Waves. The Best Is Yet to Come.": 0.8,
  "Exploring High Growth Tech Stocks In The US Market": 0.5,
  "IPO Stock Of The Week: Nvidia Partner Arm Holdings Nears New Buy Point": 0.5,
  "HSBC Trims Amgen (AMGN) Price Target, Maintains Buy Rating": 0.5,
  "Repligen, Bruker, Fortrea, Azenta, and Biogen Stocks Trade Down, What You Need To Know": -0.5,
  "As Nvidia, Broadcom Soar, Don't Ignore This AI Chip Stock. Top Funds Haven't.": 0.5,
  "HOOKIPA Pharma Announces Intention to Voluntarily Delist and Deregister its Common Stock": -0.5,
  "Watch Reddit, DoorDash, and Google as Netflix Disappoints": 0.1,
  "Why We Booked Our Profits In Booking Stock": 0.1,
  "GE Aerospace Price Targets Suggest a Record High Is Coming. How That’s Possible.": 0.5,
  "The Score: Norfolk Southern, Citigroup, Nvidia and More Stocks That Defined the Week": 0.2,
  "Block to Replace Hess in S&P 500 Index. Shares Jump on Admission News.": 0.6,
  "Square Parent Block Jumps On S&P 500 News; Robinhood Snubbed Yet Again": 0.2,
  "CrowdStrike Holdings (CRWD) Increases Despite Market Slip: Here's What You Need to Know": 0.5,
  "The Trade Desk (TTD) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Qualcomm (QCOM) Increases Despite Market Slip: Here's What You Need to Know": 0.5,
  "Amgen (AMGN) Declines More Than Market: Some Information for Investors": -0.5,
  "Axon Enterprise (AXON) Rises As Market Takes a Dip: Key Facts": 0.5,
  "4 Signs You’re Financially Comfortable (and Ready To Level Up)": 0.5,
  "Block Stock Jumps on S&P 500 Inclusion, Replacing Hess": 0.6,
  "Why Amgen (AMGN) Could Be a Hidden Gem Among Dividend Pharma Stocks in 2025": 0.6,
  "Why Gilead Sciences (GILD) Appeals to Income Investors in the Pharma Sector": 0.5,
  "How CEO Cristiano Amon Is Building ‘a New Qualcomm’": 0.5,
  "Down 16%, Should You Buy the Dip on Arm Holdings?": 0.5,
  "How Shopify quietly became a payments giant in North America": 0.5,
  "Atlassian stock: Should you own it into the print, or wait to buy a dip after?": 0.2,
  "Want $1 Million in Retirement? Invest $100,000 in These 3 Stocks and Wait a Decade.": 0.5,
  "CrowdStrike (CRWD) Expands AWS Partnership to Power AI Security Solutions": 0.6,
  "3 Magnificent Dividend Stocks to Buy Today and Hold for 20 Years": 0.8,
  "O'Reilly Automotive, Inc.'s (NASDAQ:ORLY) Intrinsic Value Is Potentially 23% Below Its Share Price": -0.7,
  "Analog Devices price target raised to $270 from $248 at Stifel": 0.5,
  "These 7 Stocks Are Analyst Favorites For Magnificent Earnings Growth; Arista, Micron Lead": 0.8,
  "Cintas Full Year 2025 Earnings: In Line With Expectations": 0.5,
  "Could Arm Holdings Stock Help You Become a Millionaire?": 0.5,
  "Possible Bearish Signals With Old Dominion Freight Line Insiders Disposing Stock": -0.6,
  "Possible Bearish Signals With Trade Desk Insiders Disposing Stock": -0.6,
  "5 Worst States To Run an Airbnb in 2025, According to Experts": -0.7,
  "Trump Tariffs Spell Trouble for Hawaii’s Few Coffee Farmers": -0.8,
  "CrowdStrike (CRWD) Initiated at ‘Neutral’ by Macquarie on Valuation Concerns": 0.1,
  "AppLovin Corporation (APP) Is A “Cash Flow Machine,” Says Jim Cramer": 0.6,
  "Big food companies undergo 'self reflection' on business future as deals sweep the sector": 0.5,
  "3 reasons to buy Costco stock and steer clear of Target": 0.2,
  "Oppenheimer Remains Bullish on Costco (COST)": 0.6,
  "China Galaxy International Downgrades PT on PDD Holdings (PDD) from $164 to $112": -0.5,
  "William Blair Maintains a Buy Rating on Palo Alto Networks (PANW)": 0.6,
  "What to Expect From CDW’s Next Quarterly Earnings Report": 0.2,
  "What You Need to Know Ahead of Cognizant Technology’s Earnings Release": 0.1,
  "Better Energy Stock: Diamondback Energy vs. Chevron": 0.5,
  "This Magnificent Tech Stock Is Soaring After Joining the S&P 500. Should You Buy It?": 0.5,
  "Own ARM stock? This Is the 1 Thing to Watch Now": 0.5,
  "Prediction: 3 Stocks That Will Be Worth More Than Palantir 5 Years From Now": 0.5,
  "Insiders At Analog Devices Sold US$7.2m In Stock, Alluding To Potential Weakness": -0.6,
  "Tesla, Alphabet highlight earnings rush as market hovers near record highs: What to know this week": 0.5,
  "Kraft Heinz Could Be Breaking Up. How Should You Play the High-Yield Dividend Stock Here?": 0.2,
  "Monster Beverage (NASDAQ:MNST) Might Become A Compounding Machine": 0.5,
  "Coca-Cola, GM, Alphabet, Tesla: Earnings to watch this week": 0.5,
  "1 Incredible Reason to Buy This Value Stock Before Wall Street Catches On": 0.8,
  "Why This Beaten-Down Medical Device Stock Could Be Your Best Investment for the Next 5 Years": 0.8,
  "Should You Buy the 3 Highest-Paying Dividend Stocks in the Nasdaq-100?": 0.1,
  "Donald Trump faces frosty reception on Aberdeen golf trip": -0.6,
  "(Item 8.01) Other Events. On July 21, 2025, MicroStrategy ® Incorporated d/b/a Strategy ™ (the “Company”) issued a press release announcing that, subject to market and other conditions, it intends to conduct an initial public offering of 5,000,000 shares of its Variable Rate Series A Perpetual Stretch Preferred Stock. A copy of the press release is filed hereto as Exhibit 99.1 and is incorporated herein by reference. Neither this Current Report on Form 8-K nor the press": 0.1,
  "(ITEM 8.01) . OTHER EVENTS. As previously disclosed, on May 16, 2025, Charter Communications, Inc., a Delaware corporation (“Charter”), entered into a Transaction Agreement (the “Transaction Agreement”) by and among Charter, Charter Communications Holdings, LLC, a Delaware limited liability company and subsidiary of Charter (“Charter Holdings”), and Cox Enterprises, Inc., a Delaware corporation (“Cox Enterprises”), pursuant to which (i) Cox Enterprises will sell and transfer to Charter 100% of the equity interests of certain subsidiaries of Cox": 0.1,
  "(Item 8.01) Other Events. ATM Updates On July 21, 2025, MicroStrategy Incorporated d/b/a Strategy (“Strategy” or the “Company”) announced updates with respect to its at-the-market offering programs: ATM Program Summary During Period July 14, 2025 to July 20, 2025 As of July 20, 2025 Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) Common ATM 1,636,373 MSTR Shares - $736.4 $17,042.7 Securities Offered: Class A Common Stock,": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On July 21, 2025, Roper Technologies, Inc. (the “Company”) issued a press release containing information about the Company’s results of operations for the quarter ended June 30, 2025. A copy of the press release is furnished as Exhibit 99.1.": 0.1,
  "3 Cybersecurity Stocks You Can Buy and Hold for the Next Decade": 0.5,
  "Escape the Sizzle: Agoda's Cool Picks in Asia to Beat the Summer Heat": 0.5,
  "CoStar (CSGP) To Report Earnings Tomorrow: Here Is What To Expect": 0.2,
  "Earnings To Watch: PACCAR (PCAR) Reports Q2 Results Tomorrow": 0.2,
  "Ground Transportation Stocks Q1 Teardown: Old Dominion Freight Line (NASDAQ:ODFL) Vs The Rest": 0.2,
  "Apparel Retailer Stocks Q1 Highlights: Lululemon (NASDAQ:LULU)": 0.5,
  "UBS Raises Monster (MNST) Price Target, Maintains Neutral Rating": 0.5,
  "HSBC Raises Booking (BKNG) Price Target, Maintains Buy Rating": 0.6,
  "3 Reasons We Love Booking (BKNG)": 0.5,
  "3 Reasons We’re Fans of MercadoLibre (MELI)": 0.5,
  "2 Large-Cap Stocks for Long-Term Investors and 1 We Brush Off": 0.2,
  "1 Volatile Stock with Competitive Advantages and 2 We Avoid": 0.5,
  "2 Large-Cap Stocks with Promising Prospects and 1 That Underwhelm": 0.2,
  "2 Industrials Stocks with Competitive Advantages and 1 We Find Risky": 0.5,
  "Fastenal’s Q2 Earnings Call: Our Top 5 Analyst Questions": 0.2,
  "Zero Networks Boosts International Sales Capabilities With Key EMEA Hire": 0.6,
  "Global and China OEMs and Tier1s' Intelligent Cockpit Platforms and Supply Chain Construction Report 2025 | Cockpit Applications Like Acoustics and HMI Pursue Immersive and High-quality Experiences": 0.6,
  "China and Global Automotive Intelligent Cockpit SoC Research Report 2025 | Localization Rate Exceeds 10%, and AI-oriented Cockpit SoC Will Become the Mainstream in the Next 2-3 Years": 0.6,
  "Zacks Market Edge Highlights: FAST, NVDA and CTAS": 0.0,
  "Domino’s regains US sales momentum in Q2": 0.6,
  "TownePlace Suites by Marriott unveils new extended-stay hotel in US": 0.5,
  "Zacks Industry Outlook Highlights O'Reilly Automotive and Advance Auto Parts": 0.5,
  "Linde Announces Major U.S. Investments to Support Commercial Space Sector": 0.8,
  "Analysis-Kraft Heinz seeks to revive old brands by undoing 2015 mega-merger": 0.5,
  "Microchip Technology's Quarterly Earnings Preview: What You Need to Know": 0.5,
  "Biggest US Power Sale to Offer Glimpse of AI’s Cost to Consumers": 0.2,
  "Block Surges on S&P 500 Inclusion: ETFs in Focus": 0.5,
  "ASML Shares Tumble. Time to Run for the Hills or Buy the Dip?": -0.5,
  "Best Income Stocks to Buy for July 21st": 0.5,
  "Roper Technologies announces second quarter financial results and acquisition of Subsplash; Increasing full year guidance": 0.8,
  "Verizon boosts annual forecast on demand for premium plans, tax law benefit": 0.6,
  "Lululemon enters Italy with first store in Milan": 0.5,
  "NodThera Announces Appointment of Dr. Jyothis George as Chief Medical Officer": 0.5,
  "UK PROPERTY ENTREPRENEUR MAKES SPLASH IN U.S WITH OPENING OF REVOLUTIONARY NEW CAR WASH CHAIN": 0.8,
  "Cadence Design Systems (NASDAQ:CDNS) shareholders have earned a 25% CAGR over the last five years": 0.8,
  "Estimating The Intrinsic Value Of Starbucks Corporation (NASDAQ:SBUX)": 0.2,
  "Roper Technologies: Q2 Earnings Snapshot": 0.0,
  "Airbnb Sued by Los Angeles Over Alleged Price Gouging, Misrepresentation During Wildfires": -0.8,
  "Corporate Earnings, Geopolitics Nudge Wall Street Higher Pre-Bell; Asia Mixed, Europe Off": 0.5,
  "Biogen Announces $2 Billion Manufacturing Investment in North Carolina’s Research Triangle Park in Conjunction with its 30th Anniversary": 0.8,
  "Stocks Gain Pre-Bell as Investors Brace for More Earnings": 0.5,
  "JAKKS Pacific And Two Other Leading Dividend Stocks": 0.1,
  "This Week In AI Chips - Reshoring Boosts Manufacturing Amid Strategic Partnerships and Acquisitions": 0.5,
  "3 Stocks Estimated To Be 10% To 27.3% Below Intrinsic Value": -0.5,
  "Exploring 3 High Growth Tech Stocks In The US Market": 0.0,
  "Roper Technologies beats Q2 estimates, raises full-year guidance": 0.8,
  "Biogen beefs up North Carolina manufacturing ahead of potential drug tariff storm": 0.2,
  "Roper Technologies raises annual forecasts on strong software demand": 0.8,
  "Domino's Same-Store Sales Growth Tops Estimates": 0.8,
  "ASML reports transactions under its current share buyback program": 0.0,
  "Roper Technologies (ROP) Surpasses Q2 Earnings and Revenue Estimates": 0.8,
  "Micron Stock Soars 36% YTD: Still a Buy or Time to Book Profits?": 0.5,
  "LRCX Soars 59% in Three Months: Is the Stock Still Worth Buying?": 0.5,
  "Lululemon expands to Italy with first store in Milan": 0.5,
  "Jeep maker Stellantis warns of a shock $2.7 billion loss as tariffs bite - >Auto giant Stellantis expects a net loss of 2.3 billion euros ($2.68 billion) in the first half of the year amid pre-tax net charges and early effects of U.S. tariffs, the company said Monday in its preliminary figures. >Stellantis, which owns household names including Jeep, Dodge, Fiat, Chrysler and Peugeot, estimated first-half net revenue of 74.3 billion euros, down from 85": -0.8,
  "Cisco Systems, Inc. (CSCO): It “Could Have An Oracle-Like Revaluation,” Says Jim Cramer": 0.6,
  "Digital Payment Update - PaaS Growth Driven By Evolving Consumer Preferences and Tech Advancements": 0.6,
  "Marriott International, Inc. (MAR)’s Raise Was Great, Says Jim Cramer": 0.8,
  "Madison Large Cap Fund Added Airbnb (ABNB) on a Dip": 0.5,
  "CDW Corporation (CDW) Moved Higher Tied to Industry Tailwinds": 0.5,
  "Starbucks Corporation (SBUX): “This Is The Right Rime To Buy Starbucks,” Says Jim Cramer": 0.6,
  "Marriott International Caribbean Highlights the Unmatched Appeal of Summer Travel Across Its Premier Resorts": 0.6,
  "Froot Loops maker WK Kellogg to remove artificial colors": 0.5,
  "CHIPS AHOY! Enters the Upside Down for the Most Anticipated Netflix Release Yet: Stranger Things 5!": 0.8,
  "Shopify Inc. (SHOP) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Datadog, Inc. (DDOG) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Want Better Returns? Don't Ignore These 2 Computer and Technology Stocks Set to Beat Earnings": 0.8,
  "How to Find Strong Computer and Technology Stocks Slated for Positive Earnings Surprises": 0.8,
  "Why Investors Need to Take Advantage of These 2 Computer and Technology Stocks Now": 0.5,
  "Investors Heavily Search Costco Wholesale Corporation (COST): Here is What You Need to Know": 0.5,
  "Fortuna Health Raises $18M Led by Andreessen Horowitz to Modernize Medicaid Access and Infrastructure Amid Federal Reforms": 0.8,
  "Three CMOs of multibillion-dollar tech companies share the secrets to success they wish all CEOs knew": 0.5,
  "Beat the Market the Zacks Way: Curtiss-Wright, Oracle, Starbucks in Focus": 0.5,
  "Domino’s Earnings Bring Good and Bad News. The Stock Is Jumping.": 0.5,
  "Gear Up for Keurig Dr Pepper (KDP) Q2 Earnings: Wall Street Estimates for Key Metrics": 0.2,
  "Why Lam Research (LRCX) is a Top Stock for the Long-Term": 0.8,
  "Is It Worth Investing in Palo Alto (PANW) Based on Wall Street's Bullish Views?": 0.5,
  "Roper Technologies (ROP) Q2 Earnings: How Key Metrics Compare to Wall Street Estimates": 0.5,
  "Are Medical Stocks Lagging  DexCom (DXCM) This Year?": 0.1,
  "Target downgraded, Dollar Tree upgraded: Wall Street's top analyst calls": 0.5,
  "NKE Rallies 19% in a Month: Time to Buy the Hype or Wait for Proof?": 0.2,
  "Here's Why Cognizant (CTSH) is a Strong Momentum Stock": 0.8,
  "Cadence Design Systems (CDNS) Reports Next Week: Wall Street Expects Earnings Growth": 0.5,
  "Pressed Juicery Launches Nationwide at Costco with New Functional Wellness Smoothie Multipack": 0.5,
  "Update: Airbnb Sued by Los Angeles Over Alleged Price Gouging, Misrepresentation During Wildfires": -0.8,
  "SHOP Trades Higher Than Industry at 13.75X P/S: Is the Stock a Buy?": 0.2,
  "How to deal with the feeling of selling too early and missing out on life changing money? - I had bought PLTR back in 2021 at an average of 28$/share. In November, it flew all the way up and it was at 43$/share. I doomscrolled on reddit and researched as much as I could. The P/E ratio did not make sense at all. With the presidency news on the horizon too, I decides to sell": -0.6,
  "CHARTER JOINS 'INVEST IN AMERICA' TRUMP ACCOUNTS INITIATIVE, DEEPENING SUPPORT FOR EMPLOYEES AND THEIR FAMILIES": 0.6,
  "Why Microsoft Is Urging Security Updates for SharePoint Customers": 0.2,
  "Figma looks to raise nearly $1B as it kicks off its IPO roadshow": 0.6,
  "EdgeOne Medical Announces Appointment of Michael Denzer as VP, Client Relations to Further Elevate Product Innovation and Client Partnerships": 0.8,
  "CRWD vs. CYBR: Which Cybersecurity Stock is the Better Buy Now?": 0.5,
  "Automatic Data Processing Investors Eyeing Q4 Bookings Growth, Fiscal 2026 Outlook, RBC Says": 0.5,
  "Starbucks Poised to Report Better-Than-Expected Fiscal Q3 Same-Store Sales, RBC Says": 0.8,
  "BlackLine Stock Gets Relative Strength Rating Lift": 0.5,
  "Target Catches Another Downgrade. These Stores Are Better Positioned.": 0.5,
  "S&P 500 and Nasdaq hit record highs to start the week thanks to gains in tech - U.S. stocks moved higher on Monday as investors tracked the latest developments in trade and awaited the start of big tech earnings this week. The S&P 500 rose 0.6%, and the Nasdaq Composite jumped 0.7%. Both indexes hit new all-time intraday highs earlier in the session, bolstered by advances in major technology names. Alphabet increased around 2%, while": 0.8,
  "DocuSign's IAM: Automating Agreements, Redefining Enterprise": 0.5,
  "Roper Q2 Earnings Top Estimates, Application Software Sales Up Y/Y": 0.8,
  "Applied Materials (AMAT) Upgraded to Buy: Here's What You Should Know": 0.8,
  "Why Qualcomm (QCOM) Could Beat Earnings Estimates Again": 0.5,
  "Why Booking Holdings (BKNG) is Poised to Beat Earnings Estimates Again": 0.6,
  "Will Kraft Heinz (KHC) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Five Key Charts to Watch in Global Commodities This Week": 0.0,
  "Roper Tech Lifts 2025 Outlook As AI, Acquisitions Fuel Double-Digit Growth": 0.8,
  "Can PayPal's Crypto Strategy Give It a Competitive Edge?": 0.5,
  "Airbnb: A Capital-Light Compounder Hiding in Plain Sight": 0.5,
  "Subsplash, a Premier Provider in Church Technology, Joins Roper Technologies": 0.5,
  "Figma's IPO priced between $25 to $28 - Three weeks ago I [wrote a post](https://www.reddit.com/r/investing/comments/1lr70x3/figmas_ipo_why_i_think_its_worth_2750share/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) estimating Figma’s IPO valuation and landed on a fair value of $27.50/share based on a discounted cash flow analysis. Today, Figma officially priced its IPO between $25 - $28/share - almost exactly in line with my estimate. The fully diluted valuation is estimated to be $14.6B o $16.4B. For context, I had assumed: * Revenue would decelerate from 46% to": 0.8,
  "Adobe Trades 38% Below 52-Week High: Right Time Buy the ADBE Stock?": 0.2,
  "Domino's belated stuffed crust and delivery investments drive 3.4% sales growth": 0.6,
  "Affirm Likely to Continue to Gain Share in Buy Now, Pay Later Space, Oppenheimer Says": 0.8,
  "This 12 Dividend Stock Portfolio Will Pay Your Bills – Every Week": 0.5,
  "S&P 500, Nasdaq Scale New Highs in Broad-Based Rally": 0.8,
  "How Will Celsius Leverage Its Energy Drink Market Share in 2025?": 0.5,
  "Biogen beefs up North Carolina manufacturing ahead of potential Trump tariff": 0.1,
  "Mondelez International (MDLZ) Unveils CHIPS AHOY! x Stranger Things Cookie Collaboration": 0.5,
  "Emburse Expands Receipt Integration Ecosystem with the AAdvantage Business™ program and DoorDash for Business": 0.5,
  "He's 66, Retired, And Has $1.9M In An IRA — Should He Pay Cash or Finance a Vacation Home?": 0.2,
  "Verizon boosts annual forecast, shares rise": 0.8,
  "US retail giant Costco to set up global capability centre in India, to employ 1000 people, sources say": 0.6,
  "American Electric Power Company (NASDAQ:AEP) shareholders have earned a 9.2% CAGR over the last five years": 0.8,
  "Figma's $1 Billion IPO Gambit: Can It Bounce Back After Adobe Walked Away?": 0.2,
  "3 Stocks Showcasing Strong Earnings Growth: NVDA, APP, GE": 0.8,
  "Nat-Gas Prices Sink on the Outlook for Cooler US Temps and Higher Gas Production": -0.7,
  "U.S. Natural Gas Futures Give Back Gains": -0.5,
  "Starbucks to Report Weak Q3 Results Amid Slow Demand, Higher Investments, UBS Says": -0.6,
  "Biogen (BIIB) Stock Trades Down, Here Is Why": -0.5,
  "onsemi (ON) Stock Is Up, What You Need To Know": 0.5,
  "Sector Update: Consumer Stocks Rise Late Afternoon": 0.5,
  "Top Stock Picks for Week of July 21, 2025": 0.0,
  "Axon to Release Second Quarter 2025 Earnings on August 4, 2025": 0.0,
  "CPKC, CSX create faster freight solutions with Southeast Mexico Express": 0.5,
  "AOI Quantum Bandwidth Networking Products Certified for Deployment by Charter Communications": 0.5,
  "Synopsys Acquisition Of Ansys Gives It Unique Capabilities, CFO Says": 0.5,
  "Why SentinelOne Stock Is Skyrocketing Today": 0.5,
  "Chip Gear Stocks Get Boost From AI Prospects": 0.6,
  "Fortinet Honors the Life and Contributions of Valued Board Member William H. Neukom": 0.8,
  "K1 to Exit Subsplash in Strategic Sale to Roper Technologies": 0.5,
  "Why SentinelOne (S) Stock Is Trading Up Today": 0.5,
  "Solana soars as DeFi amasses 999,999 SOL tokens on its balance sheet": 0.8,
  "Cuhaci Peterson Teams with NVIDIA to Empower Workforce": 0.5,
  "NXP Semiconductors (NXPI) Surpasses Q2 Earnings and Revenue Estimates": 0.8,
  "Trump Media ($DJT) builds $2 billion bitcoin hoard, as cryptocurrency swells president’s net worth - >Trump Media and Technology Group said Monday it has accumulated roughly $2 billion in bitcoin and related assets, as President Donald Trump’s highly lucrative pivot to cryptocurrency continues to grow his net worth while in office. > >The bitcoin holdings now account for about two-thirds of Trump Media’s total liquid assets, the company said in a press release. > >Trump": 0.8,
  "Palo Alto Networks (PANW) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "PDD Holdings Inc. Sponsored ADR (PDD) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Applied Materials (AMAT) Laps the Stock Market: Here's Why": 0.5,
  "Shopify (SHOP) Laps the Stock Market: Here's Why": 0.5,
  "Constellation Energy Corporation (CEG) Stock Declines While Market Improves: Some Information for Investors": -0.5,
  "Lam Research (LRCX) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Synopsys (SNPS) Rises Higher Than Market: Key Facts": 0.5,
  "Intuit (INTU) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Microsoft Rushes to Stop Hackers from Wreaking Global Havoc": -0.8,
  "BNSF hires Goldman, CSX seeks bankers as Union Pacific sparks rail M&A race, sources say": 0.2,
  "Comcast (CMCSA) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Compared to Estimates, NXP (NXPI) Q2 Earnings: A Look at Key Metrics": 0.2,
  "Diamondback Energy (FANG) Stock Declines While Market Improves: Some Information for Investors": -0.5,
  "MicroStrategy Drops 5% Despite Major Crypto Policy Win in Washington": 0.2,
  "Biogen Inc. (BIIB) Partners with Stoke Therapeutics to Tackle Dravet Syndrome": 0.8,
  "What are your favorite speculative plays that HAVE NOT blow up yet? - I’ve been doing a lot of research lately into speculative growth stocks with major upside potential think multi-baggers over the next couple years, but not ones that have already had their big run recently (e.g., not up 100%+ this month or +25% today). I’ve been looking into names like ENVX, NVTS, AMPX, and SOUN companies that might have rough execution now, but": 0.5,
  "AstraZeneca Plans to Invest $50 Billion in U.S. by 2030": 0.8,
  "Biogen to Highlight Scientific Progress Across Alzheimer’s Disease at the Alzheimer’s Association International Conference 2025": 0.5,
  "Trump's company is shockingly one of the top holders of Bitcoin": 0.2,
  "MicroStrategy 'Stretch'-ed it too far with new product launch": -0.6,
  "(Item 2.02) Results of Operations and Financial Condition. On July 22, 2025, Baker Hughes Company (the \"Company\") issued a news release announcing its financial results for the quarter ended June 30, 2025, a copy of which is furnished with this Form 8-K as Exhibit 99.1 and incorporated herein by reference. In accordance with General Instructions B.2. of Form 8-K, the information shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of\n\n(Item 2.02) , \"Results of Operations and Financial Condition.\"": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On July 22, 2025 , CoStar Group, Inc. (“CoStar Group” or the “Company”) announced its financial and operating results for the quarter ended June 30, 2025. The full text of the press release (the “Press Release”) issued in connection with the announcement is furnished as Exhibit 99.1 to this Current Report on Form 8-K. The information contained in this\n\n(Item 2.02) and the Press Release shall be considered “furnished” and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of that Section or Sections 11 and 12(a)(2) of the Securities Act of 1933, as amended, nor shall it be deemed incorporated by reference into any reports or filings with the Securities and Exchange Commission (the \"SEC\"), whether made before or": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On July 18, 2025, the Board of Directors (the “Board”) of Applied Materials, Inc. (“Applied” or the “Company”) elected James R. Anderson to the Board and the Board’s Strategy and Investment Committee, effective immediately. Mr. Anderson will receive the standard compensation payable to non-employee directors of the Board, consisting of: (1) an annual retainer of $100,000 (prorated": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On July 21, 2025, NXP Semiconductors N.V. (\"NXP\") issued a press release regarding NXP’s financial results for its second quarter 2025. A copy of the press release is attached as Exhibit 99.1. The information contained in this\n\n(Item 2.02) , including the attached exhibit, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), nor shall it be deemed to be incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such a filing.": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. On July 22, 2025, Intuitive Surgical, Inc. (“Intuitive”) issued a press release announcing its financial results for the quarter ended June 30, 2025. A copy of the press release is furnished hereto as Exhibit 99.1. The information in this Current Report on Form 8-K, including Exhibit 99.1, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange": 0.1,
  "(Item 8.01) . Other Events On July 22, 2025, Constellation Energy Corporation (the Company) learned the results of the PJM capacity auction for the 2026-2027 planning year. Each of the Company's power plants located in the PJM market cleared in the auction. Capacity revenues for nuclear units are included in the gross receipts calculation for the Production Tax Credit. The auction results take effect June 1, 2026. The table below lists the Company's cleared capacity volumes for": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition On July 22, 2025 PACCAR Inc (the “Registrant”) issued a press release announcing its financial results for the second quarter of 2025 and announcing that it would hold a conference call with securities analysts to discuss second quarter 2025 earnings to be held that same day as more fully described in the press release attached as Exhibit 99.1 to this report. The information in this Current Report on Form": 0.0,
  "(ITEM 2.02) . Results of Operations and Financial Condition The Registrant’s news release dated July 22, 2025, regarding its second-quarter results of operations and financial condition is attached hereto as Exhibit 99. The attached news release includes references to the following financial measures that were not prepared in accordance with generally accepted accounting principles in the United States (non-GAAP measures): free cash flow and ratios based on free cash flow. The company believes these non-GAAP measures provide\n\n(Item 2.02) ) 104 Cover Page Interactive Data File (embedded within the Inline XBRL document)": 0.1,
  "Got $1,000? 2 Top Growth Stocks to Buy That Could Double Your Money.": 0.8,
  "ASML Just Quietly Booked Billions for Its EUV Machines. Is It Time to Buy the Stock?": 0.5,
  "Agoda launches first-ever brand campaign in Singapore with AI-powered commercials": 0.5,
  "Port of Los Angeles sees record container traffic as shippers race to beat Trump’s tariff deadlines - https://www.cnbc.com/2025/07/14/port-of-los-angeles-record-container-traffic-trade-war-shipping-tariffs.html KEY POINTS The Port of Los Angeles says that shipping container traffic has increased as importers race to beat the latest deadlines set by President Trump for tariffs. Trade from China, while short of a Covid-like surge, has been up ahead of the mid-August deadline for a deal which could raise tariffs on Chinese goods to 145%.": 0.5,
  "Earnings To Watch: CSX (CSX) Reports Q2 Results Tomorrow": 0.2,
  "O'Reilly (ORLY) To Report Earnings Tomorrow: Here Is What To Expect": 0.2,
  "Redditors working in IT, how do you feel about Cisco? - Some analysts are saying Cisco might be a great buy given it is undervalued compared to other AI infrastructure plays. But is it an AI play or just another cautionary tale? Some questions: * How exciting is the partnership with Nvidia? Nvidia has their own networking products so how will this work? Will Nvidia end up just using Cisco's connections to get in front": 0.2,
  "How can I learn to properly research stocks? - I’ve been in the market for a while but mostly just trading based on news and basic price trends. With earnings season coming up, I really want to take things a bit more seriously and improve my ability to do fundamental research. Problem is, I’m not quite sure where to begin. I know I should look at earnings reports, valuation ratios, maybe even compare companies in": 0.2,
  "2 Reasons to Watch ADP and 1 to Stay Cautious": 0.5,
  "2 Reasons to Avoid VRSK and 1 Stock to Buy Instead": -0.5,
  "2 Unpopular Stocks That Deserve a Second Chance and 1 We Find Risky": 0.2,
  "Accounting Automation Tools (2025): QuickBooks Awarded Best Accounting Automation Solution in Report by Better Business Advice": 0.8,
  "Infinitesima Begins Project to Further Develop the Capabilities of the Metron3D 300 mm In-line Wafer Metrology System": 0.5,
  "Roper Technologies Inc (ROP) Q2 2025 Earnings Call Highlights: Strong Revenue Growth and ...": 0.8,
  "Leveraged Bearish Strategy ETF Pulls in Millions at Record Lows": 0.5,
  "Bispecific Antibodies Market Set to Surge to $163.15 Billion by 2032, Driven by a Robust 40.1% CAGR | Roche, Amgen, and Johnson & Johnson at the Forefront: AnalystView Market Insights": 0.8,
  "Zacks.com featured highlights NVIDIA, AppLovin and GE Aerospace": 0.2,
  "Can Netflix Stock Double by 2028?": 0.5,
  "SpaceX Wallet Springs to Life With $153M Bitcoin Transfer, First Move Since 2022": 0.5,
  "2 Stocks to Buy on the Dip and Hold for 10 Years": 0.5,
  "The Zacks Analyst Blog Highlights HubSpot, Okta, Adobe, NICE and Teradata": 0.5,
  "Company News for Jul 22, 2025": 0.0,
  "Cisco Takes Licence to the Sisvel Wi-Fi 6 Patent Pool": 0.5,
  "3 Healthcare Stocks to Buy Before They Announce Game-Changing Clinical Trial Results": 0.5,
  "Is CrowdStrike a Buy a Year After the Big IT Outage?": 0.2,
  "C5i Expands Strategic Advisory Board With AI Strategist Liat Ben-Zur and BFSI Leader Anshu Sharma Raja": 0.5,
  "Liberty Group exits hotel business after 45 years": -0.5,
  "Biogen to invest further $2bn in North Carolina’s Research Triangle Park": 0.8,
  "Airbnb ‘take over’ now driving up Atlanta homeowners’ costs — here’s why insurance may be their next headache": -0.6,
  "r/Stocks Daily Discussion & Technicals Tuesday - Jul 22, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on technical analysis (TA), but if TA is not your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly": 0.2,
  "Trump Media stock tests the limits of bitcoin accumulation": 0.1,
  "Market Chatter: Hackers Breach US, European Government Networks Using Microsoft SharePoint Software Flaw": -0.8,
  "MicroStrategy Bolsters Its Bitcoin War Chest": 0.5,
  "I calculated which stocks are most sensitive to tariff announcements - In preparation for the August 1 tariff deadlines, I think it's important to know which stocks are most and least sensitive to tariff-related news. This will allow us to select exactly the stocks that will change the most when new tariff changes are announced, or buy the ones that are least sensitive to hedge your position or profit from the opposite direction. To calculate": 0.2,
  "After Falling on Earnings, Should You Buy the Dip in ASML Stock?": 0.5,
  "'Superman' Flies Past $400 Million But Falters Overseas, While 'Jurassic World Rebirth' Charges Toward $650 Million In A Red-Hot Summer Box Office Battle": 0.6,
  "Those who invested in Marvell Technology (NASDAQ:MRVL) five years ago are up 110%": 0.8,
  "Here's Why We Think Axon Enterprise (NASDAQ:AXON) Is Well Worth Watching": 0.6,
  "PepsiCo to roll out prebiotic cola in US": 0.5,
  "Union Pacific--Norfolk Southern Merger Buzz Could Spur Berkshire to Target CSX": 0.5,
  "ISRG Stock Before Q2 Earnings Release: To Buy or Not to Buy?": 0.2,
  "15 names that Morgan Stanley’s analysts expect to move meaningfully on earnings": 0.5,
  "ISRG vs. SYK: Which Robotic Surgery Stock Is the Stronger Buy Today?": 0.5,
  "Buy 5 Big Data Behemoths to Strengthen Your Portfolio in 2H 2025": 0.5,
  "Applied Materials Appoints Jim Anderson to Board of Directors": 0.5,
  "Buy Now or Regret Later: This Small-Cap Stock Has Big Disruption Potential": 0.8,
  "1 Stock-Split Stock to Buy Hand Over Fist in July and 1 to Avoid": 0.5,
  "Stocks Down Pre-Bell Ahead of Key Earnings, Fed Chair Powell's Speech": -0.5,
  "Here’s Why Copart (CPRT) Lagged the Market": -0.5,
  "Vertex Pharmaceuticals' Quarterly Earnings Preview: What You Need to Know": 0.5,
  "$ENVX Enovix Corp undertaking transformative battery tech - DD on $ENVX Enovix Batteries Corp (posted on behalf of 2percentisfair on X) Most battery tech journalism is frustrating because you will hear constant tales of a tech that will double or triple battery capacity, and then of course the change never happens. The reason for this is multi-faceted: 1) what works in a lab often doesn't work in real world conditions, 2) battery materials are like": 0.2,
  "Starbucks opens new drive-through store in St Philip, Barbados": 0.5,
  "5 Things to Know Before the Stock Market Opens": 0.0,
  "Astrazeneca, Phillip Morris & D.R. Horton earnings: Trending Tickers": 0.0,
  "SentinelOne (S) Moves 9.8% Higher: Will This Strength Last?": 0.4,
  "PACCAR Achieves Good Quarterly Revenues and Profits": 0.8,
  "Boasting A 25% Return On Equity, Is NXP Semiconductors N.V. (NASDAQ:NXPI) A Top Quality Stock?": 0.5,
  "45% Of This Constellation Energy Insider's Holdings Were Sold": -0.5,
  "CrowdStrike Named the Frost Radar™ Leader in Managed Detection and Response for Second Consecutive Year": 0.8,
  "Paccar: Q2 Earnings Snapshot": 0.0,
  "Investor Confidence in Continued Growth Boosted Netflix (NFLX) in Q2": 0.8,
  "PACCAR (NASDAQ:PCAR) Posts Better-Than-Expected Sales In Q2": 0.8,
  "Microbot Medical® Expands Commercial Leadership with Appointment of Christina Bailey as VP of Sales": 0.5,
  "Intuit Launches New Agentic AI Experiences and Financial Management Capabilities for Intuit Enterprise Suite to Drive Mid-Market Business Growth": 0.5,
  "CTL Expands Leadership Team with New Sales Executive": 0.5,
  "Carnival and General Mills have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Is the Options Market Predicting a Spike in Analog Devices Stock?": 0.2,
  "PPL vs. Xcel Energy: Which Utility Stock Offers More Upside?": 0.2,
  "Figma’s IPO Seeks $13B Valuation in Latest Tech Debut. How It Stacks Up to Adobe.": 0.5,
  "Micron Launches Space-Qualified Portfolio to Power Mission-Critical Data for Aerospace Innovation": 0.6,
  "Fortinet Advances Quantum-Safe Security to Guard against Emerging Quantum Threats": 0.6,
  "VAYK Appoints Jason Armstrong as CEO for Organic Growth to $5 Million Revenue": 0.6,
  "Flexential Names 2 VPs to Lead Site Growth and Energy Strategy": 0.5,
  "Is Trending Stock Netflix, Inc. (NFLX) a Buy Now?": 0.2,
  "How to Boost Your Portfolio with Top Medical Stocks Set to Beat Earnings": 0.5,
  "Investors Heavily Search Micron Technology, Inc. (MU): Here is What You Need to Know": 0.5,
  "Adobe Inc. (ADBE) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "AppLovin Corporation (APP) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Those who invested in Exelon (NASDAQ:EXC) a year ago are up 25%": 0.5,
  "Coca-Cola Europacific Partners to close non-refundable PET line in Germany": -0.5,
  "PACCAR shares up after Q2 profit beat": 0.8,
  "Tesla’s Easy Money from Regulatory Credits Drying Up Amid Sluggish Sales - Tesla's financial model has long been propped up by selling regulatory credits to traditional automakers, but that source of income is rapidly shrinking as U.S. government policies change and Tesla’s sales falter. In a key shift, recent changes to environmental laws, particularly under the Trump administration, are set to weaken the demand for these credits. Essentially, regulatory credits have been a way for": -0.7,
  "Vuori plots international growth with 15 stores": 0.5,
  "Morning Movers: Cleveland-Cliffs rallies after second quarter earnings release": 0.6,
  "Paccar (PCAR) Beats Q2 Earnings and Revenue Estimates": 0.8,
  "Figma aims for $16 billion valuation as IPO date and stock listing nears": 0.5,
  "Palo Alto Networks Completes Acquisition of Protect AI": 0.5,
  "Countdown to Charter (CHTR) Q2 Earnings: A Look at Estimates Beyond Revenue and EPS": 0.2,
  "How Cisco Foundation and Social Impact Investments Are Driving Impact at Scale": 0.5,
  "Hotel Dining Steps Into The Spotlight: OpenTable and KAYAK Debut The Top 100 Hotel Restaurants in America": 0.5,
  "Net Impact Announces Global Case Competition on Social Impact and Business Outcomes": 0.5,
  "Brokers Suggest Investing in Zscaler (ZS): Read This Before Placing a Bet": 0.5,
  "Brokers Suggest Investing in Cadence (CDNS): Read This Before Placing a Bet": 0.5,
  "Why This 1 Computer and Technology Stock Could Be a Great Addition to Your Portfolio": 0.8,
  "Is It Worth Investing in Take-Two (TTWO) Based on Wall Street's Bullish Views?": 0.5,
  "Brokers Suggest Investing in Marvell (MRVL): Read This Before Placing a Bet": 0.5,
  "Paccar (PCAR) Reports Q2 Earnings: What Key Metrics Have to Say": 0.2,
  "Lockheed Martin, AstraZeneca, DR Horton: Trending Tickers": 0.0,
  "Applied Materials (AMAT) Recently Broke Out Above the 20-Day Moving Average": 0.5,
  "SharpLink's Ether Bet Surpasses $1.3B After Latest Purchase": 0.8,
  "1 Incredible Reason to Buy This Dividend Stock Before July 29": 0.6,
  "Here's Why CDW (CDW) is a Strong Value Stock": 0.6,
  "Netflix downgraded, Intel initiated: Wall Street's top analyst calls": 0.1,
  "Stifel Q2 cybersecurity survey: Macro dynamics weighing on near-term results": -0.5,
  "Over 30 million US homes don’t have a mortgage, report says — why that’s a red flag for the housing market": -0.6,
  "Here's Why Intuit (INTU) is a Strong Growth Stock": 0.8,
  "S&P 500 stocks: List of additions and removals in 2025": 0.0,
  "True Random Number Generator Market Company Evaluation Report 2025: Apple, Intel, and Qualcomm Technologies Shaping the Future of Secure Communications, Financial Transactions, & Defense Applications": 0.5,
  "Will Cisco's Focus on Web-Scale Clients Bring More AI Deals?": 0.5,
  "Hotel Dining Steps Into The Spotlight: OpenTable and KAYAK Debut The Top 50 Hotel Restaurants in Canada": 0.5,
  "Electronic Arts (EA) Expected to Beat Earnings Estimates: What to Know Ahead of Q1 Release": 0.5,
  "Booking Holdings (BKNG) Earnings Expected to Grow: Should You Buy?": 0.5,
  "Earnings Preview: Mondelez (MDLZ) Q2 Earnings Expected to Decline": -0.5,
  "Analysts Estimate Starbucks (SBUX) to Report a Decline in Earnings: What to Look Out for": -0.5,
  "Paypal (PYPL) Reports Next Week: Wall Street Expects Earnings Growth": 0.5,
  "Is Alibaba Cloud's Growing Partner Base a Catalyst for Future Returns?": 0.5,
  "Halliburton Stock Slips. CEO Sees Oil Services Demand Weakening.": -0.7,
  "Jefferies Maintains Underperform on Lululemon (LULU), Trims Target to $175": -0.5,
  "NXP Semiconductors Q2 Earnings Beat Estimates, Revenues Fall Y/Y": 0.2,
  "Meet the Newest Growth Stock Joining the S&P 500. It's Up 80% in 3 Months, and It's Still a Buy Right Now, According to Wall Street.": 0.8,
  "Stocks Pressured by Chip Stock Weakness": -0.5,
  "QuantumScape (QS) Can't Hide Commercialization Lag Even After Big Gains; I'm Keeping a Neutral Point of View - QuantumScape (NYSE: QS) shares have doubled in value in just a few weeks, soaring to a market capitalization of about $7.6 billion after announcing the inclusion of Cobra diaphragms in its baseline production process. But I don't think the current valuation is sustainably supported, despite the major theoretical breakthrough in solid-state battery technology. Highlight review: The Cobra": 0.1,
  "OneBill and Cisco Accelerates Customer Onboarding, Billing, and Revenue Management for Cisco BroadWorks Service Providers": 0.5,
  "Charter Communications to Report Q2 Earnings: What's in the Cards?": 0.2,
  "Should You Consider Adding IDEXX Laboratories (IDXX) to Your Portfolio?": 0.5,
  "Berkshire Hathaway May Have Stepped Up Its Role in Potential Railroad Mergers": 0.5,
  "Should you replace your bank account with PayPal?": 0.2,
  "How Global Expansion Is Shaping Costco's Long-Term Profile": 0.5,
  "Fortinet Expands via Cross-Selling: A Path to More Profitability?": 0.5,
  "NXP CEO Expects Auto Chip Demand to Recover After Two-Year Slump": 0.6,
  "Dollar General Up 51% in 6 Months: Time to Cash Out or Hold DG Stock?": 0.2,
  "Keurig Dr Pepper Likely to Post In-Line Q2 Despite Softer Sales, RBC Says": 0.2,
  "Mondelez Q2 Earnings Expected to Be 'Positive Catalyst' for Stock, Vital Farms Likely to Raise Outlook, Morgan Stanley Says": 0.8,
  "Stocks Slip on Weakness in Chip Makers and Disappointing Earnings": -0.7,
  "Are These Stocks the Next FANG? Jim Cramer Thinks So": 0.5,
  "What's driving AstraZeneca's $50B US investment push": 0.2,
  "Micron Launches First Space-Ready Memory Chip To Power AI Missions In Orbit": 0.8,
  "Veho and Enveyo Integration Enables Enterprise Shippers and 3PLs to Easily Diversify Last Mile Delivery": 0.5,
  "Arm Holdings (ARM) Stays on Analyst Radar as AI Demand Fuels Fresh Price Target": 0.5,
  "I'm bullish on AST SpaceMobile because it has major contracts with Vi India and NASDA - I'm bullish on AST SpaceMobile, Inc. ( NASDAQ: ASTS ) based on recent contracts with government and commercial organizations. For example, a deal with Vi India (Vodafone Idea) to provide satellite connectivity could reach 1.1 billion subscribers, while a government contract with the U.S. Space Development Agency (SDA) is expected to generate $43 million in revenue. When I looked": 0.8,
  "AZN Commits USD50B to US Manufacturing Expansion Amid Tariff Pressures": 0.5,
  "Talkdesk introduces new multi-storefront capability for retailers": 0.5,
  "Zoom Workplace enhancements:  Opportunities and hurdles": 0.5,
  "Shopify (SHOP) Stock Trades Down, Here Is Why": -0.5,
  "Electronic Arts (EA) Stock Trades Up, Here Is Why": 0.5,
  "Carahsoft Authorized as Cisco Public Sector Distributor, Delivering Comprehensive Networking and Security Solutions": 0.6,
  "AEP Declares Quarterly Dividend on Common Stock": 0.0,
  "SafeRacks Launches Viral Bin Storage Rack, Redefining Home and Garage Organization": 0.6,
  "Netflix (NFLX) Upgraded to Strong Buy: Here's Why": 0.8,
  "Why Take-Two (TTWO) is Poised to Beat Earnings Estimates Again": 0.8,
  "Will CDW (CDW) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Railroad stocks, Microsoft, Equifax: Trending Tickers": 0.2,
  "Stardog Appoints Sara Golbourn as Chief Revenue Officer to Scale the Enterprise Answer Engine": 0.5,
  "Chip stocks slide, NXP weak outlook, Coinbase inks PNC deal": -0.5,
  "NVIDIA (NVDA) Analysts See Long-Term Upside as AI Exports to China Get Green Light": 0.8,
  "Strategy vs. Riot Platforms: Which Bitcoin-Focused Stock Has an Edge?": 0.2,
  "CRWD Bets on Agentic AI Security: Will it Unlock Next Growth Phase?": 0.6,
  "How insiders are cashing in on a ‘complicated’ crypto treasury trend": 0.2,
  "GitLab's Partner Base Expands: Is Growth Thesis Strengthening?": 0.6,
  "Poppi Founder Allison Ellsworth on Selling Her $500 Million Brand: 'You're Happy But You Have Anxiety'": 0.2,
  "Nvidia, Apple Partner Sets Up After 217% Surge; Custom Chip King Eyes AI Boom": 0.8,
  "Why Paccar Stock Popped Today": 0.5,
  "Etsy faces user boycott over ‘Alligator Alcatraz’-branded products": -0.8,
  "PACCAR CEO Optimistic About Growth Despite Soft Truckload Market, Tariff Concerns": 0.8,
  "Vertex Announces Marketing Authorization in Canada for ALYFTREK, a Once-Daily Next-Generation CFTR Modulator for the Treatment of Cystic Fibrosis": 0.8,
  "Solana News: $SOL >$200, Ecosystem >$250 Billion, DEX Volume >$1 Trillion for 2025": 0.8,
  "ASML Earnings \"Miss\": What the Market Got Wrong": -0.5,
  "PepsiCo Stock Just Had Its Best Day in Over 5 Years. Is The Dividend King a No-Brainer Buy Now?": 0.8,
  "AstraZeneca to invest $50 bn in the US as tariff threat looms": 0.5,
  "Coca-Cola swaps corn syrup for cane sugar in MAHA-inspired move": 0.5,
  "Intuit (INTU) Enhances Enterprise Suite With AI Agents For Mid-Market Business Efficiency": 0.6,
  "PepsiCo (PEP) Innovates With Launch Of Prebiotic Cola To Meet Modern Tastes": 0.8,
  "American Electric Power Company (AEP) Declares US$0.93 Quarterly Dividend Payable September 2025": 0.5,
  "Alphabet and Tesla Earnings, Home Sales and More: What to Watch This Week": 0.2,
  "Linde (LIN) Expands U.S. Space Footprint With New Industrial Gas Facilities": 0.5,
  "NXP Semiconductors (NXPI) Reports Lower Q2 Earnings, Provides Q3 Revenue Guidance": -0.5,
  "Palo Alto Networks (PANW) Eyes Possible Acquisition of SentinelOne for Approximately US$7 Billion": 0.5,
  "Netflix Lifted Guidance. Is the Stock a Buy Following Its Drop?": 0.2,
  "US Equity Indexes Mixed as General Motors Reports $1.1 Billion Tariff Hit, Economic Data Show Weakness": -0.6,
  "Arm Holdings (ARM) Reports Strong Year-Over-Year Performance Despite Net Income Dip": 0.6,
  "Is Google new AI model release Gemini 2.5 Flash-Lite worth keeping an eye on? - Google just released Gemini 2.5 Flash-Lite their fastest and lowest-cost AI model yet optimised for latency-sensitive tasks like translation and classification. Compared to previous versions it has lower latency and is more affordable Many companies are already using it such as Satlyt to reduce latency and power consumption HeyGen to do automatic video translation DocsHound to process long videos and": 0.6,
  "Pepsi to introduce prebiotic cola this fall after buying Poppi": 0.2,
  "PepsiCo To Launch Cane Sugar-Based Prebiotic Cola This Fall To Counter Declining Soda Consumption": 0.5,
  "Corporate Earnings, Trade Developments Leave Equity Markets Mixed Intraday": 0.0,
  "Microsoft Says Chinese Hackers Exploiting SharePoint Flaws": -0.6,
  "Time to sell ENPH? - Enphase been on a constant slope for a year and with the current US administration it seems to have very little incentive to rise much within the next 3.5 years. What are your opinions? Time to sell and invest in something more lucrative and get in later? My entry was around 70$": -0.6,
  "The S&P 500 Would Be Cruising to Another Record Today—If Not for These Stocks": 0.2,
  "Why This Analog Semiconductor Stock Is A Top Undervalued Pick": 0.8,
  "NXPI Q2 Deep Dive: Early Signs of Cyclical Recovery, Automotive Inventory Headwinds Ease": 0.6,
  "Lululemon's China Cooldown And US Struggles Weigh On Outlook": -0.5,
  "Navitas vs. ON Semiconductor: Which Power Stock is a Better Bet Now?": 0.2,
  "Why CSX (CSX) Stock Is Up Today": 0.5,
  "Tesla's California sales down for seven straight quarters - https://www.reuters.com/business/autos-transportation/teslas-california-sales-down-seven-straight-quarters-2025-07-22/ “July 22 (Reuters) - Tesla's (TSLA.O), opens new tab electric vehicle registrations in California fell 21.1% in the second quarter, according to industry data, marking the seventh consecutive quarterly drop in the crucial U.S. market.”": -0.8,
  "Forecasts for Milder US Weather Weigh on Nat-Gas Prices": -0.5,
  "Sector Update: Tech Stocks Retreat Late Afternoon": -0.5,
  "SentinelOne (S) Rallies 9.8% on $10-Billion Potential Buyout": 0.8,
  "General Motors and Coca-Cola earnings reveal an important reminder: Opening Bid top takeaways": 0.2,
  "Oracle & OpenAI, Amazon, NXP Semi: Trending Tickers": 0.0,
  "S&P 500 Ekes Out Record–Even as Nvidia and Broadcom Close Lower": 0.2,
  "CoStar Group Q2 Revenue Increases 15% Year-over-Year, Achieves All-time High Quarterly Net New Bookings of $93 million and Increases Homes.com Members 56% from Q1 2025": 0.8,
  "Intuitive Announces Second Quarter Earnings": 0.0,
  "Baker Hughes Declares Quarterly Dividend": 0.0,
  "Pharma sector outlook as Trump's drug tariff deadline looms": 0.1,
  "Alphabet’s Longest Rally Since 2010 Underlines Earnings Optimism": 0.8,
  "question about wash sales and partial sales - so i've always wondered. let's say you buy 1000 shares of X corp on January 1st. and you see the price going down so you decide to sell 500 shares. Now you have 500 shares short term remaining. Let's say you decided to buy back 500 shares in July and then sell the 500 shares again in September. So you are back to having just 500 shares": 0.0,
  "CoStar: Q2 Earnings Snapshot": 0.0,
  "Intuitive Surgical (NASDAQ:ISRG) Beats Expectations in Strong Q2": 0.8,
  "China innovation and deals are good for biotech: AstraZeneca CEO": 0.6,
  "Is Robinhood’s Earnings Notification Broken on LMT? - Notification when I woke up said Lockheed earned $7.29 per share beating expectations by 11%. I bought some shares thinking the dip was random. Then I read some news saying they massively missed earnings, earning $1.46 a share. Missing expected earnings of $6.41…. Where did they pull the 7.29 number from LMFAO. Mad I bought shares but it is at a massive low rn for an evil": -0.8,
  "Earnings release - how soon can I find out? - A company I am interested in was supposed to release the earnings today after market close. Market closed 25 minutes back and I cannot find the earnings anywhere online (on their website or google or yahoo or nasdaq). I know I will be able to find the earnings tomorrow on google but is there a way to find them today? Is there a way to": -0.5,
  "Figma’s Auction-Like IPO Set Up to Capitalize on Strong Demand": 0.8,
  "CoStar’s (NASDAQ:CSGP) Q2 Sales Top Estimates": 0.8,
  "Three Video Streamers Top Netflix In Customer Satisfaction": 0.6,
  "Robotic surgery giant Intuitive falls on profit margin concerns": -0.6,
  "Hershey Lifts Candy Prices, Citing High Cocoa Costs": -0.5,
  "Arm Rises 3% as Wells Fargo Lifts Price Target to $175": 0.8,
  "Constellation Energy and Vistra stocks surge after PJM capacity auction results": 0.8,
  "S&P 500 Notches New Record, Nasdaq Snaps 6-Day Winning Streak": 0.5,
  "Baker Hughes Company Announces Second-Quarter 2025 Results": 0.5,
  "Low income people: where's your portfolio at? - I'm sure you've all seen the posts about people hitting milestones on this sub and others, and perhaps felt a bit inadequate for being so far behind. You know the ones I'm talking about: 30 year olds hitting $100k on 6 figure salaries or mid earners FIREing and investing every penny whilst living with parents. So this is a post for normal people with low-mid salaries with": -0.6,
  "Baker Hughes: Q2 Earnings Snapshot": 0.0,
  "CoStar raises annual revenue forecast as net bookings climb": 0.8,
  "Baker Hughes beats second-quarter profit estimates on strong demand for natgas technology": 0.8,
  "CoStar Group (CSGP) Q2 Earnings and Revenues Beat Estimates": 0.8,
  "Intuitive Surgical, Inc. (ISRG) Q2 Earnings and Revenues Top Estimates": 0.8,
  "CoStar (CSGP) Reports Q2 Earnings: What Key Metrics Have to Say": 0.2,
  "Baker Hughes Logs Higher Second-Quarter Profit, but Revenue Slides": 0.2,
  "Marvell Technology (MRVL) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Why Cadence Design Systems (CDNS) Outpaced the Stock Market Today": 0.5,
  "Fortinet (FTNT) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Intuitive Surgical (ISRG) Reports Q2 Earnings: What Key Metrics Have to Say": 0.2,
  "Analog Devices (ADI) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "Gilead Sciences (GILD) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Booking Holdings (BKNG) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Vertex Pharmaceuticals (VRTX) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "AstraZeneca Announces $50B US Investment Amid Pharma Tariff Threat": 0.5,
  "Intuitive Surgical reports upbeat quarterly earnings on strong demand for surgical robots": 0.8,
  "Charter and Comcast Announce Agreement to Leverage T-Mobile 5G for Wireless Business Customers": 0.5,
  "Baker Hughes (BKR) Tops Q2 Earnings and Revenue Estimates": 0.8,
  "Why Broadcom Stock Sank Today": -0.5,
  "Ross Stores (ROST) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "KLA (KLAC) Stock Falls Amid Market Uptick: What Investors Need to Know": -0.2,
  "Why Autodesk (ADSK) Outpaced the Stock Market Today": 0.5,
  "Tech, Media & Telecom Roundup: Market Talk": 0.0,
  "Mondelēz 2024 Snacking Made Right Report: Waste": -0.5,
  "T-Mobile, Comcast, Charter Team Up on Mobile Services for Businesses": 0.5,
  "Why Micron Stock Sank Today": -0.5,
  "T-Mobile's 5G to power Comcast, Charter wireless business plans": 0.5,
  "(Item 8.01) Other Events. On July 21, 2025, a purported class action lawsuit was filed in the Court of Chancery of the State of Delaware against us and our board of directors (the “Board”) alleging violations of the Delaware General Corporation Law (the “DGCL”), and asserting a claim against our Board for breach of fiduciary duty in connection with the purported DGCL violation. The plaintiff, David Dodge (the “Plaintiff”), purports to assert claims on behalf of himself": -0.6,
  "(Item 2.02) . Results of Operations and Financial Condition. On July 23, 2025, Alphabet Inc. (“ Alphabet ” or the “ Company ”) is issuing a press release and holding a conference call regarding its financial results for the quarter ended June 30, 2025. A copy of the press release is furnished as Exhibit 99.1 to this Current Report on Form 8-K. This information shall not be deemed “filed” for purposes of Section 18 of the Securities\n\n(Item 8.01) . Other Events. Alphabet’s Board of Directors declared a quarterly cash dividend of $0.21 payable on September 15, 2025 to stockholders of record for each of the Company’s Class A, Class B, and Class C shares as of September 8, 2025.": 0.2,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On July 22, 2025, Sara Martinez Tucker notified the Board of Directors (“Board”) of American Electric Power Company, Inc. (the “Company”) that she would resign as the Chair of the Board effective as of July 31, 2025. Ms. Tucker stated that she is resigning as Chair of the Board for personal reasons and not due to": -0.2,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. The Board of Directors (the “Board”) of Marvell Technology, Inc. (the “Company”) approved the appointment of Rajiv Ramaswami to the Board effective July 22, 2025. Mr. Ramaswami, age 59, has served as a Director and the President and Chief Executive Officer of Nutanix, Inc., an enterprise Cloud computing company since December 2020. Mr. Ramaswami has more than": 0.1,
  "(Item 8.01) . Other Events. PepsiCo Senior Notes Offering. On July 21, 2025, PepsiCo, Inc. (“PepsiCo”) announced an offering of $750,000,000 aggregate principal amount of its 4.100% Senior Notes due 2029 (the “2029 Notes”), $650,000,000 aggregate principal amount of its 4.300% Senior Notes due 2030 (the “2030 Notes”), $850,000,000 aggregate principal amount of its 4.650% Senior Notes due 2032 (the “2032 Notes”) and $1,250,000,000 aggregate principal amount of its 5.000% Senior Notes due 2035 (the “2035 Notes,”": 0.1,
  "(Item 2.02) – Results of Operations and Financial Condition ​ On July 23, 2025, O’Reilly Automotive Inc. (the “Company”) issued a press release announcing its 2025 second quarter earnings. The text of the press release is attached hereto as Exhibit 99.1. ​ Section 9 – Financial Statements and Exhibits ​": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition. On July 23, 2025, Tesla, Inc. released its financial results for the quarter ended June 30, 2025 by posting its Second Quarter 2025 Update on its website. The full text of the update is attached hereto as Exhibit 99.1 and is incorporated herein by reference . This information is intended to be furnished under\n\n(Item 2.02) of Form 8-K, “Results of Operations and Financial Condition” and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such a filing.": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition On July 23, 2025, CSX Corporation issued a press release and its CSX Quarterly Financial Report on financial and operating results for the quarter ended June 30, 2025. A copy of the press release is attached as Exhibit 99.1 and a copy of the CSX Quarterly Financial Report is attached as Exhibit 99.2, each of which is incorporated by reference herein. These documents are available on the Company's": 0.0,
  "2 Magnificent S&P 500 Dividend Stocks Down 2% and 16% to Buy and Hold Forever": 0.6,
  "(Item 2.02) — Results of Operations and Financial Condition On July 23, 2025, T-Mobile US, Inc. (the “Company”) issued a press release announcing the financial and operating results of the Company for the quarter ended June 30, 2025. The text of the press release and accompanying Investor Factbook are furnished as Exhibits 99.1 and 99.2 and incorporated herein by reference. The information in\n\n(Item 2.02) to this Current Report on Form 8-K, including Exhibits 99.1 and 99.2 , is being furnished and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended, except as expressly set forth by specific reference in such filing.": 0.1,
  "App India-US Free Trade 'Mini Deal' Likely By October: Sources - New Delhi: India is close to finalising an interim free trade agreement with the United States, sources told NDTV Monday evening, and said an announcement is expected by September or October. Indian negotiators returned from the US Saturday after a fifth round of talks. A team of American officials is expected in India in mid-August as both sides race to secure a provisional deal": 0.6,
  "Peter Schiff Says UK's Plan to Sell $6.7 Billion In Seized Bitcoin Could Help Budget: 'I Hope The US Doesn't Buy It For The Strategic Reserve'": 0.5,
  "Trump Announces Japan Trade Pact, Revises Trade Terms With Indonesia, Philippines": 0.5,
  "Brokers who don't charge margin interest on balanced long-short positions w/cash deficit? - (x-post from /r/trading, where it was flagged as a general question, though I can't find anything in their resources addressing this) Hey all, I've been running around in circles on this question and can't seem to find a straight answer. Say I have an account with positions as follows: * $5000 in ABC * -$5000 in XYZ (short position, obviously) * $1000": -0.2,
  "Market Rally on Aug. 1st. - Seeing how the Japanese market is rallying after Trump announced 15% on Japan, which is better then the threatened 25%, I believe Trump is gonna also lower the EU, Canada and Mexico tariffs before Aug. 1. Those countries will likely get 15% to 20%, which is far better then the previous tariff threats. I don't believe the market knows how to price in these tariff rates, so the market": 0.6,
  "AI Bookkeeping Software (2025): QuickBooks Named Leading AI Bookkeeping Solution in Report by Expert Consumers": 0.8,
  "Agoda Reveals 5 Most Booked Asian Destinations in the First Half of 2025": 0.5,
  "Keurig Dr Pepper (KDP) Reports Q2: Everything You Need To Know Ahead Of Earnings": 0.2,
  "Intel (INTC) Q2 Earnings: What To Expect": 0.2,
  "Honeywell (HON) Reports Earnings Tomorrow: What To Expect": 0.5,
  "Intel to cut 227 jobs at Rio Rancho plant, ending weeks of speculation": -0.6,
  "PayPal taps wallets from China and India to make cross-border payments easier for 2 billion people": 0.8,
  "Introducing PayPal World: a global platform connecting the world's largest payment systems and digital wallets, starting with interoperability to PayPal and Venmo": 0.8,
  "3 Reasons We’re Fans of DoorDash (DASH)": 0.5,
  "3 of Wall Street’s Favorite Stocks with Impressive Fundamentals": 0.6,
  "1 Cash-Producing Stock with Competitive Advantages and 2 We Find Risky": 0.5,
  "1 Unpopular Stock That Should Get More Attention and 2 We Avoid": 0.5,
  "Starbucks Opens Free Study Rooms in China to Lure Customers": 0.5,
  "PayPal to launch cross-border platform with link to India's UPI payments system": 0.5,
  "Taking stock of Alphabet (GOOGL GOOG) - Going into earnings, GOOGL has been up 10 straight trading days, so is it time to sell? Look at every single tech market where Alphabet is the dominant player or is in the top three. In many instances, GOOGL created the market or disrupted the market incumbent. It just emerged a few months ago that quantum computing was a thing; and which company had the breakthrough? Alphabet. (Full": 0.6,
  "China 30%, Japan 15%??? - Something doesn't seem right here. Trump has gotten China to agree to 30% tariffs, but Japan is getting 15%? Japan is 4.5% of US imports, whilst China is 15%. There is no paperwork on this agreement. I feel like this is just for show and Trump is gonna change the deal soon and the stock market is gonna tank.": -0.6,
  "Here's What to Expect From DoorDash's Next Earnings Report": 0.2,
  "What to Expect From Gilead Sciences’ Q2 2025 Earnings Report": 0.2,
  "Comcast Connects Homes and Businesses in Sublimity, Oregon to Reliable, High-Speed, Symmetrical Internet": 0.8,
  "r/Stocks Daily Discussion Wednesday - Jul 23, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.0,
  "NXP Semiconductors NV (NXPI) Q2 2025 Earnings Call Highlights: Navigating Market Challenges ...": 0.2,
  "PACCAR Inc (PCAR) Q2 2025 Earnings Call Highlights: Record Parts Revenue and Strategic ...": 0.5,
  "Intuitive Surgical Inc (ISRG) Q2 2025 Earnings Call Highlights: Robust Revenue Growth and ...": 0.8,
  "CoStar Group Inc (CSGP) Q2 2025 Earnings Call Highlights: Record Revenue Growth and Strategic ...": 0.8,
  "Alphabet and Tesla Earnings, Home Sales and More: Still to Come This Week": 0.5,
  "AI to subscribe news about stocks-related changes of enterprises? - I am relatively new to the stocks game (Anout 1.5 years) and I figured looking through news and filtering rekevant data is very bothersome. Stocks are supposed to be, at least in my case, a side hustle to invest. Which means I don't want to soend too much time on research. Is there a method to use an AI which offers notifications if stocks-related changes": 0.2,
  "Bear of the Day: Atlassian (TEAM)": 0.0,
  "Calciphylaxis Market Forecast Report 2025-2034 | Rising Incidence of Chronic Kidney Disease (CKD) and End-Stage Renal Disease (ESRD) Fueling Demand and Growth": 0.6,
  "Should You Double Up on ASML Stock Despite Growth Concerns?": -0.5,
  "Netflix's Growth Is Staggering. But Are Shares Still Attractive?": 0.5,
  "Atopic Dermatitis Market Forecast Report 2025-2034 | FDA Approval of Tralokinumab-Ldrm Stimulates Treatment Advances": 0.5,
  "Following a 112,700% Gain Since Its IPO, Is Netflix Stock a Buy, Sell, or Hold in 2025?": 0.5,
  "S&P 500 Is Getting More Bitcoin Exposure as Block Joins the Club": 0.5,
  "Luxury all‑inclusive resorts boom in Europe": 0.6,
  "DIGITIMES ASIA: Nvidia picks Micron for massive SOCAMM rollout": 0.5,
  "Will Buffett’s Successor Get the Same Free Pass From Investors?": 0.1,
  "Intel's chip contracting plan in spotlight on earnings day": 0.1,
  "The protein boom is only beginning": 0.5,
  "Why this early Google investor is funding think tanks in the U.S. and India": 0.5,
  "This one big money move sets rich retirees apart": 0.5,
  "United Airlines Holdings Inc (UAL): Get With The Program, Says Jim Cramer": 0.5,
  "What to Expect From Cisco's Next Quarterly Earnings Report": 0.2,
  "Costco Is One of the Largest Consumer Goods Companies by Market Cap. But Is It a Buy?": 0.2,
  "AstraZeneca announces $50bn US investment plans by 2030": 0.8,
  "UK watchdog investigates eight years of Deloitte audits of mining firm Glencore - The accounting firm Deloitte is under investigation by the sector regulator over eight years of its audits into the FTSE 100 commodities and mining company Glencore and a UK subsidiary. The Financial Reporting Council (FRC) said it was looking into whether Deloitte’s audits of Glencore and its subsidiary Glencore Energy UK for the financial years ending 2013 to 2020 “gave sufficient consideration": -0.6,
  "For the first time in a long time… I didn’t feel dumb for holding. - After months of watching everyone else’s “+300% in AI” or “sold before the crash” wins, I was seriously questioning if I’m just *bad* at this. But today, my boring, long-term plays actually *did the thing*. Slow grinders like MSFT, VOO, and a couple of small-cap bets finally turned green in a way that made me breathe again. Not rich overnight,": 0.6,
  "Tesla and the Trillion Dollar Club": 0.5,
  "Intuitive Surgical tempers tariff impact expectations": 0.5,
  "CDW to Announce Second Quarter 2025 Results on August 6": 0.0,
  "3 Brilliant Growth Stocks to Buy Now and Hold for the Long Term": 0.8,
  "Is There An Opportunity With AppLovin Corporation's (NASDAQ:APP) 23% Undervaluation?": 0.5,
  "Cognizant Technology Solutions Corporation's (NASDAQ:CTSH) Stock Been Rising: Are Strong Financials Guiding The Market?": 0.5,
  "Employees want informal social areas, food to boost collaboration": 0.5,
  "Grupo GEPP expands bottling operations with new returnable PET and glass lines": 0.5,
  "Northern Trust Corporation Reports Second Quarter 2025 Financial Results": 0.0,
  "This Week In AI Chips - WeRide Lenovo NVIDIA Unveil Groundbreaking Autonomous Driving Platform": 0.8,
  "July 2025's Noteworthy Stocks Trading Below Estimated Fair Value": 0.0,
  "Exelon's Q2 2025 Earnings: What to Expect": 0.0,
  "Microchip Technology (MCHP) Surged Following the Improvement in Fundamentals": 0.8,
  "Tenovi Expands Access to Glucose Data for Remote Patient Monitoring and Cardiometabolic Programs Through Dexcom Integration": 0.5,
  "Do You Believe in the Growth Potential of Amgen (AMGN)?": 0.5,
  "Sonim XP Pro Ultra-Rugged Smartphone Launches on T-Mobile": 0.5,
  "GE HealthCare drives growth with investment in AI-enabled medical devices and tops FDA’s list of AI authorizations for 4th Year with 100": 0.8,
  "Amgen's (NASDAQ:AMGN) three-year earnings growth trails the 10% YoY shareholder returns": 0.2,
  "The Return Trends At Workday (NASDAQ:WDAY) Look Promising": 0.8,
  "Old Dominion Freight Line (NASDAQ:ODFL) jumps 3.4% this week, though earnings growth is still tracking behind five-year shareholder returns": 0.1,
  "Analyst Bullish on Crowdstrike Holdings (CRWD) Says Cybersecurity Could Be ‘Biggest Subsector’ For Tech": 0.8,
  "Clorox files $380 million suit blaming Cognizant for 2023 cyberattack": -0.6,
  "Lower-income consumers remain 'under pressure' as big food companies lean on value message": -0.6,
  "MAINGEAR Drops Retro95: A 90s Throwback with 2025 Firepower": 0.5,
  "Meta Platforms and Atlassian have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "ISRG Stock Gains on Q2 Earnings & Sales Beat, Gross Margin Contracts": 0.2,
  "Company News for Jul 23, 2025": 0.0,
  "Tempus AI Gains FDA Nod Amid Booming AI ECG Market Momentum": 0.6,
  "Baker Hughes Q2 Earnings & Revenues Outpace Estimates": 0.8,
  "AI-Driven Cybersecurity Boom Makes These 3 Stocks Worth Buying": 0.8,
  "Paychex Again Named to Selling Power’s \"60 Best Companies to Sell For\" 2025 List": 0.6,
  "Payactiv Named a Workday Partner": 0.5,
  "Palo Alto Networks, Inc. (PANW) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "These 2 Computer and Technology Stocks Could Beat Earnings: Why They Should Be on Your Radar": 0.5,
  "ASML Holding N.V. (ASML) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Investors Heavily Search Constellation Energy Corporation (CEG): Here is What You Need to Know": 0.5,
  "Is Now The Time To Look At Buying Warner Bros. Discovery, Inc. (NASDAQ:WBD)?": 0.2,
  "Honeywell International Inc. (NASDAQ:HON) is favoured by institutional owners who hold 80% of the company": 0.5,
  "Is Atlassian Corporation (NASDAQ:TEAM) Potentially Undervalued?": 0.5,
  "Netflix Second Quarter 2025 Earnings: EPS Beats Expectations": 0.8,
  "Marvell Appoints Rajiv Ramaswami to its Board of Directors": 0.5,
  "This coffee chain overtook Starbucks in China. Now it’s open in the US": 0.5,
  "AI Boom Leads to Record US Grid Costs, Call for New Plants": 0.2,
  "US court dismisses child-labour claims against cocoa importers": 0.5,
  "What Analyst Projections for Key Metrics Reveal About Cadence (CDNS) Q2 Earnings": 0.2,
  "Here’s Why Broadcom (AVGO) Surged in Q2": 0.5,
  "ISRG: Solid Numbers, Tariff Concerns": 0.5,
  "Intuitive Surgical (ISRG) Is Considered a Good Investment by Brokers: Is That True?": 0.5,
  "Wall Street Analysts See MicroStrategy (MSTR) as a Buy: Should You Invest?": 0.5,
  "EU's $100B Counterattack: How Tariff Threats Could Roil the Markets - It’s been a busy week in trade news, and Trump’s latest moves are shaking up the market. The big one: a deal with Japan that’s being hailed as \"historic.\" While the details are still trickling out, we know it involves a 15% tariff on imports from Japan, along with a $550 billion investment into the U.S. But is this really a win for the": 0.2,
  "Texas Instruments Q2 Earnings Beat Estimates, Revenues Rise Y/Y": 0.8,
  "SAP Says Trade War, Dollar Weakness Weighing on Bottom Line": -0.5,
  "Analyst With $200 Advanced Micro Devices (AMD) Price Target Explains Why He’s Bullish, Sees ‘Big Reversal’ in AI Revenue": 0.8,
  "Are You a Value Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Shopify and Unity downgraded: Wall Street's top analyst calls": -0.5,
  "The Trade Desk vs. Alphabet: Which Ad-Tech Stock is the Smarter Buy?": 0.5,
  "Why Marvell Technology (MRVL) is a Top Growth Stock for the Long-Term": 0.8,
  "Amgen vs. Novo Nordisk: Which Pharma Giant Is the Better Buy?": 0.5,
  "AT&T Stock Slips Despite an Earnings Beat. Why Investors Were Looking for More.": -0.5,
  "Why CDW (CDW) is a Top Momentum Stock for the Long-Term": 0.6,
  "Dan Niles Explains Why He Turned Bullish on NVIDIA (NVDA)": 0.5,
  "Is Oklo Stock's Sky-High Valuation Justified or Simply Driven by Hype?": -0.5,
  "PACCAR Q2 Earnings Surpass Expectations, Sales Decline Y/Y": 0.2,
  "Zai Lab Limited (ZLAB) Stock Jumps 6.8%: Will It Continue to Soar?": 0.6,
  "UNC Health Southeastern Taps Transact + CBORD to Launch Mobile Meal Ordering": 0.2,
  "Trintech Achieves Workday Certified Integration to Further Accelerate Financial Close Processes": 0.5,
  "CDW (CDW) Expected to Beat Earnings Estimates: Should You Buy?": 0.5,
  "Automatic Data Processing (ADP) Reports Next Week: Wall Street Expects Earnings Growth": 0.6,
  "American Electric Power (AEP) Expected to Beat Earnings Estimates: What to Know Ahead of Q2 Release": 0.5,
  "Kraft Heinz (KHC) Expected to Beat Earnings Estimates: Can the Stock Move Higher?": 0.5,
  "Comcast's (NASDAQ:CMCSA) Returns Have Hit A Wall": -0.5,
  "PTC Inc. (PTC) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "Cognizant (CTSH) Reports Next Week: Wall Street Expects Earnings Growth": 0.5,
  "Lam Research (LRCX) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "Earnings Preview: Old Dominion Freight Line (ODFL) Q2 Earnings Expected to Decline": -0.7,
  "Qualcomm (QCOM) Reports Next Week: Wall Street Expects Earnings Growth": 0.5,
  "Rheumatoid Arthritis Therapeutics Market Forecast Report 2025-2034 | Rising Preference for Combination Therapies, and Entry of Generic Drugs Supports Expansion": 0.6,
  "Data Diode Market Report 2025, with Profiles of Siemens, Cisco Systems, BAE Systems, Thales Group, Singapore Technologies Engineering and More": 0.5,
  "This Analyst Says Lam Research (LRCX) is Among the Best AI Semiconductor Stocks to Buy on the Dip": 0.8,
  "Talen Energy, Constellation, and Vistra Stock Are on the Rise. What’s Lifting Shares.": 0.5,
  "Enterprise Suite and Agentic AI: Can Intuit Win Mid-Market?": 0.2,
  "Looking Back to the Future: Gilead's Long-Standing Commitment To Help End the HIV Epidemic": 0.5,
  "Nvidia Stock Is Rising. Here’s What Will Drive Huge Spending on AI Chips.": 0.8,
  "TSLA is about to release a new round of financial results, under the heavy “headwinds”, can Musk rebuild market confidence? - Latest News Impact New 4680 Battery Capacity Expansion: Tesla announced to accelerate the construction of 4680 battery production line to reduce the cost and improve the range and performance, which will enhance the competitiveness of Model 3 and Model Y. Supercharger network upgrade: Continued expansion of the charging network in an effort to take": 0.5,
  "Chip Stocks Are Weighing on the Nasdaq": -0.5,
  "SPECTRUM, XUMO AND EVERPASS ANNOUNCE LAUNCH OF EVERPASS APP ON XUMO STREAM BOX FOR SPECTRUM BUSINESS CUSTOMERS": 0.5,
  "Chocolate cravings are about to be costlier as Hershey’s confirms price increases are on the way": -0.7,
  "Amyotrophic Lateral Sclerosis (ALS) Market Forecast Report 2025-2034 | Advancements in Therapeutics and Approved Medications Such as Riluzole, Edaravone, and Nuedexta Drive Growth": 0.6,
  "Axon Eyes Expansion in Drone Equipment Space: Can It Deliver Growth?": 0.5,
  "Jim Cramer on Micron: “The Chart is Saying We Gotta Wait”": 0.2,
  "Jim Cramer on PepsiCo: “They Probably Have Something in Your Fridge or Your Pantry”": 0.5,
  "Jim Cramer on Costco: “It is a Victim of its Own Success”": -0.5,
  "Jim Cramer on Advanced Micro Devices: “It’s Going in the Right Direction”": 0.6,
  "Jim Cramer on Eli Lilly: “It Needs Breakthroughs in New Areas”": 0.2,
  "Sti‌cking with a s‌t‌oc‌k when sentiment turns - H‌old‌ing thr‌ough vol‌atili‌ty is one thing but h‌ol‌din‌g when m‌ar‌k‌et sentiment turns against your thesis is much harder. I’ve been long ‌D‌IS since late 2023 mainly for the rec‌overy in st‌ream‌ing and parks. Lately, even with decent results, the tone feels more bearish. Staying focused on fundamentals while ignoring noise isn’t easy How do you stay confident in a p‌o‌si‌tion‌ when h‌e‌adli‌n‌es start to ‌sh‌‌if‌t ag‌ainst you?": -0.6,
  "lululemon's Premium Valuation Shows Strength: Time to Buy or Wait?": 0.5,
  "Uranium Equities Rise While Prices Remain Steady, RBC Capital Markets Says": 0.5,
  "Oppenheimer Touts Marvell Technology (MRVL) as Top Data Center Play amid AI Infrastructure Ramp": 0.6,
  "Canadian rail giants may disrupt bids for Norfolk Southern, CSX": -0.5,
  "Applied Materials' R&D Investment is Climbing: Can it Deliver Results?": 0.5,
  "TOP SCIENCE TEACHERS ANNOUNCED FOR 12TH ANNUAL REGENERON STEM TEACHING FELLOWSHIP": 0.5,
  "AT&T poised for a Trump One Big Beautiful Bill Act windfall: Opening Bid top takeaways": 0.5,
  "Berkshire Hathaway Poised for Strong Q2 on Insurance Growth, UBS Says": 0.8,
  "Beyond Nvidia, Palantir, Top Funds Keep Loving This AI Stock": 0.5,
  "ComEd Announces $130,000 in Scholarships to City Colleges Line Worker Training Program": 0.6,
  "Wall Street Eyes $1,600 for Netflix Stock. What Could Push NFLX Higher?": 0.5,
  "Trump releases AI 'action plan' that offers a split with Biden": 0.2,
  "Surge in AI Orders Propels Baker Hughes Earnings, Outlook": 0.6,
  "SOUN is setting up for a move. My 200k SOUN bet - SOUN is currently low profile and I've been researching and following the stock for about two months now and here’s what i see. To keep it simple. the chart’s in a confirmed uptrend. higher highs higher lows since may. pulled back from 13.55 to the 11s, been chopping around there for like 2 weeks. doesn’t look like a top. looks like a flag.": 0.8,
  "Adobe’s CTO is getting more creative on the software maker’s approach to generating ‘safe’ AI tools": 0.5,
  "Billionaire Peter Thiel is Betting Big on Stablecoins. Should You Buy the \"MicroStrategy of Ethereum,\" Too?": 0.5,
  "Comcast’s Xfinity Unveils StreamStore: A Smarter, Simpler Way to Discover, Manage and Enjoy Entertainment": 0.8,
  "4 Technology Stocks Poised to Beat Earnings Estimates in Q2": 0.5,
  "As sales slump, new Intel CEO's contract manufacturing plan to face investor scrutiny": -0.5,
  "US and EU close in on 15% tariff deal - The EU and US are closing in on a trade deal that would impose 15 per cent tariffs on European imports, similar to the agreement Donald Trump struck with Japan this week. Brussels could agree to the so-called reciprocal levies to avoid the US President’s threat to raise them to 30 per cent from August 1, three people familiar with the situation told the Financial": 0.2,
  "Why institutions are wary of Ethereum treasury plays — for now": -0.5,
  "CrowdStrike Named a Leader and Fast Mover in the 2025 GigaOm Radar Report for Identity Security Posture Management (ISPM)": 0.8,
  "Would it be wise to wait for August 1? - I'm thinking of making a lump sum of $5k on Google, AMD, Amazon, ASTS and Rocketlab and forgetting about it for 5 years or so. Would you buy now, or wait for August 1? Probably doesn't matter too much when holding long term, but still I wanted to hear everyone's opinion on this": 0.2,
  "Is CRWV the most shorted stock? - If you look at short interest at end of June, around 10% of total float was shorted (17m) , however most of CRWV free float is subject to a lock up period after the IPO, so they won’t become available until end of september. Here is the catch, the current free float is only 47M, so we get to 36% at end of June, however on July 7th": 0.2,
  "Marriott completes CitizenM acquisition": 0.5,
  "US Equity Indexes Trade Close to Record Highs After Trump Announces Japan Trade Deal": 0.8,
  "The meme stock rally continues the Trump trade rebound that has stocks trading at record highs": 0.6,
  "Coke’s New Cane-Sweetened Soda Risks Upending Sugar Supplies": -0.5,
  "Will CoStar's Earnings & Revenue Beat in Q2 Drive the Stock Price?": 0.2,
  "Rheumatologists Eye AbbVie’s Rinvoq, Roche/Genentech’s Gazyva, and Bristol Myers Squibb’s Sotyktu as Front-Runners to Address Persistent Gaps in Systemic Lupus Erythematosus Care, Spherix Global Insights Reports": 0.6,
  "Palantir's Current Valuation: Stretched or Fully Justified?": 0.2,
  "US Equity Indexes Trade Near All-Time Highs After Trump's Japan Trade Deal Sets Lower Tariffs": 0.8,
  "Hershey to raise candy prices by double digits amid elevated cocoa costs": -0.7,
  "T Beats Q2 Earnings Estimates on Higher Revenues, Solid Demand - AT&T Inc.T reported strong second-quarter 2025 results with adjusted earnings and revenues beating the respective Zacks Consensus Estimate. The company witnessed solid wireless traction and customer additions, which were partially offset by lower demand for legacy voice and data services. AT&T recorded strong subscriber growth backed by a resilient business model and robust cash flow position, driven by a diligent execution of operational plans.": 0.8,
  "Stock Of The Day Plugs Into AI Revolution": 0.5,
  "Why Texas Instruments (TXN) Shares Are Sliding Today": -0.5,
  "Intel stock faces a chipmaking Catch-22, top analyst warns investors": -0.5,
  "Stocks rise, Texas Instruments falls, Alphabet & Tesla earnings": 0.2,
  "Intuitive Surgical (ISRG) Reports Strong Q2 Earnings With Revenue Up To US$2,440 Million": 0.8,
  "Vertex Pharmaceuticals (VRTX) Advances Cystic Fibrosis Treatment With ALYFTREK Approval in Canada": 0.8,
  "T-Mobile US (TMUS) Secures Multi-Year MVNO Deal With Charter And Comcast": 0.5,
  "Hershey (HSY) Announces Kirk Tanner As New CEO": 0.5,
  "BILL vs. Intuit: Which Fintech Powerhouse Stock Is the Smarter Buy?": 0.5,
  "Why CoStar (CSGP) Stock Is Trading Up Today": 0.5,
  "Sector Update: Energy Stocks Rise Wednesday Afternoon": 0.5,
  "This Former AI Underdog Might Be the Next Nvidia": 0.6,
  "AstraZeneca (LSE:AZN) Commits US$50 Billion For US Expansion By 2030": 0.8,
  "13 Dividend ETFs With Market-Beating Yields": 0.5,
  "Japan Trade Deal Helps Boost US Equities Ahead of Alphabet, Tesla Earnings": 0.6,
  "Stock Market Today: Dow rises almost 400 points, S&P 500 heads for fresh record after U.S.-Japan trade deal; Tesla and Alphabet earnings on - Investors are hoping the U.S. and Japan’s trade agreement could lead to a tariff breakthrough with other countries and push markets to fresh record highs. Big Tech earnings kick off with Tesla and Alphabet results due after the close https://www.marketwatch.com/livecoverage/stock-market-today-dow-s-p500-nasadq-higher-on-us-japan-trade-deal-tesla-alphabet-earnings-due": 0.8,
  "Goldman, BNY team up to launch tokens tied to money market funds - https://www.reuters.com/markets/wealth/goldman-bny-team-up-launch-tokens-tied-money-market-funds-2025-07-23/ The move marks an early step toward modernizing the infrastructure that underpins most of the financial ecosystem. If adopted broadly, it could make it easier and faster for institutional investors to use these assets as collateral and reduce trade settlement times. BlackRock (BLK.N), opens new tab, BNY Investments Dreyfus, Federated Hermes, Fidelity Investments and Goldman Sachs Asset Management are among the": 0.6,
  "Tesla’s Darkening Outlook to Test Robotaxi Vision Pushed by Musk": -0.5,
  "Why GE's power spin-off is one of the biggest winners from the AI boom": 0.8,
  "White House Introduces AI Plan Targeting Innovation, Domestic Infrastructure": 0.5,
  "Tally of Microsoft Victims Surges to 400 as Hackers Capitalize on SharePoint Flaw - The number of companies and organizations compromised by a security vulnerability in Microsoft Corp.’s SharePoint servers is increasing rapidly, with the tally of victims soaring more than six-fold in a few days, according to one research firm. Hackers have breached about 400 government agencies, corporations and other groups, according to estimates from Eye Security, the Dutch cybersecurity company that identified an": -0.8,
  "A question on stock valuation - Something that's been bugging me. Let's say shares of company XYZ asks is $100. Joe buys 100 shares, and pays $100. He spends $10,000 and that money goes to the seller of those shares. The next lowest ask is $110. Sarah buys only 10 shares at $110. She pays $1100, and that money goes to the seller asking for $110. However, at this point the market posts XYZ value": -0.2,
  "Why Texas Instruments Plunged Double Digits Today": -0.7,
  "Watch These Texas Instruments Price Levels as Stock Plunges on Weak Profit Outlook": -0.6,
  "Time to Buy, Hold, or Sell Intel Stock as Q2 Earnings Approach?": 0.2,
  "Marriott International Completes Acquisition of citizenM Brand": 0.5,
  "Microchip Technology, onsemi, and Allegro MicroSystems Stocks Trade Down, What You Need To Know": -0.5,
  "Why Analog Devices (ADI) Stock Is Trading Lower Today": -0.5,
  "Power Integrations (POWI) Stock Trades Down, Here Is Why": -0.5,
  "Nat-Gas Prices Tumble as US Weather Forecasts Cool": -0.7,
  "Acadia Healthcare, Henry Schein, The Pennant Group, Ziff Davis, and Atlassian Shares Are Soaring, What You Need To Know": 0.8,
  "Gilead Sciences, Omnicom Group, and QuinStreet Shares Skyrocket, What You Need To Know": 0.5,
  "Marriott Vacations, Wabash, SmartRent, Vestis, and Tandem Diabetes Stocks Trade Up, What You Need To Know": 0.5,
  "Sector Update: Tech Stocks Mixed Late Afternoon": 0.0,
  "Oklo and Liberty Energy Stocks Get a Boost from ‘Strategic Alliance’ Announcement": 0.6,
  "This Company Wants to Be the MicroStrategy of Stablecoins. Should You Buy Its Stock Now?": 0.5,
  "Sector Update: Energy Stocks Higher Late Afternoon": 0.5,
  "Meme stock rally has investors feeling 'invulnerable' as speculative bets power markets at record highs": 0.6,
  "T-Mobile Delivers Record Quarter with Outsized Customer and Financial Growth, and Raises Full Year 2025 Guidance": 0.8,
  "The Trade Desk Announces Date of Second Quarter 2025 Financial Results and Conference Call": 0.0,
  "CSX Corp. Announces Second Quarter 2025 Results": 0.0,
  "Stock market today: S&P 500, Nasdaq hit records, Dow closes in as trade hopes lift stocks before Tesla, Google": 0.8,
  "Airbnb to Announce Second Quarter 2025 Results": 0.0,
  "Google shares climb following Q2 earnings beat": 0.8,
  "T-Mobile boosts subscriber forecast on demand for premium wireless plans": 0.8,
  "CSX: Q2 Earnings Snapshot": 0.0,
  "ServiceNow Reports Second Quarter 2025 Financial Results": 0.0,
  "Dow Gains 500 Points. It's Within Striking Distance of a Record.": 0.8,
  "Oil Services Is Making a Comeback. 2 Energy Equipment Stocks to Watch.": 0.5,
  "Alphabet beats earnings expectations, raises spending forecast - Alphabet reported second-quarter earnings on Wednesday after the bell. Here’s how the company did, compared with estimates from analysts polled by LSEG: * **Revenue:** $96.43 billion vs. $94 billion estimated * **Earnings per share:** $2.31 vs. $2.18 estimated Wall Street is also watching several other numbers in the report: * **YouTube advertising revenue**: $9.79 billion vs. $9.56 billion, according to StreetAccount * **Google Cloud revenue:** $13.62 billion": 0.8,
  "Intuitive Surgical Yo-Yoes Despite 'Solid' Quarter. All Eyes On Da Vinci 5.": 0.2,
  "Chipotle trims same-store sales forecast as fewer diners visit its restaurants - Chipotle Mexican Grill on Wednesday cut its forecast for same-store sales growth this year after traffic declined for a second straight quarter. The burrito chain now anticipates flat same-store sales growth for 2025, down from its prior projection of a low-single digit percentage increase. Chipotle trimmed its same-store sales outlook for the second consecutive quarter. Here’s what the company reported for its second": -0.6,
  "Texas Instruments Stock Falls On Weak Earnings Outlook": -0.8,
  "T-Mobile: Q2 Earnings Snapshot": 0.0,
  "T-Mobile CEO: Here's how we are scoring wins against Verizon and AT&T": 0.5,
  "Tesla EPS of $0.40 vs $0.42, with operating income coming in at $923 million vs $1.23 billion expected. - \"Tesla (TSLA) reported a slight earnings and revenue miss in the second quarter, but said its \"more affordable\" model was still slated for 2025 production. Tesla reported second quarter revenue of $22.50 billion vs. $22.64 billion (per Bloomberg consensus), a 9% drop compared with the $25.05 billion reported a year ago. Tesla posted adjusted EPS of": -0.2,
  "Stocks to Watch Recap: AT&T, Toyota, Krispy Kreme, SAP": 0.0,
  "These Stocks Moved the Most Today: Tesla, Alphabet, Texas Instruments, Enphase, GE Vernova, Cal-Maine, Fiserv, Lamb Weston, and More": 0.0,
  "Capital One, Texas Instruments, Otis: Trending Tickers": 0.0,
  "O’Reilly Automotive, Inc. Reports Second Quarter 2025 Results": 0.0,
  "Elon Musk Says 'They Simply Don't' Have The Funding, Doubts Stargate AI": -0.6,
  "Dave Ramsey Says He Tips Well, But Draws The Line At The iPad Spin. He Calls It A Guilt Trip That's 'Nickel-And-Diming You To Death'": -0.6,
  "Buy GE Vernova and Soaring AI-Boosted Nuclear Energy Stocks?": 0.2,
  "IBM results beat expectations as the company pushes up full-year guidance - IBM shares fell as much as 5% in extended trading on Wednesday after the tech conglomerate issued second-quarter results that topped Wall Street projections. Here’s how the company did in comparison with LSEG consensus: * **Earnings per share:** $2.80 adjusted vs. $2.64 expected * **Revenue:** $16.98 billion vs. $16.59 billion IBM’s revenue increased nearly 8% year over year in the quarter, according to": 0.8,
  "ServiceNow lifts guidance on AI growth - ServiceNow posted strong second-quarter results and lifted its guidance Wednesday. Shares climbed 7% following the report. Here’s how the company performed compared to LSEG estimates: * **Earnings per share:** $4.09 adjusted vs. $3.57 expected * **Revenue**: $3.22 billion vs. 3.12 billion expected Subscription revenues, which account for the majority of the enterprise technology company’s revenues, hit $3.11 billion and topped a $3.03 billion forecast from StreetAccount. The company": 0.8,
  "CSX (NASDAQ:CSX) Reports Q2 In Line With Expectations": 0.5,
  "CSX Quarterly Profit, Sales Fall as Uncertainty Persists Among Industrial Markets": -0.6,
  "T-Mobile stock pops on earnings as postpaid and 5G additions hit record levels": 0.8,
  "SOUTHWEST AIRLINES REPORTS SECOND QUARTER 2025 RESULTS": 0.0,
  "Google's Q2 doesn't show 'any sign' of negative ChatGPT impact": 0.5,
  "O'Reilly Automotive: Q2 Earnings Snapshot": 0.0,
  "AMD CEO Lisa Su on the Cost of US Chips": 0.1,
  "First look: Weaker coal, carloads hit CSX earnings": -0.6,
  "Tesla, Alphabet, Chipotle: Stocks to Watch in After-Hours Trading": 0.5,
  "CoStar Group Names Grant Montgomery as National Director of Multifamily Analytics": 0.5,
  "IBM, ServiceNow, T-Mobile: Earnings movers": 0.2,
  "S&P 500 Reaches New High Amid Hopes of More Trade Deals": 0.8,
  "T-Mobile (TMUS) Q2 Earnings and Revenues Beat Estimates": 0.8,
  "O'Reilly (NASDAQ:ORLY) Posts Q2 Sales In Line With Estimates": 0.5,
  "Canadians Set A New Investment Record For US Stocks - Canadians are looking to American stocks to build their wealth these days. Canadians increased their net position in US stocks by $14.2 billion in May, more than 4x the volume last year. It was 88% higher than the previous cycle peak in May 2021, and the biggest net increase for the month on record. Only 6 months in the past 37 years of data have": 0.8,
  "Alphabet Inc. (GOOG) Q2 Earnings and Revenues Top Estimates": 0.8,
  "Crown Castle raises annual site rental revenue forecast on healthy leasing activity": 0.8,
  "O’Reilly automotive shares slip as full-year guidance disappoints": -0.6,
  "SS&C Technologies (SSNC) Q2 Earnings and Revenues Top Estimates": 0.8,
  "There’s Still No Growth at Railroader CSX—Unless Buffett Makes a Bid": 0.1,
  "O'Reilly Automotive (ORLY) Surpasses Q2 Earnings Estimates": 0.8,
  "Podcast: Tesla Profit Is Hit by Weak EV Sales": -0.5,
  "Starbucks (SBUX) Stock Declines While Market Improves: Some Information for Investors": -0.5,
  "Looking for recommendations regarding portfolio - I’m 18, and currently have a little under €10,000 invested, 50% in VOO and the other half in hand-picked stocks, primarily in the technology sector. I’m aware that beating the market is difficult, but I choose individual stocks for fun. Now, I’m looking to add about €2,000 a month and want to diversify a bit more. I realize that VOO is very tech-heavy due to its top holdings, and": 0.5,
  "From balance sheet to alpha engine: The Bitcoin treasury strategy arms race": 0.5,
  "MicroStrategy (MSTR) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Vertex Pharmaceuticals (VRTX) Rises Higher Than Market: Key Facts": 0.5,
  "Take-Two Interactive (TTWO) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Comcast (CMCSA) Rises Higher Than Market: Key Facts": 0.5,
  "T-Mobile Adds More Subscribers Than Rivals": 0.8,
  "Tesla's Q2 earnings report is 'garbage,' shareholder says": -0.8,
  "Palantir vs. BigBear.ai: Which Is the Better Artificial Intelligence (AI) Software Stock?": 0.5,
  "ON Semiconductor Corp. (ON) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Ross Stores (ROST) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "This company’s CEO made 6,666 more than its typical worker": -0.5,
  "MaxLinear (MXL) Matches Q2 Earnings Estimates": 0.5,
  "Marvell Technology (MRVL) Reaffirmed as a Buy—Here’s Why Stifel Is Bullish": 0.8,
  "Bernstein Lifts AMD Price Target to $140—But Still Holds Rating": 0.5,
  "Does the ASML Stock Sell-Off Signal Trouble for Nvidia and Broadcom?": -0.5,
  "Intel earnings, new-home sales, mortgage rates: What to Watch": 0.5,
  "EU Wrestles With China’s Chokehold Over Crucial Defense Supplies": -0.6,
  "I guess it is finally time to short $TSLA - I've been following Tesla for a long time, and have been losing money trying to take bearish positions on TSLA. However bad the earnings are, or whatever Elon does or says, the stock defies common sense and logic. However, I do think that with the recent earnings, Tesla's 'meme stock' characteristics are finally fading away. It's not just the bad earnings and 'rough times' ahead": -0.5,
  "Tesla's Q2 Results: The Affordable EV & Robotaxi What's Next for TSLA? - Tesla’s second-quarter earnings came in a bit under expectations, and the stock saw some volatility in after-hours trading. While the company still remains a leader in the EV space, the market seems to be questioning its next moves. The big headline? Tesla is still pushing ahead with its plans for a \"more affordable\" model, set to start production in late 2025. While": 0.2,
  "(Item 2.02) Results of Operations and Financial Condition On July 24, 2025, Honeywell International Inc. (the “Company”) issued a press release announcing its second quarter 2025 earnings, which is furnished herewith as Exhibit 99. The information furnished pursuant to this\n\n(Item 2.02) , including Exhibit 99, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934 (the “Exchange Act”) or otherwise subject to the liabilities under that Section and shall not be deemed to be incorporated by reference into any filing of the Company under the Securities Act of 1933 or the Exchange Act.": 0.1,
  "(Item 8.01) Other Events. On July 24, 2025, the Company issued a press release announcing that its Board of Directors had declared a quarterly cash dividend of $0.28 per share of common stock, payable on September 17, 2025, to shareholders of record at the close of business on September 3, 2025. The press release is attached hereto as Exhibit 99.1 and incorporated herein by reference.": 0.2,
  "(Item 2.02) . Results of Operations and Financial Condition. The information contained in this\n\n(Item 2.02) , including Exhibit 99.1, shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), or incorporated by reference in any filing under the Securities Act of 1933, as amended (the \"Securities Act\"), or the Exchange Act, except as expressly set forth by specific reference in such a filing. On July 24, 2025 , Keurig Dr Pepper Inc. (the \"Company\" or \"KDP\") issued a": 0.1,
  "Intel’s (INTC) AI and Chip Future May Rely on TSMC, Say Analysts": 0.5,
  "AppLovin (APP) Gets $525 Price Target Ahead of Q2 Earnings Beat, Says Analyst": 0.8,
  "Alaska Air Group (ALK) Earnings: 2Q Passenger Revenue Surpasses Estimates with Strong Growth - * Alaska Air reported second-quarter passenger revenue of $3.36 billion, exceeding the estimate of $3.31 billion and marking a 27% year-over-year increase. * Passenger traffic increased by 31.8% from the previous year. * Available seat miles reached 24.06 billion, a 32% increase compared to last year, surpassing the estimated 23.45 billion. * Capacity increased by 32.2%, indicating expanded operational capabilities. *": 0.9,
  "Apple Is Going To Surprise Wall Street, Says Tom Lee, As iPhone Maker 'Could Be Quietly Ready To Pounce On AI'": 0.6,
  "Texas Instruments CEO's tariff comments surprise investors": -0.5,
  "Japan Stock Market Skyrocketing on Reduced Tariffs - It seems like the market isn't gonna price in tariff affects anytime soon, seeing how Japan's stock market has skyrocketed, even though their tariffs have gone from near 0% to 15%. If the EU gets a tariff lower then 30%, markets will likely continue to go higher. The market will only drop once the tariff effects are reflected in the hard economic data.": 0.6,
  "Trump administration recommends location verification for AI chips": 0.1,
  "Mountain Valley MD Holdings Announces Changes to Board of Directors": 0.0,
  "Stocks rose as the S&P 500 hit an intraday high. Key movers: - * TSLA -0.3% ahead of Q2 earnings (EPS est. $0.39, rev $22.1B vs. $25.5B YoY). * GOOGL -0.7% before earnings; focus on AI capex and Search competition. Up 9.7% over 10 sessions. * TXN -13.7% despite Q2 beat; weak Q3 guidance and auto market concerns. * ENPH -14.1% on soft Q3 revenue forecast. * T -0.2% after Q2 beat; plans to invest": 0.2,
  "Agoda Ranks Asia's Most Affordable Summer Destinations for Hoteliers to Manage Yields from Deals": 0.2,
  "Charter Earnings: What To Look For From CHTR": 0.0,
  "Video Gaming Stocks Q1 Recap: Benchmarking Take-Two (NASDAQ:TTWO)": 0.1,
  "3 Reasons We’re Fans of Palantir (PLTR)": 0.5,
  "2 Reasons to Like AMGN and 1 to Stay Skeptical": 0.5,
  "3 Reasons ADI is Risky and 1 Stock to Buy Instead": -0.5,
  "AI Chat With Roland Rott,  President & CEO of Imaging at GE HealthCare": 0.1,
  "1 Profitable Stock with Competitive Advantages and 2 We Find Risky": 0.2,
  "3 of Wall Street’s Favorite Stocks to Keep an Eye On": 0.5,
  "2 Cash-Producing Stocks with Competitive Advantages and 1 We Brush Off": 0.2,
  "3 Low-Volatility Stocks We’re Skeptical Of": -0.5,
  "Jim Cramer on Starbucks: “Buy Some Now”": 0.6,
  "Jim Cramer on Adobe: “Might Get This Thing at a Cheaper Price”": 0.2,
  "Jim Cramer on Netflix: “You’re Given a Chance to Buy a Terrific Stock at a Discount”": 0.8,
  "3 Low-Volatility Stocks We Steer Clear Of": -0.5,
  "Chipmaker STMicro makes first loss in over a decade, hit by restructuring costs": -0.6,
  "The PC Chip Business May Surprise as Intel Reports Earnings Thursday": 0.5,
  "What is everyone's take on IOVA? - I learnt about IOVA from \"that\" community, but the more I read about it, the more it sounds like the opportunity of the year. A guy wrote a very detailed DD which I'll just link here. Can anyone discuss the bear thesis for this (if there is one)? [https://www.reddit.com/r/wallstreetbets/comments/1m74nu8/408k\\_800k\\_yolo\\_into\\_iova\\_and\\_why\\_this\\_is\\_just\\_the/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/wallstreetbets/comments/1m74nu8/408k_800k_yolo_into_iova_and_why_this_is_just_the/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)": 0.6,
  "In 27 Years of Investing, I've Never Witnessed a More Overvalued Megacap Stock": -0.8,
  "Analog Devices Earnings Preview: What to Expect": 0.5,
  "What You Need To Know Ahead of Synopsys' Earnings Release": 0.0,
  "CSX Corp (CSX) Q2 2025 Earnings Call Highlights: Navigating Revenue Challenges with Strategic ...": 0.5,
  "T-Mobile US Inc (TMUS) Q2 2025 Earnings Call Highlights: Record Growth and Strategic Expansions": 0.8,
  "Still long NVDA and adding on dips - They just teamed up with Lenovo and WeRide to roll out \"HPC 3.0\". From what I gather, this is part of NVIDIA's push to become not just a chipmaker, but a full-stack AI infrastructure provider. This feels like one of those consolidation dips before another leg up, especially if this HPC 3.0 move gains traction with other EV/AV players. They never slow down. Also noticed: AMF up": 0.8,
  "Looking Beyond Yield for the Safest Dividend Payers": 0.5,
  "CyberArk and Centene have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Alphabet Inc. (GOOG) Q2 Earnings and Revenues Top Estimates (Revised)": 0.8,
  "Zacks Investment Ideas feature highlights: Range Nuclear Renaissance Index ETF, GE Vernova, Talen, Amazon and Rolls-Royce": 0.2,
  "STMicroelectronics Shares Slump After Tesla Supplier Warns of Uncertainty": -0.7,
  "How PepsiCo, Cadence Bank, And Skyworks Solutions Can Put Cash In Your Pocket": 0.5,
  "If You Invested $10K In Mid-America Apartment Communities Stock 10 Years Ago, How Much Would You Have Now?": 0.0,
  "Warren Buffett Says His $31,500 House Brings Him More Joy Than 10 Mansions — And He'd Rather Eat A McDonald's Burger Than A $100 Meal": 0.8,
  "Dan Ives Picks 5 Stocks For 2nd Half Of 2025: Nvidia, Palantir, Microsoft And More: 'Golden Age Of Tech Is Here With AI Revolution'": 0.8,
  "Online Advertising Global Strategic Business Report 2025-2030 | Digital Giants Such as Google, Meta, Amazon, and TikTok Reshape Ad Spending as Retail Media, CTV, and DOOH Lead Emerging Trends": 0.6,
  "2 Artificial Intelligence (AI) Stocks to Buy Before They Soar 100% and 184%, According to Wall Street Analysts": 0.8,
  "CAR T-Cell Therapy Market Trends and Forecasts, 2021-2024 & 2025-2033 | Focus on Yescarta, Tecartus, Kymriah, Breyanzi, Abecma, Carvykti, and Carteyva": 0.5,
  "Global Markets Rise as Trade Deal Progress Boosts Investor Optimism": 0.8,
  "3 Growth Levers That Could Power Shopify's Next Chapter": 0.5,
  "Looking for Stocks to Short TSLA and PLTR Are on My Radar. What Else Is Overvalued? - I’m looking for good stocks to short due to high valuations and macro risk. My current top short candidates are TSLA and PLTR. I have already had good results shorting Tesla. What else is overvalued, overpriced, and priced for perfection or losing momentum? Fire away!": -0.8,
  "AstraZeneca drug acquired in Alexion deal succeeds in autoimmune disease trial": 0.8,
  "The Zacks Analyst Blog Highlights Meta Platforms, Lam Research, Flex and Seagate": 0.5,
  "The Zacks Analyst Blog Highlights C3.ai, Palantir Technologies and Snowflake": 0.5,
  "Should You Buy Advanced Micro Devices (AMD) Stock Before Aug. 5?": 0.2,
  "The Zacks Analyst Blog Highlights QuantumScape, NVIDIA, Apple and Microsoft": 0.5,
  "T-Mobile Stock Rises as Carrier Beats Estimates, Raises Guidance": 0.8,
  "Target Corporation (TGT): The Downgrade Isn’t Wrong, Says Jim Cramer": 0.2,
  "Costco Wholesale Corporation (COST) Isn’t Increasing Prices, Says Jim Cramer": 0.5,
  "Meta Platforms Is Helping Power This 6%-Yielding Dividend Stock's Continued Growth": 0.6,
  "Stock Market News for Jul 24, 2025": 0.0,
  "LUNGevity Foundation Joins 2025 LungXperience Tour to Promote Lung Health and Early Detection Across the U.S.": 0.5,
  "STMicro Shares Drop on Surprise Loss, Disappointing Outlook": -0.8,
  "How do RSU's work? - i have a very specific question about RSU. or if its different based on company. when someone gets RSU from a company, is it awarded in straight shares with the FMV at time of grant? or can it sometimes be awarded as cash that represents how many shares it can purchase at the current FMV? i.e. if you work at Meta. And lets say they give 100 shares vested 20%": 0.2,
  "Is AI Killing Google Search? It Might Be Doing the Opposite": 0.5,
  "r/Stocks Daily Discussion & Options Trading Thursday - Jul 24, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why": 0.2,
  "CSX Corporation (CSX): “I Am In Charge Of The Rails,” Says Jim Cramer": 0.5,
  "What to Expect From Palo Alto Networks' Q4 2025 Earnings Report": 0.2,
  "Biosimilars Markets Global Forecast Report 2025-2035 | Launch of Glp-1 Biosimilars, Increasing Strategic Partnerships and Collaborations, & Growing Focus on Advanced R&D Fueling Opportunities": 0.6,
  "What price range are you guys eyeing for stocks beaten by tariffs, BBB, etc. - Gonna admit it here, new investor so maybe I haven’t seen bad waters like some of you. Was eyeing stocks like ENPH and GM but seems like a lot of people expect them to fall even further. I’m astounded by how low they already are so what’s going on in your heads? I’m even questioning how long these destructive policies": 0.2,
  "2 Top Stocks I Wouldn't Hesitate to Invest $1,000 in Right Now": 0.8,
  "Zum Appoints Daniel Berenbaum as Chief Financial Officer": 0.5,
  "Linde Earns FTSE4Good Inclusion for Tenth Consecutive Year": 0.8,
  "HONEYWELL REPORTS SECOND QUARTER RESULTS; UPDATES 2025 GUIDANCE": 0.5,
  "How LegitScript’s CFO and CTO are building systems to scale smarter": 0.5,
  "QuickBooks AI Features (2025): QuickBooks Awarded Best AI-Powered Accounting Features in Report by Software Experts": 0.8,
  "The AI trade hasn't changed for Big Tech — and that's working for them": 0.2,
  "Apple Shares Fall Ahead of Q3: iPhone, Wearables Demand Wanes": -0.7,
  "UK Regulators Take Aim at Google and Apple's Duopoly": -0.5,
  "Honeywell raises 2025 forecasts on sustained demand for aerospace parts, services": 0.8,
  "Knox Launches on AWS Marketplace: SaaS Companies Can Now Achieve FedRAMP in 90 Days Using Their Existing AWS App and Budget": 0.6,
  "My Top AI Growth Stock to Buy Now and Hold Through at Least 2030": 0.5,
  "Honeywell’s (NASDAQ:HON) Q2: Beats On Revenue, Full-Year Outlook Slightly Exceeds Expectations": 0.6,
  "Velveeta says ‘Respect the Drip’ for first major campaign in two years": 0.5,
  "Should You Forget Palantir and Buy This Artificial Intelligence (AI) Stock Instead?": 0.2,
  "S&P 500, Nasdaq move higher after mixed earnings; Dow lags": 0.2,
  "Prediction: Interactive Brokers Stock Will Soar Over the Next Decade": 0.8,
  "Anyone else getting 2021 vibes? - Yes the monetary conditions are not exactly the same. But I remember the behavior and sentiment well as I perused reddit and various message boards over the years: Extreme risk on sentiment and margin, people favouring stocks over indexes because \"way better returns bro. Have fun with your 7% per year grandpa lol\". Meme stock short squeeze, people piling into stocks with little revenue that have already 10x in": -0.8,
  "Nvidia, AMD CEOs Rally Behind President Trump’s AI ‘Action Plan’": 0.5,
  "Honeywell lifts full-year outlook after better-than-anticipated Q2 results": 0.8,
  "3 Dividend Stocks to Double Up on Right Now": 0.5,
  "2 Top Artificial Intelligence (AI) Stocks Ready for a Bull Run": 0.8,
  "Elon Musk’s X finally blocks children from watching porn": -0.5,
  "Options Trading Now Available on Latest Five Tradr ETFs: CWVX, SMU, ASTX, GEVX and CEGX": 0.5,
  "Baker Hughes Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "Amazon Gave Prime Day Shoppers More Time to Browse. Many Went to Walmart.": -0.5,
  "DATA Communications Management Corp. to Announce Second Quarter 2025 Results on August 6, 2025": 0.0,
  "Old Dominion Freight Line Announces $0.28 Per Share Quarterly Cash Dividend": 0.5,
  "Keurig Dr Pepper Reports Q2 2025 Results and Reaffirms Guidance for 2025": 0.5,
  "Cincoze MXM GPU Computers: The AI Solutions for Manufacturing, Transportation, and Defense": 0.5,
  "Benchmark Completes Key Role in U.S. Manufacturing and Testing for Intel’s Aurora Exascale Supercomputer": 0.6,
  "Low IV Alert: Stocks that Could be Ready to Pop": 0.6,
  "Nvidia AI chips worth $1bn smuggled to China after Trump export controls": -0.8,
  "Should You Add Private Market Investments To Your 401(k)?": 0.2,
  "Google, Tesla Earnings Show Big Tech Winners Evolve. Why Some Are Falling Short.": 0.2,
  "Are Texas Instruments Incorporated (NASDAQ:TXN) Investors Paying Above The Intrinsic Value?": -0.5,
  "Institutional investors have a lot riding on O'Reilly Automotive, Inc. (NASDAQ:ORLY) with 86% ownership": 0.2,
  "Are Robust Financials Driving The Recent Rally In Broadcom Inc.'s (NASDAQ:AVGO) Stock?": 0.5,
  "If You'd Invested $10,000 in Amazon.com (AMZN) Stock 20 Years Ago, Here's How Much You'd Have Today": 0.5,
  "Honeywell International Inc. (HON) Q2 Earnings and Revenues Surpass Estimates": 0.8,
  "Marriott finalises acquisition of lifestyle hotel brand citizenM": 0.5,
  "Google Just Silenced Its Haters With This 1 Eye-Popping Number": 0.8,
  "5 Must-Buy Stocks Amid Solid Earnings Estimate Revisions After Q2 Beat": 0.6,
  "ReelTime's RI Instantly Available Now on 83 Million Samsung Mobile Devices for Free Across North America, More Capable, and More Efficient than any AI App Directly, without Requiring the App Store.": 0.6,
  "Trade, Earnings Outlooks Roil Wall Street Pre-Bell; Asia, Europe Up": 0.2,
  "Stocks Mostly Up Pre-Bell as Investors Assess Trump's Latest Tariff Threat, Key Earnings": 0.5,
  "Applied Materials to Report Fiscal Third Quarter 2025 Results on August 14, 2025": 0.0,
  "Regeneron Announces the 2025 Winners of the Regeneron Prize for Creative Innovation": 0.5,
  "Figma IPO Overview and Valuation Estimation - **Figma IPO Overview and Valuation** Figma, a leading collaborative design software company, recently published an updated prospectus for its initial public offering. The company expects to offer approximately 37 million shares at a price range of $25 to $28 per share, implying gross proceeds of up to $1 billion, including sales by both the company and existing shareholders. This IPO pricing would value Figma at a fully diluted": 0.5,
  "PayPal to launch unified platform for global payments and wallets": 0.5,
  "Keurig Dr Pepper quarterly revenue beats expectations fueled by US demand": 0.8,
  "Keurig Dr Pepper shares fall as Coffee segment struggles despite earnings beat": -0.5,
  "AAON And 2 Other Insider Picks For Growth Potential": 0.5,
  "3 Stocks That Could Be Trading Below Their Estimated Value In July 2025": 0.5,
  "Habit Burger & Grill to open outlet in Santa Clarita, California": 0.0,
  "High Growth Tech Stocks In The US For July 2025": 0.5,
  "Google Cloud Delivers Q2 Knockout, Sends Message To Amazon, Microsoft": 0.6,
  "Analyst Explains Why Nvidia China News Could be ‘Huge’ for ASML Holding (ASML)": 0.6,
  "SBET vs BMNR? - I’ve been waiting for both these companies to calm before investing Here’s my thoughts on why BMNR is currently looking far better SBET has 360,000 Ethe (2 days ago reporting) Market cap 2.6B Very high volatility 9/10 BMNR has 566,000 Ethe (as of 1 day ago) Market cap 2.06B Relative to SBET the volatility is lower 7/10 Maybe the most significant thing for me is even the name scheme. It’s been": 0.5,
  "Keurig Dr Pepper Posts Higher Profit, Sales": 0.5,
  "Analyst Explains Why He’s Bullish on Broadcom (AVGO) Amid AI Agent Revolution": 0.8,
  "Keurig Dr Pepper (NASDAQ:KDP) Surprises With Q2 Sales": 0.5,
  "Apollo Now Fully Integrated into NVIDIA’s Autonomous Driving Platform, Paving the Way for Significant Growth": 0.8,
  "Cognizant's AI Lab Records 59th U.S. Patent, Continuing to Generate AI Breakthroughs": 0.8,
  "Banuba Unveils Revolutionary Virtual Try-On Feature for Glasses and Sunglasses in Shopify Plugin": 0.8,
  "onsemi and Schaeffler Expand Collaboration with  New EliteSiC-based PHEV Platform": 0.5,
  "Constellation‘s Deal With Calpine Approved by Federal Energy Regulatory Commission": 0.5,
  "Analyst Explains Why He’s Bullish on Microsoft (MSFT) Amid ‘AI Eating Software’ Trend": 0.8,
  "Those who invested in Monster Beverage (NASDAQ:MNST) five years ago are up 53%": 0.5,
  "Adrenaline shot to SoFi delivered right before the earnings. - There was a standout transaction of $60.9M (2,825,000 shares) during yesterday's after-hours. A large entity probably knows something big is coming to SoFi to be bullish enough to execute a huge investment near its 52-week ATH right before earnings. It injects a boost of confidence into the SoFi stock right before its scheduled earnings on July 29th.": 0.8,
  "Meta Stock Takes A Breathtaking Leap. What's In Mark Zuckerberg's Facebook AI Vision?": 0.5,
  "Elon Musk's xAI Eyes $12 Billion Chip Purchase Deal With Nvidia": 0.5,
  "Nasdaq CEO signals improved IPO market momentum, shares jump on results beat": 0.8,
  "PawCo Turns 4 With Bold Expansion Plans To Lead The Future Of Dog Nutrition": 0.8,
  "Keurig Dr Pepper, Inc (KDP) Meets Q2 Earnings Estimates": 0.5,
  "Take-Two Interactive Software's Q1 2026 Earnings: What to Expect": 0.0,
  "The Kraft Heinz Company (KHC) Fell Due to Sluggish Food and Beverage Industry": -0.6,
  "Traders Digest More Earnings as US Equity Futures Turn Mixed Pre-Bell": 0.2,
  "Intel to report Q2 earnings as Wall Street looks for signs of turnaround": 0.5,
  "Longleaf Partners Fund Increased its Holdings in Regeneron Pharmaceuticals (REGN) on a Dip": 0.5,
  "Regeneron Pharmaceuticals, Inc. (REGN): A Bull Case Theory": 0.5,
  "Nvidia AI chips worth $1 billion entered China despite US curbs, FT reports": 0.2,
  "Growth in Azure Lifted Microsoft Corporation (MSFT) in Q2": 0.6,
  "Latest News In E-Commerce - Subscription Market Poised for Significant Growth by 2030": 0.8,
  "Here’s What Supports Netflix’s (NFLX) Long-Term Growth": 0.5,
  "Nubank Appoints Ethan Eismann as Chief Design Officer, Deepening Commitment to Customer Experience": 0.8,
  "ASML best positioned for 2026 in the Semicap pack: New Street Research": 0.6,
  "URLgenius Shatters Records: Prime Day Traffic Surges +493%, 1M+ Amazon Links Created": 0.8,
  "Valneva (VALN) Soars 17.4%: Is Further Upside Left in the Stock?": 0.6,
  "Analyst Sees 30% Earnings Growth for Netflix(NFLX) in 2025, Says ‘Premium Multiple’ Justified": 0.8,
  "Only 34% of Americans Feel on Track for Retirement. Here Are 2 Stocks to Buy Now and Hold for Decades.": 0.2,
  "Here’s What Drives Meta Platforms’ (META) Growth": 0.5,
  "EXCLUSIVE: Wix Adds PayPal, Venmo And Pay Later Options To Help Merchants Boost Sales, Simplify Checkout": 0.8,
  "Texas Instruments Incorporated (TXN): “They’re So Good,” Says Jim Cramer": 0.8,
  "Palantir Technologies (PLTR) Surged Due to Revenue Expansion": 0.8,
  "Honeywell Raises Outlook After Strong Quarter as Conglomerate Moves Ahead With Separation Plans": 0.8,
  "All these rumors about tariffs are just to manipulate the markets?! - From the ongoing negotiations between the United States and the EU, rumors are filtering out that an agreement between the parties is very close. It would appear to be an agreement similar to the one with Japan, with 15% duties for European products. Some exclusions for drugs, airplanes, alcohol. Some improvements in conditions also occurred in the automotive and steel sectors. All that": 0.2,
  "Honeywell International Inc. (HON): A Bull Case Theory": 0.5,
  "Datadog, Inc. (DDOG): A Bull Case Theory": 0.5,
  "PayPal and Wix Advance Strategic Relationship to Deliver Unified Payments Experience for Merchants": 0.5,
  "Roundhill Investments Launches Five Additional WeeklyPay™ ETFs": 0.5,
  "VideoAmp and Warner Bros. Discovery Sign Multi-Year Deal to Advance Measurement and Currency Innovation": 0.6,
  "Emerging Markets Are Trouncing U.S. Stocks. This Pro Likes Alibaba, Mercado Libre.": 0.5,
  "Oracle and Bloom Energy Collaborate to Deliver Power to Data Centers at the Speed of AI": 0.5,
  "Suki Expands Executive Leadership Team to Accelerate the Future of Ambient AI in Healthcare": 0.6,
  "Fullmark Energy Appoints Energy Industry Veteran to Chief Financial Officer Delivering Path to Diversified Portfolio Growth": 0.8,
  "Apex Systems Announces Availability of Peak CX-AI in the New AWS Marketplace AI Agents and Tools Category": 0.5,
  "Want Better Returns? Don't Ignore These 2 Aerospace Stocks Set to Beat Earnings": 0.8,
  "Is Trending Stock Synopsys, Inc. (SNPS) a Buy Now?": 0.2,
  "Intuit Inc. (INTU) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Here is What to Know Beyond Why Axon Enterprise, Inc (AXON) is a Trending Stock": 0.2,
  "Trump Considered Breaking Up Nvidia--Then Praised Its CEO on Stage": 0.2,
  "When Should You Buy GE HealthCare Technologies Inc. (NASDAQ:GEHC)?": 0.1,
  "Quarterly Earnings Drive Mixed Premarket Action for US Equity Futures": 0.1,
  "Warner Bros. Discovery, Inc. (WBD): I Don’t Think The Split Up Will Be Good, Says Jim Cramer": -0.6,
  "Discuss Reports Record Mid-Year Growth with AI Agentic Approach to Vibe Coding for Market Insights": 0.5,
  "Honeywell Lifts Outlook As Transformation Picks Up Speed": 0.8,
  "CoStar Group Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "FuzeHub Brings New York State Innovation Summit to Rochester October 29 - 30": 0.5,
  "Netflix, Inc. (NFLX): “I Felt Bad” About The Earnings Call, Says Jim Cramer": -0.5,
  "1 Magnificent Stock That Can Make You Richer in 2025 and Beyond": 0.8,
  "Paypal (PYPL) Q2 Earnings on the Horizon: Analysts' Insights on Key Performance Measures": 0.5,
  "Insights Into Astrazeneca (AZN) Q2: Wall Street Projections for Key Metrics": 0.2,
  "Ahead of Mondelez (MDLZ) Q2 Earnings: Get Ready With Wall Street Estimates for Key Metrics": 0.2,
  "Gear Up for Booking Holdings (BKNG) Q2 Earnings: Wall Street Estimates for Key Metrics": 0.2,
  "Starbucks (SBUX) Q3 Earnings on the Horizon: Analysts' Insights on Key Performance Measures": 0.2,
  "UNH admits its under federal investigation, two months after refuting the first WSJ article on this and calling them\"deeply irresponsible\" - UNH Untied Healthcare previously stated they were not aware of being federally investigated and had no idea what the charges were (despite curiously mentioning the integrity of their Medicare Advantage Plans in this same address), which is in fact the very thing they are being investigated for. Also calling out the WSJ as deeply": -0.8,
  "Nebius Races Ahead in AI Infra Space With Strong Customer Engagement": 0.8,
  "What energy companies will be involved in Trumps plan for AI companies to create their own super power grids? - Trump is saying NVDA and other AI companies can create their own power grids and super power stations to power their AI in the US. What companies are supplying that power/power equipment? I'm looking to try to potentially invest in energy stocks and have been looking at GE Vernova. Will that be one of the": 0.2,
  "Honeywell International Lifts Full-Year Outlook Following Second-Quarter Beat": 0.8,
  "The adoption of AI OpenAI partnerships and a compelling value-for-money story strengthen my belief that AMD’s rebound is just getting sta - I think AMD's stock will gain real momentum before the end of the year, especially as the market starts to recognize the company's potential in the AI space, rather than just being the second largest company after Nvidia. Back in mid-June, Suzie Fung surprised the market by announcing new AI server technology that": 0.8,
  "Selective Estrogen Receptor Degrader (SERDs) Market Research Report 2025-2030 Featuring AstraZeneca, Eli Lilly, EnhancedBio, Olema Oncology, Radius Therapeutics, and Roche": 0.2,
  "From Low-Code to AI: Lessons in Empowering Enterprise Users": 0.5,
  "Marketing Automation Market Surges to $81.01 Billion by 2030 - Dominated by HubSpot (US), Adobe (US), Oracle (US)": 0.5,
  "Should You Invest in Constellation Energy Corporation (CEG) Based on Bullish Wall Street Views?": 0.5,
  "Down 18%, Should You Buy the Dip on ASML Holding?": 0.2,
  "Union Pacific and Norfolk Southern in Talks. Stocks Go in Opposite Directions.": 0.1,
  "Tesla stock slides after earnings miss, Musk warns of 'few rough quarters'": -0.6,
  "Netflix, Inc. (NFLX): A Bull Case Theory": 0.5,
  "Dow Drops 300 Points After It Just Missed Closing at a Record": -0.5,
  "Stocks to Watch Thursday: Tesla, T-Mobile, American Airlines, Broadcom": 0.5,
  "NVIDIA Corporation (NVDA): A Bull Case Theory": 0.5,
  "Stock market today: Dow, S&P 500, Nasdaq trade mixed as Wall Street weighs Google, Tesla earnings": 0.1,
  "Tesla Braces for ‘Rough’ Quarters as US Ends EV Incentives": -0.6,
  "Tesla Attempts 'Crossing Chasm To Autonomy'; Stock Market, Analysts React": 0.1,
  "Norfolk Southern stock rises after confirming merger talks with Union Pacific": 0.8,
  "CrowdStrike Holdings, Inc. (CRWD): A Bull Case Theory": 0.5,
  "Alphabet Boosted by AI, Cloud Demand as Spending Needs Jump": 0.5,
  "Four Reasons To Watch This Nvidia Partner And Agentic AI Stock. A New Breakout Is Just One.": 0.5,
  "Why This 1 Growth Stock Could Be a Great Addition to Your Portfolio": 0.8,
  "Market Chatter: US Senator Seeks Further Information on Defense Department's Use of China-Based Engineers Under Microsoft Contract": -0.5,
  "Analyst Says Advanced Micro Devices (AMD) Can Get $25 Billion in GPU Sales With Just 5% Market Share": 0.8,
  "Micron Stock Is Riding the AI Wave. A Rival’s Sales Surge Is Good News.": 0.6,
  "Trump: Won't Destroy Musk's Companies, Wants All U.S. Businesses to Thrive": 0.8,
  "NVIDIA Corporation (NVDA)’s Going To Have A Good Quarter, Says Jim Cramer": 0.8,
  "Trump says he wants Musk and his companies to thrive in US": 0.6,
  "These Stocks Are Moving the Most Today: Tesla, Alphabet, IBM, UnitedHealth, Dow Inc., Southwest, American, Chipotle, and More": 0.5,
  "Microsoft Hack Hits Hundreds of Firms, Agencies as Damage Spreads": -0.8,
  "Keurig Dr Pepper Q2 Volume Growth Obscured By Margin Cut, Currency Headwind": -0.5,
  "Palantir Technologies (PLTR): “I’m Gonna Revise My Price Target When It Gets To 200,” Says Jim Cramer": 0.6,
  "ETFs to Soar Post Alphabet's Strong Q2 Earnings Results": 0.8,
  "STARRY® LAUNCHES \"100 DEGREES, 100% OFF\" CAMPAIGN TO DELIVER ULTIMATE REFRESHMENT WHEN TEMPERATURES SOAR": 0.6,
  "VERSANT Board of Directors for Future Independent Media Company Announced": 0.5,
  "Estimating The Fair Value Of Analog Devices, Inc. (NASDAQ:ADI)": 0.1,
  "Is DexCom, Inc.'s (NASDAQ:DXCM) ROE Of 24% Impressive?": 0.2,
  "Analysts Estimate Exelon (EXC) to Report a Decline in Earnings: What to Look Out for": -0.5,
  "Xcel Energy (XEL) Earnings Expected to Grow: Should You Buy?": 0.5,
  "Apple (AAPL) Earnings Expected to Grow: Should You Buy?": 0.5,
  "Amazon (AMZN) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "Analysts Estimate Biogen Inc. (BIIB) to Report a Decline in Earnings: What to Look Out for": -0.5,
  "Earnings Preview: Comcast (CMCSA) Q2 Earnings Expected to Decline": -0.5,
  "Kevin Lo Joins S2G Investments as Operating Partner": 0.5,
  "LRCX Likely to Beat Q4 Earnings Estimates: How to Play the Stock?": 0.5,
  "Micron Technology, Inc. (MU): A Bull Case Theory": 0.5,
  "PayPal Holdings, Inc. (PYPL): A Bull Case Theory": 0.5,
  "AbCellera Biologics Inc. (ABCL): A Bull Case Theory": 0.5,
  "Energy Drink Demand Helps Keurig Dr Pepper Beat Profit and Sales Estimates": 0.8,
  "Trump Denies Wanting to Destroy Elon Musk’s Firms": 0.2,
  "Honeywell Stock Falls After Earnings Beat. Here’s Why.": 0.2,
  "Stocks Supported by Strong Earnings from Alphabet": 0.8,
  "Google Stock Edges Higher as Earnings Beat Estimates. Growing CapEx Remains an Issue.": 0.5,
  "\"You Get Praise For Serving Others,\" Not Flashing Wealth — Sheraton Hotels And Perdue Farms Heiress Sold Her $1.2 Million Ring For Ukraine Aid": 0.5,
  "Alphabet (GOOGL) Stock Climbs on Q2 Double-Beat, Unveil Record AI Budget": 0.8,
  "Trump says he wants Musk’s and other American companies to thrive": 0.8,
  "Wall Street analysts assess Google’s earnings beat": 0.5,
  "Oppenheimer upgrades Spotify saying ad monetization could drive stock to $800": 0.8,
  "Nvidia Stock Rises. It Got Good News From Google and Trump.": 0.6,
  "Artificial Intelligence Application Programming Interface (AI API) Global Market Research Report 2025 | Amazon, Google, and Microsoft Dominate, North America Lead with Asia-Pacific Rapidly Growing": 0.6,
  "Investing Myth: \"Buy Low, Sell High\" Is Easier Said Than Done. Here's Why Most Investors Get It Wrong.": -0.5,
  "Tesla Stock Is Down 8%. The Earnings Call Lacked Meat.": -0.6,
  "Tesla shares sink as Musk says it could face some 'rough quarters' ahead": -0.7,
  "Alphabet Inc. (GOOG): A Bull Case Theory": 0.5,
  "Intel beats shareholder lawsuit over $32 billion stock plunge": 0.5,
  "Comcast Corporation (CMCSA): A Bull Case Theory": 0.5,
  "Constellation Energy Corporation (CEG): A Bull Case Theory": 0.5,
  "Microsoft (MSFT) “Is More Vulnerable Than People Realize,” Says Jim Cramer": -0.5,
  "BC-Most Active Stocks": 0.0,
  "Google's AI spending hike is a 'perfect backdrop' for Mag 7": 0.6,
  "Palo Alto Networks (PANW): “.These Guys Are Frantically Getting Customers,” Says Jim Cramer": 0.6,
  "Video-sharing app Vine is returning 'in AI form', Musk says": 0.2,
  "Stock Market Today: Dow, Small Caps Cool Off As Tesla Slammed; Meta Platforms Eyes New Entry (Live Coverage)": 0.1,
  "Domino’s Pizza, (DPZ): “Be Prepared To Be steamrolled,” Says Jim Cramer": 0.2,
  "DoorDash (DASH): CEO’s “A Hitter,” Says Jim Cramer": 0.6,
  "Non-GMO Food Market Overview & Company Analysis Report 2025-2033 Featuring Amy's Kitchen, Blue Diamond Growers, Organic Valley, Hain Celestial, Nestle, Kellogg's, PepsiCo, Pernod Ricard, Clif, Danone": 0.2,
  "Apple (AAPL) Isn’t Going To Buy Perplexity, Says Jim Cramer": 0.2,
  "Amazon faces UK lawsuits worth up to $5.4 billion from retailers, consumers": -0.6,
  "Keurig Dr Pepper CEO on Q2 beat, coffee sales, cane sugar": 0.5,
  "Analyst Explains How NVIDIA (NVDA) Can Reach $8 Trillion Market Cap": 0.5,
  "Stock Market Today: S&P 500, Nasdaq Touch Records; Rail Merger Talks; West Pharma in Focus": 0.5,
  "Alphabet stock still looking cheap: Opening Bid top takeaway": 0.5,
  "Union Pacific in mega US railroad merger talks with rival Norfolk Southern - Union Pacific said on Thursday it was in advanced discussions with rival Norfolk Southern for a possible mega merger that would create a transcontinental railroad behemoth. Norfolk shares were up 3.5%, while Union Pacific fell 2.3% in premarket trading. A deal, if it goes through, will combine Union Pacific's dominant position in the Western two-thirds of the U.S. with Norfolk's 19,500-mile route": 0.6,
  "World Premiere: Battlefield 6 First Trailer Reveals the Thrilling Future of the Iconic Series": 0.8
}