{
  "2 Soaring Growth Stocks That Could Climb Another 15% to 20%, According to Wall Street Analysts": 0.8,
  "Arm Holdings (ARM) Delivers ‘Respectable’ Quarter—But Investors Wanted More": 0.2,
  "Benchmark Stays Bullish on Qualcomm (QCOM) —Here’s Why": 0.8,
  "O’Reilly Automotive acquires Texas distribution center amid capacity constraints": 0.2,
  "Analysis: Sliding US rig count outpaces efficiency gains, threatening onshore oil output": -0.6,
  "Alibaba to Shut Costco-Like China Stores After Rivalry Heats Up": -0.6,
  "OpenTable: why UK Hotel Restaurants Are the New Culinary Hotspots": 0.6,
  "Is Wall Street Bullish or Bearish on Copart Stock?": 0.2,
  "Stock Index Futures Gain on Strong Earnings and Fed Rate-Cut Bets": 0.8,
  "CEG vs. AEP: Which Utility Is Best Positioned for Long-Term Growth? (Revised)": 0.2,
  "Is ASML Stock a Buy Now?": 0.0,
  "Berkshire Shares Tumble as Buffett Has Five Months Left at the Helm to Make a Big Deal": -0.5,
  "SOPHiA GENETICS expands collaboration with AstraZeneca using AI to improve breast cancer patient outcomes": 0.8,
  "Independent power producers hit back at utility critics over PJM price surge": 0.1,
  "ON Semiconductor Second Quarter 2025 Earnings: Revenues Beat Expectations, EPS Lags": 0.2,
  "President of Charter Communications Christopher Winfrey Buys 1.7% More Shares": 0.5,
  "Is Marvell Technology (NASDAQ:MRVL) A Risky Investment?": -0.6,
  "The past three years for Keurig Dr Pepper (NASDAQ:KDP) investors has not been profitable": -0.8,
  "Garmin announces collaborations with leading brands for Garmin Marathon Series": 0.5,
  "IDEXX Laboratories Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "Aurora begins nighttime driverless operations": 0.5,
  "EXCLUSIVE: Vivani Prioritizes Semaglutide-Based Implant After Promising Preclinical Data": 0.8,
  "ISRG's Ion Platform Sees Uptick in Utilization, Eyes Efficiency": 0.5,
  "Exploring 3 High Growth Tech Stocks In The US Market": 0.0,
  "Marriott earnings top estimates despite economic uncertainty": 0.8,
  "Cisco Reinvents Digital Resilience for the Agentic Era at Splunk .conf25": 0.5,
  "Aviatrix® Appoints Willie Tejada as Cloud Native Security Fabric GM as Enterprises Shift Focus to Workload Protection": 0.5,
  "Some Investors May Be Worried About Copart's (NASDAQ:CPRT) Returns On Capital": -0.5,
  "Marriott International (MAR) Surpasses Q2 Earnings and Revenue Estimates": 0.8,
  "Pfizer, Caterpillar and Marriott: Market Movers": 0.0,
  "Silicon Laboratories (SLAB) Q2 Earnings and Revenues Surpass Estimates": 0.8,
  "Companies Tout More Investments, Orders From Trump’s Tax Bill in Earnings Calls": 0.5,
  "Comcast Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "Here’s Why Baron Global Advantage Fund’s Estimate of MercadoLibre’s (MELI) Intrinsic Value Has Risen": 0.5,
  "NVIDIA Stock Jumps 59% in Three Months: Time to Hold or Exit?": 0.5,
  "Arm Stock: Are Investors Missing the Forest for the Trees?": 0.2,
  "Attain, Kargo, and SmartCommerce Win ADWEEK’s 2025 Media Plan of the Year Award for Best Use of Insights": 0.6,
  "Tempus AI Targets Breast Cancer With Expanded Next - AI Platform": 0.5,
  "Here’s Why Baron Global Advantage Fund’s Has Strong Conviction in NVIDIA (NVDA)": 0.6,
  "Palo Alto vs. Check Point: Which Cybersecurity Stock Has an Edge?": 0.5,
  "Company News for Aug 5, 2025": 0.0,
  "Wall Street Analysts Think Synopsys (SNPS) Is a Good Investment: Is It?": 0.5,
  "Caterpillar tariff warning, Yum misses, Marriott cuts outlook": -0.5,
  "Block downgraded, Wayfair upgraded: Wall Street's top analyst calls": 0.5,
  "Marriott’s (NASDAQ:MAR) Q2 Sales Beat Estimates": 0.8,
  "Why Lam Research (LRCX) is a Top Momentum Stock for the Long-Term": 0.8,
  "Stocks See Support from Strong Earnings and Rate Cut Speculation": 0.8,
  "Form 8.3 - QCOM US": 0.0,
  "Compared to Estimates, Marriott (MAR) Q2 Earnings: A Look at Key Metrics": 0.2,
  "Not Even Warren Buffett Wins 'Em All—Recent Losses on Two Big Investments Prove It": -0.5,
  "Diamondback says it should be Permian's 'consolidator of choice' as oil outlook dims": 0.2,
  "Secure Access Service Edge (SASE) Market Company Evaluation Report 2025 | Palo Alto Networks, Fortinet, and Broadcom Lead with AI-Driven Security, Integrated Platforms, & Scalable Enterprise Solutions": 0.8,
  "Compared to Estimates, GlobalFoundries (GFS) Q2 Earnings: A Look at Key Metrics": 0.2,
  "MercadoLibre Q2 Earnings Miss Estimates, Revenues Rise Y/Y": 0.2,
  "Comcast Deepens Roots in Bossier City with $19 Million Investment, Local Partnerships, and Expanded Internet Access": 0.8,
  "Comcast Extends its High-Speed Internet Network and Brings Advanced Connectivity Services to Block 59 Redevelopment in Naperville": 0.5,
  "Marriott Stock Up as Q2 Earnings Beat Estimates, RevPAR Rises Y/Y": 0.8,
  "ON Semiconductor Q2 Shows 'Muted' Sales Recovery, Auto Weakness; BofA Says": -0.5,
  "These 3 CEOs Just Bought the Dip": 0.5,
  "VRTX Q2 Earnings Beat, Stock Down as Pain Drug Misses Study Goal": -0.5,
  "Top Stock Movers Now: Gartner, Axon Enterprise, Palantir, and More": 0.5,
  "FIVN or ADSK: Which Is the Better Value Stock Right Now?": 0.2,
  "Jim Cramer on Lam Research: “Let it Come in And Then Do Some Buying”": 0.6,
  "CRSP Stock Down on Huge Q2 Loss, Focus on Increasing Casgevy Adoption": -0.5,
  "MercadoLibre Q2: CFO talks tariff impacts & Brazil e-commerce": 0.2,
  "How To Put Marvell Technology Stock On An Iron Condor's Wings": 0.2,
  "Marriott Trims Its Full Year Outlook": -0.5,
  "Starbucks under pressure again as Brazilian tariffs hike coffee costs": -0.7,
  "Trump threatens 250pc tariffs on drug imports": -0.8,
  "Marriott CEO Highlights Luxury Spend Offset By Economic Uncertainty, Reduced Government And Business Travel": -0.5,
  "From ingredient costs to sagging demand, tariffs further pinch company earnings": -0.6,
  "Susquehanna Reiterates Bullish Stance on QUALCOMM (QCOM) Stock": 0.8,
  "Argus Raises PT on NXP Semiconductors N.V. (NXPI) Stock, Maintains Buy": 0.6,
  "Constellation Energy Corporation Declares Dividend": 0.5,
  "VRTX: Vertex Shares Tank After Pain Drug Flop in Key Trial": -0.8,
  "Diamondback Eyes M&A as Permian's ‘Consolidator of Choice,’ CEO Says": 0.6,
  "Can $10,000 in O'Reilly Automotive Stock Turn Into $61,917 by 2035?": 0.2,
  "DexCom (DXCM) Extends Losses on Day 5 Amid Leadership Change": -0.6,
  "ON Semiconductor (ON) Nosedives 15% as Cautious Market Weighs on Outlook": -0.7,
  "CEG's Q2 Earnings Coming Up: How Should Investors Play the Stock?": 0.5,
  "MercadoLibre Stock Pushes Higher, Shaking Off Q2 Earnings Miss": 0.6,
  "Qualcomm (QCOM) Delivers Solid Results—But Apple Headwinds Still Loom": 0.2,
  "Raymond James Reiterates Outperform on Arm Holdings (ARM), Raises PT to $165": 0.8,
  "Palo Alto Networks, Inc. (PANW): A Bull Case Theory": 0.5,
  "Nuclear Sector Earnings Show a Mixed Picture. Why One Stock Is Surging.": 0.2,
  "Ellucian Awards Transact + CBORD Verified SaaS Badges for Eight Integrated Payment Solutions": 0.2,
  "Best Stocks to Own: Workday Stock Could Add 8% in August": 0.8,
  "Oil Falls as Possible Russia Air Truce Eases Crude Supply Risks": 0.5,
  "Why GlobalFoundries Sank Today": -0.5,
  "Top Stock Reports for Morgan Stanley, PepsiCo & Comcast": 0.0,
  "Why Vertex Pharmaceuticals (VRTX) Stock Is Trading Lower Today": -0.5,
  "CrowdStrike Announces Date of Fiscal Second Quarter 2026 Financial Results Conference Call": 0.0,
  "Resideo Announces Record Second Quarter 2025 Financial Results; Raises 2025 Outlook; Initiates Third Quarter 2025 Outlook": 0.8,
  "Companies Are Sounding Ebullient on Trump’s Tax Law. Tariffs Could Be a Killer.": 0.2,
  "Why Vertex Pharma Is Feeling The Pain Despite A Second-Quarter Beat": -0.5,
  "Equity Markets Close Lower Amid July Slowdown in Services Sector, Trade Data": -0.5,
  "These Stocks Moved the Most Today: Palantir, Vertex, Hims & Hers, Coinbase, BP, and More": 0.2,
  "AMD bull and bear react to Q2 earnings": 0.2,
  "S&P 500 Gains and Losses Today: Gartner Stock Plunges; Palantir, Axon Surge After Earnings": 0.5,
  "Amgen (AMGN) Beats Q2 Earnings and Revenue Estimates": 0.8,
  "Stocks to Watch Recap: Palantir, Coinbase, Gartner, Pfizer": 0.0,
  "Equities Fall as ISM Data Spark Economic Concerns": -0.7,
  "Qualys (QLYS) Surpasses Q2 Earnings and Revenue Estimates": 0.8,
  "Amgen (AMGN) Q2 Earnings: Taking a Look at Key Metrics Versus Estimates": 0.2,
  "Stocks to Watch Afterhours: AMD, Amgen, Snap": 0.0,
  "Copart, Inc. (CPRT) Ascends While Market Falls: Some Facts to Note": 0.5,
  "Weekly Picks: ASML's Selloff Explained, WH's Global Expansion, and NVO's Market Mispricing": 0.5,
  "Amgen’s (NASDAQ:AMGN) Q2: Beats On Revenue": 0.5,
  "(Item 2.02) Results of Operations and Financial Condition. On August 6, 2025 , DoorDash, Inc. (\"DoorDash\") issued a press release announcing its financial results for the quarter ended June 30, 2025. A copy of the press release is attached as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated herein by reference.\n\n(Item 2.02) and": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. CDW Corporation (the \"Company\") is furnishing under cover of this Current Report on Form 8-K a copy of its press release dated August 6, 2025 announcing its second quarter 2025 financial results. The press release is attached to this report as Exhibit 99.1 and incorporated herein by reference. The Company is furnishing this information in connection with its previously announced webcast conference call to be held on August\n\n(Item 2.02) of this Current Report on Form 8-K (including Exhibit 99.1) is being furnished and shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as expressly set forth by specific\n\n(Item 8.01) . Other Events. Quarterly Cash Dividend On August 6, 2025, the Company also announced that its Board of Directors has declared a quarterly cash dividend of $0.625 per common share to be paid on September 10, 2025 to all stockholders of record as of the close of business on August 25, 2025. A copy of the press release announcing the declaration of the quarterly cash dividend is attached to this report as Exhibit 99.2 and": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On August 6, 2025, Airbnb, Inc. (the “Company”) issued a Shareholder Letter (the “Letter”) announcing its financial results for the second quarter ended June 30, 2025. In the Letter, the Company also announced that it would be holding a conference call on August 6, 2025 at 1:30 p.m. PT / 4:30 p.m. ET to discuss its financial results for the second quarter ended June 30, 2025. A copy\n\n(Item 2.02) of this Form 8-K, including Exhibit 99.1 attached hereto, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference into any other filing under the Securities Act of 1933, as amended, or the Exchange Act, regardless of any general incorporation language in such filing, except as": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition On August 6, 2025, the Company issued a press release announcing its financial results for the quarter ended June 30, 2025. A copy of the press release is attached as Exhibit 99.1 to this current report on Form 8-K and is incorporated by reference herein. The information in this\n\n(Item 2.02) of this current report on Form 8-K and Exhibit 99.1 attached hereto shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”) or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, regardless of any general incorporation language in such filing.": 0.0,
  "This Arm-Backed Chipmaker Just Soared 98% on Day One -- Should You Buy the Hype?": 0.5,
  "An All-Inclusive Resort for $900 a Night? I Put One to the Test": 0.2,
  "Lam Research Corporation (LRCX): A Bull Case Theory": 0.5,
  "Trump says pharma tariffs to start small, then soar to 250%": -0.6,
  "Microchip Technology (MCHP) Q2 Earnings: What To Expect": 0.0,
  "If Tomatoes are a Fruit, is Ketchup a Smoothie? HEINZ and Smoothie King Weigh In with First-Ever Tomato Ketchup Smoothie": 0.5,
  "3 Reasons We Love Cintas (CTAS)": 0.5,
  "2 Reasons to Avoid PANW and 1 Stock to Buy Instead": -0.5,
  "3 Nasdaq 100 Stocks with Exciting Potential": 0.6,
  "2 Unpopular Stocks That Deserve Some Love and 1 We Question": 0.2,
  "1 S&P 500 Stock for Long-Term Investors and 2 We Brush Off": 0.2,
  "2 S&P 500 Stocks to Target This Week and 1 That Underwhelm": 0.2,
  "3 S&P 500 Stocks with Open Questions": 0.0,
  "3 Healthcare Stocks We Find Risky": -0.8,
  "3 S&P 500 Stocks We Approach with Caution": -0.5,
  "Coca-Cola Europacific Partners Plc Announces Results for The Six Months Ended 27 June 2025": 0.2,
  "Amgen Inc (AMGN) Q2 2025 Earnings Call Highlights: Strong Revenue Growth and Robust Pipeline ...": 0.8,
  "Glencore to Keep London Listing After Dropping New York Plans": 0.5,
  "8 Undervalued Stocks for a Rocky Market": 0.2,
  "Satellite Phased Array Antenna Market Growth Trends, Competitive Strategies and Forecasts 2025-2033 Featuring ALCAN Systems, ViaSat, C-COM Satellite Systems, and Honeywell International": 0.2,
  "Cancer Antibody Drug Conjugates Market Research 2025-2031 | Pfizer, AstraZeneca, and Biotechs Like Miracogen Advance Cancer ADCs with Strategic Acquisitions and Innovative Pipelines": 0.6,
  "Zacks Investment Ideas feature highlights: MSCI, Charter Communications and Healthpeak Properties": 0.0,
  "7 Reasons Why Vertex Pharmaceuticals Is a No-Brainer Stock to Buy on the Dip": 0.8,
  "From Hyatt to Marriott: LA lifestyle hotel undergoes brand conversion": 0.2,
  "The Zacks Analyst Blog Highlights Morgan Stanley, PepsiCo, Comcast and Gencor": 0.0,
  "Vertex’s Journavx successor culled after falling short in Phase II trial": -0.8,
  "S&P Futures Gain With Focus on Earnings and Fed Speak": 0.5,
  "US Health Department Ending Federal mRNA Vaccine Development": -0.8,
  "Vertex Pharmaceuticals Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "OMass Therapeutics Appoints Carol A. Schafer as Non-Executive Director and Chair of the Audit Committee": 0.5,
  "CDW Reports Second Quarter 2025 Earnings": 0.0,
  "Compugen Reports Second Quarter 2025 Results": 0.0,
  "Diamondback Energy Second Quarter 2025 Earnings: Revenues Beat Expectations, EPS Lags": 0.2,
  "CDW Declares Quarterly Cash Dividend of $0.625 Per Share": 0.5,
  "CDW: Q2 Earnings Snapshot": 0.0,
  "Starbucks’ stock is being pummeled by Trump’s coffee tariffs while the rest of the market soars": -0.7,
  "Enlight Renewable Energy Ltd. (ENLT) Lags Q2 Earnings Estimates": -0.5,
  "Qualcomm (QCOM) Holds ‘Overweight’ Rating—Here’s What’s Keeping Investors Confident": 0.8,
  "GlobalFoundries Second Quarter 2025 Earnings: EPS Beats Expectations": 0.8,
  "Why a Company You’ve Never Heard of Is One of the Best Nasdaq-100 Stocks of the Year": 0.5,
  "Buy Axon, avoid Byrna: Good Buy or Goodbye": 0.5,
  "AI Chips Today - Arteris FlexGen Powers AMD's Next-Gen AI Chip Designs": 0.8,
  "Coffee, Chips, and Credit Cards": 0.0,
  "Has Analog Devices, Inc.'s (NASDAQ:ADI) Impressive Stock Performance Got Anything to Do With Its Fundamentals?": 0.5,
  "Mondelez International, Inc.'s (NASDAQ:MDLZ) Intrinsic Value Is Potentially 98% Above Its Share Price": 0.8,
  "Dayforce beats quarterly revenue estimates on steady software demand": 0.8,
  "Dow Jones Futures Rise As AMD, Shopify Lead Big Earnings Movers": 0.6,
  "CrowdStrike Signal Delivers the Next Evolution of AI-Powered Threat Detection": 0.8,
  "CrowdStrike Launches New Services to Secure AI Systems and Operationalize AI in the SOC": 0.5,
  "Will Choosing Analog Devices (ADI) Prove to Be a Wise Investment Decision?": 0.5,
  "Marriott International Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "Clinical Progress in Rare Disease Signals Long-Term Revenue Potential for Innovators": 0.8,
  "AI, Robotics Are Reshaping the Future of Hospitality": 0.5,
  "Exchange-Traded Funds, Equity Futures Higher Pre-Bell Wednesday Amid Wave of Corporate Earnings": 0.5,
  "CSX Executive Vice President and Chief Commercial Officer to Address Deutsche Bank’s 2025 Transportation Conference": 0.0,
  "T-Mobile Expands Home and Small Business Internet Plans with More Built-In Benefits": 0.6,
  "BDO USA Named a Workday Partner, Enhancing Finance and HR Service Offerings": 0.6,
  "Should You Buy the Post-Earnings Dip in PayPal Stock or Cash Out in PYPL Here?": 0.2,
  "Here is What to Know Beyond Why Synopsys, Inc. (SNPS) is a Trending Stock": 0.2,
  "Investors Heavily Search Booking Holdings Inc. (BKNG): Here is What You Need to Know": 0.5,
  "ASML Holding N.V. (ASML) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Is Now The Time To Look At Buying Workday, Inc. (NASDAQ:WDAY)?": 0.2,
  "Calculating The Fair Value Of Exelon Corporation (NASDAQ:EXC)": 0.1,
  "Is the Options Market Predicting a Spike in Ross Stores Stock?": 0.2,
  "Marriott International and La Tablée Des Chefs Combat Food Insecurity with Announcement of 2025 Ready-To-Cook Soups Goal": 0.6,
  "Brokers Suggest Investing in MercadoLibre (MELI): Read This Before Placing a Bet": 0.5,
  "CDW (NASDAQ:CDW) Reports Upbeat Q2": 0.8,
  "Snap downgraded, Leidos upgraded: Wall Street's top analyst calls": 0.5,
  "This Company Looks Like a Dividend Champion in the Making and It Could Announce Another Dividend Hike Next Month": 0.8,
  "Why Idexx Laboratories (IDXX) is a Top Momentum Stock for the Long-Term": 0.6,
  "Why This 1 Momentum Stock Could Be a Great Addition to Your Portfolio": 0.8,
  "Amgen's Q2 Earnings & Sales Beat Estimates, 2025 View Raised Slightly": 0.8,
  "These Were the 2 Best-Performing Stocks in the Nasdaq-100 in July 2025": 0.5,
  "Newly proposed drone rules could boost US retail delivery options": 0.8,
  "CrowdStrike Stock Plunges 13% in a Month: Time to Hold or Exit?": -0.6,
  "Netflix Stock Hasn’t Gone Anywhere in 3 Months. How Should You Play NFLX Here?": 0.0,
  "Are Wall Street Analysts Predicting CrowdStrike Stock Will Climb or Sink?": 0.2,
  "CDW's Q2 Earnings Top, Revenues Up Y/Y on Strong Core & Global Demand": 0.8,
  "Taiwan Semiconductor Stock Soars 18% YTD: Time to Hold or Book Profit?": 0.5,
  "T-Mobile Stock: Is Wall Street Bullish or Bearish?": 0.1,
  "3 No-Brainer Artificial Intelligence (AI) Stocks to Buy Right Now": 0.5,
  "ASML vs. AMAT: Which Semiconductor Equipment Leader Is a Better Buy?": 0.5,
  "Market Chatter: Intel CEO's Links to Chinese Firms Reportedly Questioned by US Senator": -0.5,
  "Match Group Q2 Earnings Miss Estimates, Revenues Remain Flat Y/Y": -0.5,
  "Pricing Power vs. Volume Pressure: What's Driving PepsiCo Now?": 0.2,
  "Absolute Security and CrowdStrike Expand Partnership to Deliver Resilience to CrowdStrike Customers": 0.5,
  "Strength in Aerospace Technologies Unit Drives Honeywell: Can It Sustain?": 0.5,
  "PYPL or MA: Which Is the Better Value Stock Right Now?": 0.2,
  "Ultragenyx's Q2 Loss Narrower Than Expected, Revenues Rise Y/Y": 0.8,
  "Disney’s ESPN to Buy NFL Network, Other Assets in Stock Swap": 0.5,
  "Think, Move, and Play Like a Superstar in EA SPORTS™ NHL® 26, Powered by Official NHL Edge Data": 0.5,
  "July earnings update: Boeing, UnitedHealth Group, Starbucks, Coca-Cola and BlackRock": 0.0,
  "Blue chips in favour ahead of likely Bank of England interest rates cut": 0.5,
  "Vertex Pharmaceuticals (VRTX) Hits New All-Time Low on Failed Clinical Trial": -0.8,
  "Coffee prices showing marked jolt in advance of trade war tariffs with Brazil": -0.6,
  "Disney Scores Earnings Beat and 2 Big ESPN Deals": 0.8,
  "Southwest Airlines Takes Off with Priceline: More Flights, More Smiles, Same Great Fares, Now Available Directly on Priceline": 0.8,
  "Podcast: Tough Times Come for Big Food": -0.5,
  "Teva’s Ajovy becomes first migraine prevention drug approved for children": 0.8,
  "Why Is Resideo (REZI) Stock Soaring Today": 0.5,
  "Here's A Conservative Way To Take Advantage Of Bullish Axon Stock": 0.5,
  "T-Mobile tackles SOHO market with security solution": 0.5,
  "Amgen Stock Sinks As Market Eyes MariTide's Next Move": -0.5,
  "Cadence Design Systems' (NASDAQ:CDNS) Soft Earnings Are Actually Better Than They Appear": 0.5,
  "Electronic Arts Stock Earns RS Rating Upgrade": 0.5,
  "ADP Declares Regular Quarterly Dividend": 0.0,
  "Why Oracle Stock and 2 Other Software Plays Are Struggling Even as Tech Shares Rally": -0.5,
  "Staples and Discretionary Stocks Are Soaring Together. That's Not Supposed to Happen.": -0.5,
  "NRG Energy, Amgen, Arista Networks: Trending Tickers": 0.0,
  "Arcus Biosciences Reports Second-Quarter 2025 Financial Results and Provides a Pipeline Update": 0.5,
  "IonQ Announces Second Quarter Financial Results": 0.0,
  "Meta, Microsoft, Google And AppLovin Lead This Breakout Watch": 0.5,
  "Costco Wholesale Corporation Reports July Sales Results": 0.0,
  "Why S&P 500 Stock Amgen Stumbled Despite Its Beat-And-Raise Quarter": -0.5,
  "BREAKING NEWS: Japan not to be exempt from extra reciprocal tariff: White House - >The US is to impose an additional 15% tariff on Japanese imports. US tariff on Japan regardless of existing rates So take this with a grain of salt, but also remember that a random X account posted that the tariffs will be paused for 90-days, and it came true. But seems like it move the Japanese Yen. Source: [https://english.kyodonews.net/articles/-/58762?words=tariff](https://english.kyodonews.net/articles/-/58762?words=tariff)": -0.6,
  "Retail Stocks Jumped. Thank Shopify’s Earnings.": 0.8,
  "Apple Announces $100 Billion US Investment Ahead of Trump Event": 0.8,
  "McDonald's Q2 review & how to invest in the restaurant sector": 0.2,
  "Applovin shares fall despite better-than-expected Q2 results, guidance": -0.2,
  "Apple announces additional $100 billion in US investment, following Trump iPhone tariff threat": 0.5,
  "Applovin, DraftKings, E.l.f. Beauty: After-hours trending stocks": 0.2,
  "Fortinet forecasts third-quarter sales below estimates as trade uncertainty weighs": -0.5,
  "PayPal Casinos 2025: Exploring Why High 5 Casino Is Frequently Cited Among the Best PayPal Casino Platforms": 0.6,
  "AppLovin Reports Solid Earnings. The Stock Is Down.": -0.5,
  "AppLovin (NASDAQ:APP) Misses Q2 Sales Targets": -0.5,
  "GlobalFoundries Expands Partnership with Apple to Advance Wireless Connectivity and Power Management, Reinforcing U.S. Chip Manufacturing Leadership": 0.8,
  "BREAKING: Trump says there will be a 100% tariff on all semiconductors entering the US - TRUMP ON TARIFFS: SAYS U.S. WILL IMPOSE “VERY LARGE TARIFF” ON CHIPS AND SEMICONDUCTORS. WE WILL BE PUTTING IN 100% TARIFF ON ALL CHIPS. NOTES THERE WILL BE NO CHARGE FOR COMPANIES BUILDING OR COMMITTING INVESTMENT IN THE UNITED STATES.": -0.8,
  "Why CrowdStrike Holdings (CRWD) Outpaced the Stock Market Today": 0.5,
  "Marvell Technology (MRVL) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Baillie Gifford's Strategic Moves: Shopify Inc. Sees a Significant Reduction": -0.5,
  "Here’s Americans’ Favorite Tax-Prep Service. It Isn’t the Biggest.": 0.2,
  "Autodesk (ADSK) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Warner Bros. earnings, Fed talk, jobless claims: What to Watch": 0.1,
  "Trump announces 100% chip tariff as Apple ups U.S. investment": 0.5,
  "Jim Cramer Calls Out Intel's $18.8 Billion Foundry Loss Despite Subsidies: 'We Sell Your Stock'": -0.6,
  "(Item 2.02) . Results of Operations and Financial Condition. On August 7, 2025, Monster Beverage Corporation (the “Company”) issued a press release relating to its financial results for the second quarter ended June 30, 2025, a copy of which is furnished as Exhibit 99.1 hereto. The press release did not include certain financial statements, related footnotes and certain other financial information that will be filed with the Securities and Exchange Commission as part of the Company’s Quarterly": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On August 7, 2025, Datadog, Inc. (the “Company”) issued a press release announcing its financial results for the quarter ended June 30, 2025. A copy of the press release is furnished as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated herein by reference. The information contained in this\n\n(Item 2.02) , including Exhibit 99.1 hereto, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference in any filing made by the Company under the Securities Act of 1933, as amended, or the Exchange Act, regardless of any general incorporation language in such filings, unless expressly incorporated": 0.0,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On August 4, 2025, the Company announced that Russ Miller, Senior Executive Vice President, COO - U.S. and Mexico Operations, will retire effective February 2026. Caton Frates, Executive Vice President, COO Southwest Division, will be appointed Senior Executive Vice President, Warehouse Operations - U.S. and Mexico, effective February 2026.": 0.2,
  "(Item 2.02) . Results of Operations and Financial Condition The information pursuant to\n\n(Item 2.02) in this report on Form 8-K is being furnished as contemplated by General Instruction B(2) to Form 8-K and shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of that Section. On August 7, 2025, we announced the results of our operations for the first quarter of fiscal year 2026. The complete release is attached to this report as": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition Section 7 - Regulation FD": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition On August 7, 2025, Warner Bros. Discovery, Inc. (\"we,\" “Warner Bros. Discovery” or the “Company”) released its earnings for the quarter ended June 30, 2025. A copy of Warner Bros. Discovery's earnings press release is furnished herewith as Exhibit 99.1 and is incorporated herein by reference. The information in this\n\n(Item 2.02) , including Exhibit 99.1 attached hereto, is being furnished pursuant to\n\n(Item 2.02) and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liability of such section, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended (the \"Securities Act\"), or the Exchange Act, except as shall be expressly set forth by specific reference in such filing.": 0.1,
  "Axon Enterprise (AXON) Vs Palantir Technologies (PLTR): Which is the Better Investment?": 0.2,
  "Apple Expands 18-Year-Old iPhone Glass Deal in Bid to Avoid Trump Tariffs": 0.5,
  "Costco Wholesale Corporation (COST)’s A Short Term Disappointment With Long Term Potential, Says Jim Cramer": 0.2,
  "PayPal Holdings, Inc. (PYPL)’s Figures Share Key Insights For The Economy, Says Jim Cramer": 0.5,
  "Comcast Corporation (CMCSA) Should Have Pivoted To Cybersecurity, Says Jim Cramer": 0.2,
  "Arm Holdings plc (ARM) Had To Guide Up, Says Jim Cramer": 0.2,
  "Argus Raised the Firm’s PT on Lam Research Corporation (LRCX), Kept a Buy Rating": 0.6,
  "Goldman Sachs Raised the Firm’s PT on Synopsys (SNPS), Kept a Buy Rating": 0.6,
  "Oppenheimer Raised the Firm’s PT on KLA Corporation (KLAC), Kept an Outperform Rating": 0.6,
  "Barclays Lowers Price Target on MercadoLibre Stock from $3,100 to $3,000, Keeps Overweight Rating": 0.2,
  "Trump Not Moving Markets - Let’s talk about the lies Trump spews daily and how they don’t effect the markets anymore. I watched Trump embarrass Apple CEO Tim Cook today. After the cringe gift where Cook’s hand is visibly shaking Trump stands up at the mic and shamelessly says that there is no inflation and all of these companies/countries are investing hundreds of billions into the U.S.. Shortly after that he talks about how he’s": -0.7,
  "Trump Eyes 100% Chips Tariff, Exempting Firms That Invest in US": 0.2,
  "Q2 Earnings Highs And Lows: Intuitive Surgical (NASDAQ:ISRG) Vs The Rest Of The Surgical Equipment & Consumables - Specialty Stocks": 0.2,
  "3 Reasons FAST is Risky and 1 Stock to Buy Instead": -0.5,
  "2 Large-Cap Stocks to Keep an Eye On and 1 We Find Risky": 0.2,
  "1 Safe-and-Steady Stock on Our Buy List and 2 We Turn Down": 0.2,
  "2 Nasdaq 100 Stocks Worth Investigating and 1 Facing Headwinds": 0.2,
  "2 S&P 500 Stocks to Keep an Eye On and 1 Facing Challenges": 0.2,
  "AI Accounting Just Got Smarter: Better Business Advice Breaks Down QuickBooks' Task-Focused Agents": 0.6,
  "Amgen (AMGN) Completes US$60,594 Million Share Buyback After 14 Years": 0.5,
  "Electronic Arts (EA) Unveils NHL 26 Featuring Tkachuk Family On Deluxe Cover": 0.5,
  "Vertex Pharmaceuticals (VRTX) Reports Strong Q2 2025 Revenue Growth with US$2,965 Million": 0.8,
  "T-Mobile US (TMUS) Expands 5G Plans With New Perks And Cyber Security Features": 0.6,
  "Kraft Heinz (KHC) Launches Limited Edition Ketchup Smoothie With Smoothie King": 0.2,
  "Axon Enterprise (AXON) Sees Q2 Revenue Rise To US$669 Million": 0.8,
  "Holiday Inn owner IHG's profit rises, notes easing pressures after US slowdown": 0.5,
  "Wall Street Says Datadog (DDOG) Is One of Two Key Winners in Observability": 0.8,
  "Coca-Cola Europacific Partners PLC (CCEP) (H1 2025) Earnings Call Highlights: Strong Profit ...": 0.8,
  "Palo Alto Networks (PANW) Previews Application Security Module for Cortex Cloud": 0.5,
  "CrowdStrike (CRWD) Unveils AI Agent Monitoring via ChatGPT Enterprise API": 0.5,
  "Ensurge Micropower ASA appoints Shauna McIntyre as new CEO to lead commercial scale-up": 0.6,
  "Intel CEO Lip-Bu Tan Questioned by US Senator About China Investments - US Senator Tom Cotton has put Intel CEO Lip-Bu Tan on the hot seat, asking the board to explain how the new CEO's long-running financial ties to Chinese tech firms square with the company's critical position in the US semiconductor supply chain. In a letter to Intel Chair Frank Yeary, released on Wednesday, Cotton cites a probe that found Tan, through his venture": -0.6,
  "Ross Stores Stock Outlook: Is Wall Street Bullish or Bearish?": 0.1,
  "Barrick Mining and Whirlpool have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Inside AstraZeneca’s long-game strategy in lung cancer": 0.5,
  "Are Wall Street Analysts Predicting PACCAR Stock Will Climb or Sink?": 0.2,
  "The Best Stocks to Invest $1,000 In Right Now": 0.5,
  "Japan tech giant SoftBank Group sees better fortunes on surging AI stocks": 0.8,
  "Trending tickers: Apple, Shopify, Duolingo, Airbnb, Deliveroo": 0.0,
  "Disney’s Thriving Parks Are Buying It Time to Figure Out Streaming": 0.5,
  "Inside Dexcom’s strategy to stay ahead in the $13.6bn CGM market": 0.5,
  "Apple Launches $100 Billion American Manufacturing Program": 0.8,
  "Is ASML a Buy?": 0.0,
  "The Zacks Analyst Blog Highlights Walmart, BlackRock, Texas Instruments, Perma-Pipe and MIND Technology": 0.2,
  "Airbnb dips as slower growth outlook renews fears of travel demand slowdown": -0.7,
  "Apple leads surge in global tech shares after Trump tariff relief": 0.8,
  "Social Buzz: Wallstreetbets Stocks Mostly Advancing Premarket Thursday; Opendoor Technologies, Apple to Advance": 0.6,
  "EU Says Its U.S. Chip Exports Will Be Covered by 15% Tariff Deal": -0.2,
  "Apple Raises US Investment to $600 Billion as Trump Eyes 100% Chip Tariffs": 0.2,
  "CrowdStrike expands AI Security Services portfolio": 0.5,
  "Constellation Reports Second Quarter 2025 Results": 0.0,
  "Honeywell illegally forced US worker in China to retire, lawsuit alleges": -0.8,
  "Morgan Stanley downgrades Coca-Cola bottler CCEP on ’balanced risk-reward’ profile": -0.2,
  "IT'S OFFICIAL CANADA - NESTEA® RTD IS HERE": 0.6,
  "Warner Bros. Discovery Reports Second Quarter 2025 Results": 0.0,
  "Datadog Announces Second Quarter 2025 Financial Results": 0.0,
  "Baker Hughes Completes Acquisition of Continental Disc Corporation": 0.5,
  "Millennials have abandoned these 7 boomer habits that made them the richest generation yet — plus what they do instead": 0.5,
  "Investing in Palo Alto Networks (NASDAQ:PANW) five years ago would have delivered you a 297% gain": 0.8,
  "Microchip Technology (NASDAQ:MCHP) Will Be Looking To Turn Around Its Returns": 0.5,
  "Calculating The Fair Value Of Autodesk, Inc. (NASDAQ:ADSK)": 0.1,
  "Warner Bros. Discovery: Q2 Earnings Snapshot": 0.0,
  "Datadog: Q2 Earnings Snapshot": 0.0,
  "This Artificial Intelligence Stock Plays an Important Role in Chip Production, but It's Down 14% in 12 Months. Could It Be a Bargain Buy?": 0.2,
  "Datadog Q2 Adjusted Earnings, Revenue Rise; Raises 2025 Guidance": 0.8,
  "You should consider these 3 stock picks, portfolio manager says": 0.2,
  "Constellation Energy beats forecasts on top and bottom lines, shares rise": 0.8,
  "RFK Jr’s mRNA funding halt signals “shift in US public health”": 0.5,
  "Baker Hughes (BKR) Slid Due to Macro Economic Uncertainty": -0.6,
  "Datadog forecasts upbeat third-quarter results on increased cloud security adoption": 0.8,
  "Datadog Earnings Beat. Software Stock Jumps Amid OpenAI, Amazon Worries.": 0.5,
  "Stocks Gain Pre-Bell as Trump's Sweeping New Tariffs Take Effect; Investors Assess Apple's $600 Billion US Investment Plan": 0.5,
  "Datadog shares soar as Q2 earnings beats expectations, guidance raised": 0.8,
  "Warner Bros Discovery subscribers top estimates amid ongoing breakup": 0.5,
  "Datadog Stock Is Rising on Earnings Beat. What to Know.": 0.5,
  "Zscaler to Host Fourth Quarter Fiscal Year 2025 Earnings Conference Call": 0.0,
  "Greenhouse Software Welcomes New Chief Technology Officer, Sagar Patel": 0.5,
  "Constellation Energy Corporation (CEG) Tops Q2 Earnings and Revenue Estimates": 0.8,
  "Netflix, Inc. (NASDAQ:NFLX) Stock Has Shown Weakness Lately But Financials Look Strong: Should Prospective Shareholders Make The Leap?": 0.5,
  "Should You Be Excited About CSX Corporation's (NASDAQ:CSX) 25% Return On Equity?": 0.6,
  "Looking For Yields: WEC Energy, Mondelez International, And Southern Are Consistent Moneymakers": 0.6,
  "Alexion, AstraZeneca Rare Disease reaches an agreement with the pan-Canadian Pharmaceutical Alliance (pCPA) for Ultomiris for the treatment of adults with neuromyelitis optica spectrum disorder (NMOSD) and adults with generalized myasthenia gravis (gMG)": 0.5,
  "Dow Jones Futures Rise On Trump Move, Google, Tesla Eye Buy Points; DoorDash, AppLovin Earnings Late": 0.5,
  "Warner Bros. Discovery (WBD) Surpasses Q2 Earnings Estimates": 0.8,
  "Earnings in Focus: Market Movers": 0.0,
  "Should You be Confident in Atlassian’s (TEAM) Long-Term Growth Drivers?": 0.2,
  "Liberty Media Corporation Reports Second Quarter 2025 Financial Results": 0.0,
  "Datadog (DDOG) Surpasses Q2 Earnings and Revenue Estimates": 0.8,
  "Trump calls for Intel CEO’s resignation, stock falls": -0.5,
  "Intel CEO responds after Trump calls for resignation": 0.1,
  "Littelfuse names Dr. Karim Hamed Senior Vice President and General Manager, Semiconductor Business": 0.5,
  "Here's How Much a $1000 Investment in Axon Enterprise Made 10 Years Ago Would Be Worth Today": 0.5,
  "Intel Stock Slips as Trump Says CEO 'Must Resign, Immediately'": -0.8,
  "E-Commerce Update - Retail Media Networks Surge Transforming Shopper Engagement": 0.5,
  "JPMorgan says Apple delivered ’masterclass’ in managing geopolitics": 0.8,
  "Grain, automotive keep U.S. rail traffic ahead of 2024": 0.5,
  "People looking at Archer (ACHR) now… what’s your actual thesis? - So Archer Aviation just got a price target bump from JPMorgan from $9 to $10 but they still kept it at neutral. Stock popped a few percent on that, but trading volume was weak I’ve been watching this one for a while but still not sure if we’re actually at a good entry or just chasing hype The legal situation is partly cleaned up": 0.2,
  "Duolingo Shares Surge on Strong Q2 Results Despite AI Backlash - Duolingo’s second-quarter 2025 results were strong: revenue grew 41 % compared with last year, paid subscribers rose 46 % and the company logged its highest profit ever. Because of this, Duolingo raised its outlook for the rest of 2025. https://finance.yahoo.com/news/duolingo-surges-user-growth-ai-204545840.html https://investors.duolingo.com/news-releases/news-release-details/duolingo-reports-41-revenue-growth-46-subscription-revenue": 0.8,
  "Nova Ltd. (NVMI) Q2 Earnings and Revenues Beat Estimates": 0.8,
  "Mobile Access Made Easy: Transact + CBORD and ASSA ABLOY Partner to Improve Campus Security and the Student Experience": 0.6,
  "Samba TV Report Finds Advertiser Confidence is Up with 68% of Top 100 Brands Accelerating TV Advertising in First Half of 2025": 0.8,
  "Is Trending Stock Intuit Inc. (INTU) a Buy Now?": 0.2,
  "Want Better Returns? Don't Ignore These 2 Retail-Wholesale Stocks Set to Beat Earnings": 0.8,
  "Constellation Energy Q2 Earnings Beat Estimates, Revenues Rise Y/Y": 0.8,
  "Cavallo Expands SalesPad eCommerce Capabilities to Strengthen Omnichannel Distribution Support": 0.5,
  "EU Says Chip Exports to U.S. Will Have 15% Tariff Ceiling Despite New Levies": 0.2,
  "Warner Bros. Discovery Tops Revenue Estimates, Swings to Profit": 0.8,
  "We Think Biogen's (NASDAQ:BIIB) Profit Is Only A Baseline For What They Can Achieve": 0.6,
  "Food Lion Feeds Provides More than 28 Million Meals to Combat Child Hunger": 0.8,
  "DoorDash Stock Outlook: Is Wall Street Bullish or Bearish?": 0.1,
  "Company News for Aug 7, 2025": 0.0,
  "Patriot.TV Viewership and Stock Performance Surge Amid Industry Shift and Legacy Media Decline - Investors Take Notice under JD Ruckers Leadership": 0.6,
  "IDEXX Laboratories, Inc. Just Beat Earnings Expectations: Here's What Analysts Think Will Happen Next": 0.5,
  "Continuing claims for unemployment benefits hit highest level since November 2021 - Americans filing for unemployment insurance on an ongoing basis reached the highest level since November 2021 during the end of July. In the week ending July 26, 1.974 million continuing claims were filed, up from 1.936 million the week prior and the highest level seen since November 2021, according to data from the Department of Labor released Thursday morning. Economists see an increase": -0.7,
  "Earnings Growth & Price Strength Make Axon Enterprise (AXON) a Stock to Watch": 0.8,
  "Is Zscaler (ZS) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Is Marvell (MRVL) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Warner Bros. Discovery (WBD) Reports Q2 Earnings: What Key Metrics Have to Say": 0.2,
  "Compared to Estimates, CDW (CDW) Q2 Earnings: A Look at Key Metrics": 0.2,
  "Looking for Aerospace Stocks? The Zacks Rank Can Help You Find Winners": 0.5,
  "Is Axon Enterprise (AXON) Outperforming Other Aerospace Stocks This Year?": 0.2,
  "Are You a Value Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Here's Why Adobe Systems (ADBE) is a Strong Growth Stock": 0.8,
  "Why Workday (WDAY) is a Top Growth Stock for the Long-Term": 0.8,
  "Airbnb Growth Accelerates As Q2 Earnings Beat. Why The Stock Is Falling Anyway.": 0.2,
  "Eli Lilly downgraded, Lyft upgraded: Wall Street's top analyst calls": 0.2,
  "Cyient Semiconductors Enters Strategic Channel Partnership with GlobalFoundries": 0.6,
  "Elad Gil — one of tech’s sharpest minds — on early bets, breakout growth, and what’s coming next at TechCrunch Disrupt 2025": 0.6,
  "Stocks Rally on Positive Tariff News ad Rate Cut Hopes": 0.8,
  "Google Is Ditching CrowdStrike Stock. Should You?": 0.1,
  "Warner Bros. Discovery Stock Slides. The Box Office Is Back, But TV Is Still a Worry.": -0.5,
  "Law Enforcement Software Market worth $32.96 billion by 2030 | MarketsandMarkets™": 0.5,
  "Fortinet Stock Tumbles 25% After Earnings Beat. Why It Caught a Downgrade.": -0.6,
  "Influenza Vaccine Market Research Report 2025-2030 Featuring GSK, Abbott, Pfizer, AstraZeneca, Sanofi, Moderna, CSL, Emergent BioSolutions, BIKEN, Serum Institute of India, Sinovac, GC Biopharma": 0.2,
  "Form 8.3 - Qualcomm Inc": 0.0,
  "Bitcoin, crypto stocks rally ahead of Trump order opening 401(k) plans to alternative assets - https://finance.yahoo.com/news/bitcoin-crypto-stocks-rally-ahead-of-trump-order-opening-401k-plans-to-alternative-assets-130149290.html > Major cryptocurrencies and crypto-related stocks were rallying early Thursday ahead of President Trump's expected signing of an executive order that would allow alternative assets like cryptocurrencies and private equity into the retirement accounts of millions of Americans. > President Trump's executive order, expected to be signed around 12:00 p.m. ET on Thursday, according to Reuters, will direct the": 0.6,
  "Analysts weigh implications of Section 232 semiconductor tariffs": 0.0,
  "Baker Hughes Stock: Is Wall Street Bullish or Bearish?": 0.2,
  "Warner Bros. Discovery Unexpectedly Swings to Second-Quarter Profit Amid Better-Than-Expected Subscriber Growth": 0.8,
  "US Vehicle Auction Market Trends 2025-2030 Featuring Openlane, Copart, ACV, RB Global, E Automotive, eBay, COX Automotive, Capital, Cars & Bids, A Better Bid Car, AutoBidMaster, Barrett-Jackson": 0.2,
  "Nvidia, AI Bets Lift SoftBank To Profit After Brutal Year-Ago Loss": 0.6,
  "Airbnb Tops Q2 Estimates, But Here’s Why ABNB Stock Isn’t a Buy": -0.5,
  "How Airbnb's $200M investment could weigh on profit margins": -0.5,
  "Suddenly the Dow Is Down. Blame Healthcare Stocks.": -0.5,
  "Krispy Kreme Unveils Turnaround Plan With US Stake Cut, Global Re-Franchising": 0.5,
  "lululemon Navigates FX Swings & Demand Shifts: Can It Stay Nimble?": 0.2,
  "Crocs Sinks Most Since March 2020 on Tariffs, Cautious Consumers": -0.6,
  "DoorDash Stock Hits All-Time High on Record-Setting Results": 0.8,
  "Warner Bros. Discovery Hits Profit Turnaround, Thanks To Theaters, Not TV": 0.5,
  "DoorDash Stock Eyes Record High As Food Delivery Proves A Consumer 'Staple'": 0.8,
  "Vistra Jumps While Constellation Energy Stalls. Why the Power Giants Split.": 0.2,
  "Airbnb Stock Drops. Why Wall Street Is Cautious About Its Experiences Relaunch.": -0.6,
  "Analysts cut Fortinet rating shares as firewall refresh catalyst fizzles out": -0.6,
  "What's up with mid cap tech stocks today? - HUBS down 6% (after +7% pre market) despite OK quarter, DDOG slightly down after very strong quarter (pre market was up to 12% today). IOT, S, FROG,... all down even though valuation seems pretty reasonable and earnings expected on track. Nasdaq is on the other hand in plus though, so shouldn't be macro I think. Seems weird, any thoughts?": -0.2,
  "Shopify Surges in Q2 With 31% Growth, Driven by International, Enterprise Gains, Morgan Stanley Says": 0.8,
  "AI agents aren’t the ‘new Google,’ says Airbnb CEO": 0.1,
  "Trump Calls for Intel CEO to Resign, Stock Drops": -0.7,
  "LNW vs. TTWO: Which Stock Is the Better Value Option?": 0.0,
  "AVGO Expands Data Center Portfolio With Jericho4: Hold the Stock?": 0.1,
  "AppLovin Stock Gains 13% After Earnings. Why That’s Not a Big Deal.": 0.2,
  "Top Stock Movers Now: DoorDash, Fortinet, Eli Lilly, and More": 0.5,
  "Fortinet's Firewall Refresh Cycle No Longer a Near-Term Catalyst, Morgan Stanley Says": -0.2,
  "DASH Q2 Earnings Beat Estimates, Revenues Increase Y/Y, Shares Rise": 0.8,
  "Top Midday Stories: Trump Calls for Intel CEO's Resignation; Eli Lilly Shares Fall After Obesity Drug Trial Results": -0.5,
  "Uber in talks with banks, private equity firms to fund Waymo expansion - Uber (UBER.N), opens new tab is in talks with private equity firms and banks to secure funds to build its robotaxi business, CEO Dara Khosrowshahi said, as the ride-hailing giant bets on a mass roll-out of the nascent and much-scrutinized technology. Uber, which offers robotaxis from Alphabet (GOOGL.O), opens new tab-owned Waymo, has been strengthening its foothold in the self-driving taxi industry": 0.2,
  "I think the market overreacted to CROX earnings - Hello, here are some key takeaways from their earnings: Today theyre trading at about 80$ a share, 4.4B market cap. Down over 20% in reaction today, so here are some numbers they reported Returned over 200M to shareholders, over 100M in debt pay down and share buybacks each Revenue grew 3% to 1149M, non-GAAP EPS up 5% to 4.23 47% of their revenue is international (not": 0.2,
  "Nvidia, chip stocks jump after Trump says some chipmakers exempt from 100% semiconductor tariff": 0.8,
  "Why Ross Stores (ROST) Could Beat Earnings Estimates Again": 0.5,
  "Warner Bros. Discovery Q2 Earnings Beat Estimates, Revenues Rise Y/Y": 0.8,
  "ABNB Q2 Earnings Beat Estimates, Revenues Rise Y/Y, Shares Drop": 0.2,
  "Why Axon (AXON) Might be Well Poised for a Surge": 0.6,
  "This week in 5 numbers: The price tag of employee referral programs": 0.0,
  "‘You’re welcome': Biden's antitrust chief points to Figma IPO as vindication of his policy": 0.5,
  "Leerink Partners Raised the Firm’s PT on Intuitive Surgical (ISRG), Kept a Buy Rating": 0.5,
  "Cognizant Partners with WRITER to Accelerate Secure AI Adoption for Enterprises": 0.6,
  "Micron Technology (MU) Launched a New Memory Chip for Space Application": 0.5,
  "Loop Capital Markets Reiterated a Buy Rating on AppLovin Corporation (APP), Kept the PT Unchanged": 0.6,
  "New Street Lifts Netflix (NFLX) PT to $1,210 Amid Strong Performance, Ad Growth": 0.8,
  "Argus Research Raises Lam Research (LRCX) PT to $120 After Strong Q2 Performance": 0.8,
  "WBD earnings top estimates, but it's not a buy yet, analyst says": 0.2,
  "Autodesk Channel Feedback Points to H2 Rebound After Q2 Slowdown, Oppenheimer Says": 0.6,
  "Marriott International Declares Quarterly Cash Dividend and Increases Share Buyback Authorization": 0.5,
  "Jim Cramer on Netflix: “It’s a Very Highly Valued Stock”": 0.5,
  "Constellation Energy stock: Catalysts that could power it higher": 0.8,
  "IGEL Expands Zero Trust Capabilities with Zscaler Client Connector on IGEL App Portal": 0.5,
  "Nuclear Stocks CEG and VST Power the AI Boom": 0.5,
  "Workday Rising to Feature Star-Studded Lineup With Brené Brown, Duran Duran, and Microsoft": 0.8,
  "Palo Alto Networks Stock Got Hammered After CyberArk Deal. Earnings Offer a Chance at Redemption.": 0.2,
  "Equities Fall Intraday as Markets Weigh Earnings": -0.5,
  "Why AppLovin Stock Popped Today": 0.5,
  "MoonPay Now Live in Mercury App": 0.5,
  "Is Berkshire Hathaway Stock a Buy, Sell, or Hold After Earnings?": 0.2,
  "Datadog (NASDAQ:DDOG) Delivers Strong Q2 Numbers, Full-Year Outlook Exceeds Expectations": 0.8,
  "Warner Bros. Discovery (NASDAQ:WBD) Reports Q2 In Line With Expectations But Stock Drops": -0.5,
  "buildOn Welcomes Three New Members to National Board of Directors": 0.5,
  "What's the next unicorn stock you have full conviction of? - As per title, I would like to hear what you guys are strongly betting on for the next 4-5 years? As in, if you could throw 50-100k into one stock and let it sit, what stock would that be and why? I understand fully that statistically it's safer to go with the broader market ETF way for obvious reasons, as it's hard to beat": 0.2,
  "Celsius Stock Jumps on Earnings Beat. The Alani Nu Deal Is Paying Off.": 0.8,
  "VKTX rumours - Hey guys, Viking Therapeutics (VKTX) just jumped about 8% today due to growing rumors that Pfizer might be eyeing them for a potential acquisition. Pfizer reportedly hired Morgan Stanley as an advisor, signaling serious talks could be underway. VKTX has promising GLP-1 drugs, which Pfizer needs after dropping their own candidate. While nothing’s confirmed yet, the market is buzzing because an acquisition could mean a significant premium on VKTX’s stock price. Are": 0.8,
  "Update: Fortinet Shares Fall After Morgan Stanley, Rosenblatt Downgrades": -0.6,
  "DoorDash's Strong Growth Signals Ambitious Long-Term Trajectory": 0.8,
  "Nat-Gas Prices Erase Early Gains as US Weather Forecasts Cool": 0.2,
  "Paxos reaches $48m settlement with NYDFS over Binance, AML failures": -0.5,
  "Roper Technologies, Inc. (ROP): A Bull Case Theory": 0.5,
  "Why CrowdStrike (CRWD) Shares Are Plunging Today": -0.7,
  "Why Zscaler (ZS) Stock Is Nosediving": -0.8,
  "Equity Markets Mixed Amid Speculation on Semiconductor Tariffs": 0.1,
  "Fortinet Falls On Q2 Results. Investors 'Confused' On Firewall Refresh. Cybersecurity Stocks Sell Off.": -0.5,
  "Buy the Spike in AppLovin Stock after Q2 earnings?": 0.2,
  "Duolingo, Eli Lilly, Airbnb: Trending Tickers": 0.0,
  "Back to School, Forward to the Future: How Smart Tech and Sustainable Connectivity Empower Students to Thrive on the Go\"": 0.8,
  "90-day extension of US-China tariff truce is likely, US Commerce Secretary Lutnick says - White House has yet to confirm moving the deadline, now set for next week, though Beijing officials say agreement was reached. A 90-day extension of a US-China tariff truce is likely, US Commerce Secretary Howard Lutnick said on Thursday, the most concrete signal from the US side about moving the deadline since bilateral talks concluded in Stockholm last week. “I think": 0.5,
  "Ross Stores, Inc. Announces Second Quarter 2025 Earnings Release and Conference Call": 0.0,
  "Apple Stock Rallies on Trump’s Plan for ‘Make in America’ Tariff Exemptions": 0.8,
  "Atlassian and Google Cloud Partner to Bring AI-Powered Productivity to Millions of Users Worldwide": 0.8,
  "Take-Two Interactive Software, Inc. Reports Results for Fiscal First Quarter 2026": 0.0,
  "Regeneron Announces Investor Conference Presentations": 0.0,
  "Atlassian Announces Fourth Quarter and Fiscal Year 2025 Results": 0.0,
  "S&P 500 Nuclear Leaders Report Earnings As Stock Market Nuke Fever Spreads": 0.2,
  "US Equity Markets Mixed as Investors Parse President Trump's Tariff Remarks on Semiconductor Imports": 0.1,
  "The RMR Group Announces $1.0 Billion Refinancing of Vertex Pharmaceuticals’ Headquarters in Boston Seaport District": 0.8,
  "Microchip Technology Announces Quarterly Cash Dividend on Common Stock of 45.5 Cents Per Share": 0.5,
  "Microchip Technology Announces Financial Results for First Quarter of Fiscal Year 2026": 0.5,
  "Equity Markets Close Mixed Amid Trump's Semiconductors Tariffs, Jobless Claims Data": 0.1,
  "Take-Two Boosts Outlook Ahead of Next ‘Grand Theft Auto’ Release": 0.8,
  "Instacart tops estimates, issues upbeat outlook - Instacart earnings topped estimates and the grocery delivery company issued strong guidance. Here’s how the company did versus LSEG estimates: * **Earnings:** 41 cents per share vs. 38 cents expected * **Revenues:** $914 million vs. $896 million expected “We delivered another strong quarter, reinforcing the essential role we play in helping families save time, money, and effort putting food on the table,” wrote outgoing CEO Fidji Simo in": 0.8,
  "These Stocks Moved the Most Today: Eli Lilly, Fortinet, AppLovin, Sunrun, Airbnb, Duolingo, and More": 0.5,
  "Tyson Foods Names Microsoft Executive to Board of Directors": 0.5,
  "Take-Two Interactive Software Raises Fiscal-Year Outlook on Improved First-Quarter Results": 0.8,
  "Microchip Tech: Fiscal Q1 Earnings Snapshot": 0.0,
  "Take-Two lifts annual bookings forecast on 'Mafia', 'Borderlands' launches": 0.5,
  "Stocks to Watch Recap: Eli Lilly, Firefly, DoorDash, TSMC": 0.0,
  "Stocks Close Mixed after Higher Bond Yields and Tariff News": -0.5,
  "Atlassian: Fiscal Q4 Earnings Snapshot": 0.0,
  "Block shares pop 11% on full-year guidance boost - Block shares jumped in extended trading on Thursday after the fintech company increased its forecast for the year. Here is how the company did, compared to analysts’ consensus estimates from LSEG. * **Earnings per share:** 62 cents adjusted vs. 69 cents expected Block doesn’t report a revenue figure, but said gross profit rose 14% from a year earlier to $2.54 billion, beating analyst estimates of $2.46": 0.8,
  "Pinterest stock falls 10% after earnings miss - Pinterest shares were down more than 10% on Thursday after the company reported second-quarter earnings that missed on earnings per share. Here’s how the company did, compared to analysts’ consensus estimates from LSEG: * **Earnings per share**: $0.33 cents Adj. vs. $0.35 cents expected * **Revenue**: $998 million vs. $975 million expected Sales in Pinterest’s second quarter grew 17% year-over-year while net income was $38.76 million, up": -0.6,
  "Take-Two: Fiscal Q1 Earnings Snapshot": 0.0,
  "Atlassian beats Q4 estimates on strong cloud growth, 2026 guide in-line": 0.6,
  "Take-Two Tops June-Quarter Targets, Touts Ambitious Game Pipeline": 0.8,
  "Roper Technologies Prices Public Offering Of $500 Million Senior Unsecured Notes Due 2028, $500 Million Senior Unsecured Notes Due 2030, $1 Billion Senior Unsecured Notes Due 2035": 0.0,
  "Trump’s tariff threat puts semiconductors on display": 0.1,
  "Take-Two shares rise on strong net bookings, upbeat forecast ahead of new GTA": 0.8,
  "Wall Street Wavers as Tariffs Take Effect, Earnings Cycle Continues": 0.1,
  "SmartCentres Real Estate Investment Trust Releases Second Quarter Results for 2025": 0.2,
  "Traditional media 'turning the corner': Streaming sector playbook": 0.5,
  "KLA Declares Regular Cash Dividend": 0.2,
  "Mondelēz 2024 Snacking Made Right Report: Energy": 0.0,
  "Pinterest Q2 profit miss, Block Q2 revenue miss, Take-Two Q1 beat": -0.33,
  "APP: Oppenheimer Calls AppLovin a 'Top Pick' -- Shares Jump to New High": 0.8,
  "S&P 500 Gains and Losses Today: Apple Stock Climbs; Eli Lilly Slumps After Disappointing Trial Results": 0.2,
  "Atlassian’s (NASDAQ:TEAM) Q2 Sales Top Estimates But Quarterly Revenue Guidance Slightly Misses Expectations": 0.2,
  "Microchip Technology (MCHP) Q1 Earnings and Revenues Surpass Estimates": 0.8,
  "T-Mobile Is Using 5G, Drones and AI to Help First Responders": 0.6,
  "Atlassian (TEAM) Q4 Earnings and Revenues Top Estimates": 0.8,
  "Take-Two’s (NASDAQ:TTWO) Q2: Beats On Revenue, Full-Year Outlook Exceeds Expectations": 0.8,
  "Atlassian forecasts downbeat quarterly revenue": -0.7,
  "Workday (WDAY) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Why Zscaler (ZS) Dipped More Than Broader Market Today": -0.5,
  "Why the Market Dipped But Micron (MU) Gained Today": 0.2,
  "Lululemon (LULU) Dips More Than Broader Market: What You Should Know": -0.5,
  "President Trump Rocks Chip Stocks With Tariff Talk, Intel Comments": 0.5,
  "Tech, Media & Telecom Roundup: Market Talk": 0.0,
  "Take-Two Interactive (TTWO) Beats Q1 Earnings and Revenue Estimates": 0.8,
  "Microchip Tech beats Q1 net sales, profit estimates": 0.8,
  "Analog Devices (ADI) Ascends While Market Falls: Some Facts to Note": 0.5,
  "Microchip Tech (MCHP) Q1 Earnings: How Key Metrics Compare to Wall Street Estimates": 0.5,
  "Pemex plan disappoints suppliers awaiting billions in overdue payments": -0.6,
  "AppLovin Stock Jump 12% On Outlook Driven Catalysts": 0.8,
  "QuinStreet (QNST) Q4 Earnings Lag Estimates": -0.5,
  "Atlassian (TEAM) Reports Q4 Earnings: What Key Metrics Have to Say": 0.2,
  "Take-Two (TTWO) Reports Q1 Earnings: What Key Metrics Have to Say": 0.2,
  "Tesla disbands Dojo Supercomputer Team, Bloomberg Reports - https://www.reuters.com/business/autos-transportation/tesla-disbands-dojo-supercomputer-team-bloomberg-news-reports-2025-08-07/ Ahem, calls! Tesla Inc. is disbanding its Dojo supercomputer team and its leader will depart the company, according to people familiar with the matter, upending the automaker’s effort to develop in-house chips for driverless technology. Peter Bannon, who was heading up Dojo, is leaving and Chief Executive Officer Elon Musk has ordered the effort to be shut down, according to the people, who asked not to": -0.6,
  "Do CEOs pay to go on with Kramer on Fast Money? - His interviews are suspiciously soft...as of a PR person coordinated the questions and Kramer is over the top positive. Never questioning them too much. I just assume it's a paid interview. Any truth to this?": -0.6,
  "Dividend Watch: 3 Companies Boosting Payouts": 0.5,
  "nLight (LASR) Tops Q2 Earnings and Revenue Estimates": 0.8,
  "Verisk Analytics, Inc. Prices Offering of Senior Notes": 0.0,
  "Fast-growing coffee chain is coming for Starbucks' crown": 0.8,
  "SoftBank Shares Surge to Record on AI-Fueled Profit Recovery": 0.8,
  "TSMC Secrets Leak Puts Japan’s Tokyo Electron on Hot Seat": -0.5,
  "Go with the Flow: Agoda's Curated Guide to Asia's Hidden Riverside Destinations": 0.5,
  "Any thoughts on Bullish IPO? - Just saw that Bullish, a crypto-focused exchange backed by Peter Thiel’s Founders Fund, is planning to IPO on August 13 under the ticker BLSH, with a price range of 28 to 31 dollars per share. They are targeting a valuation in the $4 billion range and plan to raise a little over $600 million. Financials seem mixed. They were profitable last year, but Q1 of this year showed a": 0.2,
  "What the analysts got wrong about Eli Lilly's oral GLP... - So LLY just got rekt today because their oral GLP showed lower than expected % body weight loss of 12%... Lilly says that the results are actually as good as you're gonna get in an oral GLP... so why is there a difference of expectation? DOSING.... It's well known that GLP drugs have a dose dependent efficacy AND adverse effect profile... simply put, the": -0.5,
  "SOFI joins the MSCI ACWI equity index. - SoFi adds a whole new spectrum for the MSCI ACWI (All Country World Index) equity index by being the most diversified Fintech Bank that thrived in multiple macro environments. * SoFi is the only Fintech bank that combines a Charter bank, a Financial technology payment processing platform, and Cyberbank Core capabilities. A great portion of its revenue is from fee services. * The upcoming probable interest rate": 0.8,
  "Q2 Earnings Roundup: DoorDash (NASDAQ:DASH) And The Rest Of The Gig Economy Segment": 0.2,
  "Comcast’s (CMCSA) $19M Expansion Brings Speed and Support to Bossier City": 0.8,
  "BMO Capital Lifts PT on Regeneron Pharmaceuticals (REGN) Stock, Keeps Outperform": 0.6,
  "Jim Cramer on Target: “You’re Free to Buy It”": 0.5,
  "2 Reasons to Watch BKNG and 1 to Stay Cautious": 0.5,
  "Canadian stock market benefits the most from Trump's tariffs - Even with Trump's tariffs on Canada, Canada still has one of the smallest average effective tariff rate compared to other countries due to CUSMA/USMCA exception. This will help Canada withstand the downsides of Trump's tariffs. I predict Canada's stock market to greatly outperform other indices. The TSX Composite Index is already up 11.50% YTD, but it has the potential to go higher as tariffs start": 0.8,
  "How Quantum Computing Could Upend Bitcoin": -0.5,
  "TSMC’s July Sales Grow 26% on Sustained Demand for AI Chips": 0.8,
  "Netflix Stock: Is Wall Street Bullish or Bearish?": 0.2,
  "What Are Wall Street Analysts' Target Price for Xcel Energy Stock?": 0.0,
  "Dutch Bros Stock Is Steaming Hot. Could It Be the Next Starbucks?": 0.8,
  "Constellation Energy Corp (CEG) Q2 2025 Earnings Call Highlights: Strong Financial Performance ...": 0.8,
  "Zacks Investment Ideas feature highlights: Constellation Energy, Vistra and Meta Platforms": 0.5,
  "Palo Alto Networks Stock: Is Wall Street Bullish or Bearish?": 0.2,
  "Zacks Investment Ideas feature highlights: AppLovin": 0.0,
  "Atlassian Corp (TEAM) Q4 2025 Earnings Call Highlights: Record Deals and AI Growth Propel ...": 0.8,
  "Prediction: This Dividend Stock Will Beat the Market Over the Next 5 Years": 0.6,
  "Intel CEO Dogged by Decades of China Chip Bets, Board Work": -0.5,
  "Think You Know Costco? Here's 1 Little-Known Fact You Can't Overlook.": 0.5,
  "These Are the 5 Most Popular Stablecoins in 2025. Will That Change in 2026?": 0.2,
  "Microchip Technology (NASDAQ:MCHP) Posts Better-Than-Expected Sales In Q2 But Stock Drops": -0.5,
  "Best AI Marketing Tools (2025): QuickBooks to Launch Campaign Automation via Mailchimp, Named Top Marketing Solution by Better Business Advice": 0.6,
  "r/Stocks Daily Discussion & Fundamentals Friday Aug 08, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is": 0.5,
  "Intel boss hits back at ‘misinformation’ after Trump attacks China links": -0.5,
  "CFOs On the Move: Week ending Aug. 8": 0.0,
  "Pepsi: Turnaround in the Making?": 0.5,
  "Have $1,000? These 2 Stocks Could Be Bargain Buys for 2025 and Beyond": 0.5,
  "Smart Gas Meter Market Research and Global Forecast Report 2025-2030 with Apator, Diehl Stiftung, Honeywell International, Itron, and Landis+Gyr Leading": 0.5,
  "DoorDash Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "Should You Double Down on These 3 Dow Jones Dividend Stocks Near All-Time Highs?": 0.5,
  "Additional Considerations Required While Assessing Xcel Energy's (NASDAQ:XEL) Strong Earnings": 0.5,
  "4 chip stocks well positioned for Trump's 100% tariff threat": 0.5,
  "July in Review: 11 Top Technology Press Releases": 0.5,
  "5 Top Stocks to Buy in August": 0.0,
  "Fortinet Second Quarter 2025 Earnings: EPS Beats Expectations": 0.8,
  "Novo Nordisk is a top pick - Winner in Obesity treatment market - Hello Guys, as a european investor I am surprised by the huge crash the Novo Nordisk shares had to go through and now is the time to buy the huge dip. For a long time Novo Nordisk was the most valuable company in Europe, but due to their not excellent Q2 2025 numbers and competition in the obesity treatment market they suffered": 0.2,
  "Nicotine Is Hot, Beer Is Not. What Vice Stocks Say About America’s Guilty Pleasures.": 0.2,
  "A Closer Look At Honeywell International Inc.'s (NASDAQ:HON) Impressive ROE": 0.8,
  "Edge AI Hardware Market Research Report 2025-2030 | Opportunities Expand with Generative AI Optimization, On-Device Visual Processors, and 5G-Enabled Ultra-Low Latency Applications": 0.6,
  "AppLovin Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "Earnings, Tariff Outlook Lift Wall Street Pre-Bell; Asia Mixed, Europe Up": 0.5,
  "Sonder Secures New Funding, Amends Marriott Agreement": 0.5,
  "Airbnb, Inc. Just Beat EPS By 9.5%: Here's What Analysts Think Will Happen Next": 0.5,
  "This Week In AI Chips - DEEPX Baidu Partnership Advances Global AI Integration": 0.8,
  "US High Growth Tech Stocks To Watch In August 2025": 0.5,
  "Texas Instruments Incorporated (TXN) Surged Along with Market Sentiment": 0.8,
  "What Makes Adobe (ADBE) a Lucrative Investment?": 0.5,
  "I’m 300 shares deep in UNH at a cost basis of $255 - I plan to hold for approx five years. My bet is they will be higher in 5 years time. I will be selling covered calls with 2-3 month expirations dates approx 20% above market price throughout. That is all.": 0.6,
  "Financially motivated cluster a key player in ToolShell exploitation": -0.5,
  "NXP Semiconductors (NASDAQ:NXPI) Might Have The Makings Of A Multi-Bagger": 0.8,
  "Why Phillips 66, PepsiCo, And Regions Financial Are Winners For Passive Income": 0.5,
  "Here’s Why Diamondback Energy (FANG) Slid in Q2": -0.5,
  "California bakery paid extra $100K to DoorDash after being double-billed for 8 years — how to avoid delivery overcharges": -0.7,
  "Investors Parse, Look Ahead to Earnings Announcements as US Futures Rise Friday Pre-Bell": 0.5,
  "Take-Two soars after forecast signals mobile gaming rebound": 0.8,
  "3 Cheap Tech Stocks to Buy Right Now": 0.5,
  "Is Warren Buffett About To Dump The Highest-Yielding Dividend Stock In Berkshire Hathaway's Portfolio?": -0.5,
  "Are Intel Options Traders Expecting the Chip Stock to Collapse This August?": -0.5,
  "AWAKE Caffeinated Chocolate Makes Delicious Debut in U.S. Costco Warehouses": 0.8,
  "Intel CEO responds after Trump calls for his resignation": 0.1,
  "Intel CEO Says He Has Board’s Support After Trump Calls to Step Down": 0.2,
  "Is Wall Street Bullish or Bearish on Constellation Energy Stock?": 0.5,
  "Exchange-Traded Funds, Equity Futures Higher Pre-Bell Friday Ahead of Fed Board Changes": 0.5,
  "How to Find Strong Computer and Technology Stocks Slated for Positive Earnings Surprises": 0.8,
  "Here is What to Know Beyond Why Intuitive Surgical, Inc. (ISRG) is a Trending Stock": 0.2,
  "Investors Heavily Search Axon Enterprise, Inc (AXON): Here is What You Need to Know": 0.5,
  "Investors Heavily Search Applied Materials, Inc. (AMAT): Here is What You Need to Know": 0.5,
  "Homes.com Report: Moderate Home Price Appreciation Continued in July. Nationally, the Median Home Price Was up 2.1% From a Year Ago.": 0.5,
  "Wall Street Set to Open Slightly Higher Friday as Investors Pore Over Earnings Results": 0.5,
  "Enovix Establishes R&D Center of Excellence in India to Accelerate AI-2™ Platform Development": 0.5,
  "United States Soup Market Trends and Growth Analysis Report 2025-2033 | Premium and Plant-Based Soups Drive Expansion Amidst Evolving Consumer Preferences": 0.6,
  "Computer-aided Engineering (CAE) Market Surges to $19.96 billion by 2030 - Dominated by Ansys (US), Autodesk (US), Dassault Systèmes (France)": 0.6,
  "Atlassian Q4 Earnings Surpass Expectations, Revenues Rise Y/Y": 0.8,
  "Netflix revenues hit record high amid BBC licence fee exodus": 0.5,
  "PepsiCo (PEP) Crossed Above the 20-Day Moving Average: What That Means for Investors": 0.5,
  "Trade Desk downgraded, Instacart upgraded: Wall Street's top analyst calls": 0.2,
  "Coca-Cola Europacific Partners First Half 2025 Earnings: EPS: €1.99 (vs €1.73 in 1H 2024)": 0.5,
  "Tradr Readies Leveraged Single-Stock ETFs on ALAB and DDOG": 0.1,
  "Here's Why Idexx Laboratories (IDXX) is a Strong Growth Stock": 0.8,
  "Datadog Q2 Earnings Surpass Estimates, Revenues Increase Y/Y": 0.8,
  "Mafia: The Old Country Now Available Worldwide": 0.5,
  "When Should You Buy Starbucks Corporation (NASDAQ:SBUX)?": 0.0,
  "Stocks Supported by Robust Earnings and Rate Cut Hopes": 0.8,
  "Tax Management Software Market Surges to USD 25.4 Billion by 2033, Propelled by 10.5% CAGR - Verified Market Reports®": 0.8,
  "Stock Market Rises In Range; Palantir, AMD, Shopify Lead Huge Earnings Movers: Weekly Review": 0.8,
  "PepsiCo Stock: Is Wall Street Bullish or Bearish?": 0.1,
  "BBAI, ASTS, ACHR & OKLO are all announcing their earning report after the bell on Monday. Which of these companies is going to rise most? - All four of these companies are incredibly popular on Reddit right now, and you really can’t visit a single investing sub Reddit without hearing about at least one of them. Of these four, which is most likely to make a huge jump come Tuesday morning? Each and every one": 0.6,
  "Sezzle Is Up 7,000% Since Bottoming in 2023. The Question Is Why": 0.5,
  "Are Wall Street Analysts Predicting American Electric Power Stock Will Climb or Sink?": 0.1,
  "Amgen's Repatha, Evenity & Blincyto Drive Sales This Earnings Season": 0.5,
  "Stocks to watch this week: CoreWeave, Cisco, Aviva, Entain and Persimmon": 0.0,
  "3 Crypto-Centric Stocks to Grab Before Bitcoin's Next Rally": 0.5,
  "Gilead Sciences Lifts Annual Outlook As Yeztugo Launch Nears": 0.6,
  "Take-Two Interactive 'Well Diversified' With IP Across Categories, Wedbush Says": 0.5,
  "Expedia Posted Strong Earnings. What Wall Street Is Saying About the Stock.": 0.5,
  "Form 8.3 - Qualcomm Incorporated": 0.0,
  "How do 3x shares work, they don't seem to be 3x - I bought some 3x amd and 3x nvidia shares to see what happens but they aren't doing 3x what the original stock is doing. In the last 24hrs nvda has gone up 1.23% but the 3x has gone up 2.46 which is 2x? In the last 24hrs amd has gone up 0.42% but the 3x has gone down 1%? The 3x i got": 0.1,
  "Intellia Q2 Loss Narrower Than Expected, Pipeline Progress in Focus": 0.5,
  "Comcast Brings High-Speed Internet and Lift Zone to McDuffie County, Celebrates with Laptop Giveaway and Block Party": 0.8,
  "Stocks Rally on Positive Earnings and Hopes for an End to Russia-Ukraine War": 0.8,
  "Warner Bros. Stock Slides After Analysts Flag Second-Half Challenges": -0.6,
  "Airbnb charts AI-first path as it expands customer service agent": 0.1,
  "Airbnb Stock Just Went on Sale. Here’s How to (Safely) Trade the Post-Earnings Dive with Options.": 0.2,
  "Gilead Sciences Expected to See 3% Growth in Annual HIV Product Sales, Truist Says": 0.5,
  "Airbnb embraces a paradox: CEO Brian Chesky says hotels are the future": 0.5,
  "Stock Conversation - Is it appropriate to talk about investments and stocks with people? Not too long ago I was with some friends and I brought up stocks and investments. The conversation got quiet and basically ended. Fast forward a couple of drinks and two of my friends ended up calling me an asshole acting like I was flaunting my wealth and riches when I hadn’t even discussed how much I had invested. I tried": -0.5,
  "Under fire from Trump over China ties, Intel’s Tan counters resignation calls": -0.5,
  "Monster Beverage Q2 Upside, July Sales Growth Back Morgan Stanley's Guide for Revenue Outperformance, Analysts Say": 0.5,
  "Saylor Says Bitcoin Is a Better Investment Than Gold": 0.8,
  "GFS vs. LSCC: Which Stock Is the Better Value Option?": 0.2,
  "BZLFY vs. MDLZ: Which Stock Is the Better Value Option?": 0.0,
  "Microchip Q1 Earnings Beat Estimates, Sales Down Y/Y, Shares Drop": -0.5,
  "Can China Momentum Balance Starbucks' U.S. Comps Challenges?": 0.1,
  "Apartments.com Releases Multifamily Rent Growth Report for July 2025": 0.0,
  "DASH Q2 Benefits From Strong Marketplace GOV: Time to Buy the Stock?": 0.6,
  "You don’t own enough Google- Another “Google is undervalued” post - OpenAI just released their frontier model and suffice to say… it flopped. People are waiting with bated breath to see what Google has cooked up. They already released Genie 3, which nobody is even close to yet on world models. I think it will be trivial for them to surpass or at least catch up to OpenAI on the intelligence front for frontier LMM.": 0.2,
  "Microchip Technology Faces Higher Revenue Bar than Peers, Morgan Stanley Says": 0.1,
  "Alphabet Rises 11% in a Month: Buy, Sell or Hold the GOOGL Stock?": 0.2,
  "Monster (MNST) Shares Skyrocket, What You Need To Know": 0.5,
  "Why Is Gilead Sciences (GILD) Stock Rocketing Higher Today": 0.6,
  "Gilead’s Yeztugo sales “ahead of expectations” following launch": 0.8,
  "Is Idexx (IDXX) a Solid Growth Stock? 3 Reasons to Think \"Yes\"": 0.6,
  "Piper Sandler gets bullish on Monster Beverage, sees sustainable growth ahead": 0.8,
  "Monster Beverage Leverages Functional, Zero-Sugar Innovations To Capture Energy Drink Market Growth": 0.8,
  "Netflix's $6 Billion UK Spend Pays Off With Strong Growth, Membership Gains": 0.8,
  "Oil, Gas Rigs Still Near 3-Year Low Despite Weekly Bump": 0.1,
  "Tariffs Be Damned. Stocks Flirt With a New Record High.": 0.8,
  "US Equity Indexes Rise Amid Trump's Efforts to Secure Ukraine-Russia Peace Deal; Gold Hits New Record": 0.8,
  "Intuit (INTU) Revolutionizes Small Business Finance With Advanced AI Accounting Tools": 0.8,
  "Trade Desk nosedives, Twilio weak outlook, FuboTV revenue beat": -0.5,
  "Microchip Technology (MCHP) Reports Dividend Declaration Despite US$19 Million Quarterly Loss": -0.5,
  "PepsiCo (PEP) Unveils 7UP Pink Lemonade To Enhance Moods With Colourful UK Campaign": 0.6,
  "CrowdStrike (CRWD) Launches AI Security Services to Protect and Power the Future of SOCs": 0.6,
  "KLA (KLAC) Announces US$1.90 Dividend as Board Members Retire": 0.5,
  "Sector Update: Tech Stocks Rise in Afternoon Trading": 0.5,
  "Diamondback Energy Narrows Production Guidance as Net Income Dips in Q2": -0.5,
  "Constellation Energy (CEG) Completes Buyback as Earnings Show Mixed Results": 0.1,
  "Compared to Estimates, Datadog (DDOG) Q2 Earnings: A Look at Key Metrics": 0.2,
  "Datadog (DDOG) Reports Q2 Earnings: Sales Rise to US$827 Million, Net Income Declines": -0.5,
  "Atlassian (TEAM) Announces Leadership Change, Earnings Rise, & Google Cloud Partnership": 0.5,
  "Monster Beverage Q2 Earnings Beat, Higher Sales Across Most Segments Aid": 0.8,
  "Top Midday Decliners": -0.5,
  "Investing.com’s stocks of the week": 0.0,
  "Compared to Estimates, Monster Beverage (MNST) Q2 Earnings: A Look at Key Metrics": 0.5,
  "Why Trade Desk (TTD) Stock Is Plummeting Today": -0.7,
  "Tariff fog looms over US auto sector as semiconductor rules remain unclear": -0.5,
  "Microchip Beats Q2 Estimates but Shares Sink 5% on Tepid Outlook": -0.5,
  "Inflation Data, China Tariff Deadline: What to Watch in the Coming Week": 0.2,
  "CPI report incoming 8/12 Tuesday. Possibility Trump names a new head of BLS during the weekend and tamper the CPI data to his favor? - He did say he will be picking a new guy for BLS this week. High chance it's a puppet who'll do anything Trump will ask. In this case it's reports on inflation. Which, if indeed the report says inflation is high it ruins the chance for rate cut in September": -0.8,
  "New gold tariffs are in effect. Will Costco gold bars be affected?": 0.0,
  "Equities Rise Intraday as Markets Parse Earnings, Fed Official's Comments": 0.5,
  "Intel's new CEO had 3 major problems to tackle. This week Trump added a new one.": -0.5,
  "1 Cash-Producing Stock with Exciting Potential and 2 We Turn Down": 0.6,
  "2 Cash-Producing Stocks for Long-Term Investors and 1 We Brush Off": 0.2,
  "Oil Rig Count Rises by 1; Crude Set for Weekly Losses Ahead of Potential Trump-Putin Meeting": -0.5,
  "Honeywell (HON): Buy, Sell, or Hold Post Q2 Earnings?": 0.2,
  "Cisco Stock, Monster Hit New Highs And Flash This Signal": 0.6,
  "2 Reasons PANW is Risky and 1 Stock to Buy Instead": -0.5,
  "2 Unpopular Stocks That Should Get More Attention and 1 Facing Headwinds": 0.2,
  "Truck sales in the second quarter might have been the worst performing metric of all": -0.8,
  "3 Market-Beating Stocks with Solid Fundamentals": 0.5,
  "1 Large-Cap Stock Worth Your Attention and 2 We Find Risky": 0.2,
  "Final Countdown: San Francisco Set to Host B2B’s Boldest Voices at Marketers Connect": 0.5,
  "Sector Update: Consumer Stocks Advance Late Afternoon": 0.5,
  "Crowdstrike Is A Better Investment than Palo Alto Networks - **Crowdstrike (CRWD) $422 Palo Alto Networks, (PANW) $168** Given how well other cybersecurity companies have done, PANW has been an under performer, gaining just 10% in the past year, but with a stellar record of a 286% gain in 5, and 481% in 10 years. Currently, the stock remains subdued with the acquisition of CyberArk, and unless there are other catalysts announced on earnings date": 0.2,
  "Equity Markets Rise After Corporate Earnings; Fed's Musalem Sees Labor, Inflation Risks": 0.5,
  "Figma’s $21 Billion Drop Returns Stock to Earth After IPO Frenzy": -0.5,
  "Microsoft, Palantir Get Analyst Attention": 0.5,
  "Step Aside, Nvidia And Palantir. Top Funds Get Fired Up About This Stock.": 0.5,
  "Trade Desk Stock Plunges On Small Revenue Beat, Rising Amazon Competition": -0.6,
  "Sector Update: Tech Stocks Higher Late Afternoon": 0.5,
  "Alphabet (GOOGL) Needs a Breakup to Unlock Full Value, Says DA Davidson": 0.2,
  "Gilead Surges 8%, Flirting With A Breakout, On Growing Enthusiasm For HIV PrEP": 0.8,
  "Nvidia Stock Notches New Record. 2 Reasons for the Rally.": 0.8,
  "US Equity Markets Rise, Nasdaq Climbs to Record After Week Packed With Corporate Earnings": 0.8,
  "How major US stock indexes fared Friday, 8/8/2025": 0.0,
  "Capital Compounders for Investors": 0.0,
  "These Stocks Moved the Most Today: Trade Desk, Expedia, SoundHound, Pinterest, Gilead, Peloton, and More": 0.2,
  "Equity Markets Close Higher After Earnings, Fed's Musalem Inflation, Labor Remarks": 0.5,
  "Top Stock Reports for JPMorgan Chase, Chevron & Shopify": 0.5,
  "Video game sector: Tariff impacts, GTA 6 release, EA outlook": 0.2,
  "S&P 500 Advances on Week Amid Gains in Information Technology, Consumer Discretionary": 0.6,
  "Stocks to Watch Recap: Apple, Tesla, Firefly, Block": 0.0,
  "This TSX juggernaut has another 25% upside, CIBC analyst says": 0.8,
  "Nasdaq Hits Fresh High as Wall Street Posts Best Week Since June": 0.8,
  "After Skyrocketing Over 3,000% in 5 Years, Can MicroStrategy Stock Continue to Rise Higher?": 0.8,
  "S&P 500 Gains and Losses Today: Apple Stock Extends Its Rise; The Trade Desk Craters After Earnings": 0.2,
  "Is Apple Stock a Buy After Appeasing President Trump?": 0.2,
  "Stock Market Week Ahead: Ford's 'Model T' Moment, China Leaders, Aerospace Innovators": 0.5,
  "LG Display (LPL) future? - Historically speaking, LG has been at the lowest in 15 years this year. I bought a few hundred shares at $2.46/e that are now in the $4/e~ range I've considered liquidating. That being said I see LG appliances, AC units everywhere these days despite the company not showing profit. And I know Tesla just struck a deal with LG, so there is room for growth. Is this a hold for": 0.5,
  "CBMJ (Patriot.TV) Stock Rockets: +296.48% Since July 6, +127.49% This Week, and +63.64% Today": 1.0,
  "Nasdaq posts record closing high with tech gains, rate cut optimism": 0.8,
  "The Paramount Merger Was a Bad Deal for Old Shareholders. Buying the Stock Is a Good Bet for New Ones.": 0.2,
  "FlyJets CEO On Rising Private Jet Rentals": 0.5,
  "Circle earnings, CPI, comments from Fed's Bostic: What to Watch": 0.1,
  "Compared to Estimates, Diamondback (FANG) Q2 Earnings: A Look at Key Metrics": 0.2,
  "Shorting on a Margin-ed account. Pay any Interest? - So if you place your account in a Margin-able position and you want to Short Sell some equities. Do you pay Interest to Borrow those shares? Sure I know if I borrow money to Buy Long other position I pay Interest, But if you short? curious... Does anyone do this? What do you short?": -0.2,
  "Ad Tech Company Trade Desk Downgraded as Amazon, AI Reshape Digital Market": -0.5,
  "Tesla Robotaxi scores permit to run ride-hailing service in Texas - Tesla has been granted a permit to run a ride-hailing business in Texas, allowing the electric vehicle maker to compete against companies including Uber and Lyft. Tesla Robotaxi LLC is licensed to operate a “transportation network company” until August 6, 2026, according to a listing on the website of the Texas Department of Licensing and Regulation, or TDLR. The permit was issued this week.": 0.8,
  "Spending for Executive Protection Is on the Rise": 0.5,
  "I Tried To Buy 1,000 Shares Of The Figma IPO...Here's What Happened": 0.1,
  "ETFs Show Strongest Inflows of 2025 in July. 2025 is on track to mark a second consecutive year of $1 trillion-plus inflows. - ETF investors ramped up purchases of ETFs in July, adding just under $116 billion to U.S.-listed exchange-traded funds, the biggest monthly total of the year so far. The surge brings year-to-date net inflows to $672.8 billion, translating to an average of $96 billion per month. At that pace, 2025 is on track": 0.8,
  "Question from someone who is considering ULTY - I ask this question in all sincerity. I am looking for investments paying a strong yield. If I bought 100k of ulty on Jan 2 at 9.04 a share, today it would be worth 66, 712 dollars. The weekly distributions would be $29,589. The total would be $96,312. A decline of about 3.5%. Almost any other investment would be better. Why would I choose this investment?": -0.5,
  "Oreos Combined With Reese’s? Inside the Manhattan Project of Snacks.": 0.5,
  "If You Invested $10K In Micron Technology Stock 10 Years Ago, How Much Would You Have Now?": 0.0,
  "How are stocks priced to demand? - To clarify my question is basically how much does a stock’s price increase when there’s for example 100 buyers and 99 sellers. Obviously the stock price would go up but by what amount? i’ve looked this up on google but didn’t find any conclusive answer.": -0.2,
  "RDDT - which advertisers are paying $$$ ?? - I made money shorting RDDT after the first record high. Now I want to do it again but their earnings report is stupefying to me. How can they be pulling in that much dough from advertisers? I never even notice ads on here. I can't believe advertisers would pay a lot to RDDT in the apparent belief that redditors are going to turn into big time": -0.6,
  "Wells Fargo Lowers Lululemon (LULU) PT to $225, Cites US, China Concerns": -0.5,
  "Shopify Inc Stock - Shop Inc (NASDAQ: SHOP) skyrocketed 20%+ after earnings a few days ago due to a surprise EPS beat and more importantly, them saying that the Trump tariffs will not have noticeable effects on them. However, it is greatly overvalued, with inflation on the rise due to tariffs and a slowing economy, I believe SHOP is gonna crash hard. It crashed hard in 2021 during post-COVID inflation. SHOP is very sensitive to": -0.8,
  "Will the NFL Bring the Magic Back to Disney Stock?": 0.5,
  "Made a huge mistake investing a lot into ETFs - As a first time investor, I made the mistake of investing 30k at 37 years old into VOO around November 2024. I was DCAing about 5k per month and had hit about 50k before the market crashed in April. Unfortunately, I did not have a lot of cash on the sidelines and I wanted to build an emergency fund, so I did just that. I": -0.6,
  "The Smartest Growth Stock to Buy With $1,000 Right Now": 0.5,
  "Solid Earnings Reflect AstraZeneca's (LON:AZN) Strength As A Business": 0.8,
  "Forget the \"Magnificent Seven.\" It's Time to Start Talking About the \"Ten Titans.\"": 0.6,
  "3 Stocks That Could Turn $1,000 Into $5,000 by 2030": 0.8,
  "The Smartest Growth Stocks to Buy With $1,000 Right Now": 0.5,
  "/r/Stocks Weekend Discussion Saturday - Aug 09, 2025 - This is the weekend edition of our stickied discussion thread. Discuss your trades / moves from last week and what you're planning on doing for the week ahead. Some helpful links: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips *": 0.2,
  "Prediction: 2 Stocks That'll Be Worth More Than Palantir 3 Years From Now": 0.5,
  "Here's Why Charter Communications (NASDAQ:CHTR) Is Weighed Down By Its Debt Load": -0.5,
  "Marvell Technology, Inc.'s (NASDAQ:MRVL) Intrinsic Value Is Potentially 22% Below Its Share Price": -0.6,
  "Is Arm Holdings Stock a Buy Now?": 0.2,
  "Google Breaks Out, Leads Five Stocks Near Buy Points": 0.5,
  "These 7 Stocks Are Analyst Favorites For Magnificent Earnings Growth; Arista, GE Lead": 0.8,
  "Monster Beverage Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "Roper Technologies' (NASDAQ:ROP) Solid Earnings May Rest On Weak Foundations": -0.5,
  "Is Costco Stock a Buy, Sell, or Hold in 2025?": 0.0,
  "Electronic Arts' (NASDAQ:EA) Conservative Accounting Might Explain Soft Earnings": -0.5,
  "Traders Are Fleeing Stocks Feared to Be Under Threat From AI": -0.6,
  "Can Kakao's stock recover amid Korea's AI push focusing on Naver? - I hold Kakao shares and recently averaged down my cost basis to around 80,000 KRW. However, recent government announcements about boosting the AI industry seem to focus heavily on Naver. Given Kakao's current position in Korea's tech landscape and the competitive environment, I’m wondering how realistic it is for the stock to recover to pre-2023 levels. Would love to hear perspectives from anyone": 0.2,
  "Take-Two Interactive Software First Quarter 2026 Earnings: Beats Expectations": 0.8,
  "Gilead Sciences Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "Is There An Opportunity With lululemon athletica inc.'s (NASDAQ:LULU) 39% Undervaluation?": 0.5,
  "Bitmine (BMNR) Soars 24% on Easy $423-Million Unrealized Gain From ETH’s Jump to $4K Level": 0.8,
  "Crypto Currents: Trump signs executive order to allow crypto in 401(k) plans": 0.5,
  "Gilead Sciences (GILD) Touches New Record High as 10 Analysts Turn Bullish": 0.8,
  "Analysts Have Been Trimming Their The Trade Desk, Inc. (NASDAQ:TTD) Price Target After Its Latest Report": 0.1,
  "Is Qualcomm the Best Semiconductor Stock to Buy Right Now?": 0.5,
  "r/Stocks Weekly Thread on Meme Stocks Saturday - Aug 09, 2025 - The meme stock scheduled posts will now run weekly and post Saturday afternoon and won't be a sticky; you're probably seeing this because automod sent you here! [Full list of meme stocks here.](https://www.reddit.com/r/stocks/wiki/meme-stocks) This will be updated every once in a while. ------ Welcome traders who just can't help them selves discuss the same exact stock that's been discussed 100s of times a": 0.1,
  "Some basic questions about portfolio rebalancing - I’ve been contributing to my employers ESPP for years now and it’s gotten to a point where my individual brokerage account is 56% my company’s stock on Fidelity. I wanted to sell some and rebalance into FXAIX (probably) but have some questions first. 1. If I sell my company stock and buy FXAIX (or any other) this is a taxable event, correct? Even though the money is staying": -0.2,
  "Cathie Wood Goes Bargain Hunting. 1 Dirt Cheap Artificial Intelligence (AI) Stock With Monster Potential She Just Bought": 0.8,
  "Comcast (CMCSA) Completes High-Speed Internet Expansion in Georgia with $10,000 Community Grant": 0.6,
  "Wells Fargo analyst gives TECK $101 price target (It's currently $33.) - Relevant link: [https://www.investing.com/news/analyst-ratings/teck-resources-stock-rating-reiterated-at-**overweight-by-wells-fargo-93CH-4179952**](https://www.investing.com/news/analyst-ratings/teck-resources-stock-rating-reiterated-at-overweight-by-wells-fargo-93CH-4179952) **Full disclosure:** I'm a longstanding TECK holder. It's a large part of my port, I recently added some, and I plan to hold it for many years to come. As such, I'm biased and have a lot to gain by seeing it moon. On the other hand, I think I'm pretty realistic. I have a decent grasp of the challenges": 0.6,
  "Wells Fargo Stays Bullish on Apple (AAPL) Amid $100B U.S. Expansion Plan": 0.8,
  "UBS Reiterates Buy on AppLovin (APP) With $540 PT After Q2 Beat": 0.8,
  "Datadog (DDOG) PT Lifted to $170 on AI-Driven Usage Growth": 0.5,
  "Palo Alto Networks (PANW) Price Target Trimmed to $204 Despite Positive CyberArk Outlook": 0.5,
  "As Shopify Shares Soar, Is It Too Late to Buy the Stock?": 0.2,
  "The Biggest Takeaways From Axon Enterprise's Aug. 4 Earnings Report": 0.5,
  "Fortinet (FTNT) Price Target Cut to $90 as UBS Warns of Low Double-Digit Growth Ahead": -0.5,
  "Mizuho Cuts Atlassian (TEAM) Price Target to $235 but Sees Strong Multi-Year Growth Ahead": 0.6,
  "Shopify Inc. (SHOP) Is Just Crushing Everyone, Says Jim Cramer": 0.8,
  "SoFi Q2 2025 Earnings Report's Top Takeaways - Source: \"5 Important Takeaways From SoFi's Blowout Earnings Report\" by Matt Frankel dated Aug 9, 2025 1 Growth Momentum keeps on growing. * Revenue growth 44% YOY * Membership base 34% YOY with 846K new members, the highest single quarter. 2 Strong Capital-light revenue streams. * LPB (loan platform business) has explosive growth. * Fee-based low-risk revenue makes up 44% of the company's total revenue. * Noninterest": 0.8,
  "Wolfspeed, Inc. (WOLF) Appoints Bret Zahn as Vice President and General Manager": 0.5,
  "Needham Lifts Axon Enterprise, Inc. (AXON)’s Price Target To $870, Maintains Buy Rating": 0.8,
  "Psychological advice to help me stick to my 70/30 passive/active portfolio - I have been investing for 2 years. I began as 95% all world etf with 5% gold, original 40k investment lump. Over that time I found myself leaning more into individual stock picking, as I have started to enjoy it. I have had good results with amd, western digital, vertiv and applovin, which are now 30% of portfolio. I have already noticed the": 0.2,
  "Apple has its best week since July 2020 after White House visit - [https://www.cnbc.com/2025/08/08/apple-has-best-week-since-july-2020-after-tim-cooks-white-house-visit.html](https://www.cnbc.com/2025/08/08/apple-has-best-week-since-july-2020-after-tim-cooks-white-house-visit.html) * Apple shares rose 13% this week, its largest weekly gain in more than five years, after CEO Tim Cook appeared with President Donald Trump in the White House on Wednesday. * At the White House on Wednesday, Cook appeared with Trump to announce Apple’s plans to spend $100 billion on American companies and American parts over the next four years.": 0.8,
  "PagerDuty (PD) high chance of buyout potential ? - Shares of PagerDuty popped from $14.71 to a high of $18.00 July 28 when Reuters came out with an https://www.reuters.com/markets/europe/pagerduty-exploring-potential-sale-after-receiving-buyer-interest-sources-say-2025-07-25/ that they are \"working with Qatalyst Partners on the sale effort, after attracting interest from both financial sponsors and strategic acquirers.\" TD upgraded PagerDuty to Buy on high likelihood of buyout with a price target of $22 up from $17. They mentioned Qatalyst has a strong": 0.8,
  "TD Cowen Backs Comcast (CMCSA) on Strong Q2 and Diversified Growth": 0.8,
  "Jim Cramer on Intuitive Surgical: “I Like That Company So Much”": 0.8,
  "Companies that have a moat - lock their customers in - I'm doing research on which companies have a moat to add to my portfolio. Especially with growth. Companies that once customers use their services, it's hard for them to leave, and customers then have to pay the companies over and over again. But I also want them to have high growth for higher return. Feel free to agree/ disagree and suggestion. Thanks. NVDA: already": 0.6,
  "Micron Technology Announces the Launch of First In Its Class SLC NAND Product": 0.8,
  "Goldman Sachs Reiterates its Buy Rating on Adobe, Keeps PT at $570": 0.6,
  "Wells Fargo Lowers Honeywell (HON) Target, Cites Near-Term Market Uncertainty": -0.5,
  "If You'd Invested $1,000 in Palantir Stock 3 Years Ago, Here's How Much You'd Have Today": 0.5,
  "Better Growth Stock: Costco vs. Visa": 0.5,
  "Should You Sell Palantir Stock After Its Post-Earnings Pop? The Answer May Surprise You.": 0.5,
  "3 Brilliant Growth Stocks to Buy Now and Hold for the Long Term": 0.8,
  "3 Undervalued Dividend Stocks for Passive Income Investors to Buy in August": 0.5,
  "What To Expect in Markets This Week: The Latest Inflation Figures, Earnings and More": 0.0,
  "This AI Stock Just Crushed Palantir's Rule of 40 Score. Is It a Buy Now?": 0.2,
  "2 Surefire Stocks to Invest $1,000 in for the Long Haul": 0.5,
  "Stock-Split Watch: Is ASML Next?": 0.0,
  "Inflation in focus as Fed rate cut debate heats up: What to watch this week": 0.2,
  "CoreWeave, Circle, Cisco: Earnings to watch this week": 0.2,
  "From Theme Parks to Tron: This Company Wants to Be the MicroStrategy of TRX": 0.2,
  "Cadence Design Systems, Inc. (NASDAQ:CDNS) is a favorite amongst institutional investors who own 89%": 0.5,
  "Companies aiding Trump’s immigration crackdown see ‘extraordinary’ revenues": 0.5,
  "Cintas (NASDAQ:CTAS) Could Be A Buy For Its Upcoming Dividend": 0.5,
  "Honeywell International Inc. (NASDAQ:HON) Will Pay A US$1.13 Dividend In Four Days": 0.2,
  "Here's Why We Think Exelon (NASDAQ:EXC) Might Deserve Your Attention Today": 0.5,
  "A Look At The Intrinsic Value Of Old Dominion Freight Line, Inc. (NASDAQ:ODFL)": 0.2,
  "Stock market pullbacks will be 'short-lived': Wall Street sees AI, rate-cut optimism fueling rally": 0.8,
  "CDW's (NASDAQ:CDW) Dividend Will Be $0.625": 0.2,
  "Palantir’s 2,500% run has bulls scrambling to justify valuation": 0.2,
  "My 3 Favorite Stocks to Buy Right Now": 0.0,
  "Workday, Inc.'s (NASDAQ:WDAY) Intrinsic Value Is Potentially 47% Above Its Share Price": 0.8,
  "India plans tariff response to US over steel, aluminium levy - [https://www.hindustantimes.com/india-news/india-plans-tariff-response-to-us-over-steel-aluminium-levy-101754765466919.html](https://www.hindustantimes.com/india-news/india-plans-tariff-response-to-us-over-steel-aluminium-levy-101754765466919.html) India may slap tariff countermeasures on select American commodities, a retaliation to Washington’s move to impose a steep 50% duty in June on steel, aluminium and their derivatives from India, people aware of the matter have said. To be sure, the levies on steel and aluminium have played out as a parallel trade dispute at the World Trade Organization, but its timing would": -0.2,
  "Do you think Salesforce (CRM) stock will go up before earnings on Sept 3? - I’ve been watching CRM and wondering if it’s likely to run up ahead of the earnings report on September 3rd. Do you think the stock will gain momentum leading into earnings and hit beyond $270 or is it more likely to stay flat or drop? Any insights or thoughts on what to expect would be appreciated! Thanks!": 0.2,
  "When to Buy Back In Internationally - I'm one of the fools who thought they could time the market. I didn't get burned too bad, as I sold at an average of about 5800 in the S&P. But now I'm sitting on a lot of \"cash\" in my 401k that's only making like 4%. I like to think I've learned my lesson and will not be doing something like this again. I want to diversify": 0.2,
  "Owners connected to Monster Energy announce plans to expand Thrifty Ice Cream": 0.5,
  "How do you feel about GDRX? - I’ve been looking for a few stocks to invest a bit of money into and one of my undecided tickers is GDRX. GDRX is near an all time low right now at $3.47. GoodRX just got a new CEO, new VP from Amazon Pharmacy, new Board, etc, but earnings have been under analyst expectations (3% increase). Not great, not terrible. I’m not sure if they are at a": 0.2,
  "Everyone’s worried about the economy, but executives have been talking less about a recession": 0.2,
  "Bringing AI To Fashion: These Startups Are Changing How We Approach Personal Style— And Cutting Costs For Retailers": 0.8,
  "Exit GOOG/GOOGL or Hold Through Remedies Ruling? - It's my largest position by far and I'm a bit nervous about Department of Justice remedies announcement coming sometime this month. Thinking of selling 500 or 600 shares and waiting out the month of August until there's clarity around legal headwinds facing the company; then, if it dumps on some harsher than expected verdict (e.g. selling Chrome, forced sharing of search data treasure trove, etc.) get back": -0.6,
  "23 years old, starting my first paid internship, How to build a diversified portfolio with small amounts? - Hi everyone, I’m 23, living in France, and about to receive my first salary from a 6-month internship. My goal is to start investing as early as possible to build a diversified portfolio over the long term (7–8 years minimum, possibly longer). At first, my monthly budget for investing will be quite small (low hundreds of euros),": 0.6,
  "Thirsty for Passive Income? PepsiCo's Dividend Yield Continues to Deliver.": 0.6,
  "CENTENE (CNC) is a good long term opportunity at this level - Like every self-respecting Value investor, I've been looking for opportunities to divest from my tech-heavy portfolio. AI Stocks like NVDA, PLTR, MSFT, AMZN, TSLA have done great, but some of these valuations just don't make sense and I don't think now is a good time to buy into them anymore. That brings me to look for other opportunities. I don't think there's a": 0.6,
  "Here Are My Top \"Magnificent Seven\" Stocks to Buy Now": 0.8,
  "(Item 8.01) . Other Events Wisconsin Electric and Natural Gas Rate Request In March 2025, Northern States Power Company-Wisconsin (NSP-Wisconsin), a wholly owned subsidiary of Xcel Energy Inc., filed a request with the Public Service Commission of Wisconsin (PSCW) for a multi-year electric and natural gas rate increase. For the electric utility, NSP-Wisconsin requested a total electric revenue increase of $94 million (11.8%) in 2026 and an incremental $57 million (7.1%) in 2027, for a total of": -0.1,
  "(Item 8.01) Other Events. ATM Updates On August 11, 2025, MicroStrategy Incorporated d/b/a Strategy (“Strategy” or the “Company”) announced updates with respect to its at-the-market offering programs: ATM Program Summary During Period August 4, 2025 to August 10, 2025 As of August 10, 2025 Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) Common ATM - - - $17,042.7 $21 billion of class A common stock, $0.001": 0.1,
  "(Item 8.01) Other Events. On July 7, 2025, the Company filed with the Secretary of State of the State of Delaware a Certificate of Amendment (the “STRK Certificate of Amendment”) to the Certificate of Designations that established the terms of the Company’s 8.00% Series A Perpetual Strike Preferred Stock, $0.001 par value per share (the “STRK Stock”). As described in greater detail in the Company’s Current Report on Form 8-K filed with the Securities and Exchange Commission": 0.0,
  "Nextdoor - NXDR: The Next Local Platform Breakout & Why Reddit Buying it Makes Sense - Nextdoor is a hyperlocal social platform sitting at the intersection of community trust, local commerce, and utility. After years of underperformance, it’s in the middle of a *major product relaunch* that’s already driving better engagement and beating revenue estimates. With a market cap under $1B (\\~3× revenue), there are multiple untapped monetization levers, and real strategic appeal to larger": 0.8,
  "Trump Administration Considers Longtime Critic to Lead Bureau of Labor Statistics - The Trump administration is interviewing candidates to lead the Bureau of Labor Statistics including at least one longtime critic of the agency, according to a senior administration official. Administration officials are weighing candidates to take the top job after President Trump [fired the BLS commissioner](https://www.wsj.com/politics/policy/trump-orders-firing-of-bureau-of-labor-statistics-chief-d8eaa272) earlier this month following the release of a weak jobs report. One of the people being interviewed is": -0.5,
  "3 Growth Stocks to Invest $1,000 in Right Now": 0.5,
  "5 Dividend Stocks to Hold for the Next 5 Years": 0.5,
  "Inside The MBA Program Where Students Solve Real Problems For Fortune 500s — Before They Graduate": 0.6,
  "Oklo, CoreWeave, On Holding, Cisco, Deere, and More Stocks to Watch This Week": 0.5,
  "Trump Administration to Take 15% Cut of Nvidia and AMD Chip Sales to China - I feel 15% is going to be the threshold for any export but this seems unprecedented. If these chips are dangerous for China to own, why sell them at all? “It is unusual for companies to essentially pay for export licenses. The agreements follow criticism from national-security hawks who fear the chips and other technology will boost China’s AI ecosystem": -0.6,
  "E-commerce Software Q2 Earnings: Shopify (NASDAQ:SHOP) Simply the Best": 0.8,
  "Ross Stores (ROST): Buy, Sell, or Hold Post Q1 Earnings?": 0.2,
  "Intel CEO to visit White House after Trump called for his ouster over alleged China ties: report": -0.5,
  "AI Won’t Kill Software. It Will Simply Give It New Life.": 0.5,
  "2 High-Flying Stocks to Research Further and 1 We Turn Down": 0.2,
  "1 Large-Cap Stock on Our Buy List and 2 That Underwhelm": 0.2,
  "2 High-Flying Stocks to Own for Decades and 1 We Turn Down": 0.2,
  "1 Surging  Stock with Competitive Advantages and 2 We Avoid": 0.5,
  "2 Profitable Stocks to Consider Right Now and 1 Facing Challenges": 0.2,
  "1 Semiconductor Stock Worth Investigating and 2 We Question": 0.0,
  "1 Unprofitable Stock on Our Buy List and 2 Facing Headwinds": -0.5,
  "3 Large-Cap Stocks with Promising Prospects": 0.5,
  "3 Market-Beating Stocks to Target This Week": 0.5,
  "Why Shopify Stock Skyrocketed Last Week": 0.5,
  "Gilead Stock Is Closing In on an All-Time High. The Case for More Upside.": 0.8,
  "Airbnb added to the shame I felt after suffering years of domestic abuse": -0.8,
  "Inflation Data, China Tariff Deadline, Cisco Earnings: What to Watch This Week": 0.2,
  "How Mondelēz is modernizing Ritz as it turns to snacks to drive growth": 0.5,
  "O'Reilly Automotive's Historic Stock Split Was Spurred by a 65,000% Gain Since Its IPO. Is Its Biggest Rival About to Become Wall Street's Next Stock-Split Stock?": 0.5,
  "In India, Trump's tariffs spark calls to boycott American goods": -0.6,
  "AppLovin Shares Jump as Revenue Continues to Surge. Is It Too Late to Buy the Stock?": 0.5,
  "Company News for Aug 11, 2025": 0.0,
  "1 Popular AI Stock to Sell Before It Falls 17%, According to Wall Street Analysts (Hint: It's Not Nvidia)": -0.8,
  "Apreo raises $130M for pivotal trial of emphysema device": 0.5,
  "Microsoft, Alphabet, and Meta Platforms Just Delivered Great News for Nvidia Shareholders": 0.8,
  "Is This 7-Bagger Stock Poised for Explosive Growth Over the Next 5 Years?": 0.8,
  "Non-metastatic Prostate Cancer Market Analysis and Forecast, 2023-2035 | J&J, Astellas, Bristol-Myers Squibb, Pfizer, Merck, Bayer, Sanofi, Clovis, AstraZeneca, AbbVie, and Boehringer Lead Innovations": 0.5,
  "Stuttering Market Research Report 2025-2035 | AstraZeneca, via Alexion, Leads with Strensiq as the First Approved Enzyme Replacement Therapy": 0.5,
  "These 3 Artificial Intelligence (AI) Stocks Could Soar More Than 40% Over the Next 12 Months, According to Wall Street": 0.8,
  "Chronic Inflammatory Demyelinating Polyneuropathy Market Report 2025 | Distribution Channel, Route of Administration, and Region Analysis and Forecast to 2035": 0.0,
  "Salesforce, PayPal COFOs tout agentic AI potential: Trial Balance": 0.2,
  "Palantir or AMD: UBS Picks the Superior AI Stock to Buy After Earnings": 0.5,
  "US Equity Investors to Look for Impact of Inflation on Rate-Cut Outlook, Ukraine-Russia Truce This Week": 0.2,
  "The rise (and risks) of interim CEO roles": 0.1,
  "O'Reilly Automotive Second Quarter 2025 Earnings: In Line With Expectations": 0.0,
  "Monster Beverage achieves “record” quarterly net sales": 0.8,
  "India calls for boycott of American goods over Trump tariffs": -0.8,
  "Biogen and Stoke Therapeutics Announce First Patient Dosed in Phase 3 EMPEROR Study of Zorevunersen, a Potential Disease-Modifying Treatment for Dravet Syndrome": 0.5,
  "Stoke Therapeutics and Biogen Announce First Patient Dosed in Phase 3 EMPEROR Study of Zorevunersen, a Potential Disease-Modifying Treatment for Dravet Syndrome": 0.8,
  "Kymera Therapeutics Announces Second Quarter 2025 Financial Results and Provides a Business Update": 0.5,
  "Biohaven Reports Second Quarter 2025 Financial Results and Recent Business Developments": 0.0,
  "Unlocking the Future of Digital Marketing with Hyperformance: Templates, Ads, and Design Services": 0.5,
  "Option Volatility And Earnings Report For Aug 11 - 15": 0.0,
  "Palo Alto Networks, Inc.'s (NASDAQ:PANW) Fundamentals Look Pretty Strong: Could The Market Be Wrong About The Stock?": 0.6,
  "With 85% ownership of the shares, Adobe Inc. (NASDAQ:ADBE) is heavily dominated by institutional owners": -0.5,
  "Citi Strategists Raise S&P 500 Target on Resilient Earnings": 0.8,
  "Better Artificial Intelligence Stock: ASML vs. AMD": 0.5,
  "Shopify Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "Peace Talks, Pending Inflation Report Cap Wall Street Pre-Bell; Asia Up, Europe Muted": 0.2,
  "AAON (NASDAQ:AAON) Reports Sales Below Analyst Estimates In Q2 Earnings, Stock Drops 15.6%": -0.7,
  "TDS reports second quarter 2025 results": 0.0,
  "The Trade Desk Crashes 39% in a Day as Amazon Looms Large": -0.7,
  "Holtec’s Michigan nuclear plant set for restart": 0.5,
  "AI Chips Update - DEEPX Partners With Baidu To Propel AI Innovation": 0.8,
  "U.S. Cellular’s (NYSE:USM) Q2: Beats On Revenue": 0.5,
  "Take the Zacks Approach to Beat the Markets: Digi Power X, RF Industries & Starbucks in Focus": 0.5,
  "Alibaba Group (BABA) Plans to Wind Up its Members-Only Stores, Bloomberg Reports": -0.5,
  "What Gives Constellation Energy an Edge in Wholesale Energy Markets?": 0.5,
  "Microchip Technology (NASDAQ:MCHP) Is Paying Out A Dividend Of $0.455": 0.2,
  "Best platform to look up historical intra day performance of a stock? - If you would look at the chart for XYZ stock today at 4pm, that 1 day chart (but for a previous day) seems hard to find for say 3 Tuesdays ago. ChatGPT and Grok and a few others don't show it either, they talk about subscription services that provide this. For those with experience in this kind of thing, which paid platform": 0.1,
  "Up 23% to 132%, There's Still Time to Buy These 3 Stocks": 0.5,
  "Micron Updates Fourth Quarter Fiscal 2025 Guidance": 0.2,
  "GE HealthCare Technologies Inc.'s (NASDAQ:GEHC) Intrinsic Value Is Potentially 67% Above Its Share Price": 0.8,
  "Analog Devices, Inc. (NASDAQ:ADI) is largely controlled by institutional shareholders who own 89% of the company": 0.1,
  "Growth Stock Climbing Too Fast? Here's How To Tell If It Will Roll Over": -0.5,
  "Axon Enterprise (NASDAQ:AXON) delivers shareholders enviable 60% CAGR over 5 years, surging 13% in the last week alone": 0.8,
  "Datadog (DDOG) Releases Q2 2025 Results": 0.2,
  "The Trade Desk (TTD) Announces Financial Results for Q2 2025": 0.5,
  "PLTR: Palantir Becomes S&P 500's Priciest Stock as AI Mania Peaks": 0.5,
  "Diamondback Energy Q2 Earnings Beat Estimates, Revenues Rise Y/Y": 0.8,
  "Michael Saylor's Strategy Adds $18M of Bitcoin on Five-Year Anniversary of First Purchase": 0.8,
  "Micron raises forecasts as AI boosts memory chip demand": 0.6,
  "Q2's coming up, ACHR dip looks more like a chill moment than a breakdown - Alright, Archer’s about to drop Q2 results on Aug 11 most expect a loss around $0.25 per share on tiny revenue. Doesn’t scream breakout, but let’s not freak out just yet Btw, [Vanguard just scooped up 5.66% of the company](https://www.msn.com/en-us/money/topstocks/vanguard-takes-5-66-stake-in-archer-aviation-as-stock-swings-continue/ar-AA1JWfde) & [Virtu Financial went nuts boosted its position by 704%, worth about $2.56M](https://www.marketbeat.com/instant-alerts/filing-virtu-financial-llc-has-256-million-stake-in-archer-aviation-inc-nyseachr-2025-08-10/). That’s not small time support On the": 0.5,
  "Chipmakers, Intel and Lithium: 3 Things": 0.0,
  "Biogen, Stoke Therapeutics Dose First Patient in Phase 3 Trial of Zorevunersen for Dravet Syndrome": 0.5,
  "BitMine stock soars as ETH holdings reach $4.96 billion": 0.8,
  "If You Invested $1000 in Broadcom Inc. a Decade Ago, This is How Much It'd Be Worth Now": 0.5,
  "If You Invested $1000 in Shopify a Decade Ago, This is How Much It'd Be Worth Now": 0.5,
  "4 Stocks to Bet on as Nasdaq's Northbound Journey Continues": 0.5,
  "Latest News In Digital Payment - Digital Banks Reshape Landscape With Super Apps and Innovation": 0.8,
  "Crypto stocks gain as BTC nears all-time high": 0.8,
  "Micron stock rises after boosting guidance": 0.8,
  "Crypto Stocks Gain as Bitcoin Trades Near Its All-Time High": 0.8,
  "Find Oversold Stocks to Buy at a Discount With This Barchart Screener": 0.2,
  "Golden State Perks Await in Paradise: Hacienda del Mar Unveils Limited-Time California Resident Offer": 0.6,
  "What a Lagging Tech Bet Tells Us": 0.1,
  "Paramount buys UFC rights in $7.7 billion, 7-year deal - [https://www.cnbc.com/2025/08/11/paramount-buys-ufc-rights-skydance-merger.html?&qsearchterm=paramount](https://www.cnbc.com/2025/08/11/paramount-buys-ufc-rights-skydance-merger.html?&qsearchterm=paramount) Paramount has acquired the U.S. rights to UFC, beginning in 2026. The deal is for all annual UFC live events, which will then be exclusively streamed in the U.S. on Paramount+. The new Paramount deal removes pay-per-view, so all events are available for no extra charge on Paramount+.": 0.8,
  "Airbnb Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "Amplitude to Present at Upcoming Investor Conferences": 0.0,
  "RELEX Solutions Expands Partnership with DoorDash to Scale DashMart Operations": 0.5,
  "GoTo Foods® and DoorDash Take to the Skies with Wing's Drone Delivery Service": 0.5,
  "Workday Wellness Named a 2025 Top HR Product of the Year by HR Executive": 0.8,
  "Broadcom Unveils Event Highlights for VMware Explore 2025": 0.5,
  "EVERISE STRENGTHENS LEADERSHIP TEAM WITH CHIEF REVENUE OFFICER AND CHIEF FINANCIAL OFFICER APPOINTMENTS": 0.5,
  "Is Trending Stock Amgen Inc. (AMGN) a Buy Now?": 0.2,
  "Is Trending Stock Palantir Technologies Inc. (PLTR) a Buy Now?": 0.2,
  "Is Most-Watched Stock PDD Holdings Inc. Sponsored ADR (PDD) Worth Betting on Now?": 0.2,
  "AppLovin Corporation (APP) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Amgen Insiders Sell US$12m Of Stock, Possibly Signalling Caution": -0.5,
  "Trump family crypto business announces $1.5 billion treasury company for World Liberty token": 0.5,
  "3 Biotech Stocks Likely to Outpace Q2 Earnings Estimates": 0.5,
  "Meet the Monster Stock that Continues to Crush the Market": 0.8,
  "3 Top-Ranked Dividend Stocks: A Smarter Way to Boost Your Retirement Income": 0.5,
  "Insights Into Applied Materials (AMAT) Q3: Wall Street Projections for Key Metrics": 0.2,
  "Why KLA (KLAC) International Revenue Trends Deserve Your Attention": 0.5,
  "Investing in Microchip Tech (MCHP)? Don't Miss Assessing Its International Revenue Trends": 0.5,
  "International Markets and Atlassian (TEAM): A Deep Dive for Investors": 0.5,
  "Fortinet (FTNT) International Revenue Performance Explored": 0.2,
  "Unlocking Monster Beverage (MNST) International Revenues: Trends, Surprises, and Prospects": 0.5,
  "ON Semiconductor Corp. (ON) Reliance on International Sales: What Investors Need to Know": 0.2,
  "CRDO Rises 79% YTD: How Should Investors Approach the Stock?": 0.5,
  "BitMine's ETH Holdings Near $5B After Latest Purchase; BMNR Tops Big Names in Trading Volume": 0.8,
  "Intel stock rises as CEO prepares for White House meeting amid Trump criticism": 0.5,
  "PepsiCo (PEP) Crossed Above the 200-Day Moving Average: What That Means for Investors": 0.5,
  "Brokers Suggest Investing in AppLovin (APP): Read This Before Placing a Bet": 0.2,
  "Can Solid Automotive Revenues Propel QCOM Stock Amid Tariff Woes?": 0.1,
  "Arm initiated, Adobe downgraded: Wall Street's top analyst calls": -0.5,
  "Lithium stocks soar after world's largest EV battery maker shutters mine in China": 0.8,
  "Does PepsiCo Have the Edge in Functional Beverage Boom?": 0.5,
  "Lifeway Foods Expands Distribution to San Diego Region Costco Wholesale Warehouse Locations with Kefir Variety Packs": 0.5,
  "Is AppLovin (APP) Stock Outpacing Its Business Services Peers This Year?": 0.1,
  "ADP® Lyric HCM Wins Top HR Product of 2025 Award By HR Executive": 0.6,
  "r/Stocks Daily Discussion Monday - Aug 11, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.2,
  "Micron Jumps After Raising Revenue Forecast": 0.8,
  "Nvidia & AMD US–China deal, Intel CEO & Trump: What to know": 0.1,
  "Token Security and Descope Unite with Cybersecurity Leaders to Launch Security Guide for Agentic AI Adoption": 0.6,
  "Tariffs Cost U.S. Consumers Approximately $12.2B Each Month; Averaging $47 More Per Adult": -0.8,
  "The Rise of Wi-Fi as a Service Market: A $21.96 billion Industry Dominated by Tech Giants - AT&T (US), Verizon (US), and T-Mobile (US)| MarketsandMarkets™": 0.5,
  "Palo Alto Networks (PANW) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "Deep Learning Chipsets Market Surges to USD 25.5 Billion by 2033, Propelled by 18.4% CAGR - Verified Market Reports®": 0.8,
  "MicroStrategy Stock Rises Amid Crypto Rally. It Bought a Lot Less Bitcoin Than Usual.": 0.5,
  "Apple Inc (AAPL) Increases its Total Investment to $600 billion to Expand its Manufacturing in the United States": 0.8,
  "Morgan Stanley Raised the Firm’s PT on Broadcom Inc. (AVGO), Kept an Overweight Rating": 0.5,
  "CMB International Securities Raised the Firm’s PT on Meta Platforms (META)": 0.2,
  "PepsiCo hit with US lawsuit over alleged price discrimination": -0.7,
  "PANW Plunges 14% in 6 Months: Should You Hold or Fold the Stock?": -0.6,
  "Netflix (NFLX) Secures Broadcasting Rights for FIFA Women’s World Cup": 0.8,
  "Form 8.3 - Aqua Acquisition Sub LLC (subsidiary of Qualcomm Incorporated)": 0.0,
  "Datadog Q2 Earnings & Revenues Beat on Solid Customer Growth": 0.8,
  "[Latest] Global Email Encryption Market Size/Share Worth USD 31.1 Billion by 2034 at a 22.5% CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trends, Forecast, Segmentation, Growth Rate, Value, SWOT Analysis)": 0.5,
  "Micron Stock Rises After Chipmaker Raises Guidance": 0.8,
  "SK hynix Sees HBM Growing 30% Annually": 0.6,
  "Exclusive-Paxos joins spate of crypto companies applying for US trust bank licenses": 0.5,
  "Paxos joins spate of crypto companies applying for US trust bank licenses": 0.5,
  "Costco's July Sales Jump Signals Strong Finish to Fiscal 2025": 0.8,
  "Remington Hospitality appoints chief commercial officer": 0.0,
  "Nvidia & AMD investors can put China chip tariff risks 'to bed'": 0.6,
  "Apple: Navigating Tariffs while Services Drive Growth": 0.5,
  "NVIDIA RTX PRO Servers With Blackwell Coming to World’s Most Popular Enterprise Systems": 0.6,
  "Trinity and Costco Launch Scalable Off-Grid Power Solutions with Innovative Energy System": 0.6,
  "Vertex Minerals to commence high-grade ore production at Reward gold mine": 0.8,
  "Mag 7 stocks deliver earnings beats but results get mixed market response": 0.1,
  "The Zacks Analyst Blog Highlights JPMorgan Chase, Chevron, Shopify and Crawford United": 0.0,
  "Pinterest Faces Slowdown in Advertiser Spend in APAC Region, UBS Says": -0.5,
  "Figma’s CEO sent cold emails and bought coffee to convince former LinkedIn and Flipboard coworkers to use his product before its $68 billion success": 0.5,
  "Vitalik Buterin Is a Billionaire Again as Ethereum Flips Palantir": 0.5,
  "Melius Research warns that things ‘can get worse for SaaS players like Adobe’": -0.6,
  "C3.ai stock nosedives on preliminary earnings: Where the AI trade stands": -0.6,
  "IonQ Stock Surges on Quantum Breakthroughs: More Upside Ahead?": 0.8,
  "Enterprises Push Ahead with AI-Powered Job Replacement Despite Risks": -0.6,
  "PLTR: UBS Picks a Winner in the Palantir vs. AMD AI Showdown": 0.6,
  "Honeywell Rises 10% in a Year: How Should You Play the Stock?": 0.5,
  "Applied Materials Before Q3 Earnings: How to Play the Stock": 0.5,
  "S&P 500 Companies' Profit, Revenue Growth Accelerates, Oppenheimer Says": 0.6,
  "ChatGPT continues steady gains in search market, Wells Fargo says": 0.6,
  "Top Midday Stories: Nvidia, AMD to Pay US 15% of Revenue From Chip Sales to China; Paramount to Pay $7.7 Billion for UFC Media Rights": 0.2,
  "Meta Enhances Brand Rights Protection Dashboard With Improved UI and Features": 0.8,
  "Exelon (EXC) Could Be a Great Choice": 0.8,
  "Can Nebius Reach $1.1B ARR and $630M Revenue Amid AI Boom?": 0.5,
  "Fox and ESPN to Offer Streaming Services in $40-a-Month Bundle": 0.5,
  "Paxos Applies for National Bank Trust Charter, Joining Stablecoin Issuers Circle, Ripple": 0.5,
  "Laurel Secures Investment from Workday Ventures to Reshape How Professional Services use AI to Track, Manage, and Maximize Time": 0.6,
  "National Advertising Review Board Recommends T-Mobile Discontinue Certain Comparative Savings Claims for its Mobile Telephone Service": -0.5,
  "Electronic Arts blocks more than 300,000 attempts to cheat after launching Battlefield 6 beta": 0.6,
  "Double Your Savings in a Year With This Plan by Humphrey Yang": 0.5,
  "Goldman Sachs revamps Nvidia stock price target ahead of earnings": 0.5,
  "Chip Stocks Are Rising Today. There Are a Few Reasons Why.": 0.5,
  "Strategy stock rises on bitcoin, Micron outlook, AMC Q2 beat": 0.5,
  "Surging Earnings Estimates Signal Upside for DoorDash (DASH) Stock": 0.8,
  "iPhone 17, the ‘thinnest iPhone ever,’ and everything else we’re expecting out of Apple’s hardware event": 0.5,
  "EA SPORTS™ NHL® 26 Elevates Authenticity With NHL EDGE Partnership and ICE-Q 2.0 Integration": 0.5,
  "GitHub CEO to step down": -0.5,
  "Enterprise Merchandising, Now Native on Shopify": 0.5,
  "Trump's Nvidia, AMD China deal: National security risks persist": -0.5,
  "Meta Lands Record $29B AI Data Center Deal -- Private Credit's Biggest Bet Yet": 0.6,
  "Why software stocks face 'a lot' of volatility right now": -0.6,
  "Electronic Arts (EA) Stock Is Up, What You Need To Know": 0.5,
  "Why The Trade Desk (TTD) Stock Is Up Today": 0.5,
  "The Bancorp (TBBK) Stock Is Up, What You Need To Know": 0.5,
  "Why Monday.com (MNDY) Shares Are Plunging Today": -0.7,
  "Adobe Stock Gets a Downgrade. ‘AI Is Eating Software,’ Analyst Says.": -0.6,
  "Is Broadcom Inc. (AVGO) a Solid Growth Stock? 3 Reasons to Think \"Yes\"": 0.6,
  "Nvidia Will Give U.S. a Cut of Its AI Chip Sales to China. The Stock Gets a Bump.": 0.5,
  "Amazon's Starlink Competitor Tops 100 Satellites. What Project Kuiper Means For Amazon Stock.": 0.5,
  "Michael Saylor's Latest Bitcoin Buy Is Strategy's Smallest in Months": 0.1,
  "2 Stocks to Buy From the Challenging Semiconductor Industry": 0.5,
  "Why Micron Stock Popped Again Today": 0.5,
  "Momentum Alert: META and TSLA Shares About to Surge?": 0.6,
  "Broadcom Hits New High: Is AVGO Stock Still a Buy?": 0.5,
  "Made by Google 2025: How to watch Google debut the Pixel 10, Pixel Watch 4, and more": 0.5,
  "GitHub CEO Thomas Dohmke to step down, plans new startup": 0.2,
  "Apple and Cook Are Back in Trump’s Good Books: How Should You Play AAPL Stock Here?": 0.2,
  "GitHub CEO Dohmke to Depart Microsoft": -0.5,
  "New Fospha Research: Brands Only Measuring Web Miss What's Causing 42% Of Their Sales": -0.5,
  "Shopify's Higher FCF Margins Can Push SHOP Stock Higher": 0.6,
  "Trump Expands ‘Pay-for-Play’ in Trade Policy With Nvidia, AMD Deal": -0.8,
  "Ocean’s new app brings inbox triage, tasks, and invites to Gmail users": 0.5,
  "If You'd Invested $1,000 in Zoetis (ZTS) Stock 10 Years Ago, Here's How Much You'd Have Today": 0.5,
  "Arm Stock Is Rising. The Chip Designer Has Tripled Its Market, This Analyst Says.": 0.6,
  "How Stagflation Could Derail a Market Fueled by ‘Hopium’ and Send Stocks Down 15%": -0.7,
  "Affirm Stock Revisits This Place As 'Buy Now, Pay Later' Delights Shoppers": 0.6,
  "Trump's 'pay-to-play' deals blur line between govt. & free market": -0.7,
  "Peter Thiel Once Said Bitcoin Was 'Systematically Underestimated' For Years — Does This Still Hold True Today?": 0.5,
  "Comcast Names Nick Kask Vice President of Finance and Business Operations for Big South Region": 0.2,
  "Micron Stock Jumps as Nvidia-Driven DRAM Boom Lifts Q4 Forecast": 0.8,
  "Digital Silk Publishes Guide on Google Shopping Optimization to Support eCommerce Visibility": 0.5,
  "GoTo Foods is testing drone delivery services": 0.1,
  "Trump extends China tariff deadline by 90 days - President Donald Trump has signed an executive order that will prevent high U.S. tariffs on Chinese goods from snapping back into effect for another 90 days, a White House official told CNBC on Monday afternoon. The order was signed just hours before midnight, when the pause on Trump’s tariffs was set to expire. The delay was the expected outcome from the latest round of talks between": 0.2,
  "Jeff Bezos' space tech company makes surprising Bitcoin bet": 0.5,
  "Paramount Stock Falls on UFC Deal. There Could Be More Deals Coming.": -0.5,
  "Accumulating bitcoin a risky digital rush by companies?": -0.5,
  "OpenAI, Palantir, and Meta execs join fight for America’s tech edge": 0.5,
  "Trump signs order granting another 90-day extension on harshest China tariffs": 0.2,
  "A Key Crypto Insider Wants to Make This Penny Stock the Next MicroStrategy. Should You Buy Shares Here?": 0.5,
  "Musk’s Tesla Eyes UK Electricity Market Amid EV Sales Slump": 0.1,
  "American Companies Are Buying Their Own Stocks at a Record Pace": 0.5,
  "Why Palantir Technologies Stock Surged 16% to a New All-Time High in July": 0.6,
  "Nvidia, AMD Reach Deal to Give US a Cut of China AI Chip Sales": 0.2,
  "Commentary: Trump is reviving crony capitalism": -0.8,
  "Why Tesla (TSLA) Stock Is Up Today": 0.5,
  "Why IonQ (IONQ) Stock Is Up Today": 0.5,
  "Why Shutterstock (SSTK) Stock Is Falling Today": -0.5,
  "Data I/O Announces Appointment of Charles DiBona as Chief Financial Officer": 0.5,
  "Breakout Watch: Nvidia, Broadcom In Focus, But Don't Forget This Semiconductor Stock": 0.5,
  "Stock market today: Dow, S&P 500, Nasdaq slump with key inflation report on deck": -0.5,
  "Plug Power Second Quarter 2025 Highlights": 0.5,
  "FibroGen Reports Second Quarter 2025 Financial Results and Provides Business Update": 0.0,
  "Tesla Stock Clears Early Entry As Elon Musk Makes These Business Comments": 0.5,
  "PubMatic Announces Second Quarter 2025 Financial Results": 0.0,
  "Ford Is Reinventing EV Manufacturing to Take On Tesla, BYD. The Stock Is Down.": -0.5,
  "Tesla Stock Is Up Again. There’s a Key Momentum Level in Sight.": 0.5,
  "Micron Stock Rises After Memory-Chip Maker Ups Outlook": 0.8,
  "Microchip Technology to Present at the KeyBanc Technology Leadership Forum": 0.5,
  "Tesla Is Benefiting From End of Tax-Credit Sales Rush": 0.5,
  "Circle Internet Stock Is Going Gangbusters. Earnings Are Its Next Test.": 0.6,
  "AMC earnings, Strategy & bitcoin, C3.ai sinks: Trending Tickers": 0.2,
  "Bitcoin Nears Record. It Could Soon Join Your 401(k).": 0.8,
  "X Makes Grok 4 Free to All Users as it Looks to Boost Interest in its AI Offerings": 0.6,
  "iOS 26 beta 6 adds new ringtones, snappy app launches, and more": 0.6,
  "These Stocks Moved the Most Today: C3.ai, Coinbase, Monday.com, Avantor, Tegna, Nvidia, Albemarle, and More": 0.2,
  "Earnings live: BigBear.ai stock tumbles on large miss, Plug Power slides, AMC stock pops, Monday.com tanks": -0.5,
  "Why Is Tilray (TLRY) Stock Soaring Today": 0.5,
  "Stock Market Today: Dow, Nasdaq Fall, Set Aside Trump-China Tariff Move; Tesla Clears Entry But This AI Stock Craters": -0.2,
  "US Equity Indexes Decline Ahead of July CPI Inflation Print, Upcoming Ukraine-Russia Peace Talks": 0.1,
  "S&P 500 Gains & Losses Today: UFC Parent TKO Soars, Intel Stock Rises; Hershey Drops": 0.2,
  "Heard on the Street Recap: Generation ‘Buy the Dip’": 0.5,
  "Stocks Slip Despite China Tariff Extension": -0.5,
  "Galaxy Appoints Matt Friedrich as Chief Legal Officer": 0.5,
  "Auto & Transport Roundup: Market Talk": 0.0,
  "Intel Soars as CEO Heads to White House; Nvidia, AMD Rally on China AI Deal": 0.8,
  "Tech, Banks Lead Record U.S. Buyback Wave": 0.5,
  "Tesla Wins Texas Robotaxi License": 0.8,
  "Tesla Shifts From Dojo To AI6 Chips": 0.5,
  "Apple co-founder slams YouTube for Bitcoin scam with misleading image": -0.7,
  "McDonald’s Launches VR Experience in Meta’s Horizon Worlds": 0.2,
  "Health Care Roundup: Market Talk": 0.0,
  "Dow Jones Futures: Tesla Hits New Buy Point; CoreWeave Earnings, CPI Inflation Data Next": 0.5,
  "Stocks cautious before US inflation report": 0.0,
  "Trump holds high-stakes meeting with Intel CEO after calling for his resignation": -0.5,
  "Mondelēz 2024 Snacking Made Right Report: Climate Change": 0.0,
  "Adobe Stock Downgraded As 'AI Is Eating Software'": -0.5,
  "Trump flip-flops on Intel CEO, calls him ‘success’ days after demanding resignation - President Trump said Monday that he met with Intel CEO Lip-Bu Tan, days after the U.S. leader called on Tan to resign. Intel shares rose 2% in extended trading. In a post on Truth Social, Trump praised Tan and said Tan and members of the Cabinet would come up with suggestions. “I met with Mr. Lip-Bu Tan, of Intel, along with Secretary": 0.2,
  "Why Nvidia Stock Popped 13% in July": 0.5,
  "President Trump Meets Intel CEO: ‘A Very Interesting One’": 0.5,
  "Albemarle operating chief Netha Johnson to leave company": -0.5,
  "Jeff Bezos Once Said Great Leaders Need More Sleep, Not More Hours — Amazon Founder Then Explained His Point Using This Warren Buffett Rule": 0.5,
  "Trump Met With Intel CEO, Says Tan Will Bring ‘Suggestions’ Next Week": 0.2,
  "Trump says had ’interesting’ meeting with Intel CEO, will continue talks": 0.5,
  "UFC Parent TKO Punch Higher, Leads S&P 500; Intel Extends Gains Late On Trump Reversal": 0.5,
  "Stocks to Watch Recap: Nvidia, AMC, Coinbase": 0.0,
  "Intuit (INTU) Declines More Than Market: Some Information for Investors": -0.5,
  "PDD Holdings Inc. Sponsored ADR (PDD) Falls More Steeply Than Broader Market: What Investors Need to Know": -0.5,
  "Jeff Bezos' Blue Origin Now Accepts Bitcoin, Ethereum and Solana for Spaceflights": 0.5,
  "Why sports dominate the media industry & what's next in 2026": 0.2,
  "Why Arm Holdings Stock Popped Higher on Monday": 0.5,
  "Nimble Gravity Acquires Fog Solutions, further enabling client growth through data and AI": 0.6,
  "Is Figma the Next Hot Tech Stock to Own?": 0.6,
  "Copart, Inc. (CPRT) Advances While Market Declines: Some Information for Investors": 0.5,
  "Wall Street ends down, inflation data, China trade in focus": -0.5,
  "Trump Says Intel CEO Has ‘Amazing Story,’ Sets Cabinet Talks": 0.5,
  "Trump meets with Intel CEO after demanding he resign": -0.8,
  "Texas businessmen indicted for allegedly bribing officials at Mexico's Pemex": -0.8,
  "Apple Cinemas Addresses Trademark Dispute with Apple Inc.": 0.1,
  "Tomorrow CPI numbers will be BAD - So Trump just announced his new pick for BLS head, the day before CPI numbers are out. I think this is a sign from Trump. Trump has access to the BLS data releases a day before, so he knows what's gonna happen tomorrow. Trump is trying to quickly get the new BLS head into office so \"changes\" to the BLS can made quickly. I also think Trump will": -0.6,
  "Analysis-Trump's unusual Nvidia deal raises new corporate and national security risks, lawmakers and experts say": -0.6,
  "Do You Use AI Like ChatGPT for Investing? How? - Lately I’ve been seeing more people talk about using AI tools for investing, things like researching companies, understanding the market, or even getting quick summaries of news. I haven’t really tried it myself yet, and I’m wondering if I’m missing out. Do you actually use anything like ChatGPT for your investing? If so, how exactly, and has it been worth it for you? I am": 0.2,
  "Tesla shares jump as popular analyst revamps target": 0.8,
  "Berkshire Hathaway Director’s Firm Sold Almost 30% of Its Berkshire Stake": -0.5,
  "Cannabis stocks rally after Trump says he is weighing drug reclassification - ″We’re looking at reclassification,” Trump told reporters Monday during a press conference to announce the deployment of the National Guard to Washington, D.C. “We’ll make a determination ... over the next few weeks.” The biggest immediate win is this will remove 280e, where these companies will finally be on the same playing field as every other American company and can deduct business expenses,": 0.8,
  "Stock market today: Dow, S&P 500, Nasdaq futures hold steady as Wall Street braces for July inflation report": 0.5,
  "Is Cisco Systems Stock a Buy as its Q4 Results Approach?": 0.5,
  "Marine Sensors Market to Reach $1.9 Billion by 2028, Growing at 6.5% CAGR: Exploring the Depths of Growth": 0.8,
  "Prediction: This Unstoppable Stock Will Join Nvidia, Microsoft, and Apple in the $3 Trillion Club Before 2028": 0.8,
  "Agoda Unveils Top Visa-Free Asian and European Destinations for South Korean Travelers": 0.5,
  "Nvidia, AMD to pay U.S. government 15% of AI chip sales to China": -0.5,
  "Ex-US Trade Diplomat on China Tariff Truce, Negotiations": 0.5,
  "This Might Be the Most Controversial Tesla Take Yet": 0.1,
  "Gilead Receives Favorable CHMP Opinion For HIV Prevention With Twice-Yearly Lenacapavir": 0.8,
  "Amgen Announces Bemarituzumab’s Successful Phase 3 Results in FGFR2b+ Gastric Cancer": 0.8,
  "Regeneron Reveals The Regeneron Prize For Creative Innovation 2025 Winners": 0.5,
  "The Smartest Growth Stock to Buy With $160 Right Now": 0.5,
  "Revna Biosciences and AstraZeneca Increase Access to Lung Cancer Treatment in Ghana": 0.8,
  "The Biggest Mistake Investors Make When Buying Amazon Stock": -0.5,
  "China Trade Deal Deadline Extended to Nov. 9": 0.5,
  "Best Stock to Buy Right Now: Uber vs. DoorDash": 0.5,
  "CrowdStrike Sees 13% Stake Growth from PNC Financial": 0.5,
  "Lucid Is on a Roll, So Why Is It Down 30% in 2025?": -0.6,
  "Hoxton Planning Boosts Meta Holdings to Nearly $1.9M": 0.6,
  "Big Tech Pledged Billions for New Housing. The Results Aren’t Living Up to the Hype.": -0.6,
  "Nvidia to Pay the U.S. Government 15% of China AI Chip Sales. How Will Its Revenue and Profits Be Impacted?": -0.5,
  "With Billions at Risk, Nvidia CEO Buys His Way Out of the Trade Battle": 0.2,
  "Raymond James Raises PT on Alphabet Inc. (GOOGL); Maintains ‘Outperform’ Rating": 0.8,
  "Musk says xAI to take legal action against Apple over App Store rankings": -0.5,
  "Once battered AI stock surges 43% after earnings": 0.8,
  "Dr. Bronner's Boosts Marketplace Revenue by 55% with Pattern": 0.6,
  "Trump Bid for Cut of Chip Revenue Risks ‘Dangerous World’": -0.6,
  "Trump's trade war with China in 2025": -0.5,
  "Cisco (CSCO) Q2 Earnings Report Preview: What To Look For": 0.5,
  "Do you actually sell when your stock hits your target price? - I’ve always found it tricky to sell when a stock finally reaches the target price I set. A recent example for me was AMD. I bought it during a dip, and a few months later it was up over 35%. My initial target was around $150 based on my valuation work, and when it hit that level I still hesitated. I kept thinking": -0.5,
  "Trump praises Intel CEO days after calling for him to resign": 0.2,
  "Folks who \"VOO and chill\", what's your VOO average cost? - My portfolio is currently super concentrated in a few mega-cap tech stocks and a lot of cash. I want to diversify and embrace the \"VOO and chill\" strategy to get some exposure to the broader S&P 500. The only thing holding me back is that VOO is sitting at an all-time high, and it feels a bit daunting to start now. I know the": -0.2,
  "GOOGL is a value buy due to AI - Yes, this is your weekly Google post! Google, the company that made LLMs possible with the transformer revolutionary paper. The company that has been valued at 20 PE for many quarters now, even though its peers are at 30ish PE. LLMs have hit a plateau. Incremental model versions (GPT 5 for example) are not showing incremental gains. If anything, new versions are kind of acting funny": 0.2,
  "Singapore Witnesses the Future of Logistics Unfold at GoComet's Odyssey 2025": 0.8,
  "Google and IBM believe first workable quantum computer is in sight": 0.8,
  "TDK backs Ultraviolette with $21M to take India-made electric motorcycles global": 0.8,
  "Elon Musk threatens to sue Apple over app store ranking of his AI app": -0.6,
  "China Urges Firms Not to Use Nvidia H20 Chips in New Guidance": -0.5,
  "China urges local firms not to use Nvidia's H20 chips, Bloomberg News reports": -0.5,
  "China Urges Local Firms Not to Use Nvidia's H20 Chips": -0.5,
  "Life360’s New CEO Unfazed by Founder in the Boardroom": 0.2,
  "Costco’s High PE Ratio and its Growth Potential - Costco is one of the best retail businesses in the world with decades of consistent growth. The stock has been trading at a P/E of around 54 and I wanted to see if the fundamentals justify the current price. **Earnings growth requirements** If we assume a fair multiple of 27 (which is what I would pay for an exceptional business like Costco) then EPS would need": 0.5,
  "This Dividend Fund Owns Nvidia and Broadcom. It’s Crushing the Market.": 0.8,
  "ELI5 what a settlement is and how it differs from execution - I also would like to ask if anyone could give a rough estimate as to when I would be receiving my funds from selling shares. I started the process on Saturday and Monday I got a notification saying the order was executed, and that I would get another notification when the order has settled. It also informed me that since it's a stock": 0.0,
  "MU Micron is about to go up, don't miss out - After my post about buying rddt, alot of people thought rddt wouldn't pump at all, it has 2x+ since my first initial post about it. Here is my next stock play. On Aug 11, Monday, Micron released news that quarterly results would be raised, stock price only increased 4%. Last earnings MU peaked at about 130 dollars, they beat earnings and will most likely": 0.5,
  "Norway’s $1.9 Trillion Fund Has Best Quarter Since 2023": 0.8
}