{
  "(Item 2.02) Results of Operations and Financial Condition. On January 23, 2025, General Electric Company, operating as GE Aerospace (the \"Company\"), released its fourth-quarter and full-year 2024 financial results on its investor relations website at www.geaerospace.com/investor-relations. A copy of these is attached as Exhibit 99 and incorporated by reference herein. The information provided pursuant to this\n\n(Item 2.02) , including Exhibit 99, is being furnished and shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934 (the \"Exchange Act\") or otherwise subject to the liabilities under that Section and shall not be deemed to be incorporated by reference into any filing of the Company under the Securities Act of 1933 or the Exchange Act.": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition On January 29, 2025, Microsoft Corporation issued a press release announcing its financial results for the fiscal quarter ended December 31, 2024. A copy of the press release is furnished as Exhibit 99.1 to this report. In accordance with General Instruction B.2 of Form 8-K, the information in this Current Report on Form 8-K, including Exhibit 99.1, shall not be deemed to be “filed” for purposes of Section": 0.0,
  "(Item 1.01) . Entry into a Material Definitive Agreement 3": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. On January 30, 2025, Atlassian Corporation (the “ Company ”) issued a press release announcing its results for the quarter ended December 31, 2024 (the “ Press Release ”). A copy of the Press Release is attached as Exhibit 99.1 to this current report on Form 8-K and is incorporated by reference herein. The Company also published a letter to its shareholders announcing its financial results for the\n\n(Item 2.02) , including Exhibit 99.1 and Exhibit 99.2, is being furnished and shall not be deemed “filed” for the purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “ Exchange Act ”), or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference into any filing made by the Company under the Securities Act of 1933, as amended, or the Exchange Act, except as shall": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On February 3, 2025, RTX Corporation (“RTX” or the “Company”) announced that Gregory J. Hayes, RTX’s current Executive Chairman, has informed the Board of Directors of his intention to not stand for re-election and to step down as Executive Chairman and as a member of the Board, effective April 30, 2025. Mr. Hayes has agreed to": -0.5,
  "(Item 2.02) . Results of Operations and Financial Condition. The following information, including the exhibits hereto, is being furnished pursuant to this\n\n(Item 2.02) . Incorporated by reference is a press release issued by Merck & Co., Inc. on February 4, 2025, regarding earnings for the fourth quarter and year end of 2024, attached as Exhibit 99.1. Also incorporated by reference is certain supplemental information not included in the press release, attached as Exhibit 99.2. This information shall not be deemed to be “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition On February 4, 2025, The Estée Lauder Companies Inc. (the “Company”) issued a press release announcing its financial results for its fiscal quarter ended December 31, 2024. The release includes the Company’s estimates related to its fiscal 2025 third quarter net sales and diluted net earnings per common share. A copy of the press release is attached hereto as Exhibit 99.1 and is incorporated herein by reference.": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition. Fourth Quarter and Full Year 2024 Earnings Press Release and Reconciliation of Non-GAAP Financial Measures On February 4, 2025 , the Company issued a press release announcing its unaudited results of operations for the three months and year ended December 31, 2024, and its unaudited financial position as of December 31, 2024. The full text of the press release is furnished as Exhibit 99.1 hereto. In its press release\n\n(Item 2.02) of this Current Report is not incorporated by reference into any filings of the Company made under the Securities Act of 1933, as amended, whether made before or after the date of this Current Report, regardless of any general incorporation language in the filing unless specifically stated so therein.": 0.0,
  "(Item 8.01) . Other Events. On February 10, 2025, Eli Lilly and Company (the “Company”) entered into an underwriting agreement (the “Underwriting Agreement”) with Barclays Capital Inc., BofA Securities, Inc., Citigroup Global Markets Inc., Deutsche Bank Securities Inc. and Goldman Sachs & Co. LLC, as representatives of the several underwriters named therein, for the issuance and sale by the Company of $1,000,000,000 aggregate principal amount of its 4.550% Notes due 2028 (the “2028 Notes”), $1,250,000,000 aggregate principal": 0.1,
  "(Item 8.01) . Other Events. On February 18, 2025, Linde plc (the “Company”) issued €850 million aggregate principal amount of 2.625% Notes due 2029 (the “2029 Notes”), issued €750 million aggregate principal amount of 3.000% Notes due 2033 (the “2033 Notes”) and issued €650 million aggregate principal amount of 3.250% Notes due 2037 (the “2037 Notes”). The 2029 Notes, the 2033 Notes and the 2037 Notes were issued pursuant to a Subscription Agreement, dated February 14, 2025,": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers (b) On February 14 , 2025, Sandra Leung notified Bristol-Myers Squibb Company (the “Company”) of her intention to retire from her position as Executive Vice President, General Counsel in 2025. Ms. Leung is expected to remain with the Company for a transition period until her successor’s appointment in order to assist with the transition of her duties.": -0.2,
  "(ITEM 5.02) DEPARTURE OF DIRECTORS OR CERTAIN OFFICERS; ELECTION OF DIRECTORS; APPOINTMENT OF CERTAIN OFFICERS; COMPENSATORY ARRANGEMENTS OF CERTAIN OFFICERS Director Appointment On February 20, 2025, the Board of Directors (“Board”) of Danaher Corporation (“Danaher” or the “Company”) appointed Charles W. Lamanna to the Board, with a term expiring at Danaher’s 2025 annual meeting of shareholders. Mr. Lamanna was also appointed to the Science & Technology Committee of the Board. As a non-employee director, Mr. Lamanna will": 0.1,
  "(Item 8.01) Other Events. On February 27, 2025, Mastercard Incorporated (the “Company”) completed an offering of $300,000,000 aggregate principal amount of its Floating Rate Notes due 2028 (the “Floating Rate Notes”), $450,000,000 aggregate principal amount of its 4.550% Notes due 2028 (the “2028 Notes”) and $500,000,000 aggregate principal amount of its 4.950% Notes due 2032 (the “2032 Notes” and, together with the Floating Rate Notes and the 2028 Notes, the “Notes”). The offering of the Notes was": 0.1,
  "(ITEM 1.01) ENTRY INTO A MATERIAL DEFINITIVE AGREEMENT On February 25, 2025, Stryker Corporation, and certain of its subsidiaries as designated borrowers, entered into a revolving credit agreement with various lenders and issuing banks and Wells Fargo Bank, National Association, as administrative agent (the “Credit Agreement”), that replaces its previous revolving credit agreement, dated as of October 26, 2021 (the “2021 Credit Agreement”). The principal terms of the Credit Agreement are: (1) an aggregate principal amount of\n\n(Item 1.01) above with respect to the Credit Agreement is hereby incorporated by reference into this": 0.1,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders Deere & Company (the “Company”) held its annual meeting of shareholders on February 26, 2025 (the “Annual Meeting”). The voting results for each matter submitted to a vote of shareholders at the Annual Meeting are as follows: 1. Election of Directors All director nominees were elected for terms expiring at the 2026 annual meeting of shareholders with the following votes: Shares Voted For Shares Voted Against": 0.1,
  "(Item 2.02) Results of Operati ons and Financial Condition On March 10, 2025, Oracle Corporation (“Oracle”) issued a press release announcing financial results for its fiscal third quarter ended February 28, 2025. A copy of this press release is furnished as Exhibit 99.1 to this report. Section 8—Other Events\n\n(Item 8.01) O ther Events Oracle announced that its Board of Directors has declared a cash dividend of $0.50 per share of outstanding common stock payable on April 23, 2025, to stockholders of record as of the close of business on April 10, 2025. Section 9—Financial Statements and Exhibits": 0.5,
  "(Item 8.01) .\n\n(Item 8.01) . Other Events On March 10, 2025, CSX Corporation (the “Company”) completed a public offering of $600,000,000 aggregate principal amount of the Company’s 5.050% Notes due 2035 (the “Notes”). The Notes were issued pursuant to an indenture, dated as of August 1, 1990, between the Company and The Bank of New York Mellon Trust Company, N.A. (formerly known as The Bank of New York Trust Company, N.A.), successor to JPMorgan Chase Bank, N.A. (formerly known": 0.1,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. The Annual Meeting of Shareholders of Applied Materials, Inc. (the “Company”) was held on March 6, 2025 (the “Annual Meeting”). At the Annual Meeting, the Company’s shareholders cast their votes on three proposals, as set forth below. Proposal 1. Election of Directors. Name of Nominee For Against Abstain Broker Non-Votes Rani Borkar 584,684,759 10,552,537 850,131 93,148,031 Judy Bruner 555,787,128 39,475,637 824,662 93,148,031 Xun (Eric) Chen 582,947,061": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (b) On March 10, 2025, the Board of Directors (the “Board”) of McDonald’s Corporation (the “Company”) approved changes to the Company’s senior management, including the appointment of Gillian (Jill) McDonald as Executive Vice President – Global Chief Restaurant Experience Officer. Ms. McDonald, one of the Company’s named executive officers, currently serves as Executive Vice President –": 0.0,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On March 12, 2025, Gilead Sciences, Inc., a Delaware corporation (the “Company”), announced that Sandra Patterson, the Company’s Senior Vice President, Corporate Controller and Chief Accounting Officer and the Company’s principal accounting officer, has decided to leave the Company. The Company’s Board of Directors has appointed Diane E. Wilfong as the Company’s interim Corporate Controller and Chief": -0.2,
  "(Item 2.02) . Results of Operations and Financial Condition. On March 12, 2025, Adobe Inc. (“Adobe”) issued a press release announcing financial results for its first quarter fiscal year 2025 ended February 28, 2025. A copy of this press release is furnished and attached hereto as Exhibit 99.1 and is incorporated herein by reference. The information in this report and the exhibit attached hereto are being furnished and shall not be deemed filed for purposes of the": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Transition of Principal Accounting Officer On March 12, 2025, Jennifer M. Kirk, the Global Controller and Principal Accounting Officer of Medtronic plc (Company), notified the Company of her decision to resign from the Company, effective May 2, 2025, to become the chief executive officer of Exubrion Therapeutics, a privately held company. Ms. Kirk’s resignation did not": -0.5,
  "(Item 8.01) . Other Events. Between January and March 2025, Chevron Corporation (“Chevron” or the “company”) purchased 15,380,000 shares of Hess Corporation (“Hess”) common stock at prevailing market prices in open market transactions. The number of shares purchased represents approximately 4.99% of the shares of Hess common stock outstanding as of January 31, 2025, as reported by Hess in its Annual Report on Form 10-K for the year ended December 31, 2024. These purchases, which were made": 0.0,
  "(ITEM 5.02) DEPARTURE OF DIRECTORS OR PRINCIPAL OFFICERS; ELECTION OF DIRECTORS; APPOINTMENT OF CERTAIN OFFICERS; COMPENSATORY ARRANGEMENTS OF CERTAIN OFFICERS. On March 20, 2025, Allan B. Hubbard, a member of the Board of Directors (the “Board”) of Simon Property Group, Inc. (the “Company”), notified the Company that, effective May 14, 2025, he is retiring from the Board and will not stand for re-election at the Company’s upcoming 2025 annual meeting of shareholders to be held on May": -0.5,
  "(Item 2.02) Results of Operations and Financial Condition On March 20, 2025, Accenture plc (“Accenture”) issued a news release announcing financial results for its second quarter of fiscal 2025, which ended on February 28, 2025. A copy of the news release is attached hereto as Exhibit 99. All information in the news release is furnished but not filed. Non-GAAP Financial Information In the attached news release Accenture discloses the following non-GAAP financial measures: • Free cash flow": 0.0,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. (a-b) The final results of voting on each of the matters submitted to a vote of security holders during the Registrant’s annual meeting of shareholders on March 20, 2025 are as follows. 1. Election of Directors: For Against Abstentions Broker Non-Votes Mary T. Barra 1,173,554,159 46,902,767 2,166,807 250,362,675 Amy L. Chang 1,207,387,859 12,228,417 3,007,457 250,362,675 D. Jeremy Darroch 1,210,906,336 9,191,055 2,526,342 250,362,675 Carolyn N. Everson 1,209,731,318": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Appointment of Brian O. Newman as Executive Vice President and Chief Financial Officer On April 7, 2025, the Board of Directors of CVS Health Corporation (the “Company” or “CVS Health”) appointed Brian O. Newman to serve as Executive Vice President and Chief Financial Officer of CVS Health, effective May 12, 2025 (the “Effective Date”). Mr. Newman": 0.2,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On April 7, 2025, Fulvio Conti informed Aon plc (the “Company”) of his decision to retire from the Company’s Board of Directors after more than 15 years, effective upon the completion of his current term at the Company’s 2025 Annual General Meeting. Mr. Conti informed the Company that his retirement is not due to any disagreements with": -0.2,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On April 11, 2025, the Board of Directors (the \"Board\") of Meta Platforms, Inc. (the \"Company\") approved an increase in the size of the Board to fifteen (15) members and elected Dina Powell McCormick and Patrick Collison as members of the Board, effective April 15, 2025. A copy of the press release announcing the election is attached": 0.2,
  "(Item 2.02) . Results of Operations and Financial Condition On April 11, 2025, BlackRock, Inc. (the “Company”) reported results of operations for the three months ended March 31, 2025. A copy of the earnings release issued by the Company is attached as Exhibit 99.1 to this Form 8-K.": 0.0,
  "(Item 8.01) Other Events. On April 14, 2025, Applied Materials, Inc. issued a press release announcing that it has purchased 9% of the outstanding shares of the common stock of BE Semiconductor Industries N.V., a Dutch public limited liability company. The purchase was made through market-based transactions. A copy of the press release is attached as Exhibit 99.1 to this Current Report on Form 8-K.": 0.0,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers . On April 9, 2025, Enrique Salem notified Atlassian Corporation (the “ Company ”) of his decision to retire as a director of the Company, effective as of April 14, 2025. The Board of Directors of the Company (the “ Board ”) and the Company are deeply grateful for Mr. Salem’s dedication and contributions to the": 0.5,
  "(Item 2.02) Results of operations and financial condition On April 15, 2025, Johnson & Johnson issued the attached press release (Exhibit 99.1) announcing its sales and earnings for the first quarter ended March 30, 2025.\n\n(Item 8.01) Other Events On April 15, 2025, Johnson & Johnson issued the attached press release (Exhibit 99.3) announcing that its Board of Directors declared a 4.8% increase in the quarterly dividend, from $1.24 per share to $1.30 per share, marking the 63rd year of consecutive increases. At the new rate, the indicated dividend on an annual basis is $5.20 per share compared to the previous rate of $4.96 per share. The next quarterly dividend is payable": 0.8,
  "(Item 8.01) Other Events. On April 9, 2025, the U.S. government, or USG, informed NVIDIA Corporation, or the Company, that the USG requires a license for export to China (including Hong Kong and Macau) and D:5 countries, or to companies headquartered or with an ultimate parent therein, of the Company’s H20 integrated circuits and any other circuits achieving the H20’s memory bandwidth, interconnect bandwidth, or combination thereof. The USG indicated that the license requirement addresses the risk": -0.2,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. As U.S. Bancorp (the “Company”) previously disclosed on a Current Report on Form 8-K filed on January 28, 2025, Gunjan Kedia was appointed as the Company’s President and Chief Executive Officer, effective April 15, 2025. At its meeting on April 15, 2025, the Company’s Board of Directors determined the base salary and target annual cash incentive award\n\n(Item 5.02) .": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition On April 16, 2025, Abbott Laboratories announced its results of operations for the first quarter 2025. Furnished as Exhibit 99.1, and incorporated herein by reference, is the news release issued by Abbott announcing those results. In that news release, Abbott uses various non-GAAP financial measures including, among others, net earnings excluding specified items. These non-GAAP financial measures adjust for factors that are unusual or unpredictable, such as expenses primarily\n\n(Item 2.02) ). 104 Cover Page Interactive Data File (the cover page XBRL tags are embedded in the Inline XBRL document).": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition On April 16, 2025, CSX Corporation issued a press release and its CSX Quarterly Financial Report on financial and operating results for the quarter ended March 31, 2025. A copy of the press release is attached as Exhibit 99.1 and a copy of the CSX Quarterly Financial Report is attached as Exhibit 99.2, each of which is incorporated by reference herein. These documents are available on the Company's": 0.0,
  "(Item 8.01) . Other Events The Board of Directors declared a quarterly cash dividend on the Company's common stock and approved a quarterly increase from $1.16 to $1.30 per share, $5.20 on an annualized basis. The dividend was declared on April 16, 2025, and is payable May 16, 2025, to shareholders of record at the close of business on May 2, 2025.": 0.8,
  "(Item 2.02) Results of Operations and Financial Condition. On April 17, 2025, Netflix, Inc. (the “Company”) announced its financial results for the quarter ended March 31, 2025. The Letter to Shareholders, which is attached hereto as Exhibit 99.1 and is incorporated herein by reference, includes reference to the non-GAAP financial information. A reconciliation to the GAAP equivalent of non-GAAP measures is contained in tabular form in Exhibit 99.1. We are not able to reconcile forward-looking non-GAAP financial\n\n(Item 2.02) and the accompanying Exhibit 99.1 are “furnished” and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that section, and shall not be incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act regardless of any general incorporation language in such filing, unless expressly incorporated by specific\n\n(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On April 11, 2025, Reed Hastings informed the Company of his intent to transition from his executive officer position. Effective April 17, 2025, Reed Hastings will transition to serve as Chairman of the board of directors of the Company (the “Board”) and non-executive director. On April 11, 2025, Timothy Haley informed the Company of his decision to": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On April 17, 2025, Lockheed Martin Corporation (“Lockheed Martin” or the “Company”) announced that Jay Malave, its Chief Financial Officer, advised the Company of his intention to pursue other opportunities outside of the Company. Mr. Malave’s departure is not related to any financial or accounting issue or any disagreement with the Company on any matter relating to": -0.2,
  "(Item 2.02) Results of Operations and Financial Condition On April 17, 2025, The Charles Schwab Corporation issued a press release announcing its financial results for the quarter ended March 31, 2025. A copy of the press release is furnished as Exhibit 99.1 to this report.": 0.0,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. U.S. Bancorp (the “Company”) held its 2025 annual meeting of shareholders on Tuesday, April 15, 2025. Shareholders considered four proposals at the meeting, each of which is described in more detail in the Company’s Definitive Proxy Statement on Schedule 14A, which was filed with the Securities and Exchange Commission on March 5, 2025, as supplemented by a proxy statement supplement filed with the Securities and Exchange": 0.1,
  "(ITEM 5.07) . Submission of Matters to a Vote of Security Holders. At the annual meeting of stockholders held on April 17, 2025, the stockholders elected the Board of Directors of Texas Instruments Incorporated and voted upon the proposals contained within the company’s proxy statement dated March 5, 2025. The Board nominees were elected with the following vote: Nominee For Against Abstentions Broker Non-Votes Mark Blinn 721,514,575 22,997,791 874,915 65,641,693 Todd Bluedorn 702,584,071 41,836,102 967,108 65,641,693 Janet": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition On April 22, 2025, Chubb Limited issued a Press Release reporting its first quarter 2025 results and the availability of its first quarter 2025 Financial Supplement. The Press Release and the Financial Supplement are attached hereto as Exhibit 99.1 and Exhibit 99.2, respectively, and are hereby incorporated herein by reference. The information furnished pursuant to this\n\n(Item 2.02) , including Exhibit 99.1 and Exhibit 99.2, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934 (the “Exchange Act”) or otherwise subject to the liabilities under that Section and shall not be deemed to be incorporated by reference into any filing of the Company under the Securities Act of 1933 or the Exchange Act.": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition On April 22, 2025, 3M Company issued a press release reporting first-quarter 2025 financial results (attached hereunder as Exhibit 99.1 and incorporated herein by reference).\n\n(Item 2.02) hereof) . 104 Cover Page Interactive Data File (the cover page XBRL tags are embedded in the Inline XBRL document).": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. On April 22, 2025, Intuitive Surgical, Inc. (“Intuitive”) issued a press release announcing its financial results for the quarter ended March 31, 2025. A copy of the press release is furnished hereto as Exhibit 99.1. The information in this Current Report on Form 8-K, including Exhibit 99.1, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On April 22, 2025, RTX Corporation (the “ Company ”) issued a press release announcing its first quarter 2025 results. The press release issued April 22, 2025 is furnished herewith as Exhibit No. 99 to this Report, and shall not be deemed filed for the purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “ Exchange Act ”), or otherwise subject to the": 0.0,
  "(Item 2.02) - Results of Operations and Financial Condition. On April 22, 2025, Elevance Health, Inc. issued a press release reporting its financial results for the quarter ended March 31, 2025. A copy of the press release is furnished as Exhibit 99.1 to this report and incorporated herein by reference. None of the information furnished in\n\n(Item 2.02) or Exhibit 99.1 hereto shall be deemed to be “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended. Unless expressly set forth by specific reference in such filings, none of the information furnished in this report shall be incorporated by reference in any filing under the Securities Act of 1933, as amended, whether made before or after the date hereof and regardless of any general incorporation language in such": 0.1,
  "(ITEM 2.02) RESULTS OF OPERATIONS AND FINANCIAL CONDITION On April 22, 2025, Danaher Corporation (“Danaher”) issued a press release announcing financial results for the quarter ended March 28, 2025. A copy of the release is furnished herewith as Exhibit 99.1 and incorporated by reference herein. This Current Report on Form 8-K and the press release attached hereto are being furnished by Danaher pursuant to\n\n(Item 2.02) of Form 8-K. This information shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such a filing.": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On April 22, 2025, General Electric Company, operating as GE Aerospace (the \"Company\"), released its first-quarter 2025 financial results on its investor relations website at www.geaerospace.com/investor-relations. A copy of these is attached as Exhibit 99 and incorporated by reference herein. The information provided pursuant to this\n\n(Item 2.02) , including Exhibit 99, is being furnished and shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934 (the \"Exchange Act\") or otherwise subject to the liabilities under that Section and shall not be deemed to be incorporated by reference into any filing of the Company under the Securities Act of 1933 or the Exchange Act.": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On April 22, 2025 , Lockheed Martin Corporation issued a news release reporting its financial results for the quarter ended March 30, 2025. A copy of the news release is furnished as Exhibit 99.1 to this Current Report on Form 8-K. Exhibit 99.1 shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, nor shall it be deemed incorporated by reference in": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition. On April 23, 2025, the Registrant announced its financial results for the fiscal quarter ended March 29, 2025. The full text of the press release issued in connection with the announcement is furnished as Exhibit 99.1 to this Form 8-K and incorporated herein by reference. The information contained in this report and exhibits hereto shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition 3": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. The information set forth under “\n\n(Item 2.02) . Results Of Operations and Financial Condition,” including the Exhibit attached hereto, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933, except as shall be expressly set forth by specific reference in such filing. Attached and incorporated herein by reference as Exhibit 99.1 is a copy of a press release": 0.0,
  "(ITEM 2.02) . Results of Operations and Financial Condition The Registrant’s news release dated April 23, 2025, regarding its first-quarter results of operations and financial condition is attached hereto as Exhibit 99. The attached news release includes references to the following financial measures that were not prepared in accordance with generally accepted accounting principles in the United States (non-GAAP measures): free cash flow and ratios based on free cash flow. The company believes these non-GAAP measures provide\n\n(Item 2.02) ) 104 Cover Page Interactive Data File (embedded within the Inline XBRL document)": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On April 23, 2025, ServiceNow, Inc. (“ServiceNow” or the “Company”) issued a press release announcing financial results for the three months ended March 31, 2025. A copy of the press release is furnished as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated by reference herein. The information above, including Exhibit 99.1, is furnished pursuant to\n\n(Item 2.02) of Form 8-K and is not deemed to be “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to liabilities of that section, nor shall it be deemed incorporated by reference in any filing of ServiceNow under the Securities Act of 1933, as amended (the “Securities Act”), or the Exchange Act, whether made before or after the date hereof and irrespective of any\n\n(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On April 21, 2025, Paul Smith notified the Company of his decision to resign from his position as the Company’s President, Global Customer and Field Operations, effective April 23, 2025. Mr. Smith will continue to serve in an advisory role until no later than September 30, 2025, to ensure a seamless transition and go-to-market continuity. He is": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (e) On April 22, 2025, Bank of America Corporation (the “Corporation”) held its 2025 Annual Meeting of Shareholders (the “Annual Meeting”). At the Annual Meeting, the Corporation’s shareholders approved the amendment and restatement of the Bank of America Corporation Equity Plan (“Plan”) to (i) increase the number of shares available for grant by 100 million; (ii)\n\n(Item 5.02) (e) by reference, does not purport to be complete, and is qualified in its entirety by reference to the full text of the amended and restated Plan attached as Exhibit 10.1 to this report and incorporated into this\n\n(Item 5.02) (e) by reference.\n\n(Item 5.07) . Submission of Matters to a Vote of Security Holders. (a) On April 22, 2025, the Corporation held its Annual Meeting. (b) The Corporation’s shareholders: elected all of the nominees for director; approved the advisory vote on executive compensation; ratified the appointment of PricewaterhouseCoopers LLP as the Corporation’s independent registered public accounting firm for 2025; and approved the amendment and restatement of the Plan. The Corporation’s shareholders did not approve the shareholder proposals listed below.": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (e) At the Annual Meeting of Shareholders of The Goldman Sachs Group, Inc. held on April 23, 2025 (the “Annual Meeting”), our shareholders approved The Goldman Sachs Amended and Restated Stock Incentive Plan (2025) (the “2025 SIP”). The 2025 SIP replaces the Amended and Restated Stock Incentive Plan previously in effect and applies to awards granted on\n\n(Item 5.07) Submission of Matters to a Vote of Security Holders. (a) The Annual Meeting was held on April 23, 2025. (b) The results of the matters submitted to a shareholder vote at the Annual Meeting were as follows: 1. Election of Directors: Our shareholders elected the following 14 directors to each serve a one-year term expiring on the date of our 2026 annual meeting of shareholders or until his or her successor has been duly chosen": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On April 24, 2025, Bristol-Myers Squibb Company (the “Company”) issued a press release (the “Earnings Press Release”) announcing its financial results for the first quarter of 2025. A copy of the Earnings Press Release is furnished pursuant to this\n\n(Item 2.02) as Exhibit 99.1 to this Current Report on Form 8-K and incorporated by reference herein in its entirety.": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition. On April 24, 2025 , Gilead Sciences, Inc., a Delaware corporation (“Gilead”), issued a press release announcing its financial results for the quarter ended March 31, 2025. A copy of the press release is filed as Exhibit 99.1 to this report. Gilead has presented certain financial information in accordance with U.S. generally accepted accounting principles (“GAAP”) and also on a non-GAAP basis. Management believes this non-GAAP information is useful\n\n(Item 2.02) and": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On April 24, 2025, Union Pacific Corporation issued a press release announcing its financial results for the quarter ended March 31, 2025. A copy of the press release is furnished herewith as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated herein by reference.": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition. On April 24, 2025, Intel Corporation (“Intel” or the \"Company\") issued a press release announcing the financial results of its first quarter ended March 29, 2025 and forward-looking statements relating to its second quarter of 2025. A copy of this press release is attached hereto as Exhibit 99.1 and is incorporated by reference herein. The attached press release includes non-GAAP financial measures relating to our operations and forecasted outlook.\n\n(Item 2.02) of this Report and the press release attached hereto as Exhibit 99.1 are furnished and shall not be treated as filed for purposes of the Securities Exchange Act of 1934, as amended.": 0.1,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders. The Boeing Company held its Annual Meeting of Shareholders on April 24, 2025. Set forth below are the final voting results for each of the proposals submitted to a vote of the shareholders. 1. Election of Directors NAME FOR AGAINST ABSTAIN BROKER NON-VOTES Robert A. Bradway 472,629,384 36,524,197 3,616,003 112,727,182 Mortimer J. \"Tim\" Buckley 496,758,694 12,457,903 3,552,987 112,727,182 Lynne M. Doughtie 490,279,395 18,768,190 3,721,999 112,727,182": 0.5,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (e) Amendment and Restatement of 2019 Equity Incentive Plan On April 22, 2025, at the 2025 Annual Meeting of Stockholders (the “ Annual Meeting ”) of Adobe Inc. (the \" Company \"), the Company’s stockholders approved the Adobe Inc. 2019 Equity Incentive Plan, as amended (the “ 2019 Plan ”), to increase the available share reserve by\n\n(Item 5.07) . Submission of Matters to a Vote of Security Holders. At the Annual Meeting, held on April 22, 2025, the Company’s stockholders approved proposals one through four and did not approve proposal five listed below. The final results for the votes regarding each proposal are set forth in the following tables. Each of these proposals is described in detail in the Company’s Proxy Statement. 2 1. Elect eleven members of the Board, each to serve": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition . The following information, including the exhibits hereto, is being furnished pursuant to this\n\n(Item 2.02) . Incorporated by reference is a press release issued by Merck & Co., Inc. on April 24, 2025, regarding earnings for the first quarter of 2025, attached as Exhibit 99.1. Also incorporated by reference is certain supplemental information not included in the press release, attached as Exhibit 99.2. This information shall not be deemed to be “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. The information in this\n\n(Item 2.02) , including Exhibit 99.1 attached hereto, is being furnished and shall not be deemed “filed” for the purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that Section and shall not be incorporated by reference into any registration statement or other document pursuant to the Securities Act of 1933, as amended, or the Exchange Act, except as otherwise expressly stated in\n\n(Item 2.02) is a copy of the press release issued by PepsiCo, Inc. (“PepsiCo”), dated April 24, 2025, reporting PepsiCo’s financial results for the 12 weeks ended March 22, 2025. As previously disclosed in our Annual Report on Form 10-K for the fiscal year ended December 28, 2024, effective beginning with our first quarter of 2025, we realigned certain of our reportable segments to conform with changes to our organizational structure and how our Chief Executive Officer": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On April 25, 2025, Aon plc issued a press release (the “Press Release”) announcing its results of operations for the quarter ended March 31, 2025. A copy of the Press Release is attached hereto as Exhibit 99.1 and is incorporated herein by reference.": 0.0,
  "(Item 1.01) Entry into a Material Definitive Agreement. Senior Credit Facility Effective as of April 23, 2025, CME Group Inc. (“CME Group”) entered into a new multi-currency revolving credit facility (the “Senior Credit Facility”) with certain lenders, agents, arrangers, bookrunners and Bank of America, N.A., as Administrative Agent. The Senior Credit Facility is for a line of credit of $2.25 billion with the option to increase the facility from time to time from $2.25 billion to $3.25\n\n(Item 1.01) above is hereby incorporated by reference under this": 0.2,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On April 23, 2025, in connection with the planned reorganization of certain operating functions under E William Parsley, III that will be transitioned to other core lines of business and the finance function of The PNC Financial Services Group, Inc. (the “Corporation”), Mr. Parsley will cease to serve as Chief Operating Officer of the Corporation effective July\n\n(Item 5.07) Submission of Matters to a Vote of Security Holders. An annual meeting of shareholders of the Corporation was held on April 23, 2025 for the purpose of considering and acting upon the following matters: (1) The election of the 13 director nominees named in the Corporation’s proxy statement to serve until the next annual meeting and until their successors are elected and qualified; (2) The ratification of the Audit Committee’s selection of PricewaterhouseCoopers LLP as": 0.1,
  "Stocks to watch this week: Apple, Microsoft, Shell, HSBC, Lloyds and AstraZeneca": 0.0,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders (a) The Pfizer Inc. (the \"Company\") Annual Meeting of Shareholders was held on April 24, 2025. (b) Shareholders voted on the matters set forth below. 1. The nominees for election to the Company’s Board of Directors set forth in Item 1 to the Company’s Proxy Statement filed with the U.S. Securities and Exchange Commission on March 13, 2025 were elected to hold office until the Company’s": 0.0,
  "(Item 8.01) . Other Events. Walmart Inc., a Delaware corporation (the “ Company ”), and BofA Securities, Inc., Goldman Sachs & Co. LLC, Wells Fargo Securities, LLC, Barclays Capital Inc., BNP Paribas Securities Corp. and Mizuho Securities USA LLC, acting for themselves and as representatives of the other several underwriters named in Schedule I to the Pricing Agreement (as defined below) (collectively, the “ Underwriters ”), have entered into a Pricing Agreement, dated April 23, 2025 (the": 0.1,
  "(Item 5.07) — Submission of Matters to a Vote of Security Holders. Abbott held its Annual Meeting of Shareholders on April 25, 2025. The following is a summary of the matters voted on at that meeting. (1) The shareholders elected Abbott’s entire Board of Directors. The persons elected to Abbott’s Board of Directors and the number of shares cast for, the number against, the number abstaining, and the number of broker non-votes, with respect to each of": 0.1,
  "(Item 1.01) . Entry into a Material Definitive Agreement. On April 29, 2025, Micron Technology, Inc. (\"Micron,\" \"we,\" \"us,\" or \"our\") settled its offering of (i) $500,000,000 aggregate principal amount of 5.65% senior notes due 2032 (the \"2032 Notes\"), and (ii) $1,250,000,000 aggregate principal amount of 6.05% senior notes due 2035 (the \"2035 Notes\" and, together with the 2032 Notes, the \"Notes\"). The Notes were issued and sold in a public offering pursuant to a registration statement\n\n(Item 1.01) of this Current Report is incorporated herein by reference.\n\n(Item 8.01) . Other Events. Wilson Sonsini Goodrich & Rosati, Professional Corporation, counsel to Micron, has issued an opinion to Micron dated April 29, 2025 regarding the legality of the Notes. A copy of the opinion is filed as Exhibit 5.1 hereto. On April 24, 2025, we issued a notice to redeem in full our outstanding 4.185% Senior Notes due 2027 (the \"2027 Notes\"). The redemption of the 2027 Notes will be effected pursuant to the terms": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On April 29, 2025 , we issued a press release announcing earnings for the first quarter ended March 31, 2025. A copy of the press release is furnished as Exhibit 99.1 to this current report. This information, including Exhibit 99.1, will not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities": 0.0,
  "(Item 8.01) . Other Events. On Tuesday, April 29, 2025, IBM announced that its board of directors approved an increase in the regular quarterly cash dividend to $1.68 per common share. The dividend is payable on June 10, 2025 to stockholders of record on May 9, 2025. This is the 30th year in a row that IBM has increased its quarterly cash dividend. IBM has paid consecutive quarterly dividends since 1916.": 0.8,
  "(ITEM 8.01) . Other Events. On April 29, 2025, the Corporation sold 3,000,000 Depositary Shares (the “Depositary Shares”), each representing a 1/25 th interest in a share of the Series OO Preferred Stock. The terms of the offering of the Depositary Shares are described in the Corporation’s Prospectus dated March 28, 2024, constituting a part of the Registration Statement on Form S-3 (Registration No. 333-277673), as supplemented by a Prospectus Supplement dated April 24, 2025. Additional exhibits": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On April 29, 2025, Booking Holdings Inc. announced its financial results for the first quarter ended March 31, 2025. The press release is attached as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated herein by reference. Copies of Booking Holdings' consolidated balance sheet at March 31, 2025, consolidated statement of operations for the three months ended March 31, 2025, and consolidated statement of cash\n\n(Item 2.02) , including Exhibit 99.1, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such a filing.": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On April 29, 2025, Altria Group, Inc. issued a press release announcing its financial results for the quarter ended March 31, 2025. A copy of the press release is attached as Exhibit 99.1 and incorporated by reference in this\n\n(Item 2.02) . In accordance with General Instruction B.2 of Form 8-K, the information in\n\n(Item 2.02) of this Current Report on Form 8-K, including Exhibit 99.1, shall not be deemed “filed” for the purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of that section. The information in\n\n(Item 2.02) of this Current Report on Form 8-K shall not be incorporated by reference into any filing or other document pursuant to the Securities Act of 1933, as amended, except as shall be expressly set forth by specific reference in such filing or document.\n\n(Item 2.02) ) 104 The cover page from this Current Report on Form 8-K, formatted in Inline XBRL (included as Exhibit 101) 2": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. Attached as Exhibit 99.1 is a copy of a press release of The Coca-Cola Company (“company”), dated April 29, 2025 , reporting the Company’s financial results for the first quarter 2025. The information in this\n\n(Item 2.02) , including the Exhibit 99.1 attached hereto, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended, except as shall be expressly set forth by specific reference in such filing.": 0.1,
  "(Item 2.02) and 7.01. Results of Operations and Financial Condition and Regulation FD Disclosure On April 29, 2025, S&P Global Inc. (the “Registrant”) issued an earnings release containing a discussion of the Registrant’s results of operations and financial condition for the first quarter ended March 31, 2025, as well as certain guidance for 2025. On April 29, 2025, the Registrant also issued a press release announcing its intent to separate its Mobility segment into a standalone public\n\n(Item 2.02) and": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition On April 29, 2025, Pfizer Inc. (“Pfizer”) issued a press release announcing its financial results for the first quarter of 2025. A copy of the press release is furnished herewith as Exhibit 99 and is incorporated by reference herein. The information furnished pursuant to this “\n\n(Item 2.02) - Results of Operations and Financial Condition”, including Exhibit 99, shall not be deemed to be “filed” for the purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”) or otherwise subject to the liabilities of that section, and shall not be deemed to be incorporated by reference into any filing made by us under the Exchange Act or Securities Act of 1933, as amended, regardless of any general": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. D. Adamczyk notified the Company that he intends to retire from the Company’s Board of Directors in connection with an announcement on April 23 rd that he will join Goldman Sachs as a Partner. The retirement will be effective May 31, 2025. His retirement is for personal reasons and not as a result of any disagreement with\n\n(Item 5.07) Submission of Matters to a Vote of Security Holders. (a) T he 2025 Annual Meeting of Shareholders of the Company was held on April 24, 2025. (b) At the 2025 Annual Meeting of Shareholders, the shareholders: • elected all 11 Director nominees named in the 2025 Proxy Statement to the Company ’ s Board of Directors; • approved, on an advisory basis, the executive compensation philosophy, policies and procedures described in the “Compensation Discussion and": -0.2,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On April 28, 2025, Christopher Schell, Executive Vice President, Chief Commercial Officer, and General Manager of Sales, Marketing and Communications, notified Intel of his decision to resign, effective as of June 30, 2025, in order to pursue another career opportunity.": -0.5,
  "(Item 2.02) . Results of Operations and Financial Condition. On April 30, 2025, Caterpillar Inc. issued a press release reporting its financial results for the quarter ended March 31, 2025. A copy of the press release is attached hereto as Exhibit 99.1 and incorporated into this\n\n(Item 2.02) by reference.": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition. On April 30, 2025, Meta Platforms, Inc. (\"Meta\") issued a press release and will hold a conference call regarding its financial results for the quarter ended March 31, 2025. A copy of the press release is furnished as Exhibit 99.1 to this report. The information furnished with this\n\n(Item 2.02) , including Exhibit 99.1, shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference into any other filing under the Securities Act of 1933, as amended, or the Exchange Act, except as expressly set forth by specific reference in such a filing. Meta is making reference": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition On April 30, 2025, Microsoft Corporation issued a press release announcing its financial results for the fiscal quarter ended March 31, 2025. A copy of the press release is furnished as Exhibit 99.1 to this report. In accordance with General Instruction B.2 of Form 8-K, the information in this Current Report on Form 8-K, including Exhibit 99.1, shall not be deemed to be “filed” for purposes of Section": 0.0,
  "(ITEM 2.02) — RESULTS OF OPERATIONS AND FINANCIAL CONDITION On April 30, 2025, Crown Castle Inc. (\"Company\") issued a press release disclosing its financial results for the first quarter ended March 31, 2025. A copy of the press release is furnished herewith as Exhibit 99.1.\n\n(Item 2.02) above refers to certain supplemental information that was posted as a supplemental information package on the Company's website on April 30, 2025. The supplemental information package is furnished herewith as Exhibit 99.2.": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On 1 May 2025, Air Products and Chemicals, Inc. issued a press release announcing its earnings for the second quarter of fiscal year 2025. The press release is furnished as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated by reference herein. The information in\n\n(Item 2.02) of this Current Report on Form 8-K and Exhibit 99.1 attached hereto shall not be deemed to be “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise be subject to liability under that section, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended, except as expressly set forth therein.": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On May 1, 2025 , CVS Health Corporation issued a press release announcing results for the three months ended March 31, 2025. A copy of that press release is furnished herewith as Exhibit 99.1 and hereby incorporated in this\n\n(Item 2.02) by reference. The information in this Current Report on Form 8-K, including Exhibit 99.1, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934 (as amended, the “Exchange Act”) or otherwise subject to the liabilities of that Section, and shall not be or be deemed to be incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, regardless of any\n\n(Item 2.02) ) 104 Cover Page Interactive Data File - the cover page XBRL tags are embedded within the Inline XBRL document.": 0.1,
  "(ITEM 2.02) RESULTS OF OPERATIONS AND FINANCIAL CONDITION Stryker Corporation issued a press release on May 1, 2025 announcing its first quarter 2025 operating results. A copy of this press release is attached hereto as Exhibit 99.1. The information furnished in this report, including Exhibit 99.1, shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), or incorporated by reference in any filing under the": 0.0,
  "(ITEM 2.02) Results of Operations and Financial Condition On May 1, 2025, Linde plc issued a press release setting forth Linde plc’s results of operations for the quarter ended March 31, 2025. A copy of Linde plc’s press release is furnished herewith as Exhibit 99.1 and is hereby incorporated by reference in this\n\n(Item 2.02) .\n\n(Item 2.02) hereof: Exhibit No. Description 99.1 Press Release dated May 1, 2025 104 Cover Page Interactive Data File (embedded within the Inline XBRL document) 2": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition On May 1, 2025, The Estée Lauder Companies Inc. (the “Company”) issued a press release announcing its financial results for its fiscal quarter ended March 31, 2025. The release includes the Company’s estimates related to its fiscal 2025 full year net sales and diluted net earnings (loss) per common share. A copy of the press release is attached hereto as Exhibit 99.1 and is incorporated herein by reference.": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. On May 1, 2025, Atlassian Corporation (the “ Company ”) issued a press release announcing its results for the quarter ended March 31, 2025 (the “ Press Release ”). A copy of the Press Release is attached as Exhibit 99.1 to this current report on Form 8-K and is incorporated by reference herein. The Company also published a letter to its shareholders announcing its financial results for the\n\n(Item 2.02) , including Exhibit 99.1 and Exhibit 99.2, is being furnished and shall not be deemed “filed” for the purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “ Exchange Act ”), or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference into any filing made by the Company under the Securities Act of 1933, as amended, or the Exchange Act, except as shall": 0.1,
  "(ITEM 2.02) . RESULTS OF OPERATIONS AND FINANCIAL CONDITION. 3": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. The information in this\n\n(Item 2.02) , including Exhibit 99.1 attached hereto, is being furnished and shall not be deemed “filed” for the purposes of Section 18 of the Securities Exchange Act of 1934 (the “Exchange Act”), or otherwise subject to the liabilities of that Section and shall not be incorporated by reference into any registration statement or other document filed pursuant to the Securities Act of 1933 or the Exchange Act, except as otherwise expressly stated in such filing. Attached\n\n(Item 2.02) is a copy of the press release, dated May 1, 2025, announcing the financial results of Eli Lilly and Company for the quarter ended March 31, 2025.": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition. First Quarter 2025 Earnings Press Release and Reconciliation of Non-GAAP Financial Measures On May 1, 2025 , the Company issued a press release announcing its unaudited results of operations for the three months ended March 31, 2025, and its unaudited financial position as of March 31, 2025. The full text of the press release is furnished as Exhibit 99.1 hereto. In its press release the Company included certain non-U.S.\n\n(Item 2.02) of this Current Report is not incorporated by reference into any filings of the Company made under the Securities Act of 1933, as amended, whether made before or after the date of this Current Report, regardless of any general incorporation language in the filing unless specifically stated so therein.": 0.1,
  "(Item 8.01) . Other Events. Alphabet Inc. U.S. Dollar-Denominated Bond Offering On May 1, 2025, Alphabet Inc. (“Alphabet”) closed its underwritten public offering of $750,000,000 aggregate principal amount of 4.000% notes due 2030 (the “2030 Notes”), $1,250,000,000 aggregate principal amount of 4.500% notes due 2035 (the “2035 Notes”), $1,500,000,000 aggregate principal amount of 5.250% notes due 2055 (the “2055 Notes”) and $1,500,000,000 aggregate principal amount of 5.300% notes due 2065 (the “2065 Notes” and collectively, the “Notes”)": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers On April 25, 2025, Hubert L. Allen, Executive Vice President, General Counsel and Secretary, informed Abbott Laboratories that he plans to retire from the company after a period of transition.": -0.5,
  "(Item 2.02) Results of Operations and Financial Condition. On May 1, 2025, Apple Inc. (“Apple”) issued a press release regarding Apple’s financial results for its second fiscal quarter ended March 29, 2025. A copy of Apple’s press release is attached hereto as Exhibit 99.1. The information contained in this Current Report shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or incorporated by reference": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. On May 1, 2025, McDonald’s Corporation issued an investor release reporting its results for the first quarter ended March 31, 2025. A copy of the investor release is being filed as Exhibit 99.1 to this Form 8-K and is incorporated by reference in its entirety. Also filed herewith and incorporated by reference as Exhibit 99.2 is supplemental information for the first quarter ended March 31, 2025. The information\n\n(Item 2.02) , including such Exhibits, shall be deemed to be “filed” for purposes of the Securities Exchange Act of 1934, as amended.": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition On May 1, 2025, Mastercard Incorporated issued an earnings release announcing financial results for its first quarter 2025. A copy of the earnings release is attached hereto as Exhibit 99.1. All information in the earnings release is furnished but not filed.": 0.0,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders. (a) International Business Machines Corporation (IBM) held its Annual Meeting of Stockholders on April 29, 2025. Below are the final voting results. For more information on the following proposals, see IBM’s proxy statement dated March 10, 2025, the relevant portions of which are incorporated herein by reference. (b) Election of Directors for a Term of One Year: DIRECTOR FOR AGAINST ABSTAIN BROKER NON-VOTES M.C. Brown": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition\n\n(Item 2.02) and": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition. On May 2, 2025, The Cigna Group issued a press release announcing results for the three months ended March 31, 2025. The press release is furnished as Exhibit 99.1 to this Current Report on Form 8-K and incorporated herein by reference. This information shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or incorporated by reference": 0.0,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders. (a) The 2025 Annual Meeting of Shareowners of The Coca-Cola Company (the “Company”) was held on Wednesday, April 30, 2025. The results of the matters submitted to a vote of the shareowners at the meeting are set forth below. Pursuant to Delaware law and the Company’s By-Laws, abstentions and broker non-votes are not considered votes cast and do not affect the outcome of the votes.": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition On May 2, 2025 , Chevron Corporation (the “Company”) issued a news release announcing unaudited first quarter 2025 earnings of $3.5 billion. The news release is attached hereto as Exhibit 99.1 and incorporated herein by reference. The information included herein and in Exhibit 99.1 shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, nor shall it be deemed incorporated by reference": 0.1,
  "(Item 8.01) Other Events. On April 28, 2025, Colgate-Palmolive Company (the “Company”) executed an underwriting agreement (the “Underwriting Agreement”) with Citigroup Global Markets Inc. and Scotia Capital (USA) Inc., as representatives of the several underwriters named therein (the “Underwriters”) with regard to the issuance and sale by the Company of $500,000,000 aggregate principal amount of its 4.200% Senior Notes due 2030 (the “Notes”). The Underwriting Agreement includes customary representations, warranties and covenants by the Company. It also": 0.1,
  "Linde PLC (LIN) Q1 2025 Earnings Call Highlights: Strong Margins and Dividend Growth Amidst ...": 0.8,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. The Company held its 2025 Annual Meeting of Shareowners on May 1, 2025. As of March 4, 2025, the record date for the meeting, 1,335,089,924 shares of Company common stock were issued and outstanding. A quorum of 1,185,960,406 shares of common stock was present or represented at the meeting. Set forth below are the final voting results for each of the matters submitted to a vote": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. On May 5, 2025, we issued a press release in which we reported our consolidated financial results for the three months ended March 31, 2025. A copy of that press release is attached to this Current Report on Form 8-K as Exhibit 99.1 and is incorporated herein by reference. The information set forth in Exhibit 99.1 shall not be deemed to be “filed” for purposes of Section 18": 0.0,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Approval of the Amendment and Restatement of the Amended and Restated 2010 Incentive Award Plan The Board of Directors (the “Board”) of Intuitive Surgical, Inc. (the “Company”) previously adopted, subject to stockholder approval, the amendment and restatement of the Company’s Amended and Restated 2010 Incentive Award Plan (the “Amended 2010 Plan”), which (i) increases the number\n\n(Item 5.07) . Submission of Matters to a Vote of Security Holders. At the Annual Meeting, the stockholders of Intuitive Surgical, Inc. (the “Company”) voted on the following six proposals, each of which is described in detail in the Proxy Statement filed with the Securities and Exchange Commission on March 14, 2025. Proposal No. 1 : To elect eleven members to the Board to serve until the 2026 Annual Meeting of Stockholders: Nominee For Against Abstain Broker": 0.1,
  "(Item 8.01) . Other Events. Alphabet Inc. Euro-Denominated Bond Offering On May 6, 2025, Alphabet Inc. (“Alphabet”) closed its underwritten public offering of €1,500,000,000 aggregate principal amount of 2.500% notes due 2029 (the “2029 Notes”), €1,500,000,000 aggregate principal amount of 3.000% notes due 2033 (the “2033 Notes”), €1,250,000,000 aggregate principal amount of 3.375% notes due 2037 (the “2037 Notes”), €1,250,000,000 aggregate principal amount of 3.875% notes due 2045 (the “2045 Notes”) and €1,250,000,000 aggregate principal amount of": 0.1,
  "(Item 8.01) Other Events. Also on May 6, 2025, the Company terminated its remaining revolving credit facility agreements and simultaneously entered into two new revolving credit facility agreements that provide for commitments to borrow an aggregate of $7.0 billion. The new revolving credit facility agreements allow for borrowings for general corporate purposes, including to backstop the Company’s $7.0 billion commercial paper program. 2": 0.5,
  "(Item 8.01) . Other Events. On May 1, 2025, we announced and priced an offering (the “Notes Offering”) of senior notes due 2028 (the “2028 Notes”), senior notes due 2030 (the “2030 Notes”) and senior notes due 2035 (the “2035 Notes” and, together with the 2028 Notes and the 2030 Notes, the “Notes”). In connection with the Notes Offering, on May 1, 2025, we entered into a Terms Agreement in respect of the Notes (the “Terms Agreement”)": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition On May 6, 2025, Zoetis Inc. (the Company) issued a press release reporting its financial results for the first quarter of 2025 and its guidance for full year 2025. A copy of the Company’s press release is furnished as Exhibit 99.1 to this Current Report on Form 8-K. The information in this\n\n(Item 2.02) and the attached Exhibit 99.1 is being furnished to the Securities and Exchange Commission and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the Exchange Act), or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference into any filing of the Company under the Securities Act of 1933, as amended, or the Exchange Act, except as expressly": 0.1,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. (a) The Annual Meeting of the Company was held on May 6, 2025. (b) Shareholders voted on the matters set forth below. Item 1. The shareholders elected each of the Company’s 11 nominees to serve as directors of the Company until the 2026 Annual Meeting based upon the following votes: For Against Abstain Broker Non-Vote Peter J. Arduini 1,514,455,481 24,103,012 2,929,909 241,575,246 Deepak L. Bhatt, M.D.,": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On May 7, 2025, the Registrant issued a press release relating to its results for the quarter ended March 29, 2025. A copy of the press release is furnished herewith as Exhibit 99.1. Use of Website to Distribute Material Company Information The Registrant’s Investor Relations website is www.disney.com/investors. We use our Investor Relations website as a means of disclosing material non-public information and for the purpose of complying with": 0.1,
  "(ITEM 5.07) SUBMISSION OF MATTERS TO A VOTE OF SECURITY HOLDERS The annual meeting of shareholders of Danaher Corporation (the “Company”) was held on May 6, 2025. At the annual meeting, the Company’s shareholders voted on the following proposals: 1. To elect the thirteen directors named in the Company’s proxy statement to terms expiring in 2026. Each nominee for director was elected by a vote of the shareholders as follows: For Against Abstain Broker Non-Votes Rainer M.": 0.0,
  "(Item 8.01) Other Events On May 8, 2025, Comcast Corporation (“Comcast”) consummated the issuance and sale of $650,000,000 aggregate principal amount of its 4.950% Notes due 2032 (the “2032 Notes”), $850,000,000 aggregate principal amount of its 5.300% Notes due 2035 (the “2035 Notes”) and $1,000,000,000 aggregate principal amount of its 6.050% Notes due 2055 (the “2055 Notes” and, together with the 2032 Notes and the 2035 Notes, the “Notes”), pursuant to an underwriting agreement dated May 5,": -0.1,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders. The Eli Lilly and Company (the “Company”) annual meeting of shareholders (the “2025 Annual Meeting”) was held on May 5, 2025. The total number of shares of the Company's common stock voted in person or by proxy at the 2025 Annual Meeting was 846,655,979, representing approximately 89% of the 947,989,151 shares that were outstanding and entitled to vote as of February 26, 2025, the record": 0.0,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. The 2025 annual meeting of stockholders (the “Annual Meeting”) of Gilead Sciences, Inc. (the “Company”) was held on May 7, 2025 . Of the 1,246,634,469 shares of the Company’s common stock entitled to vote at the Annual Meeting, 1,121,336,290 shares were represented at the beginning of the meeting in person or by proxy, which constituted a quorum. The voting results are presented below. The Company’s stockholders": 0.0,
  "(Item 1.01) Entry into a Material Definitive Agreement. On May 5, 2025, Automatic Data Processing, Inc. (the “Company”) executed an Underwriting Agreement (attached hereto as Exhibit 1.1 and incorporated herein by reference) with BofA Securities, Inc., J.P. Morgan Securities LLC and Morgan Stanley & Co. LLC, as representatives of the underwriters listed in Schedule 1 thereto (collectively, the “Underwriters”), pursuant to which the Company agreed to issue and sell to the Underwriters $1,000,000,000 aggregate principal amount of\n\n(Item 8.01) Other Events. A copy of the opinion of Davis Polk & Wardwell LLP, counsel to the Company, relating to the legality of the Notes, is filed as Exhibit 5.1 to this Current Report.": 0.1,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders. CME Group Inc. (the “Company”) held its 2025 Annual Meeting of Shareholders on May 8, 2025 (the “Annual Meeting”). At the close of business on March 10, 2025, the record date of the Annual Meeting, the Company had 360,382,710 shares of Class A and Class B common stock issued and outstanding. The following shares were present at the Annual Meeting, either in person or by": 0.0,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. Lockheed Martin Corporation (the “Company”) held its Annual Meeting of Stockholders on May 9, 2025. Of the 234,573,049 shares outstanding and entitled to vote (as of the February 28, 2025 record date), 202,834,756 shares were represented at the meeting, or an 86.47% quorum. The final results of voting for each matter submitted to a vote of stockholders at the meeting are as follows: Proposal 1 -": 0.1,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. At the annual meeting of stockholders (the \"Annual Meeting\") of Intel Corporation (the \"Company\") held on May 6, 2025, a total of 3,328,455,208 shares of the Company's common stock were present or represented by proxy, representing 76.3% of the 4,360,591,639 shares outstanding as of the close of business on March 10, 2025, the record date for the determination of stockholders entitled to vote at the Annual": 0.1,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders. PepsiCo, Inc. (“PepsiCo”) held its 2025 Annual Meeting of Shareholders on May 7, 2025. For more information on the following proposals, see PepsiCo’s proxy statement for the 2025 Annual Meeting of Shareholders, filed with the Securities and Exchange Commission on March 28, 2025. Below are the final voting results. (1) The following 15 persons were elected to serve as directors of PepsiCo: Nominee For Against": 0.1,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. (a) General Electric Company, operating as GE Aerospace (the \"Company\"), held its annual shareholders meeting on May 6, 2025 (the \"Annual Meeting\"). (b) At the Annual Meeting, shareholders elected all of the Company's nominees for director; approved the advisory vote on the Company's named executives' compensation (\"Say on Pay\"); and ratified the appointment of Deloitte & Touche LLP as the Company's independent auditor for 2025 (\"Auditor": 0.2,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. Union Pacific Corporation (the Company) held its Annual Meeting of Shareholders on May 8, 2025, conducted through a live audio webinar only (the Meeting). Of the 599,318,180 shares outstanding and entitled to vote at the Meeting, 528,745,245 shares were present at the Meeting in person or by proxy, constituting a quorum of approximately 88%. The shareholders of the Company’s common stock (the Shareholders) considered and voted": 0.0,
  "(Item 1.01) Entry into a Material Definitive Agreement. Senior Notes On May 9, 2025, Booking Holdings Inc. (the “ Company ”) executed three Officers’ Certificates (the “ Officers’ Certificates ”), in accordance with Sections 2.02 and 10.04 of the Indenture dated August 8, 2017 (the “ Base Indenture ” and, together with the Officers’ Certificates, the “ Indenture ”) between the Company and U.S. Bank Trust Company, National Association (as successor in interest to U.S. Bank National\n\n(Item 1.01) of this Current Report on Form 8-K is incorporated by reference.\n\n(Item 8.01) Other Events . Senior Notes Offering On May 6, 2025, the Company entered into an underwriting agreement (the “ Underwriting Agreement ”) with Banco Santander, S.A., BNP PARIBAS, Deutsche Bank AG, London Branch, Goldman Sachs & Co. LLC, and Merrill Lynch International, as representatives of the several underwriters named in Schedule II thereto (the “ Underwriters ”), pursuant to which the Company agreed to issue and sell to the Underwriters €1,750,000,000 aggregate principal amount of": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers Transition of Elizabeth F. Whited from President On May 9, 2025, Union Pacific Corporation (the “Company”) announced that its President, Elizabeth F. Whited, will transition from President to Strategic Advisor, effective July 1, 2025 (the “Transition Date”). Pursuant to the Transition Agreement, Ms. Whited will remain a non-officer executive of the Company to advise on matters relating": 0.1,
  "(Item 8.01) Other Events. On May 12, 2025, Apple Inc. (“Apple”) consummated the issuance and sale of $1,500,000,000 aggregate principal amount of its 4.000% Notes due 2028 (the “2028 Notes”), $1,000,000,000 aggregate principal amount of its 4.200% Notes due 2030 (the “2030 Notes”), $1,000,000,000 aggregate principal amount of its 4.500% Notes due 2032 (the “2032 Notes”) and $1,000,000,000 aggregate principal amount of its 4.750% Notes due 2035 (the “2035 Notes” and, together with the 2028 Notes, the": 0.1,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders a. The Company held its Annual Meeting of Shareholders on May 7, 2025. b. The following is a summary of the voting results for each matter presented to shareholders at the Annual Meeting. Proposal 1: Election of Directors The Company's shareholders elected the persons nominated as Directors of the Company as set forth below: Nominees For Against Abstain Broker Non-Votes Marco Alverà 243,518,681 2,403,842 274,815": 0.5,
  "(Item 2.02) . Results of Operations and Financial Condition On May 12, 2025, Simon Property Group, Inc. issued a press release containing information on earnings for the quarter ended March 31, 2025 and other matters. A copy of the press release is furnished with this report as Exhibit 99.1 and is incorporated by reference into this report.": 0.0,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders. CSX Corporation (“CSX”) held its Annual Meeting of Shareholders (the “Annual Meeting”) on Wednesday, May 7, 2025. The final voting results for each matter submitted to a shareholder vote at the Annual Meeting are set forth below. Item 1: The following twelve persons were elected to the CSX Board of Directors: For Against Abstain Broker Non-Votes Ann D. Begeman 1,411,615,573 16,232,594 2,581,522 217,137,335 Thomas P.": 0.1,
  "(Item 8.01) . Other Events. A copy of the form of Judicial Consent Order described in": 0.0,
  "(Item 8.01) Other Events. On May 13, 2025, The PNC Financial Services Group, Inc. (the “Corporation”) completed the public offer and sale of $1,250,000,000 aggregate principal amount of its 4.899% Fixed Rate/Floating Rate Senior Notes due May 13, 2031 (the “Notes”). The Notes were sold pursuant to an Underwriting Agreement dated May 6, 2025 (the “Underwriting Agreement”) entered into by the Corporation, PNC Capital Markets LLC, J.P. Morgan Securities LLC and Morgan Stanley & Co. LLC. The\n\n(Item 8.01) by reference. The Notes were issued under an Indenture, dated as of September 6, 2012 (the “Base Indenture”), as amended and supplemented by a First Supplemental Indenture, dated as of April 23, 2021 (the “Supplemental Indenture” and together with the Base Indenture, the “Indenture”), between the Corporation and The Bank of New York Mellon, as trustee. The underwritten offering described in this Current Report on Form 8-K is more fully described in the prospectus supplement,": 0.1,
  "(ITEM 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. At the Annual Meeting of Shareholders of Stryker Corporation (the “Company”) held on May 8, 2025 (the “Annual Meeting”), shareholders approved the 2011 Long-Term Incentive Plan, as Amended and Restated, the 2011 Performance Incentive Award Plan, as Amended and Restated and the 2008 Employee Stock Purchase Plan, as Amended and Restated (collectively, the “Plans”), in each case,\n\n(ITEM 5.07) Submission of Matters to a Vote of Security Holders At the Company's Annual Meeting of Shareholders held on May 8, 2025, shareholders voted on six proposals and cast their votes as follows: 1) All ten directors were elected to serve until the next Annual Meeting of Shareholders and until their successors have been duly elected and qualified based upon the following votes: Shares Name For Against Abstain Broker Non-Votes Mary K. Brainerd 286,232,193 7,008,635 318,882": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (d) On May 12, 2025, the Board of Directors (the “Board”) of QUALCOMM Incorporated (the “Company”) elected Christopher D. Young, former Executive Vice President, Business Development, Strategy, and Ventures of Microsoft Corporation, to the Board. Mr. Young was elected for a term of office that expires at the Company’s next annual meeting of stockholders. The Board": 0.1,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders. At the Annual Meeting of Stockholders of Prologis, Inc. (the “Company”) held on May 8, 2025, the Company’s stockholders voted on the proposals listed below. The final results for the votes regarding each proposal are set forth below. The proposals are described in further detail in the Company’s Definitive Proxy Statement on Schedule 14A as filed with the Securities and Exchange Commission on March 28,": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. On May 14, 2025, Cisco Systems, Inc. (“Cisco”) reported its results of operations for its fiscal third quarter 2025 ended April 26, 2025. A copy of the press release issued by Cisco concerning the foregoing results is furnished herewith as Exhibit 99.1. The information contained herein and in the accompanying exhibit shall not be incorporated by reference into any filing of Cisco, whether made before or after the": 0.0,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Appointment of Officer; Departure of Officer On May 9, 2025, Scott Herren notified Cisco Systems, Inc. (“Cisco”) of his decision to retire as Executive Vice President and Chief Financial Officer of Cisco effective July 26, 2025. Mr. Herren will remain employed by Cisco as an Executive Advisor through May 1, 2026. On May 10, 2025, Cisco": -0.2,
  "(Item 8.01) . Other Events. On May 12, 2025, the Company entered into an agreement (the “Underwriting Agreement”) with the underwriters listed on Schedule II thereto (the “Underwriters”), whereby the Company agreed to sell and the Underwriters agreed to purchase from the Company, subject to and upon the terms and conditions set forth in the Underwriting Agreement, $500,000,000 principal amount of 4.650% Senior Notes due 2030, $1,250,000,000 principal amount of 5.250% Senior Notes due 2035, $1,250,000,000 principal": 0.1,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders At the 2025 Annual Meeting of Shareholders of the Company held on May 13, 2025, the votes cast with respect to each item of business properly presented at the meeting are as follows: Proposal No. 1 — The shareholders elected each of the eleven nominees to the Board of Directors for a one-year term by the vote of the majority of votes cast, in accordance with": 0.2,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders. (a) The Company’s Annual Meeting of Stockholders was held on May 9, 2025. The matters voted on and the results of the vote were as follows. (b) The Company’s stockholders voted on the matters set forth below. 1. John P. Bilbrey, John T. Cahill, Steven A. Cahillane, Lisa M. Edwards, C. Martin Harris, Martina Hund-Mejean, Kimberly A. Nelson, Brian O. Newman, Lorrie M. Norrington, and": 0.0,
  "(Item 5.07) - Submission of Matters to a Vote of Security Holders On May 14, 2025, Elevance Health, Inc. (the \" Company \") held its Annual Meeting of Shareholders. The shareholders of the Company voted as follows on the matters set forth below. 1. Election of Directors . The following nominees for director were elected to serve three-year terms to expire at the Company’s annual meeting of shareholders in 2028 based on the following votes: Nominee For": -0.2,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders The annual meeting of shareholders of Vertex Pharmaceuticals Incorporated (the \"Company\") was held on May 14, 2025 (the \"Annual Meeting\"). Set forth below are the voting results for each of the proposals submitted to a vote of the Company's shareholders at the Annual Meeting: Proposal No. 1 : Based upon the following votes, the shareholders elected Sangeeta Bhatia, Lloyd Carney, Alan Garber, Reshma Kewalramani, Michel Lagarde,": 0.1,
  "(ITEM 5.07) Submission of Matters to a Vote of Security Holders The 2025 Annual Meeting of shareholders of Simon Property Group, Inc. (the “Company”) was held on May 14, 2025 (the “Meeting”). The vote tabulation for each proposal considered at the Meeting is as follows: Proposal 1 - Election of Directors The Company’s shareholders elected each of the following directors to serve until the Company’s 2026 annual meeting of shareholders and until their successors have been duly\n\n(ITEM 8.01) Other Events At the Meeting, the Company’s shareholders approved a proposal to redomesticate, by conversion, the Company from a corporation organized under the laws of the State of Delaware (the “Delaware Corporation”) to a corporation organized under the laws of the State of Indiana (the “Indiana Corporation”) by means of a plan of conversion (the “Plan of Conversion”, and such redomestication, the “Redomestication”), as described in the Company’s Definitive Proxy Statement for the Meeting (as": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition ​ On Thursday, May 15, 2025, Deere & Company (the “Company”) issued a press release announcing its results of operations for the second quarter of fiscal 2025. A copy of the press release is furnished herewith as Exhibit 99.1 and is incorporated herein by reference. ​": 0.0,
  "(Item 8.01) . Other Events. On May 12, 2025, Caterpillar Inc. (the “Company”) entered into an Underwriting Agreement (the “Underwriting Agreement”) with Barclays Capital Inc., Citigroup Global Markets Inc. and SG Americas Securities, LLC, as representatives of the several underwriters named therein (the “Underwriters”), with respect to the offering and sale of $1.7 billion aggregate principal amount of the Company’s 5.200% Senior Notes due 2035 (the “2035 Notes”) and $300 million aggregate principal amount of the Company’s": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On May 15, 2025, Applied Materials, Inc. (“Applied Materials”) announced its financial results for its second quarter ended April 27, 2025. A copy of Applied Materials’ press release is attached hereto as Exhibit 99.1. The information in this Form 8-K, including Exhibit 99.1, is being furnished and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”),": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On May 14, 2025, the Board of Directors (the “Board”) of Intuitive Surgical, Inc. (the “Company”) appointed David J. Rosa, currently the Company’s President, as Chief Executive Officer of the Company effective July 1, 2025. Mr. Rosa will replace Gary S. Guthart, Ph.D., who will step down as Chief Executive Officer of the Company effective July": 0.2,
  "(Item 2.02) . Results of Operations and Financial Condition. In accordance with\n\n(Item 2.02) of Form 8-K of the Securities and Exchange Commission (the \"SEC\"), Walmart Inc., a Delaware corporation (the \"Company\"), is furnishing to the SEC a press release that the Company will issue on May 15, 2025 (the \"Press Release\") and a financial presentation that will be first posted by the Company on the Company’s website at http://stock.walmart.com on May 15, 2025 (the \"Financial Presentation\"). The Press Release and the Financial Presentation will disclose information regarding the\n\n(Item 2.02) of this Current Report on Form 8-K, including Exhibits 99.1 and 99.2 hereto, which are furnished herewith pursuant to and relate to this\n\n(Item 2.02) , shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), or otherwise be subject to the liabilities of Section 18 of the Exchange Act. The information in this\n\n(Item 2.02) of this Current Report on Form 8-K and Exhibits 99.1 and 99.2 hereto shall not be incorporated by reference into any filing or other document filed by the Company with the SEC pursuant to the Securities Act of 1933, as amended, the rules and regulations of the SEC thereunder, the Exchange Act, or the rules and regulations of the SEC thereunder except as shall be expressly set forth by specific reference in such filing or\n\n(Item 8.01) . Other Events. Effective May 15, 2025, the Company moved its corporate headquarters and principal executive offices from 702 S.W. 8th Street to 1 Customer Drive, Bentonville, AR 72716. There is no change to the Company’s telephone number. Future correspondence and communications to the Company from shareholders and others should be directed to this address.": 0.1,
  "(Item 8.01) Other Events On May 15, 2025, NextEra Energy Capital Holdings, Inc. (NEECH), a wholly-owned subsidiary of NextEra Energy, Inc. (NEE), sold $875 million principal amount of its Series U Junior Subordinated Debentures due June 1, 2085 (Junior Subordinated Debentures). The Junior Subordinated Debentures bear interest at a rate of 6.50% per year, payable quarterly. NEECH, at its option, may redeem some or all of the Junior Subordinated Debentures beginning in June 2030. The Junior Subordinated": 0.1,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders. On May 15, 2025, BlackRock, Inc. (the “Company”) held its 2025 Annual Meeting of Shareholders (the “Annual Meeting”). The following are the voting results on each matter submitted to the Company’s shareholders at the Annual Meeting. All director nominees were elected (Item 1). The proposal to approve the compensation of the named executive officers as disclosed in the Company’s proxy statement, through a non-binding advisory": 0.2,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders The Company convened its AGM on May 15, 2025, pursuant to notice duly given. Agenda Items 1-12 submitted by the Company at the annual general meeting were approved in accordance with the Board’s recommendations. The shareholder proposal, Agenda Item 13, was rejected. The matters voted upon at the meeting and the results of such voting are set forth below. The vote required to approve each agenda": 0.2,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. At the 2025 Annual Meeting of Shareholders (the “Annual Meeting”) of Morgan Stanley (the “Company”) held on Thursday, May 15, 2025, shareholders approved the amended and restated Equity Incentive Compensation Plan (the “EICP”) to increase the number of shares of common stock available to be granted under the EICP by 50 million shares and to extend\n\n(Item 5.07) . Submission of Matters to a Vote of Security Holders. At the Annual Meeting, the shareholders of the Company in attendance (the “Shareholders”), constituting a quorum under the Amended and Restated Bylaws of the Company, voted on proposals to: (i) elect directors to the Company’s Board of Directors (the “Board”), (ii) ratify the appointment of Deloitte & Touche LLP as the Company’s independent auditor for the 2025 fiscal year, (iii) approve the compensation of the": 0.1,
  "(Item 8.01) Other Events. The Board of Directors of Vertex Pharmaceuticals Incorporated (the “Company”) has authorized an additional program to repurchase up to $4.0 billion of the Company’s common stock (the “2025 Repurchase Program”). The 2025 Repurchase Program does not have an expiration date and can be discontinued at any time. Under the 2025 Repurchase Program, the Company may repurchase stock from time to time, subject to general business and market conditions and other investment opportunities, on": 0.6,
  "(Item 8.01) Other Events Issuance of 3.250% Senior Notes due 2029 and 4.000% Senior Notes due 2034 On May 19, 2025, Equinix Europe 2 Financing Corporation LLC (the “ Issuer ”), a Delaware limited liability company and an indirect, wholly-owned subsidiary of Equinix, Inc. (the “ Guarantor ” or “ Equinix ”), a Delaware corporation, issued and sold €750,000,000 aggregate principal amount of its 3.250% Senior Notes due 2029 (the “ 2029 Notes ”) and €750,000,000 aggregate": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Controller Transition On May 13, 2025, Steven D’Ambrosia, Vice President and Controller of Altria Group, Inc. (“Altria”), announced his intention to retire as Vice President and Controller effective July 31, 2025. On May 15, 2025, Altria’s Board of Directors (the “Board”) elected Katie F. Patterson to become Vice President and Controller of Altria, effective upon Mr.\n\n(Item 5.07) . Submission of Matters to a Vote of Security Holders. There were 1,387,662,634 shares of Altria’s common stock represented in person or by proxy at the Annual Meeting, constituting 82.28% of outstanding shares on March 25, 2025, the record date for the Annual Meeting. The matters voted upon at the Annual Meeting and the final voting results are set forth below: Proposal 1: Election of 11 Directors. Name For Against Abstain Broker Non-Vote Ian L.T.": -0.2,
  "(Item 8.01) Other Events. On May 19, 2025, Pfizer Netherlands International Finance B.V. (the “Issuer”), a private limited liability company ( besloten vennootschap met beperkte aansprakelijkheid ) under Dutch law and a wholly-owned subsidiary of Pfizer Inc. (the “Company”), completed a public offering of €750,000,000 aggregate principal amount of 2.875% Notes due 2029 (the “2029 Notes”), €1,000,000,000 aggregate principal amount of 3.250% Notes due 2032 (the “2032 Notes”), €750,000,000 aggregate principal amount of 3.875% Notes due 2037": 0.1,
  "(Item 8.01) Other Events. Exhibits are filed herewith in connection with the issuance by American Express Company (the “Company”), on May 20, 2025, of €1,000,000,000 aggregate principal amount of 3.433% Fixed-to-Floating Rate Notes due May 20, 2032 (the “Notes”) pursuant to a Prospectus Supplement dated May 13, 2025 to the Prospectus dated February 9, 2024, filed as part of the Company’s Registration Statement on Form S-3 (No. 333-276975). The Notes were issued under a senior indenture, dated": 0.1,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. The following are the voting results on each matter submitted to the stockholders of CVS Health Corporation (the “Company”) at the Annual Meeting of Stockholders held on May 15, 2025 (the “Annual Meeting”). The proposals below are described in detail in the proxy statement filed by the Company on April 4, 2025 (the “Proxy Statement”). There were present at the Annual Meeting, in person or by": 0.0,
  "(Item 8.01) . Other Events. On May 15, 2025, the Company entered into an agreement (the “Underwriting Agreement”) with the underwriters listed on Schedule I thereto (the “Underwriters”), whereby the Company agreed to sell and the Underwriters agreed to purchase from the Company, subject to and upon the terms and conditions set forth in the Underwriting Agreement, $170,673,000 principal amount of Floating Rate Senior Notes due 2075 (the “Transaction”). The Company intends to use the net proceeds": 0.2,
  "(Item 2.02) . Results of Operations and Financial Condition. On May 20, 2025, The Home Depot, Inc. (the “Company”) issued a press release, attached as Exhibit 99.1 and incorporated herein by reference, announcing the Company’s financial results for the fiscal quarter ended May 4, 2025. The information contained in this\n\n(Item 2.02) , including Exhibit 99.1 attached hereto, is being furnished and shall not be deemed filed for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of Section 18. Furthermore, the information contained in this\n\n(Item 2.02) and Exhibit 99.1 shall not be deemed to be incorporated by reference into any registration statement or other document filed pursuant to the Securities Act of 1933, as amended.": 0.0,
  "(Item 5.07) below, at the 2025 annual meeting of stockholders (\"Annual Meeting\") of Crown Castle Inc. (\"Company\"), the Company's stockholders approved the proposals to amend and restate the Company's Restated Certificate of Incorporation (\"Charter\") to eliminate (1) all supermajority voting requirements and (2) certain unnecessary or outdated provisions set forth therein (collectively, \"Charter Amendments\"). The Company's Board of Directors previously approved the Charter Amendments, subject to stockholder approval. The Charter Amendments became effective upon the filing of\n\n(ITEM 5.07) —SUBMISSION OF MATTERS TO A VOTE OF SECURITY HOLDERS At the Annual Meeting held on May 21, 2025, the Company's stockholders (1) elected each of the nine nominees for director, to serve until the Company's next Annual Meeting and until their respective successors are duly elected and qualified, (2) ratified the appointment of PricewaterhouseCoopers LLP as the Company's independent registered public accountants for fiscal year 2025, (3) approved, on a non-binding, advisory basis, the compensation": 0.5,
  "(Item 2.02) . Results of Operations and Financial Condition On May 21, 2025, Medtronic plc, a public limited company organized under the laws of Ireland, issued a press release announcing its full year and fourth quarter fiscal year 2025 financial results. A copy of the Medtronic financial results press release is furnished as Exhibit 99.1 to this Current Report on Form 8-K.\n\n(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. As referenced in the press release furnished as Exhibit 99.1 to this Current Report on Form 8-K, the Company announced that Sean Salmon would be departing from his position as EVP and President, Cardiovascular Portfolio and Skip Kiil would be assuming the role of EVP and President, Cardiovascular Portfolio, effective May 21, 2025. Mr. Salmon will remain\n\n(Item 8.01) . Other Events As described in the press release attached as Exhibit 99.2 to this Current Report on Form 8-K, on May 21, 2025, Medtronic announced its intent to separate its Diabetes business into a new standalone public company.": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition . On May 21, 2025, Target Corporation issued a News Release containing its financial results for the three months ended May 3, 2025. The News Release is attached hereto as Exhibit 99.": 0.0,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On May 20, 2025, the Board of Directors of UnitedHealth Group Incorporated (the “Company”) accepted Andrew Witty’s resignation as a director of the Company, effective immediately. Accordingly, Mr. Witty will not stand for re-election as a director in connection with the Company’s 2025 annual shareholder meeting to be held on June 2, 2025.": -0.5,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Effective May 21, 2025, Mr. Robert Scully retired from the Board of Directors of Zoetis Inc. (the “Company”), prior to the Company’s 2025 Annual Meeting of Shareholders (the “Annual Meeting”) in accordance with the Company’s director retirement policy. Effective May 21, 2025, Dr. Mark Stetter was elected to the Board of Directors of the company at the\n\n(Item 5.07) . Submission of Matters to a Vote of Security Holders. As discussed under\n\n(Item 5.02) of this Current Report on Form 8-K, on May 21, 2025, the Company held the Annual Meeting. At the Annual Meeting, the Company’s shareholders voted on four proposals, each of which is described in more detail in the Company’s definitive proxy statement filed with the Securities and Exchange Commission on April 9, 2025 (the “Proxy Statement”). There were 392,890,991 shares of common stock present at the Annual Meeting in person or by proxy, which represented": 0.1,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. (a) Registrant held its Annual Meeting of Shareholders on Tuesday, May 20, 2025; 2,371,361,078 shares were represented in person or by proxy, or 85.21% of the total shares outstanding. (b) The results of the shareholder voting on the proposals presented were as follows: MANAGEMENT PROPOSALS Proposal 1 - Shareholders elected the 12 director nominees named in the Proxy Statement. All director nominees received at least 92.98%": 0.5,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On May 21, 2025, the Board of Directors (the “Board”) of Thermo Fisher Scientific Inc. (the “Company”), following a thorough evaluation, approved the grant of 5-year cliff vesting performance-based restricted stock units (the “Award”) to Marc N. Casper, the Company’s Chairman, President and Chief Executive Officer (“CEO”), to secure his continued leadership through at least May 2030,": 0.5,
  "(Item 2.02) . Results of Operations and Financial Condition On May 22, 2025, Analog Devices, Inc. (the “Registrant”) announced its financial results for its fiscal second quarter ended May 3, 2025. The full text of the press release issued by the Registrant concerning the foregoing results is furnished herewith as Exhibit 99.1. The information in this\n\n(Item 2.02) and in the accompanying Exhibit 99.1 shall not be incorporated by reference into any filing of the Registrant, whether made before or after the date hereof, regardless of any general incorporation language in such filing, unless expressly incorporated by specific reference to such filing. The information in this\n\n(Item 2.02) , including Exhibit 99.1, shall not be deemed to be “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of that section or Sections 11 and 12(a)(2) of the Securities Act of 1933, as amended.": 0.0,
  "(ITEM 5.07) . SUBMISSION OF MATTERS TO A VOTE OF SECURITY HOLDERS. 3": 0.0,
  "(Item 1.01) . Entry into a Material Definitive Agreement. On May 21, 2025, QUALCOMM Incorporated (the Company) executed an Officers’ Certificate (the Officers’ Certificate), in accordance with Sections 2.02, 2.03, 10.04 and 10.05 of the Indenture dated May 20, 2015 (the Base Indenture and, together with the Officers’ Certificate, the Indenture) between the Company and U.S. Bank Trust Company, National Association (as successor in interest to U.S. Bank National Association), as trustee (the Trustee), in connection with\n\n(Item 8.01) . Other Events. On May 19, 2025, the Company entered into an underwriting agreement (the Underwriting Agreement) with J.P. Morgan Securities LLC, BofA Securities, Inc., Barclays Capital Inc., Goldman Sachs & Co. LLC and Morgan Stanley & Co. LLC, on behalf of the several Underwriters listed in Schedule I thereto (the Underwriters), pursuant to which the Company agreed to issue and sell the Notes to the Underwriters in a registered public offering (the Offering). The": 0.1,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. McDonald’s Corporation (the “Company”) held its 2025 Annual Shareholders’ Meeting (the “Annual Meeting”) on May 20, 2025. Set forth below are the final, certified voting results for each proposal presented at the Annual Meeting, as reported by Broadridge Financial Solutions, Inc., the Company’s independent inspector of election. Proposal 1 : The election of 11 nominees to the Company’s Board of Directors, each to hold office until": 0.0,
  "(Item 1.01) . Entry into a Material Definitive Agreement.": 0.0,
  "(Item 8.01) . Other Events. Effective May 23, 2025, PepsiCo, Inc. (“ PepsiCo ”) terminated the $5,000,000,000 364 day unsecured revolving credit agreement, dated as of May 24, 2024, among PepsiCo, as borrower, the lenders party thereto, and Citibank, N.A., as administrative agent (the “ 2024 364 Day Credit Agreement ”). There were no outstanding borrowings under the 2024 364 Day Credit Agreement at the time of its termination. On May 23, 2025, PepsiCo entered into a": 0.1,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders Honeywell International Inc. (the “Company”) held its Annual Meeting of Shareowners on May 20, 2025. The following matters set forth in our Proxy Statement dated April 9, 2025 (the “2025 Proxy Statement”), which was filed with the Securities and Exchange Commission pursuant to Regulation 14A under the Securities Exchange Act of 1934, were voted upon with the results indicated below. 1. The nominees listed below were": 0.1,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. (a) The 2025 Annual Meeting of Stockholders of The Charles Schwab Corporation (“CSC”) was held on May 22, 2025. (b) All nominees for director were elected, and each nominee received more “for” votes than “against” votes cast for the nominee’s election. The proposal to ratify the selection of Deloitte & Touche LLP (“Deloitte”) as CSC’s independent auditors for the 2025 fiscal year was approved. The advisory": 0.1,
  "(Item 8.01) . Other Events Issuance of $1,200,000,000 of Notes On May 23, 2025, Texas Instruments Incorporated (“Texas Instruments”) consummated the issuance and sale of $550,000,000 aggregate principal amount of its 4.500% Notes due 2030 (the “2030 Notes”) and $650,000,000 aggregate principal amount of its 5.100% Notes due 2035 (the “2035 Notes” and, together with the 2030 Notes, the “Notes”), pursuant to an underwriting agreement filed herewith as Exhibit 1.1 dated May 20, 2025 among Texas Instruments": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On May 21, 2025, Dr. Laurie Glimcher informed the Board of Directors (the “Board”) of Analog Devices, Inc. (the “Company”) that she had decided to retire from the Board, effective immediately. Dr. Glimcher’s decision to retire did not involve any disagreement on any matter relating to the Company’s operations, policies or practices. In connection with Dr.": -0.2,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders. The Company held its Annual Meeting on May 23, 2025. The final results of the voting for each matter submitted to a vote of stockholders at the meeting are as follows: Item 1 - Election of Directors Each of the following 12 nominees for director were elected to serve a one-year term expiring at the Company’s 2026 annual meeting of stockholders and until his or": 0.1,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. At the Annual Meeting, the shareholders were asked to vote on seven proposals. A brief description of each proposal, along with the final voting results, is set forth below: 1. The shareholders elected the individuals listed below as directors to serve until the next annual shareholders meeting and until his or her successor has been duly elected and qualified or his or her earlier death, resignation": 0.2,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Mondelēz International, Inc. Severance Plan for Key Executives On May 20, 2025, in connection with a review of Mondelēz International, Inc.'s (the \" Company \") severance programs, the People and Compensation Committee of the Company (the “ Committee ”) approved the Mondelēz International, Inc. Severance Plan for Key Executives (the “ Plan ”). All of the Company’s\n\n(Item 5.07) . Submission of Matters to a Vote of Security Holders. On May 21, 2025, we held our annual meeting of shareholders. A total of 1,124,518,986 shares of our Class A Common Stock, or 86.8% of our outstanding shares of Class A Common Stock, were represented at the annual meeting. The final voting results for each of the matters submitted to a shareholder vote at the annual meeting are set forth below: 1. Our shareholders elected": 0.0,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders. The Annual Meeting of Equinix, Inc. (“Equinix”) was held on May 21, 2025 (the “Annual Meeting”) for the purpose of considering and voting on: • Election of 8 directors to the Board of Directors (the “Board”) to serve until the next Annual Meeting or until their successors have been duly elected and qualified; • Approval, by a non-binding advisory vote, of the compensation of Equinix’s": 0.0,
  "(Item 1.01) Entry into a Material Definitive Agreement. On May 28, 2025, Honeywell International Inc. (the “Company”) entered into a Cooperation Agreement (the “Agreement”) with Elliott Investment Management L.P., Elliott Associates, L.P. and Elliott International, L.P. (collectively, “Elliott”). Pursuant to the Agreement, the Board of Directors of the Company (the “Board”) agreed to increase the size of the Board by one, appoint Marc Steinberg (the “New Director”) to the Board, effective as of May 31, 2025 (the\n\n(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. The description of the matters included under\n\n(Item 1.01) are incorporated into this\n\n(Item 5.02) by reference. On the Effective Date, the New Director will also be appointed to serve as a member of the Audit Committee of the Board. The New Director will receive the same compensation as the Company’s other non-employee directors. There are no arrangements or understandings between the New Director and any other person pursuant to which the New Director was appointed as a director other than with respect to the matters referred to in\n\n(Item 1.01) . At this time, there are no transactions in which the New Director has or will have an interest that would be required to be disclosed pursuant to Item 404(a) of Regulation S-K under the Exchange Act.": 0.1,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders (a) NextEra Energy, Inc. (NEE) held its 2025 Annual Meeting of Shareholders (2025 Annual Meeting) on May 22, 2025. At the 2025 Annual Meeting, NEE's shareholders approved three proposals. The proposals are described in detail in NEE's definitive proxy statement on Schedule 14A for the 2025 Annual Meeting (Proxy Statement), filed with the Securities and Exchange Commission on April 1, 2025. (b) The final voting results": 0.1,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders At the Annual Meeting held on May 21, 2025, the shareholders of the Company voted on the following proposals: 1. The following nominees were elected to the Company’s Board of Directors for a one-year term expiring at the 2026 annual meeting of shareholders. For Against Abstain Broker Non-Votes Marc N. Casper 288,144,302 25,678,666 2,486,405 18,072,525 Nelson J. Chai 296,784,356 18,421,795 1,103,222 18,072,525 Ruby R. Chandy 313,439,920": -0.2,
  "(Item 2.02) Results of Operations and Financial Condition. On May 28, 2025, NVIDIA Corporation, or the Company, issued a press release announcing its results for the quarter ended April 27, 2025. The press release is attached as Exhibit 99.1 and is incorporated herein by reference. Attached hereto as Exhibit 99.2 and incorporated by reference herein is financial information and commentary by Colette M. Kress, Executive Vice President and Chief Financial Officer of the Company, regarding results for": 0.1,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders. The 2025 Annual Meeting of Shareholders of The Home Depot, Inc. (the “Company”) was held on May 22, 2025. Below are the final vote results from the meeting. Proposal 1 : The following nominees were elected by majority vote to serve on the Board of Directors of the Company: FOR AGAINST ABSTAIN BROKER NON-VOTES Gerard J. Arpey 694,921,089 14,023,258 1,063,654 138,693,972 Ari Bousbib 678,305,860 30,575,941": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition On May 29, 2025, the Company issued a press release containing its operating results for the third quarter (twelve weeks) and the first 36 weeks of fiscal 2025, ended May 11, 2025. A copy of the press release is attached as Exhibit 99.1. In addition, a copy of the Company's earnings release supplement for the third quarter of fiscal 2025 is attached as Exhibit 99.2.": 0.0,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders. (a) The Annual Meeting of Shareholders of Merck & Co., Inc. (the “Company”) was held on May 27, 2025. (b) Shareholders voted on the matters set forth below: 1. The following nominees were elected to the Company’s Board of Directors to hold office until the Company’s next Annual Meeting of Shareholders and received the number of votes set forth opposite their names: Names Votes For": 0.0,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On May 29, 2025, Colgate-Palmolive Company (the “Company”) announced that its Board of Directors (the “Board”) had elected Shane Grant as the Company’s Chief Operating Officer, Americas, reporting to Chairman, President and Chief Executive Officer, Noel R. Wallace, effective June 16, 2025. Mr. Grant, 50, will join the Company from Group Danone (“Danone”), a leading global": 0.2,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. (a), (b) Exxon Mobil Corporation (the “Company,” “ExxonMobil,” “we,” or “our”) held its Annual Meeting of Shareholders (“Annual Meeting”) on May 28, 2025. At the meeting, the matters set forth below were submitted for a vote of security holders. As of the close of business on April 2, 2025, which was the record date for the Annual Meeting, 4,308,968,407 shares of ExxonMobil common stock, without par": 0.0,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. (b) At the Annual Meeting, Chevron stockholders voted on the matters set forth below, with final voting results indicated. For the election of Directors in an uncontested election, each nominee who received a majority of votes cast (i.e., the number of shares voted for exceeded the number of shares voted against, excluding abstentions) was elected as a Director. Approval of the amendment to Chevron’s Restated Certificate": 0.1,
  "(Item 8.01) Other Events. On May 30, 2025, ServiceNow, Inc. (the “Company”) filed with the U.S. Securities and Exchange Commission (the “SEC”) a prospectus supplement to its effective registration statement on Form S-3ASR (File No. 333-279150) covering the resale from time to time by certain stockholders of shares of the Company’s common stock (the “Shares”). Such stockholders acquired the Shares in connection with the Company’s acquisition of Logik.io Inc. A copy of the legal opinion of Freshfields": 0.1,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. On May 28, 2025, Meta Platforms, Inc. (the \"Company\") held its annual meeting of shareholders via live audio webcast (the \"Annual Meeting\"). At the Annual Meeting, the Company's shareholders voted on fourteen proposals, each of which is described in more detail in the Company's definitive proxy statement filed with the Securities and Exchange Commission on April 17, 2025 (the \"Proxy Statement\"). At the beginning of the": 0.1,
  "If You Invested $10K In Crown Castle Stock 10 Years Ago, How Much Would You Have Now?": 0.0,
  "Rate My Portfolio - r/Stocks Quarterly Thread June 2025 - Please use this thread to discuss your portfolio, learn of other stock tickers & portfolios like [Warren Buffet's](https://buffett.online/en/portfolio/), and help out users by giving constructive criticism. Why quarterly? Public companies report earnings quarterly; many investors take this as an opportunity to rebalance their portfolios. We highly recommend you do some reading: Check out our wiki's list of [relevant posts & book recommendations.](https://www.reddit.com/r/stocks/wiki/index/#wiki_relevant_posts.2C_books.2C_wiki_recommendations) You can find": 0.2,
  "(Item 5.02) — Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On June 2, 2025, the Board of Directors (the “Board”) of United Parcel Service, Inc. (“UPS”), upon recommendation of the Board’s Nominating and Corporate Governance Committee, increased the size of the Board to thirteen members and appointed John Morikis, age 61, to the Board, effective immediately. Mr. Morikis will join the Audit Committee of the Board.": 0.0,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On May 30, 2025, the board of directors (the “Board”) of The Cigna Group (the “Company”) appointed Michael J. Hennigan as an independent member of the Board, effective June 2, 2025. Mr. Hennigan will participate in the Company’s non-employee director compensation program, amended and restated effective July 24, 2024 (the “Plan”), as described in the Company’s Proxy": 0.2,
  "(Item 1.01) . Entry into a Material Definitive Agreement. On May 29, 2025, The Boeing Company (the “Company”) entered into a Non-Prosecution Agreement (“NPA”) with the U.S. Department of Justice (“Department”) that, subject to court proceedings, resolves matters relating to the Department’s determination that the Company did not fulfill its obligations under the previously-disclosed Deferred Prosecution Agreement entered into by the Company and the Department on January 6, 2021 (the “DPA”). Pursuant to the NPA, the Company": -0.5,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders. The 2025 Annual Meeting of Stockholders of the Company was held virtually on June 3, 2025 at www.virtualshareholdermeeting.com/BKNG2025. Stockholders voted on the proposals as described below: 1. The following individuals were elected to the Company’s Board of Directors to serve until the next annual meeting of stockholders and until their successors are elected and qualified. Nominee Votes For Votes Against Broker Non-Votes Glenn D. Fogel": 0.2,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On June 2, 2025, the Compensation and Human Resources Committee of the Board of Directors of UnitedHealth Group Incorporated (the “Company”) cancelled the performance-based restricted stock units granted to Andrew Witty, the Company’s former Chief Executive Officer, on February 20, 2025. Mr. Witty agreed to the cancellation in connection with his retirement.\n\n(Item 5.07) . Submission of Matters to a Vote of Security Holders. On June 2, 2025, the Company held its 2025 Annual Meeting of Shareholders (the “Annual Meeting”). There were 811,952,044 shares of common stock represented at the Annual Meeting. The shareholders of the Company voted as follows on the following matters at the Annual Meeting: 1. Election of Directors. The nine directors were elected at the Annual Meeting for a one-year term based upon the following": 0.1,
  "(Item 8.01) . Other Events. On May 21, 2025, Linde plc (the “Company”) issued ₣225 million aggregate principal amount of 0.6150% Notes due 2029 (the “2029 Notes”), and issued ₣275 million aggregate principal amount of 1.0629% Notes due 2033 (the “2033 Notes”). The 2029 Notes and the 2033 Notes were issued pursuant to a Subscription Agreement, dated June 3, 2025, by and among the Company, as issuer, and the financial institutions named as bookrunners and other managers": 0.1,
  "(Item 8.01) . Other Events. On June 6, 2025, Philip Morris International Inc. (“PMI”) issued €500,000,000 aggregate principal amount of its 2.750% Notes due 2029 (the “2029 Notes”) and €500,000,000 aggregate principal amount of its 3.250% Notes due 2032 (the “2032 Notes” and, together with the 2029 Notes, the “Notes”). The Notes were issued pursuant to an Indenture dated as of April 25, 2008, by and between PMI and HSBC Bank USA, National Association, as trustee. In": 0.1,
  "(Item 1.01) Entry into a Material Definitive Agreement. On June 3, 2025, Autodesk, Inc. (“Autodesk” or the “Company”) entered into an underwriting agreement (the “Underwriting Agreement”) with Citigroup Global Markets Inc., BofA Securities, Inc. and J.P. Morgan Securities LLC, as representatives of the several underwriters listed on Schedule II thereto (the “Underwriters”), relating to the issuance and sale by the Company of $500 million aggregate principal amount of 5.300% Notes due 2035 (the “Notes”). The Underwriting Agreement\n\n(Item 1.01) , “Entry into a Material Definitive Agreement,” is incorporated herein by reference.\n\n(Item 8.01) . Other Events. Wilson Sonsini Goodrich & Rosati, Professional Corporation, counsel to Autodesk, has issued an opinion to Autodesk dated June 6, 2025 regarding the legality of the Notes. A copy of the opinion is filed as Exhibit 5.1 hereto.": 0.1,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. On June 5, 2025, Netflix, Inc. (the “Company”) held its 2025 annual meeting of stockholders (the “Annual Meeting”). As of April 7, 2025, the Company’s record date, there were a total of 425,571,266 shares of common stock outstanding and entitled to vote at the Annual Meeting. At the Annual Meeting, 368,794,416 shares of common stock were represented in person or by proxy and, therefore, a quorum": 0.1,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders On June 5, 2025, Walmart Inc. (the “Company”) held its Annual Shareholders’ Meeting (the “Meeting”). As of the close of business on April 11, 2025, the record date for the Meeting, there were 8,000,886,911 shares of the Company’s common stock outstanding, with each share entitled to one vote. The holders of 7,309,887,889 (91.36%) shares of the Company’s common stock were present in person or represented": 0.1,
  "Crown Castle Stock Up 10.5% Year to Date: Will the Trend Continue?": 0.5,
  "Was Jim Cramer Right About Crown Castle Inc. (CCI)?": 0.2,
  "Linde (NasdaqGS:LIN) Expands CO2 Capacity In Texas With CHF 500M Debt Financing": 0.2,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Compensatory Arrangements of Certain Officers On June 5, 2025, the Compensation and Management Development Committee of the Board of Directors of Cisco Systems, Inc. (“Cisco”) approved an equity award for Mark Patterson in connection with his appointment as Executive Vice President, Chief Financial Officer of Cisco, as previously disclosed on a Form 8-K filed with the": 0.1,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. Salesforce, Inc. (the “Company”) held its 2025 Annual Meeting of Stockholders on June 5, 2025 (the “Meeting”). The proposals considered at the Meeting are described in the Company’s 2025 Proxy Statement filed with the Securities and Exchange Commission on April 24, 2025 (the “Proxy Statement”), and the final voting results are set forth below: 1. Election of directors: For Against Abstain Broker Non-Votes Marc Benioff 688,158,875\n\n(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. As reported above, at the Meeting, the Company’s stockholders approved an amendment and restatement of the Company’s 2013 Equity Incentive Plan (as amended and restated, the “2013 Equity Incentive Plan”) to increase the number of shares of the Company’s common stock reserved for issuance by an additional 34 million shares and to extend the termination date of": 0.1,
  "(ITEM 5.02) DEPARTURE OF DIRECTORS OR CERTAIN OFFICERS; ELECTION OF DIRECTORS; APPOINTMENT OF CERTAIN OFFICERS; COMPENSATORY ARRANGEMENTS OF CERTAIN OFFICERS. On June 9, 2025, the Board of Directors of The Procter & Gamble Company (the “Company”) appointed Craig Arnold, former Chairman and Chief Executive Officer of Eaton Corporation, as a Director of the Company, effective June 9. Mr. Arnold will serve on the Audit and Compensation & Leadership Development Committees. The Board has determined that Mr. Arnold\n\n(Item 5.02) (d), “Election of Directors.”": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers On June 10, 2025, Johnson & Johnson (the “Company” or “Johnson & Johnson”) announced that Daniel Pinto was elected to the Board of Directors effective July 1, 2025. Mr. Pinto will serve on the Audit Committee and the Compensation & Benefits Committee. As a non-employee director of the Company, Mr. Pinto will receive compensation as described in": 0.1,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. On June 6, 2025, T-Mobile US, Inc. (the “Company”) held its Annual Meeting of Stockholders (the “Annual Meeting”). At the Annual Meeting, the following two proposals were presented, as described in the Company’s definitive proxy statement on Schedule 14A filed with the Securities and Exchange Commission on April 18, 2025 (the “Proxy Statement”): (1) Elect 13 director nominees named in the Proxy Statement to the Board": 0.1,
  "(Item 8.01) Other Events . On June 10, 2025, Target Corporation (“Target”) closed the sale of $500 million aggregate principal amount of its 4.350% Notes due 2028 (the “2028 Notes”) and $500 million aggregate principal amount of its 5.250% Notes due 2036 (the “2036 Notes,” and together with the 2028 Notes, the “Notes”) pursuant to an Underwriting Agreement, dated June 5, 2025 (the “Underwriting Agreement”), among Target and Barclays Capital Inc., Goldman Sachs & Co. LLC, and": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On June 10, 2025, the Company announced that on June 30 Dan Hines will retire as Senior Vice President, Corporate Controller, and Principal Accounting Officer. He will remain a Senior Vice President until his retirement in January 2026, following 35 years of service. Tiffany Barbre, 51, has been appointed as Senior Vice President, Corporate Controller and": 0.1,
  "(Item 2.02) Results of Operati ons and Financial Condition On June 11, 2025, Oracle Corporation (“Oracle”) issued a press release announcing financial results for its fiscal fourth quarter ended May 31, 2025. A copy of this press release is furnished as Exhibit 99.1 to this report. Section 8—Other Events\n\n(Item 8.01) O ther Events Oracle announced that its Board of Directors has declared a cash dividend of $0.50 per share of outstanding common stock payable on July 24, 2025, to stockholders of record as of the close of business on July 10, 2025. Section 9—Financial Statements and Exhibits": 0.5,
  "(Item 8.01) . Other Events. On June 9, 2025, Air Products and Chemicals, Inc. (the “Company”) entered into an Underwriting Agreement (the “U.S. Underwriting Agreement”) with Deutsche Bank Securities Inc., J.P. Morgan Securities LLC, Scotia Capital (USA) Inc., TD Securities (USA) LLC and Wells Fargo Securities, LLC, as representatives of the underwriters named therein, relating to the issuance and sale by the Company of (i) $600,000,000 aggregate principal amount of its 4.300% Senior Notes due 2028 (the": 0.1,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders On June 11, 2025, Caterpillar Inc. (the “Company”) held a virtual 2025 Annual Shareholders Meeting (the “Annual Meeting”). Set forth below are the voting results for each of the matters submitted to a vote of the Company’s shareholders at the Annual Meeting. Proposal 1 - Company Proposal - Election of Directors All nominees for election to the Company’s Board of Directors named in the Proxy Statement": 0.1,
  "(Item 8.01) Other Events. On June 12, 2025, Micron Technology, Inc. (the “Company”) issued a press release (the “Announcement”) announcing the Company’s plans for expanded U.S. investments in leading-edge DRAM manufacturing and research and development. A copy of the press release is filed herewith as Exhibit 99.1 to this Current Report on Form 8-K. In connection with the Announcement, on June 11, 2025, two wholly-owned subsidiaries of the Company, Micron Idaho Semiconductor Manufacturing (Triton) LLC, a Delaware": 0.5,
  "(Item 8.01) Other Events On June 12, 2025, NextEra Energy Capital Holdings, Inc., a wholly-owned subsidiary of NextEra Energy, Inc. (NEE), sold C$600 million principal amount of its 3.83% Debentures, Series due June 12, 2030 and C$1.4 billion principal amount of its 4.67% Debentures, Series due June 12, 2035 (together, the Debentures), both of which are guaranteed by NEE. The Debentures were registered under the Securities Act of 1933 pursuant to Registration Statement Nos. 333-278184, 333-278184-01 and": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On June 12, 2025, Adobe Inc. (“Adobe”) issued a press release announcing financial results for its second quarter fiscal year 2025 ended May 30, 2025. A copy of this press release is furnished and attached hereto as Exhibit 99.1 and is incorporated herein by reference. The information in this report and the exhibit attached hereto are being furnished and shall not be deemed filed for purposes of the": 0.1,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders. At the Annual Meeting of Stockholders of Alphabet Inc. (“ Alphabet ”) held on June 6, 2025 (the “ 2025 Annual Meeting ”), Alphabet’s stockholders voted on fifteen proposals as set forth below, fourteen of which are described in detail in Alphabet’s definitive proxy statement on Form 14A filed with the U.S. Securities and Exchange Commission on April 25, 2025 (the “ 2025 Proxy Statement": 0.1,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders . On June 11, 2025, Target Corporation (the “Company”) held its 2025 Annual Meeting of Shareholders (the “Annual Meeting”). At the Annual Meeting, the Company's shareholders voted on the four proposals described below. The final voting results, including the votes used to determine the results for each proposal under the applicable approval standard (as indicated by the borders), are set forth below. 1. The shareholders elected": 0.1,
  "Saudi Arabia’s Giant Hydrogen Project Reaches 80% Completion": 0.8,
  "RBC starts Air Products, Linde at Outperform on earnings recovery": 0.6,
  "Air Products to Benefit From Return to Core Industrial Gas Model, RBC Capital Says": 0.6,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On June 14, 2025, the Board of Directors (“Board”) of Morgan Stanley (the “Company”) elected Lynn J. Good, the former Chair, Chief Executive Officer and President of Duke Energy Corporation, to the Board, effective July 18, 2025. The Board determined that Ms. Good is independent in accordance with the director independence standards established under the Company’s Corporate": 0.1,
  "(Item 8.01) – Other Events. On June 16, 2025, T-Mobile US, Inc. (the “Company”), together with T-Mobile USA, Inc., its wholly-owned subsidiary (“T-Mobile USA”), issued a press release announcing the preliminary results of its offers to exchange (collectively, the “Exchange Offers”) up to $544,000,000 aggregate principal amount of the outstanding 6.700% Senior Notes due 2033 (the “USCC 2033 Notes”) of United States Cellular Corporation, a Delaware corporation (“USCC”), $500,000,000 aggregate principal amount of USCC’s outstanding 6.250% Senior": 0.1,
  "(Item 1.01) . Results of Operations and Financial Condition On June 16, 2025, Analog Devices, Inc. (the “Company”) issued $850,000,000 aggregate principal amount of senior notes due June 15, 2028 (the “2028 Notes”) and $650,000,000 aggregate principal amount of senior notes due June 15, 2030 (the “2030 Notes” and, together with the 2028 Notes, the “Notes”) pursuant to an effective registration statement on Form S-3 (File No. 333-281670) (the “Registration Statement”) and a related prospectus and prospectus": 0.1,
  "Want Better Returns? Don't Ignore These 2 Finance Stocks Set to Beat Earnings": 0.8,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On June 17, 2025, Prologis announced that Joseph Ghazal, Chief Investment Officer, has informed the company of his decision to step away from his role as an executive officer effective July 1, 2025. He will remain with Prologis until July 10, 2026, to support a smooth transition.": -0.2,
  "Hydrogen giant abandons £2bn British factory plans Labour refused to back": -0.8,
  "Linde plc's (NASDAQ:LIN) Recent Stock Performance Looks Decent- Can Strong Fundamentals Be the Reason?": 0.5,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers On June 13, 2025, Cathleen Benko notified NIKE, Inc. (the “Company”) of her decision to retire as a member of the Board of Directors of the Company (the “Board”) effective as of the Company’s 2025 annual meeting of shareholders (the “2025 Annual Meeting”). Therefore, Ms. Benko will not stand for re-election at the 2025 Annual Meeting.": -0.5,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On June 16, 2025, the Board of Directors (the Board) of Citigroup Inc. (Citigroup) elected Jonathan Moulds as a director of Citigroup and appointed him to the Board’s Risk Management Committee and Transformation Oversight Committee. Mr. Moulds serves as Chair of the Board of Directors of Citigroup Global Markets Limited (CGML), Citigroup’s international broker/dealer. Mr. Moulds previously": 0.1,
  "How to Find Strong Finance Stocks Slated for Positive Earnings Surprises": 0.8,
  "Air Products and Chemicals, Inc. (APD) Initiated with an Outperform Rating at RBC Capital": 0.6,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. At our annual meeting of shareholders held on June 18, 2025 (the “annual meeting”), our shareholders approved an amendment to the Comcast-NBCUniversal 2011 Employee Stock Purchase Plan (the “Plan”) to increase the number of shares available for issuance from 24.2 million to 34.2 million. The amendment was approved on February 25, 2025 by the Compensation and\n\n(Item 5.07) . Submission of Matters to a Vote of Security Holders. (a) At the annual meeting on June 18, 2025, our shareholders approved, or did not approve, the following proposals. (b) The number of votes cast for and against (or withheld) and the number of abstentions and broker non-votes with respect to each such proposal, as described in detail in the Company’s definitive proxy statement dated April 25, 2025, are set forth below. (1) All of": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition On June 20, 2025, Accenture plc (“Accenture”) issued a news release announcing financial results for its third quarter of fiscal 2025, which ended on May 31, 2025. A copy of the news release is attached hereto as Exhibit 99. All information in the news release is furnished but not filed. Non-GAAP Financial Information In the attached news release Accenture discloses the following non-GAAP financial measures: • Free cash flow": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Board Committee Appointments On April 24, 2025, Autodesk, Inc. (“Autodesk” or the “Company”) filed a Current Report on Form 8-K disclosing, among other things, that Jeff Epstein and A. Christine (Christie) Simons were appointed to the Company’s Board of Directors (the “Board”), effective immediately following the conclusion of the Company’s 2025 annual meeting of stockholders. At\n\n(Item 5.07) of this Current Report below, at the 2025 Annual Meeting of Stockholders of the Company held on June 18, 2025 (the “Annual Meeting”), the stockholders of Autodesk voted on and approved the amendment and restatement of the Company’s 2022 Equity Incentive Plan (the \"2022 Plan as Amended and Restated\"). The terms and conditions of the 2022 Plan as Amended and Restated are described in Autodesk's definitive proxy statement on Schedule 14A filed with the U.S.\n\n(Item 5.07) . Submission of Matters to a Vote of Security Holders. The information set forth in\n\n(Item 5.02) above is incorporated by reference herein. At the Annual Meeting, the Company elected the following ten individuals to its Board. Each director will serve for the ensuing year and until his or her successor is duly elected and qualified. Nominee Votes For Votes Against Abstentions Broker Non-Votes Andrew Anagnost 170,772,192 2,765,235 124,047 15,033,309 Stacy J. Smith 146,133,194 25,871,724 1,656,556 15,033,309 Karen Blasing 171,511,650 2,045,670 104,154 15,033,309 John T. Cahill 168,924,255 4,604,898 132,321 15,033,309 Reid French": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers On June 20, 2025, Accenture plc (“Accenture” or the “Company”) issued a news release announcing changes to its growth model and its leadership, effective September 1, 2025. Accenture will bring all of its services—Strategy, Consulting, Song, Technology and Operations, together into a single, integrated business unit called Reinvention Services under the leadership of Manish Sharma, Accenture’s current\n\n(Item 8.01) Other Events Kate Clifford, who currently serves as Chief Human Resources Officer of the Americas, has been appointed as Accenture’s Chief Leadership and Human Resources Officer and will join the Global Management Committee, effective September 1, 2025, succeeding Angela Beatty, who has decided to leave Accenture to pursue other opportunities. Jason Dess, who currently serves as Lead of CFO and Enterprise Value Consulting, has been appointed as Group Chief Executive – Consulting, effective September 1,": 0.2,
  "(Item 1.01) . Entry into a Material Definitive Agreement. On June 20, 2025, International Business Machines Corporation (“IBM”) (i) entered into Amendment No. 2 (the “Three-Year Amendment”) to the existing $2.5 billion Three-Year Credit Agreement dated as of June 22, 2021 (as amended by Amendment No. 1 to Three-Year Credit Agreement, dated as of June 30, 2022, the “Existing Three-Year Credit Agreement”), among IBM, the several banks and other financial institutions from time to time parties thereto,\n\n(Item 1.01) of this Current Report on Form 8-K is incorporated by reference herein.": 0.2,
  "(Item 8.01) . Other Events. On June 17, 2025, UnitedHealth Group Incorporated (the “Company”) agreed to sell its (i) 4.400% Notes due June 15, 2028 in the aggregate principal amount of $500,000,000, (ii) 4.650% Notes due January 15, 2031 in the aggregate principal amount of $750,000,000, (iii) 5.300% Notes due June 15, 2035 in the aggregate principal amount of $1,000,000,000 and (iv) 5.950% Notes due June 15, 2055 in the aggregate principal amount of $750,000,000 (collectively, the": 0.1,
  "S&P Futures Gain as Trump Delays Decision on Iran Strikes": 0.5,
  "CSX Corporation (NASDAQ:CSX) is largely controlled by institutional shareholders who own 78% of the company": 0.1,
  "ADRNY vs. CLX: Which Stock Is the Better Value Option?": 0.2,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On June 18, 2025, the Board of Directors (Board) of Medtronic plc (Company) increased the size of the Board from 10 to 11 and appointed Dr. Joon Lee as a new director of the Company, in each case effective as of June 18, 2025. Dr. Lee has been appointed to serve on the Science and Technology": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On June 22, 2025, Elinor Mertz was appointed to the Board of Directors (the “Board”) of Netflix, Inc. (the “Company”) effective immediately, for a term expiring at the Company's 2026 annual meeting of stockholders, or until her earlier resignation or removal. Ms. Mertz was also appointed to serve on the Audit Committee of the Board (the “Audit\n\n(Item 5.02) .\n\n(Item 8.01) Other Events. As previously disclosed by the Company in a Current Report on Form 8-K filed with the Securities and Exchange Commission on June 6, 2025, Mr. Jay Hoag did not receive a majority of votes cast in his election to the Board, and in accordance with the Company’s director resignation policy, Mr. Hoag offered his resignation, conditioned upon Board acceptance. Pursuant to the Company’s director resignation policy, the Nominating and Governance Committee (the “Nominating": 0.1,
  "(Item 1.01) Entry into a Material Definitive Agreement. 364-Day Credit Agreement On June 20, 2025 (the “ 364-Day Effective Date ”), Salesforce, Inc. (the “ Company ”) entered into a 364-Day Credit Agreement with the lenders named therein, JPMorgan Chase Bank, N.A., as administrative agent, and the other parties from time to time party thereto (the “ 364-Day Credit Agreement ”). The 364-Day Credit Agreement provides the Company with the ability to borrow up to $4 billion\n\n(Item 1.01) above is hereby incorporated by reference in its entirety into this": 0.1,
  "Is CSX Corporation's (NASDAQ:CSX) 27% ROE Better Than Average?": 0.2,
  "Aon Unveils AI-Powered Broker Copilot to Modernize Insurance Placement": 0.5,
  "Crown Castle (CCI) Plans Restructuring to Focus on Towers and Boost 5G Growth": 0.6,
  "(Item 2.02) . Results of Operations and Financial Condition. On June 25, 2025 , Micron Technology, Inc. (the \"Company\", \"we\" or \"our\") announced the financial results for our third quarter of fiscal 2025 ended May 29, 2025. The full text of the press release issued in connection with the announcement is attached as Exhibit 99.1 to this Current Report on Form 8-K. The information in\n\n(Item 2.02) and Exhibit 99.1 of this Current Report on Form 8-K shall not be deemed \"filed\" for the purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), or otherwise subject to the liabilities of that section. The information in\n\n(Item 2.02) and Exhibit 99.1 of this Current Report on Form 8-K shall not be incorporated by reference into any filing or other document pursuant to the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such filing or document.": 0.0,
  "The 5 Most Interesting Analyst Questions From ADP’s Q1 Earnings Call": 0.6,
  "Stifel Downgrades Zoetis (ZTS) Stock, Reduces PT": -0.5,
  "Chubb (CB) Stock Moves -1.38%: What You Should Know": -0.5,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On June 25, 2025, the Board of Directors (the “Board”) of Starbucks Corporation (the “Company”) increased the number of directors of the Company from nine to 11 and appointed Marissa Mayer and Dambisa F. Moyo to serve as directors on the Board, effective immediately. The Board expects to appoint Ms. Mayer and Dr. Moyo to one or": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition Today NIKE, Inc. issued a press release disclosing financial results for the fiscal quarter and year ended May 31, 2025. The text of the release is furnished herewith as Exhibit 99.1.": 0.0,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. As noted above, the Annual Meeting was held on June 24, 2025. Holders of Class A common stock at the close of business on April 25, 2025 were entitled to vote at the Annual Meeting. A total of 809,905,298 shares of Class A common stock, constituting a quorum, were present or represented by proxy at the Annual Meeting. The votes cast with respect to the matters": 0.1,
  "(Item 8.01) . Other Events. Effective January 1, 2025, The Coca-Cola Company (“Company”) sunset its Global Ventures operating segment to streamline and simplify the Company’s operating structure. The Global Ventures operating segment was established in 2019 primarily to oversee the Company’s ownership of Costa Limited (“Costa”), innocent and doğadan, as well as the fees earned pursuant to distribution coordination agreements between the Company and Monster Beverage Corporation (“Monster”). Effective January 1, 2025, the results of the Costa": 0.1,
  "Union Pacific (UNP): Buy, Sell, or Hold Post Q1 Earnings?": 0.2,
  "Is the Options Market Predicting a Spike in Air Products Stock?": 0.2,
  "Bumble (BMBL) Soars 25.1%: Is Further Upside Left in the Stock?": 0.6,
  "5 Insightful Analyst Questions From Zoetis’s Q1 Earnings Call": 0.5,
  "(Item 1.01) Entry into a Material Definitive Agreement. On June 27, 2025, Automatic Data Processing, Inc., a Delaware corporation (the “Company”), entered into a $4.55 billion 364-Day Credit Agreement (the “364-Day Facility”) and a $2.5 billion Five-Year Credit Agreement (the “Five-Year Facility,” and together with the 364-Day Facility, the “New Facilities”) with a group of lenders (the “Lenders”). The Five-Year Facility contains an accordion feature under which the aggregate commitment can be increased by $500 million to\n\n(Item 1.01) is hereby incorporated by reference into this": 0.1,
  "What Makes Union Pacific’s Railroad Network Hard to Replace": 0.2,
  "1 Industrials Stock for Long-Term Investors and 2 to Ignore": 0.2,
  "AON’s CEO Sees Huge Potential in These Four (or Five) Megatrends": 0.6,
  "Prologis Earnings Preview: What to Expect": 0.0,
  "Stryker names Mike Carlin as leader of digital, robotics unit": 0.2,
  "Should You Invest in Zoetis (ZTS) Based on Bullish Wall Street Views?": 0.5,
  "Berkshire Stock Falls 8% in 3 Months: Should You Buy the Dip?": 0.2,
  "CVS vs. DHR: Which Stock Is the Better Value Option?": 0.2,
  "Swire sells majority stake in Brickell City Centre retail to Simon for $512M": 0.5,
  "Simon Acquires Brickell City Centre Retail in Miami": 0.5,
  "Returns On Capital At CSX (NASDAQ:CSX) Have Stalled": -0.5,
  "Jim Cramer on Danaher: “This Stock Has Been Such a Disappointment for Me”": -0.6,
  "3 Brilliant Dividend Stocks to Buy Now and Hold for the Long Term": 0.8,
  "3 of Wall Street’s Favorite Stocks on Our Buy List": 0.5,
  "Danaher appoints Martin Stumpe as chief technology and AI officer": 0.5,
  "What to Expect From Crown Castle's Next Quarterly Earnings Report": 0.2,
  "3 Prominent Stocks Estimated To Be Trading At Up To 38.9% Below Intrinsic Value": -0.7,
  "SYK Boosts Foot & Ankle Portfolio With FDA-Cleared Total Ankle System": 0.5,
  "Circle initiated, Disney upgraded: Wall Street's top analyst calls": 0.6,
  "Simon Boosts Portfolio With Brickell City Centre's Retail Arm Buyout": 0.5,
  "Plug Power Stock Is Surging. Why Hydrogen Just Got a Boost From the Senate Bill.": 0.8,
  "Wall Street Set to Close Strong a Turbulent 1H 2025": 0.6,
  "Hedge Fund Strategy Built on Catastrophes Taps Hot New Trend": 0.6,
  "Is Danaher's M&A Premium Already Priced In?": 0.1,
  "Can Berkshire Hathaway's Railroad Subsidiary Power its Growth?": 0.2,
  "Citi upgrades Linde on project wins and productivity gains": 0.6,
  "Equinix (NasdaqGS:EQIX) Removed From Multiple Russell Growth Indexes": -0.5,
  "Air Products and Chemicals (NYSE:APD) Removed From Two Russell 1000 Indexes": -0.5,
  "Equinix (EQIX) Outperforms Broader Market: What You Need to Know": 0.5,
  "(Item 8.01) Other Events. On July 1, 2025, The Goldman Sachs Group, Inc. (the Registrant) issued a press release, a copy of which is attached hereto as Exhibit 99.1 and incorporated into this\n\n(Item 8.01) by reference.": 0.0,
  "(Item 8.01) Other Events On July 1, 2025, JPMorgan Chase & Co. (\"JPMorganChase\" or the \"Firm\") issued a press release concerning its preliminary Stress Capital Buffer requirement and related matters. A copy of the Firm’s press release is attached as Exhibit 99. The information set forth in Exhibit 99 shall be deemed to be “filed” for purposes of the Securities Exchange Act of 1934. This Current Report on Form 8-K (including the Exhibit hereto) contains forward-looking statements": 0.1,
  "(Item 8.01) Other Events. On July 1, 2025, the Georgia Public Service Commission (“PSC”) voted to approve the settlement agreement, among Georgia Power Company (“Georgia Power”) and the Georgia PSC Public Interest Advocacy Staff, which was filed with the Georgia PSC on May 19, 2025 and subsequently signed by Georgia Association of Manufacturers and Utility Management Services (the “Settlement Agreement”). The Settlement Agreement extends the existing alternate rate plan previously approved by the Georgia PSC, which set": 0.1,
  "(Item 8.01) . Other Events. This Current Report on Form 8-K is being filed in connection with the completion on July 1, 2025 (the “ Closing Date ”) of BlackRock, Inc.’s (the “Company”) previously announced acquisition of 100% of the business and assets of HPS Investment Partners (“ HPS ”), a leading global credit investment manager (the “ Acquisition ”). In connection with the Acquisition, approximately 8.5 million units of BlackRock Saturn Subco, LLC, a consolidated subsidiary\n\n(Item 8.01) .": 0.0,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders. On June 25, 2025, at the 2025 Annual Meeting of Stockholders of NVIDIA Corporation, or the 2025 Annual Meeting, the following proposals were adopted or rejected by the margin indicated. 1. Stockholders approved the election of each of our thirteen (13) director nominees to hold office until the 2026 Annual Meeting of Stockholders of NVIDIA Corporation and until his or her successor is elected or": 0.1,
  "(Item 8.01) . Other Events. On July 1, 2025, Bank of America Corporation (the “Corporation”) issued a press release (“Press Release”) announcing that the Corporation plans to increase its quarterly common stock dividend from $0.26 per share to $0.28 per share beginning in the third quarter of 2025. The quarterly common stock dividend is subject to approval by the Corporation’s Board of Directors. The Press Release also announced the results of the Federal Reserve Board’s 2025 Comprehensive\n\n(Item 8.01) .": 0.8,
  "(Item 8.01) Other Events. On July 1, 2025, Morgan Stanley (the “Company”) announced it will increase its quarterly common stock dividend to $1.00 per share from the current $0.925 per share, beginning with the common stock dividend expected to be declared by the Company’s Board of Directors (the “Board”) in the quarter ending September 30, 2025 (the “third quarter”). In addition, the Board reauthorized a multi-year common equity share repurchase program of up to $20 billion, without": 0.8,
  "Aon's (NYSE:AON) investors will be pleased with their respectable 93% return over the last five years": 0.8,
  "Southern Water bailed out by owner to stave off debt crunch": -0.5,
  "Here's Why Zoetis (ZTS) is a Strong Growth Stock": 0.8,
  "Why This 1 Momentum Stock Could Be a Great Addition to Your Portfolio": 0.8,
  "Economic Data Deluge This Week": 0.2,
  "Can Realty Income's Expansion Into New Sectors Fuel Future Growth?": 0.5,
  "The anti-DEI movement has inadvertently made corporate diversity stronger": 0.6,
  "Fed Chair's Comments, Manufacturing Data Leave Equities Mixed Intraday": 0.0,
  "Sector Update: Financial Stocks Advance Late Afternoon": 0.5,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On June 29, 2025, the independent members of the Board of Directors and the Compensation and Management Development Committee of Starbucks Corporation (the “Company”, “we”, or “our”) approved a “Back to Starbucks” grant of performance-based restricted stock units (“PRSUs”) for each of the Company’s continuing named executive officers. This equity award is 100% performance based, with targets": 0.2,
  "(Item 8.01) Other Events. On July 1, 2025, U.S. Bancorp (the “Company”) announced that the Board of Governors of the Federal Reserve System (the “Federal Reserve”) has notified the Company that its preliminary Stress Capital Buffer (“SCB”) requirement is 2.6%, based on the results of the Federal Reserve’s Dodd-Frank Act Stress Test. The Federal Reserve will provide the Company with its final SCB requirement by August 31, 2025. A copy of the press release is attached as\n\n(Item 8.01) by reference. The Company also announced that its planned capital actions include an increase in the Company’s quarterly common stock dividend from $0.50 to $0.52 per share (subject to approval by the Company’s Board of Directors), starting in the third quarter of 2025. Forward-Looking Statements THE FOLLOWING INFORMATION APPEARS IN ACCORDANCE WITH THE PRIVATE SECURITIES LITIGATION REFORM ACT OF 1995: This current report contains forward-looking statements about the Company. Statements that are not historical or": 0.2,
  "(Item 8.01) – Other Events. On July 2, 2025, T-Mobile US, Inc. (the “Company”), together with T-Mobile USA, Inc., its wholly-owned subsidiary (“T-Mobile USA”), issued a press release announcing the extension of the Exchange Offers and Consent Solicitations (as defined below). The Exchange Offers and Consent Solicitations, which were previously scheduled to expire at 5:00 p.m., New York City time, on July 1, 2025, will now expire at 5:00 p.m., New York City time, on August 1,": 0.1,
  "(Item 8.01) Other Events. On July 1, 2025, Citigroup Inc. (Citi) announced that it has completed the Federal Reserve Board’s 2025 annual supervisory stress test process. Citi’s indicative Stress Capital Buffer (SCB) requirement is 3.6%, 50 bps down from the current 4.1%, and Citi's preliminary Standardized Common Equity Tier 1 (CET1) capital ratio regulatory requirement will be 11.6%, 50 bps down from the current 12.1%. As of March 31, 2025, Citi's Standardized CET1 capital ratio was 13.4%,": 0.5,
  "(Item 2.02) Results of Operations and Financial Condition. On July 2, 2025, Tesla, Inc. published the press release which is attached hereto as Exhibit 99.1 and is incorporated herein by reference. This information is intended to be furnished under\n\n(Item 2.02) of Form 8-K and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “ Exchange Act ”), or incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act as shall be expressly set forth by specific reference in such a filing .": 0.1,
  "Jim Cramer on Thermo Fisher: “It Does Seem Like it’s Bottoming”": 0.5,
  "Barclays begins coverage on six U.S. shopping center REITs, rates 2 stocks Buy": 0.5,
  "What to Expect From Chubb’s Q2 2025 Earnings Report": 0.2,
  "Chariot Re debuts with reinsurance deal backed by MetLife and General Atlantic": 0.5,
  "Do Rising Costs Raise Red Flag Despite APLD's Revenue Growth?": -0.5,
  "Vertex Gets EU Nod for New Cystic Fibrosis Drug Alyftrek": 0.5,
  "Vertex Pharmaceuticals Incorporated (VRTX) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Deere & Company (DE) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "CSX's (NASDAQ:CSX) 9.4% CAGR outpaced the company's earnings growth over the same five-year period": 0.2,
  "Honeywell Acquires Li-ion Tamer & Boosts Building Automation Portfolio": 0.6,
  "Is it Wise to Retain Crown Castle Stock in Your Portfolio for Now?": 0.2,
  "Stocks Supported by Chip Stock Strength and Trade News": 0.5,
  "Can Berkshire Hathaway's Manufacturing Subsidiary Power its Growth?": 0.2,
  "Why Molina Healthcare (MOH) Shares Are Sliding Today": -0.5,
  "Vertex Pharmaceuticals (NasdaqGS:VRTX) Secures EU Approval for New CF Treatment Access": 0.8,
  "Aon (NYSE:AON) Enhances Leadership Team With Strategic Industry Appointments": 0.6,
  "Sector Update: Financial": 0.0,
  "Why Chubb Limited Fell Today": -0.5,
  "Sector Update: Financial Stocks Softer in Afternoon Trading": -0.5,
  "Equities Mostly Rise Intraday After US-Vietnam Trade Deal; Tesla Advances": 0.6,
  "Barclays bullish on Kimco, Federal Realty as it launches coverage of retail REITs": 0.8,
  "Why Elevance Health (ELV) Shares Are Sliding Today": -0.5,
  "Nasdaq, S&P 500 Notch New Record Highs Following US-Vietnam Deal; Tesla Rebounds": 0.8,
  "Deere (DE) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Chubb (CB) Stock Sinks As Market Gains: Here's Why": -0.5,
  "This $125M Israeli Startup Is Building The World's First Cataract Robot To Solve A Global Crisis: 'There Is No Human Way To Close The Gap'": 0.6,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Amendment to International Assignment Letter On June 27, 2025, Aon Corporation (“Aon Corporation”), an indirect, wholly owned subsidiary of Aon plc (together with its subsidiaries, “Aon” or the “Company”), and Gregory C. Case entered into an amendment (the “Case Amendment”) to the international assignment letter agreement dated July 1, 2016 between Aon Corporation and Mr. Case (as\n\n(Item 5.07) Submission of Matters to a Vote of Security Holders. The Company held its Annual Meeting on June 27, 2025. A total of 193,925,428 Class A Ordinary Shares, or 89.77% of the total shares entitled to vote, were represented at the Annual Meeting in person or by proxy. Shareholders voted on the following eight proposals at the Annual Meeting, all of which are described in the Proxy Statement, and cast their votes as described below: 1.": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On June 29, 2025, the Board of Directors of The Boeing Company (the “Company”) elected Jesus (Jay) Malave to serve as the Company’s Executive Vice President and Chief Financial Officer, effective August 15, 2025 (the “Effective Date”), succeeding Brian J. West in that role. As of the Effective Date, Mr. West will cease to be the": 0.1,
  "Citi Maintains Neutral Rating on Simon Property Group (SPG)": 0.0,
  "Prologis (PLD) To Add 4000 Homes with Caltrain Site Revamp": 0.5,
  "5 Must-Read Analyst Questions From CSX’s Q1 Earnings Call": 0.0,
  "Is Analog Devices, Inc. (NASDAQ:ADI) Potentially Undervalued?": 0.5,
  "Stocks Edge Up Pre-Bell as Investors Await Key Jobs Report Before Independence Day": 0.5,
  "Southern Company's Georgia Power Freezes Base Rates Through 2028": 0.8,
  "Prologis Stock Rises 10.3% in Three Months: Will the Trend Last?": 0.6,
  "Trump Visits Iowa While 2028 Republicans Wait for Their Chance": 0.1,
  "Nonfarm Payrolls Exceed Estimates in June": 0.8,
  "Robinhood Stock Is Falling After S&P 500 Snub. Why That’s Shortsighted.": 0.2,
  "Will Linde (LIN) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Sector Update: Financial Stocks Rise Thursday Afternoon": 0.5,
  "Vertex Says Long-Term Data Show Casgevy's 'Durable' Clinical Benefits in Blood Disorder Trials": 0.6,
  "S&P 500, Nasdaq Stretch Record Closing Runs After Jobs Report": 0.5,
  "2 Growth Stocks with All-Star Potential and 1 to Approach with Caution": 0.5,
  "3 Volatile Stocks in the Doghouse": -0.5,
  "1 Profitable Stock to Keep an Eye On and 2 to Keep Off Your Radar": 0.5,
  "2 S&P 500 Stocks with Promising Prospects and 1 to Question": 0.5,
  "CME Group to Launch FX Tape+ for Enhanced Transparency in Foreign Exchange Markets": 0.6,
  "Stryker’s Incompass System Secures FDA Nod, Boosting Orthopaedics Innovation Strategy": 0.6,
  "Linde Stock Holds Price Target as UBS Highlights AI, Hydrogen, and Growth Sectors": 0.5,
  "CME Group's Quarterly Earnings Preview: What You Need to Know": 0.0,
  "Should You Invest in Linde plc (LIN)?": 0.0,
  "Why Investors Need to Take Advantage of These 2 Finance Stocks Now": 0.5,
  "Investors Heavily Search Intuitive Surgical, Inc. (ISRG): Here is What You Need to Know": 0.5,
  "Stocks making big moves this week: Oscar Health, Sunrun, Elevance Health, Tesla, and GMS": 0.5,
  "Intuitive Surgical's Fifth Generation da Vinci System Receives CE Mark": 0.5,
  "GitLab's DevSecOps Growth Momentum Continues: A Sign for More Upside?": 0.6,
  "Could CME Group's FX Tape+ be the Key to a More Transparent FX Market?": 0.5,
  "How Oklo Plans to Power the AI & Cloud Boom With Nuclear Energy": 0.5,
  "Will S&P Global (SPGI) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Simon Property Stock Gains 15.7% in Three Months: Will the Trend Last?": 0.5,
  "Vertex reports long-term results for Casgevy in sickle cell and thalassaemia": 0.5,
  "Jim Cramer Says “Danaher Can Make a Comeback”": 0.6,
  "2 Unstoppable Growth Stocks to Hold for the Next 20 Years": 0.8,
  "Wells Fargo Maintained a Buy Rating on Elevance Health (ELV), Kept the PT Unchanged": 0.5,
  "2 Top Dividend Stocks to Buy in July": 0.0,
  "2 Dividend Growth Stocks to Buy and Hold Forever": 0.5,
  "Should You Investigate CSX Corporation (NASDAQ:CSX) At US$33.60?": 0.2,
  "More than 200 S&P 500 companies scrubbed 'diversity' and 'equity' from annual reports in 2025": -0.8,
  "(Item 8.01) Other Events On July 7, 2025, Deere & Company (the “Company”) issued a press release announcing the death of Sherry M. Smith. Ms. Smith had served as a director of the Company since 2011. In light of her passing, on July 7, 2025, the Board reduced its size to ten members and appointed R. Preston Feight as Lead Director. ​": -0.5,
  "Groq launches its first European data centre in Helsinki": 0.5,
  "CPKC paces all railroad freight gains in latest quarter": 0.6,
  "Should You Invest in the iShares U.S. Transportation ETF (IYT)?": 0.2,
  "Do Its Financials Have Any Role To Play In Driving Analog Devices, Inc.'s (NASDAQ:ADI) Stock Up Recently?": 0.1,
  "Thermo Fisher Scientific (TMO) Traded Down due to Concerns Over Spending Cuts": -0.6,
  "Exploring High Growth Tech Stocks In The US Market": 0.5,
  "ISRG da Vinci 5 Gets European Nod: Will it Boost the Stock's Prospect?": 0.5,
  "Investors Heavily Search Chubb Limited (CB): Here is What You Need to Know": 0.5,
  "Will J&J's Q2 Results Reflect End of MedTech Issues & Higher Sales?": 0.5,
  "Should You Invest in Booking Holdings (BKNG) Based on Bullish Wall Street Views?": 0.5,
  "Weekly Stock Grader Analysis: Upgrades & Downgrades on Top Blue-Chip Stocks": 0.0,
  "Intellia Gains 29.8% in a Month: How Should You Play the Stock?": 0.6,
  "This Tech Stock Is Soaring After Takeover Deal. How It Changes the AI Picture.": 0.5,
  "CoreWeave & Core Scientific, Nvidia, Groq: Trending Tickers": 0.0,
  "SGIOY or ZTS: Which Is the Better Value Stock Right Now?": 0.2,
  "Elevance Health (NYSE:ELV) Removed From Russell Indices in June 2025": -0.5,
  "Freight Stocks Have a Tariff Overhang. Morgan Stanley Says It Could Be Worse.": -0.5,
  "Why Estée Lauder (EL) Shares Are Falling Today": -0.5,
  "Why Cigna (CI) Shares Are Sliding Today": -0.5,
  "Stocks Slide on Trade Tensions": -0.7,
  "Old-School Floor Traders Finally Get Their Day in Court Against CME": 0.2,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On July 7, 2025, Sean D. Major resigned as Executive Vice President, General Counsel and Secretary of Air Products and Chemicals, Inc. (the “Company”), effective July 11, 2025. Mr. Major’s successor will be named at a later date. Mr. Major will receive severance and other benefits in accordance with the Company’s Executive Separation Program. The terms": -0.5,
  "1 Profitable Stock to Consider Right Now and 2 to Brush Off": 0.2,
  "3M Company’s Q2 2025 Earnings: What to Expect": 0.0,
  "Colgate-Palmolive’s Quarterly Earnings Preview: What You Need to Know": 0.2,
  "Thermo Fisher’s Oncomine Dx Express Test Receives FDA Approval": 0.8,
  "Piper Sandler Reaffirms Overweight on Colgate-Palmolive, Sees 18% Upside Post CEO Meeting": 0.8,
  "Mondelez Seeks 12-Month Delay on EU Deforestation Law, Citing Supply Chain Strains": -0.5,
  "Analysis: Activist investors set to push for changes as dealmaking picks up": 0.5,
  "Should You Invest in the iShares U.S. Utilities ETF (IDU)?": 0.0,
  "Aon's Q2 2025 Earnings: What to Expect": 0.0,
  "Best Momentum Stock to Buy for July 8th": 0.6,
  "Investors Met With Slowing Returns on Capital At Mondelez International (NASDAQ:MDLZ)": -0.5,
  "Do You Believe in the Upside Potential of Vertex Pharmaceuticals (VRTX)?": 0.5,
  "ISRG Expands Installed Base, But Is Utilization Keeping Pace?": 0.1,
  "Phibro (PAHC) Soars 6.8%: Is Further Upside Left in the Stock?": 0.6,
  "How to Boost Your Portfolio with Top Finance Stocks Set to Beat Earnings": 0.5,
  "What to Expect From Union Pacific's Next Quarterly Earnings Report": 0.2,
  "What to Expect From Mondelez International’s Q2 2025 Earnings Report": 0.2,
  "Booking Holdings Inc. (BKNG) Hits Fresh High: Is There Still Room to Run?": 0.5,
  "Mondelez urges further delay to EU deforestation law": -0.5,
  "Mondelez urges further delay deforestation law amid calls for EU to press on": 0.1,
  "Is Deere (DE) a Buy as Wall Street Analysts Look Optimistic?": 0.6,
  "Circle initiated, CoreWeave downgraded: Wall Street's top analyst calls": -0.5,
  "Honeywell to Evaluate Alternatives for 2 Businesses Ahead of Planned Split": 0.5,
  "Broadcom and 13 Other Stocks That Have Come Too Far, Too Fast": -0.5,
  "Top Midday Stories: Canadian Regulator Advances Amazon Probe; Boeing Q2 Commercial Deliveries Up 63% YoY": 0.5,
  "Are You Looking for a Top Momentum Pick? Why Booking Holdings (BKNG) is a Great Choice": 0.8,
  "Mondelez Recalls Some RITZ Peanut Butter Cracker Sandwiches": -0.5,
  "SAP (XTRA:SAP) Partners Globally With JA Worldwide To Empower Over 85,000 Youth": 0.8,
  "RTX (NYSE:RTX) Successfully Demonstrates Barracuda Mine Neutralization Vehicle in Narragansett Bay": 0.6,
  "Honeywell International (NasdaqGS:HON) Appoints Jim Masso to Lead Process Automation Business": 0.5,
  "Uber's highs, Trump tariff warning, Wendy’s CEO heads to Hershey": 0.2,
  "Stock market today: Dow, S&P 500 slip as Trump stays firm on August tariff deadline, announces copper duties": -0.5,
  "PNC Bank automates direct deposit switch for customers": 0.5,
  "Honeywell Is Looking at ‘Strategic Alternatives.’ What It Means for the Stock.": 0.2,
  "Top Analyst Reports for T-Mobile, AstraZeneca & Comcast": 0.5,
  "Palantir Stock Goes 'Warp Speed' — But There's A Caveat": 0.1,
  "HSBC downgrades Big Banks: Analyst behind the call explains why": -0.5,
  "US oil futures dip after API inventory shows massive build in US crude stocks": -0.6,
  "Amgen (AMGN) Advances While Market Declines: Some Information for Investors": 0.5,
  "Why the Market Dipped But Analog Devices (ADI) Gained Today": 0.2,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On July 9, 2025, Salesforce, Inc. (the “Company”) announced that Amy Chang and David Kirk were appointed as directors, each effective as of July 9, 2025. There are no arrangements or understandings between Ms. Chang or Mr. Kirk and any other persons pursuant to which they were selected as directors, and neither has any family relationships with": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On July 8, 2025, Apple Inc. (“Apple”) announced that Jeff Williams will transition his role as Chief Operating Officer later this month to Sabih Khan, Apple’s Senior Vice President of Operations, as part of a long-planned succession. Mr. Williams will continue reporting to Apple CEO Tim Cook and overseeing Apple’s world-class design team and Apple Watch alongside": 0.2,
  "Prologis vs. Union Pacific: Which Supply Chain Giant Has More Room to Run?": 0.2,
  "Citigroup Upgrades Linde (LIN) to Buy, Raises Price Target": 0.8,
  "Accenture (ACN) Buys SYSTEMA to Support Manufacturing Automation for Semiconductor Clients": 0.5,
  "TXN- A Resilient Semiconductor Name That's on the March": 0.6,
  "Mondelez (MDLZ) Urges EU to Delay Deforestation Law Amid Cocoa Market Turmoil": 0.1,
  "Stifel Rates Philip Morris (PM) as a ‘Buy’ Buoyed By Smoke-Free Strategy": 0.8,
  "DexCom Is Doubling Down on Its ‘Mistake.’ Why It’s Time to Buy the Stock.": 0.6,
  "1 No-Brainer Dividend Stock to Buy Now and Hold Forever": 0.8,
  "Wendy’s CEO Kirk Tanner to step down": -0.5,
  "The Zacks Analyst Blog Highlights T-Mobile US, AstraZeneca and Comcast": 0.0,
  "Should You Invest in the iShares U.S. Basic Materials ETF (IYM)?": 0.0,
  "S&P Global Earnings Preview: What to Expect": 0.0,
  "Intuitive Surgical’s Da Vinci 5 System Receives CE Mark, Expands Advanced Robotic Surgery Access Across Europe": 0.8,
  "RTX, Shield AI Partner to Integrate Advanced AI, Autonomy into Defense Products": 0.5,
  "3 reasons Cisco's president says CEOs aren't ready for AI": -0.5,
  "Is CVS Moving Closer to Reaching Its Long-Term Low 3X Leverage Goal?": 0.2,
  "Ritz recall 2025: Mislabeled peanut butter cracker sandwiches pose risk of life-threatening allergic reaction": -0.8,
  "Should You Continue to Hold Thermo Fisher Stock in Your Portfolio Now?": 0.2,
  "3 Crypto-Focused Stocks to Buy as Bitcoin Heads Toward New High": 0.8,
  "Is Philip Morris' Pricing Power Behind Its Profit Strength?": 0.2,
  "Texas Instruments Incorporated (TXN) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Comcast (CMCSA) Positioned for Resilience and Growth Amid Market Volatility and U.S. Tax Tailwinds": 0.8,
  "Crown Castle Stock Gains 13% Year to Date: Will the Trend Last?": 0.5,
  "UPS vs. FDX: Which Parcel Delivery Company Has an Edge Now?": 0.2,
  "Wall Street Analysts Think NextEra (NEE) Is a Good Investment: Is It?": 0.5,
  "Microsoft upgraded, Instacart initiated: Wall Street's top analyst calls": 0.5,
  "Nvidia hits $4 trillion market cap, first company to do so - Nvidia shares jumped more than 2% on Wednesday, topping a $4 trillion market cap for the first time as investors scooped stock in the tech giant building the hardware for the generative artificial intelligence boom. The chipmaker is the first company to ever achieve this market value. Nvidia is the world’s most valuable company, surpassing Microsoft and Apple, both of which hit the": 0.8,
  "The PNC Financial Services Group, Inc (PNC) Earnings Expected to Grow: Should You Buy?": 0.5,
  "T-Mobile Stock Drops After Downgrade. Why It Could Keep Lagging Rival AT&T.": -0.6,
  "Will medtech M&A pick back up in the second half?": 0.5,
  "AMAT Rides on AI Demand: Will Logic and DRAM Strength Last?": 0.2,
  "Cisco president: AI is moving fast, but most companies are struggling to keep up": -0.6,
  "Salesforce Adds 2 Board Members. It’s Gearing Up for the Agentic AI Era.": 0.5,
  "PNC Launches New Digital Direct Deposit: A Move to Boost Fee Income?": 0.2,
  "T-Mobile US Lags Peers in Fiber Investments, KeyBanc Says in Downgrade": -0.5,
  "T-Mobile US (NasdaqGS:TMUS) Launches New Galaxy Devices With Exclusive Offers And Perks": 0.6,
  "T-Mobile ending DEI programs as it seeks US FCC approval for 2 deals": -0.5,
  "Applied Materials Applies Winning Techniques, Driving Its Stock Price Steadily Higher": 0.8,
  "Altria Tanks On Bearish Note, But This Stock Named Top Tobacco Stock": 0.2,
  "T-Mobile US Reportedly Scraps Diversity, Inclusion Policies": -0.8,
  "June Minutes Point to Divided Federal Reserve, and Rate Cuts by Year-End": -0.5,
  "Stock investors should be less diversified now, says portfolio manager": -0.5,
  "AES Whipsaws On Renewable Tax Cuts, Takeover Interest": 0.1,
  "Intel (INTC) Price Target Raised by Citi Ahead of Q2 Earnings": 0.5,
  "Top Research Reports for SAP, Novo Nordisk & Thermo Fisher": 0.0,
  "Caterpillar (CAT) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "NextEra Energy (NEE) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Altria (MO) Stock Dips While Market Gains: Key Facts": -0.5,
  "1 Magnificent High-Yield Dividend Stock Down 50% to Buy and Hold Forever": 0.8,
  "Thinking of exiting my Google position because of ChatGPT's coming browser - This news of ChatGPT releasing an AI browser soon really makes me uneasy. Right now I own $50k worth of Google. But this news is not good for Google's ads business on Chrome. Right now I already ditched Chrome for Safari since I'm deep in Apple ecosystem. And if I want to learn or research something, I do it on ChatGPT. And if": -0.6,
  "3 Big Reasons to Love Atlassian (TEAM)": 0.6,
  "Palantir (PLTR) Teams With Accenture to Expand AI Solutions in Federal Government": 0.6,
  "1 Top Dividend Growth Stock to Buy Right Now": 0.5,
  "Hims & Hers Announces Planned 2026 Expansion to Canada, Following ZAVA Acquisition Completion - Hims & Hers Announces Planned 2026 Expansion to Canada, Following ZAVA Acquisition Completion >SAN FRANCISCO, July 09, 2025--(BUSINESS WIRE)--Hims & Hers Health, Inc. (NYSE: HIMS) the leading digital health and wellness platform, today announced its plans to bring its affordable, holistic weight loss program to Canada, timed with the anticipated first-ever availability of generic semaglutide anywhere in the world. This move": 0.5,
  "2 High-Yield Dividend Growth Stocks to Buy Now and Hold for Decades": 0.8,
  "Health Insurers Are Becoming Chronically Uninvestable": -0.8,
  "Regional Banks’ Torrid Rally Draws Bearish Bets as Earnings Loom": -0.6,
  "The Zacks Analyst Blog Highlights SAP SE, Novo Nordisk, Thermo Fisher Scientific and FONAR": 0.5,
  "Where Are Cash Sweep Lawsuits Now?": 0.0,
  "Is CSX (NASDAQ:CSX) Using Too Much Debt?": -0.5,
  "Desi Arnaz Revolutionized TV After Losing Everything": 0.5,
  "Aon unveils new insurance facility for data centre lifecycle": 0.2,
  "Goldman Sachs bullish on LRCX, AMAT, and STX  in new semiconductor call": 0.8,
  "India plans to tighten oversight of claims portal to curb rising healthcare costs, source says": 0.1,
  "What to Expect From Stryker's Next Quarterly Earnings Report": 0.0,
  "Home Depot Wins the Bidding War Against QXO Inc (QXO), Acquires GMS Inc (GMS)": 0.5,
  "Citi Raised the Firm’s PT On QUALCOMM (QCOM), Maintains a Hold Rating": 0.2,
  "Zoom Communications (ZM) Launches Zoom Virtual Agent 2.0": 0.5,
  "Earnings Preview: What to Expect From Lam Research's Report": 0.5,
  "Here's Why You Should Retain CONMED Stock in Your Portfolio for Now": 0.5,
  "OPEC+ considers pausing production increases after September hike - Bloomberg": 0.2,
  "Hologic's GYN Surgical Dominance: What's Powering the Road Ahead?": 0.5,
  "DUV Demand Powers ASML Holding in China: Will Export Curbs Cut It Off?": 0.1,
  "Looming pay transparency laws could create chaos for multinational companies and only 19% are ready for the new normal": -0.6,
  "Will Solid Momentum in Premium Handset Vertical Drive QCOM's Growth?": 0.6,
  "Here’s Why Right Tail Capital Exited Its Position in The Charles Schwab Corporation (SCHW) in 2023": 0.1,
  "How to Find Strong Utilities Stocks Slated for Positive Earnings Surprises": 0.8,
  "Accenture PLC (ACN) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "RTX Corporation (RTX) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "ServiceNow, Inc. (NOW) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Amgen: How To Find And Own America's Greatest Opportunities": 0.5,
  "Nvidia didn’t just win with tech it won with customers - Everyone talks about how Nvidia ($NVDA) has the best product and yeah, H100s and now B100s are beasts. But honestly, what really sets them apart is who’s buying from them. When the top five richest companies on Earth AMZN, GOOG, META, MSFT, even TSLA are all basically funneling their AI capex directly into Nvidia’s pockets, you realize this isn’t just about good tech. It’s": 0.8,
  "Trump Just Dropped The 50% ‘Copper Tariff Bomb’ - What Does This Mean For The Stock Market? - That's right ...Trump just announced that he will impose a 50% tariff on copper, effective August 1, 2025, citing a “national security assessment.” In his statement, he bombastically emphasized the importance of copper to the country: copper is the second most used material in the Department of Defense. How can we let ‘sleepy leaders’ destroy this industry?": -0.6,
  "Nvidia initiated, Roku upgraded: Wall Street's top analyst calls": 0.5,
  "Why This 1 Growth Stock Could Be a Great Addition to Your Portfolio": 0.8,
  "Analyst Says This Semiconductor Stock Can Benefit from Increased Defense Spending": 0.5,
  "Here's Why Gilead Sciences (GILD) is a Strong Momentum Stock": 0.6,
  "Here's Why T-Mobile (TMUS) is a Strong Momentum Stock": 0.8,
  "Earnings Preview: Elevance Health (ELV) Q2 Earnings Expected to Decline": -0.5,
  "U.S. Bancorp (USB) Earnings Expected to Grow: Should You Buy?": 0.5,
  "RTX Stock: Does Barracuda Anti-Mine's Success Signal a Buying Opportunity?": 0.5,
  "NDAQ Outperforms Industry, Trades at Premium: How to Play the Stock": 0.6,
  "Can Colgate's Pricing Strength Keep Earnings Buoyant in 2025?": 0.5,
  "Cisco Shares Trade Near 52-Week High: What's Next for CSCO Investors?": 0.5,
  "Suzetrigine: a new era in non-opioid pain relief": 0.6,
  "TSMC Sales Surge. It Might Be an Even Bigger AI Chip Winner than Nvidia.": 0.8,
  "HSBC Lifts PT on US Bancorp (USB) to $61 From $54, Keeps a Buy Rating": 0.8,
  "Citi Lifts PT on United Parcel Service (UPS) to $127 from $122, Keeps Buy Rating": 0.6,
  "Bernstein Maintains a Buy on Elevance Health (ELV), Sets a $585 PT": 0.6,
  "AMD expects annual AI revenue to grow by more than 60 percent driven by MI300 adoption and expanding EPYC Turin processor cloud deployments - AMD's growth was primarily driven by its Data Center and Artificial Intelligence (AI) businesses, with Data Center revenue increasing 57 percent year-over-year in the first quarter of fiscal 2025 This growth was driven by strong demand for AMD's EPYC server processors and Instinct AI gas pedals, primarily the MI300 series. AMD": 0.8,
  "Cigna Group Foundation Commits $3M to Veteran Mental Health, Housing Stability": 0.8,
  "Howmet's Commercial Aerospace Strength Seems Firm: More Upside Ahead?": 0.8,
  "Top Stock Movers Now: Delta Air Lines, WK Kellogg, Autodesk, and More": 0.5,
  "Autodesk & PTC, Workday, Estée Lauder: Trending Tickers": 0.0,
  "Why NextEra (NEE) is Poised to Beat Earnings Estimates Again": 0.8,
  "Will Altria (MO) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Will CME (CME) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Will Philip Morris (PM) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Why Wall Street Could Be Underestimating Palantir": 0.5,
  "Estée Lauder Stock Pops as Bank of America Reinstates Coverage With 'Buy' Rating": 0.8,
  "BofA reinstates Estee Lauder with Buy, sees 30% upside as Asia headwinds ease": 0.8,
  "Applied Materials, Inc. (AMAT): A Bull Case Theory": 0.5,
  "White House accuses Powell of mismanaging Federal Reserve, citing headquarters renovation - https://www.cnbc.com/2025/07/10/trump-fed-powell-omb.html >President Donald Trump’s budget chief on Thursday said that Federal Reserve Chairman Jerome Powell “has grossly mismanaged the Fed” and suggested he had misled Congress about a pricey renovation of the central bank’s headquarters. > >The broadside by Office of Management and Budget Director Russell Vought opened up a new front in Trump’s war of words against Powell. > >Trump has repeatedly": -0.6,
  "Gilead Sciences, Inc. (GILD): A Bull Case Theory": 0.5,
  "GMS Inc. (GMS): A Bull Case Theory": 0.5,
  "T-Mobile Ends DEI Programs Amid Trump-Era Regulatory Pressure to Secure FCC Deal Approvals": -0.5,
  "United Parcel Service (UPS): A Bull Case Theory": 0.5,
  "Why Atlassian (TEAM) Shares Are Plunging Today": -0.8,
  "Is BRK.B a good buy in my IRA right now? - I currently have 180k invested in VOO and 130k in cash within my IRA from a company 401k rollover. I have been contemplating whether to reinvest into VOO or to go another direction, and saw that BRK.B has diverged pretty heavily from the run VOO is on since April. I know BRK.B has been comparable in returns (and at points beating) to the S&P500.": 0.2,
  "Nvidia Stock Closes Above $4 Trillion Milestone for First Time": 0.8,
  "Lockheed Stock Rises Despite Downgrade. It’s Losing Wall Street Support.": -0.5,
  "Top Stock Reports for NVIDIA, Walmart & Caterpillar": 0.0,
  "Stock Market Today: Small Caps Rise, Edging Dow; Travel Firms Jump On Oil Drop But Byrna, Axon Trip Sell Rules (Live Coverage)": 0.2,
  "Auto & Transport Roundup: Market Talk": 0.0,
  "Justice Department to allow T-Mobile's $4.4 billion acquisition of UScellular": 0.5,
  "Tesla moves to expand Robotaxi to Phoenix, following rival Waymo - Elon Musk’s Tesla has applied to test and eventually deploy its Robotaxi vehicles in Phoenix, Arizona, following in the footsteps of market leader Waymo. Tesla has applied to conduct autonomous vehicle testing and operations, with and without human safety drivers on board, in Arizona, a spokesperson for the Arizona Department of Transportation told CNBC on Thursday. A decision on the application is expected at": 0.2,
  "Justice Department Won’t Seek Injunction for T-Mobile Acquisition of U.S. Cellular": 0.2,
  "Deere (DE) Outperforms Broader Market: What You Need to Know": 0.5,
  "ServiceNow (NOW) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "McDonald's (MCD) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Corrections & Amplifications": 0.0,
  "Prologis (PLD) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "Atlassian Stock Drops 9% as CEO Sheds Over $1.6 Million of Shares": -0.7,
  "Not sure if this is the best place but have a question on an IPO w/ warrants a company issued - I am trying to better understand what GOVX was offering. To me it appears that they offered an IPO at .65 USD per share w/ a 5 year warrant. My understanding is that this warrant can be exercised immediately so if the stock went to $1.00 the buyer could exercise that warrant for a": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On July 10, 2025, the Board of Directors of The Southern Company (“Southern Company”) appointed David P. Poroch, currently Comptroller of Southern Company, to serve as Executive Vice President and Chief Financial Officer of Southern Company, effective July 31, 2025. Mr. Poroch will succeed Daniel S. Tucker, who, on July 10, 2025, announced he will retire": 0.2,
  "50 percent tarifs on copper and 35 percent tariffs on Canada will suffocate US manufacturers - Global copper demand keeps rising because copper is essential for construction, electrical wiring, renewable energy, and electric vehicles. Many forecasts expect demand to double by 2035 as clean energy and electrification expand. The supply chain begins with mining in countries like Chile, Peru, China, the DRC, the U.S., and Canada. Companies like Freeport-McMoRan, Southern Copper, BHP, Rio Tinto, First": 0.2,
  "Altria Group’s Quarterly Earnings Preview: What You Need to Know": 0.2,
  "I feel silly buying at an all time high. - I'm currently in a decent enough position financially to start investing disposable income into the stock market, starting with a big lump sum sometime this month. I just feel weird about starting investing when companies are in an all time high. Not currently invested in stocks aside from my 401k. What my hope are for the future is that companies currently doing research in tech": 0.1,
  "Rothschild & Co Redburn Downgrades Applied Materials (AMAT) Stock to Neutral": -0.5,
  "Q1 Earnings Highs And Lows: ServiceNow (NYSE:NOW) Vs The Rest Of The Automation Software Stocks": 0.5,
  "Baird Resumes Coverage of Union Pacific (UNP) Stock With a Neutral Rating": 0.0,
  "2 Top Bargain Stocks Ready for a Bull Run": 0.8,
  "5 Growth Stocks to Buy and Hold Forever": 0.5,
  "10 Under-the-Radar Consumer Goods Stocks With Incredible Growth Potential": 0.8,
  "International Business Machines Corporation (IBM): I “Salute” Its CEO’s Wealth Creation Abilities, Says Jim Cramer": 0.6,
  "Lam Research Corp (LRCX): We Don’t Talk About It Enough, Says Jim Cramer": 0.2,
  "What Is Considered a Good Dividend Stock? 3 Healthcare Stocks That Fit the Bill": 0.5,
  "Eli Lilly Has Seized the Lead in Anti-Obesity Drugs. Next Up: a Pill.": 0.5,
  "The Best High Yield Medical Device Stock to Invest $1,000 in Right Now": 0.6,
  "The Zacks Analyst Blog Highlights NVIDIA, Walmart, Caterpillar, Seneca Foods and Waterstone": 0.5,
  "r/Stocks Daily Discussion & Fundamentals Friday Jul 11, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is": 0.2,
  "2 Top Stocks Down 16% and 17% This Year to Buy and Hold": 0.1,
  "IBM Launches Power11 Servers—Targeting the Future of AI and Hybrid Cloud": 0.8,
  "CFOs On the Move: Week ending July 11": 0.0,
  "3 Dirt-Cheap Value Stocks to Invest $1,000 in This July": 0.5,
  "5 Monster Stocks to Hold for the Next 5 Years": 0.5,
  "Liberty Specialty Markets enters UK HNW market": 0.5,
  "At its centennial, Caterpillar finds its growth is now led by powering data centers": 0.5,
  "Why the Business World Can’t Let Go of Landline Phones": 0.1,
  "Accenture, Microsoft partner to tackle cyber threats with AI": 0.6,
  "OnePay unveils new payment system with Mastercard for cross-border transfers": 0.5,
  "Buy These 5 Blue-Chip Stocks to Strengthen Your Portfolio in 2H25": 0.6,
  "The Future of Banking shifts and reflects on revenue growth as the rise of online banking and the shrinking of the brick-and-mortar store. - The Brick-and-mortar stores eat into traditional banks' profit margin, which reflects on their slow revenue growth compared to the rapidly growing Fintech banks such as SoFi. It is a sign of the times. SoFi's 24/7 One-Stop-Shop does everything that traditional banks do with a fraction of the overhead cost. The savings": 0.5,
  "4 Low-Beta Defensive Stocks to Buy as Rate Cut Uncertainty Continues": 0.2,
  "Stocks to watch this week: Goldman Sachs, Netflix, TSMC, ASML and Burberry": 0.0,
  "Top Growth Companies With Strong Insider Ownership July 2025": 0.5,
  "Latest News In AI Chips - AI Transforms Logistics With Innovative Supply Chain Solutions": 0.5,
  "What You Need to Know Ahead of Mastercard's Earnings Release": 0.1,
  "Dow Jones Futures Fall As Trump Sets 35% Canada Tariff, Eyes Higher Global Rate": -0.6,
  "Taking Profits. Anyone else? - Trying to get a vibe on what others are doing recently.. . Normally when I get on reddit and see nothing but posts about peoples gains it's time to sell. I've been taking profits and dumping them into my money market fund account recently. Currently sitting 22% of my portfolio in cash. I am DCAing some beaten down stocks like UNH, GOOGL, STZ, NVO, EQIX on the side as well.": 0.2,
  "Charles Schwab price target raised to $106 from $89 at Barclays": 0.5,
  "What to Expect From Automatic Data Processing's Q4 2025 Earnings Report": 0.1,
  "Accenture, Microsoft join forces to develop Gen AI cybersecurity tools": 0.5,
  "Shareholders Would Enjoy A Repeat Of McDonald's' (NYSE:MCD) Recent Growth In Returns": 0.6,
  "Does Accenture (NYSE:ACN) Deserve A Spot On Your Watchlist?": 0.2,
  "Here's Why You Should Add Cencora Stock to Your Portfolio Now": 0.6,
  "Here's Why Holding Southern Company Is Justified for Now": 0.5,
  "Constellation Energy Rises 51.7% in 3 Months: How to Play the Stock?": 0.6,
  "Industrial Logistics Properties Trust (ILPT) Soars 14.7%: Is Further Upside Left in the Stock?": 0.6,
  "The Walt Disney Company (DIS) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Looking for Stocks with Positive Earnings Momentum? Check Out These 2 Consumer Staples Names": 0.8,
  "Why Investors Need to Take Advantage of These 2 Computer and Technology Stocks Now": 0.5,
  "Procter & Gamble Company (The) (PG) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Here's Why Investors Should Give CSX Stock a Miss for Now": -0.8,
  "3 Top Dividend Stocks to Maximize Your Retirement Income": 0.5,
  "Behind Altria's Profit Resilience: The Power of Pricing Strategy": 0.5,
  "The PNC Financial Services Group (PNC) Q2 Earnings Preview: What You Should Know Beyond the Headline Estimates": 0.5,
  "Gear Up for Prologis (PLD) Q2 Earnings: Wall Street Estimates for Key Metrics": 0.2,
  "Cisco reveals 1 million share stake in hyperscale computing company CoreWeave - Cisco Systems (NASDAQ:CSCO) disclosed that it owns 1.06 million shares of hyperscale computing company CoreWeave (NASDAQ:CRWV), according to a filing with the Securities and Exchange Commission. CoreWeave launched its initial public offering (IPO) at the end of March at a price of $40 per share. Since then, its shares have more than tripled, hitting an all-time high of $183.58 on June 20, but": 0.8,
  "Trump posted: ‘The stock market is at an all-time high and interest rates should be cut immediately’! - Former U.S. President Donald Trump just posted heavy rhetoric on social media, praising tech, industrial stocks and cryptocurrencies for their big gains and strongly calling on the Federal Reserve to cut interest rates. Let's break down what he said and analyze the current state of the market with the latest data. Tech stocks, industrial stocks, Nasdaq hit": 0.6,
  "Brokers Suggest Investing in RTX (RTX): Read This Before Placing a Bet": 0.5,
  "Levi Sees Revenue Growth Offsetting Most of Tariff Impact": 0.6,
  "CoreWeave initiated, Texas Instruments upgraded: Wall Street's top analyst calls": 0.5,
  "Are You a Value Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Why This 1 Value Stock Could Be a Great Addition to Your Portfolio": 0.8,
  "Why Booking Holdings (BKNG) is a Top Growth Stock for the Long-Term": 0.6,
  "Why ServiceNow (NOW) is a Top Growth Stock for the Long-Term": 0.8,
  "Tucker Carlson Asks Dave Ramsey Why Credit Cards Are a Problem If You Pay Them Off — Ramsey Says, 'That's the Great Lie... Most People Don't'": 0.2,
  "Rise in NII & Fee Income to Aid PNC Financial's Q2 Earnings": 0.6,
  "Smart Money Going in Senior Health: Key Stocks in Elderly Care": 0.5,
  "US Judge drops anti-competitive lawsuit against Apple, Visa, Mastercard": 0.5,
  "Is It the Right Time to Retain SPG Stock in Your Portfolio Now?": 0.2,
  "ABBV or BMY: Which Biopharma Giant Has Better Prospects for Now?": 0.5,
  "Comerica Incorporated (CMA) Expected to Beat Earnings Estimates: Should You Buy?": 0.5,
  "The Charles Schwab Corporation (SCHW) Reports Next Week: Wall Street Expects Earnings Growth": 0.6,
  "If You Had Invested in Oil Stocks During the Gulf War in the 1990s, Here’s How Much You’d Have Today": 0.5,
  "Southern Company names comptroller as next finance chief": 0.2,
  "UnitedHealth vs. Cigna: Which Insurer to Buy Amid Sector Turmoil?": 0.2,
  "MKL Stock Trading at a Discount to Industry at 1.53X: Time to Hold?": 0.6,
  "Which Brokerage Stock Will Lead Tomorrow: Robinhood or Schwab?": 0.2,
  "AI chatbot’s simple ‘123456’ password risked exposing personal data of millions of McDonald’s job applicants": -0.8,
  "Trump just announced tariffs on Canada. How does this affect global investors? - That's right. ... Trump is back to “spicing things up” for Canada. On July 11, 2025, the U.S. formally announced that it would be raising tariffs on a range of Canadian goods, and global markets have already begun to react to the news. But what does this mean for us investors - whether we're trading, long-term holders, or have exposure to North": -0.6,
  "CMS proposes covering renal denervation for hypertension": 0.5,
  "Jim Cramer Says Boeing May Benefit as Tariffs Pressure Trade Partners": 0.5,
  "BP Says Low Oil Prices Are Hurting. Why the Stock Is Doing Better Than Exxon, Chevron.": 0.2,
  "Can Mastercard Stay Ahead in the Race Toward a Digital Wallet Future?": 0.5,
  "Raytheon from RTX Demonstrates Autonomous Barracuda Mine Neutralization Vehicle": 0.5,
  "Honeywell Explores Sale of Two Divisions Ahead of Planned 2026 Split": 0.5,
  "How are you able to tell if most of the trading volume is retail or institutional money? - I’ve read the news and also certain posts on investing subreddits say big money is cautious right now and most of the trading volume is retail, how would an individual investor that doesn’t have access to vast amounts of data or expensive Bloomberg terminals know that most volume is retail? Right now I’ve noticed volume lower than": -0.2,
  "Buy Texas Instruments Stock, TD Cowen Says. It’s the ‘Best Cycle Recovery’ Play.": 0.8,
  "Lockheed's Arm Secures a $198M Contract to Support Sonar Systems": 0.5,
  "Helen of Troy Q1 Earnings Fall Short of Estimates, Sales Dip Y/Y": -0.6,
  "This 3 Stock Portfolio Provides Monthly Income": 0.5,
  "HOOD Faces Legal Probe in Florida: Will Regulatory Woes Derail Growth?": -0.6,
  "Truist Reaffirms Buy on Deere (DE), Cites Brazil Market Expansion": 0.6,
  "Can NextEra Ride Florida's Economic Momentum for Long-Term Growth?": 0.5,
  "Why I'm Starting to Track Humanoid Robotics as a Long-Term Theme (and One ETF That's Structurally Interesting) I’ve been diving into the em - Humanoid robots robots that can walk, manipulate objects, interact with humans have been stuck in sci-fi and R&D labs for decades. That’s rapidly changing:**Tesla Optimus** is already performing warehouse tasks**China’s UBTech** delivered >1,000 units to factories**Xpeng** and **Agility Robotics** are testing models for last-mile delivery**Nvidia**, **Intel**, and **AMD** are providing the": 0.5,
  "Are You Looking for a High-Growth Dividend Stock?": 0.0,
  "As tech CEOs predict AI will replace humans in just 5 years, this Fortune 500 boss says taking the focus off real people is a ‘recipe for failure’": 0.5,
  "PepsiCo Nears Q2 Earnings: Is a Buy Warranted Before the Release?": 0.5,
  "CSCO vs. DELL: Which AI Enterprise Infrastructure Stock is a Buy?": 0.2,
  "What Makes The Charles Schwab Corporation (SCHW) a Strong Momentum Stock: Buy Now?": 0.6,
  "Walgreens shareholders approve $10 billion private equity buyout": 0.5,
  "Will Pfizer (PFE) Beat Estimates Again in Its Next Earnings Report?": 0.5,
  "Chevron says offshore well start-up caused Mars crude quality issues": -0.3,
  "Snap-on Gears Up for Q2 Earnings: What Lies Ahead for the Stock?": 0.5,
  "Trump Keeps Pushing Powell to Lower Interest Rates. It Could Backfire.": -0.6,
  "Netflix gets a bullish call, AMC & Texas Instruments upgraded": 0.8,
  "Nvidia and Other Big Tech Stocks That Are Cheaper Than You Might Think": 0.5,
  "Equity Markets Mostly Fall Intraday as Traders Track Tariff Updates": -0.5,
  "Why Nike Stock Dropped on Friday": -0.5,
  "Sector Update: Health Care Stocks Slide Friday Afternoon": -0.5,
  "Sector Update: Energy Stocks Gain Friday Afternoon": 0.5,
  "Why do Delisted Stocks continue to move and how do you buy them? - So I’ve seen a number of stocks that get delisted from the NYSE but continue moving I’ve assumed they become OTC. Recent example is SBNY. This morning it went from about .011 per share to .7 and every few months it fluctuates like that. It’ll drop off to .01 or less then shoot back up to about .7 then hover between": 0.2,
  "Market Chatter: Lockheed Martin Could See More F-35A Orders Under Senate Defense Funding Proposal": 0.5,
  "Marc Benioff says AI is radically reshaping Salesforce, and 51% of Q1 hiring was internal as thousands of employees were redeployed": 0.5,
  "Why Bristol-Myers Squibb (BMY) Shares Are Sliding Today": -0.5,
  "U.S. Physical Therapy, Evolent Health, Charles River Laboratories, Moderna, and Intuitive Surgical Shares Are Falling, What You Need To Know": -0.5,
  "Guardant Health, Gilead Sciences, Inspire Medical Systems, Enovis, and AMN Healthcare Services Stocks Trade Down, What You Need To Know": -0.5,
  "Why Owens & Minor (OMI) Shares Are Sliding Today": -0.5,
  "Tandem Diabetes, Solventum, LeMaitre, UFP Technologies, and Artivion Stocks Trade Down, What You Need To Know": -0.5,
  "Equity Markets Lower After US Treasury Budget Surplus in June": -0.5,
  "How Apple's 'consumer-first' approach plays into the AI race": 0.5,
  "Sector Update: Health Care Stocks Retreat Late Afternoon": -0.5,
  "JPMorgan plans to charge fintechs for customer data, Bloomberg News reports": -0.5,
  "Why FuboTV Stock Skyrocketed 206% in the First Half of the Year": 0.8,
  "Sector Update: Energy Stocks Gain Late Afternoon": 0.5,
  "Wayfair, Sabre, MongoDB, ServiceNow, and Asana Shares Are Falling, What You Need To Know": -0.5,
  "Oxford Industries, PENN Entertainment, American Airlines, United Airlines, and Atlassian Shares Plummet, What You Need To Know": -0.6,
  "Levi CFO Sees Revenue Growth Offsetting Tariff Impact": 0.5,
  "Hegseth’s Vow to Unleash American Dominance Lifts Drone Stocks": 0.6,
  "Stock got delisted today from major stock exchange - 👋 I own RDUS recycling stock. Quite a few shares but I noticed today it got delisted ?! If I want to sell, how can I do that? Will the stock be listed again? I am so confused never happened to my portfolio before.": -0.6,
  "Equity Markets Close Lower as Trade Tensions Escalate": -0.8,
  "Air India crash probe reveals pilot cut fuel flow to engines": -0.8,
  "Big pharma's multiple looming patent cliffs: What to know": -0.5,
  "Shuffle Board: Funko Replaces CEO, Madewell Exec Joins Parker Thatch": 0.1,
  "Thoughts on Block, $XYZ, and other fintechs, in light of JPM plan to charge for data. - JPM announced today a plan to charge significant fees for data that fintech companies like Block need for their platforms. A court case is currently pending regarding Biden regulation, Open Banking Rule 1033, which stated such information would be free to access, if the customer permits it. Trump administration has abandoned the rule, and is siding with JPM,": -0.6,
  "US FCC approves two T-Mobile deals after wireless carrier drops DEI programs": -0.5,
  "Wall Street Retreats as Investors Monitor Tariffs Updates, Bank Earnings Loom": -0.5,
  "JPMorgan Tells Fintechs to Pay Up for Customer Data Access": -0.5,
  "Cisco Systems (CSCO) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "Qualcomm (QCOM) Suffers a Larger Drop Than the General Market: Key Insights": -0.5,
  "Why IBM (IBM) Dipped More Than Broader Market Today": -0.5,
  "Amgen (AMGN) Falls More Steeply Than Broader Market: What Investors Need to Know": -0.5,
  "Why Comcast (CMCSA) Dipped More Than Broader Market Today": -0.5,
  "Why Intuitive Surgical, Inc. (ISRG) Dipped More Than Broader Market Today": -0.5,
  "MasterCard (MA) Dips More Than Broader Market: What You Should Know": -0.2,
  "United Parcel Service (UPS) Declines More Than Market: Some Information for Investors": -0.5,
  "Apple Offers as Much as $150 Million for Formula One U.S. Rights": 0.5,
  "The Trump Administration appears to be preparing to reschedule cannabis from schedule 1 to 3 - So if you've been following weed stocks at all you likely know that they've been absolutely in the dumps for the past 4.5 years, dropping 95%+ from the ATHs that they set shortly after the 2020 election where Democrats promised to enact cannabis reforms which never materialized. The closest that they got was when Biden initiated the scheduling review": 0.2,
  "Earnings season, CPI data, Fed commentary: What to Watch": 0.0,
  "Just How Bad Is the Art Market’s Case of the Blues?": -0.5,
  "TD Cowen Reaffirms Buy on Uniti Group Inc. (UNIT) with a $9 Target": 0.6,
  "Q2 Earnings Season Setup Remains Favorable: Big Bank Results Loom": 0.6,
  "Extended trading - Only recently have I done a few trades after close so please forgive my ignorance. Today I happened to notice that Goldman Sachs briefly dipped 10% during extended hours and then quickly returning to its earlier day close. During the 10minute span that I saw( could have been longer) I tried to take advantage but order was not filled despite a generous limit price. Does a retail investor even have a chance": -0.5,
  "Philip Morris U.S. launches national advertising campaign": 0.2,
  "Lump sump vs swing trading over years for growth stock - I thought it would be smart to learn swing trading by analyzing technical chart (MACross, MACD lines), it looks good in short trend but in long trend, it seems it cannot beat just put all money (lump sump) in the beginning and forget about it. For example: assume I invested $10 000 to NVDA stock in beginning of 2020, after 5 years, it gained": 0.1,
  "Best Stock to Buy Right Now: Constellation Brands vs. Altria": 0.5,
  "2 Tariff-Proof Stocks to Buy as Trump Threatens 70% Tariffs": -0.6,
  "The Best Stocks to Invest $1,000 in Right Now": 0.5,
  "This Magnificent Semiconductor Stock Has Shot Up 60% in 3 Months. It Can Still Soar Higher.": 0.8,
  "What to expect from legacy media stocks as Q2 earnings season is set to start": 0.2,
  "Rezolve AI (RZLV) Launches Global Professional Services Division for AI Growth": 0.5,
  "With 89% ownership of the shares, Analog Devices, Inc. (NASDAQ:ADI) is heavily dominated by institutional owners": 0.2,
  "With 88% ownership of the shares, Texas Instruments Incorporated (NASDAQ:TXN) is heavily dominated by institutional owners": 0.2,
  "Urban Outfitters, Micron Lead 5 Stocks Near Buy Points As Earnings Season Nears": 0.5,
  "Five Themes for Investors to Watch as Earnings Season Kicks Off": 0.5,
  "Fuel Switches Played a Role in the Boeing 787 Air India Crash. More Details Are Still to Come.": -0.5,
  "FDA willing to trade faster drug reviews for lower prices, Bloomberg reports": 0.2,
  "CoreWeave initiated, Texas Instruments upgraded: Wall Street’s top analyst calls": 0.5,
  "CMS decision opens ‘massive’ patient pool for Medtronic, says BTIG": 0.6,
  "Trump Tax Law Quietly Takes Aim at Popular Perk: Office Snacks": -0.5,
  "Jim Cramer on AT&T: “This Thing is a Really Good Situation”": 0.8,
  "Home Depot’s (HD) $5.5B GMS Acquisition Solidifies Bullish Analyst Confidence": 0.8,
  "r/Stocks Weekly Thread on Meme Stocks Saturday - Jul 12, 2025 - The meme stock scheduled posts will now run weekly and post Saturday afternoon and won't be a sticky; you're probably seeing this because automod sent you here! [Full list of meme stocks here.](https://www.reddit.com/r/stocks/wiki/meme-stocks) This will be updated every once in a while. ------ Welcome traders who just can't help them selves discuss the same exact stock that's been discussed 100s of times a": 0.1,
  "That’s a Wrap on Prime Day. What the Numbers Show.": 0.0,
  "What's to stop the markets from climbing? - Caught a little of Stephanie Link (ultra-bull) yesterday on a Pod Cast. She said don't be surprised to see earnings be better than expected. After I heard that, I had lunch with a financial advisor, and I asked him what he thought of the markets despite all the talk that they're overbought. He agreed with Stephanie in that earnings should be good because who's really going to": 0.6,
  "Southern (NYSE:SO) Appoints New CFO as Daniel S. Tucker Announces Retirement": 0.2,
  "Atlassian (NasdaqGS:TEAM) Reports Q3 Net Loss Of US$71 Million": -0.5,
  "ChatGPT hit 100M users ~3 years ago. Google search shows no decline $GOOG - Almost every day I read about how search is dead, but AFAICT the metrics show the complete opposite story - search revenue is in fact growing faster than it was back then. Even apples data point was quickly disproven; Apple exec noted *safari* searches dipped; NOT Google queries from iOS devices. This could be due to safari losing market share to": 0.5,
  "Eli Lilly and Company (LLY): I Would “Love” If Trump Praised The Company, Says Jim Cramer": 0.6,
  "Novo Nordisk A/S (NVO): “Canada’s A Backdoor,” Says Jim Cramer": 0.1,
  "Verona Pharma plc (VRNA): Jim Cramer Approves The Merck Acquisition": 0.5,
  "Merck & Co., Inc. (MRK)’s CEO Thinks He’s Got $50 Billion Of New Drugs, Says Jim Cramer": 0.5,
  "Caterpillar Inc. (CAT): “You’re Making A Lot Of Money” If You’re Involved In AI Build Out, Says Jim Cramer": 0.6,
  "The Walt Disney Company (DIS) “Has Just Continued To Be Right,” Says Jim Cramer": 0.8,
  "ServiceNow, Inc. (NOW) Is Competing With The Rise Of AI, Says Jim Cramer": 0.2,
  "Salesforce, Inc. (CRM) Is Competing With The Rise Of AI, Says Jim Cramer": 0.2,
  "UnitedHealth Group Incorporated (UNH): “Medicare Fraud Is Prison,” Warns Jim Cramer": -0.5,
  "'Magnificent 7' check-in: Why these 3 names might not 'belong'": -0.5,
  "Why Shares in UPS Declined by 20% in the First Half of 2025": -0.5,
  "(Boeing) Engine fuel supply was cut just before Air India jet crash, preliminary report says - >A cut in the fuel supply to the engines caused last month’s Air India crash that killed 260 people, a preliminary report has found. >The London-bound plane had barely left the runway at Ahmedabad airport when it hurtled back to earth. Everyone on board was killed, except for one passenger. >According to the report by India’s Aircraft Accident Investigation": -0.8,
  "Is Costco Stock Worth Buying at $1,000?": 0.2,
  "Amazon Prime Day 2025 racks up record sales figures, company says": 0.8,
  "Mexico Sure It Will Strike Deal With US to Skirt Tariffs - https://www.bloomberg.com/news/articles/2025-07-12/mexico-is-in-talks-to-avoid-trump-s-latest-tariff-threat * Mexican President Claudia Sheinbaum said her team had begun discussions with the US and was confident Mexico would get a deal to fend off new tariffs. * Mexico and the US established a new binational working group to address security, migration, and economic issues, including finding an alternative to the tariffs. * President Donald Trump threatened to impose 30% tariffs on": 0.6,
  "Allegion : what am I missing ? (ALLE, ASSA-B, DOKA) - Hello, It seems to me that nobody cares about Allegion. Please tell why you haven't bought it or why you wouldn't. I already made a post elsewhere and nobody answered. In this post I also speak about major competitors Assa Abloy and Dormakaba # Allegion (ALLE) Allegion is a lock, (automatic) door and anti-fire window manufacturer. It also made investments in various technology start-ups": 0.1,
  "5 Most Valuable ‘Error Coins’ Ever Minted — Look for These Misprints": 0.5,
  "Which 100bn stock is most likely to become a trillion dollar stock (if at all)? - For example companies in this RANGE (75-125BN) include PANW / CRWD / FTNT (Cyber sec) CDNS / SNPS / KLAC (Semis) MELI / SE (EM e-commerce/ fintech) ISRG HOOD APP Not saying I think any of the above will, but just some off the top of my head who are in this range. Or if you have any to": 0.1,
  "Truist Increases PT on Bank of America to $53, Maintains Buy Rating On the Stock": 0.6,
  "Barclays Loweres PT on Aon plc Stock to $401, Maintains Overweight Rating": 0.5,
  "Coca-Cola To Releases Q2 2025 Financial Results on July 22, Analysts Expects Earnings Around $0.84": 0.5,
  "Deluxe Corporation (DLX) Announces Strategic Partnership With Chargent": 0.5,
  "Deutsche Bank Initiates Coverage of Micron Technology (MU) stock with Buy Rating": 0.8,
  "Danaher (DHR) Teams Up to Advance Precision Medicine Diagnostics": 0.5,
  "DA Davidson Reaffirms Buy on Adobe (ADBE) After Figma’s S-1 Filing": 0.6,
  "Morgan Stanley Keeps Buy Rating on S&P Global (SPGI), Raises PT": 0.6,
  "FDA Approves Intuitive Surgical’s (ISRG) New Vessel Sealer Tool": 0.5,
  "BTIG Raises PT for Booking Holdings (BKNG), Keeps Buy Rating": 0.6,
  "Raymond James Raises Charles Schwab PT, Keeps Outperform Rating": 0.5,
  "Scotiabank Upgrades Thermo Fisher (TMO) to Outperform, Lowers PT": 0.2,
  "Pfizer (PFE) Reports XTANDI Shows Life-Extending Benefits": 0.8,
  "Baird Increases Micron (MU) PT, Keeps Outperform Rating": 0.6,
  "Have $500? 3 Absurdly Cheap Stocks Long-Term Investors Should Buy Right Now.": 0.5,
  "Is United Parcel Service Stock a Buy Now?": 0.2,
  "Will Trump’s 200% tariff threat on pharma really materialize?": -0.5,
  "Trump's FTC Chairman Is Becoming MAGA’s Answer to Lina Khan": 0.2,
  "Southern Company Is One of the Largest Utilities Companies by Market Cap. But Is It a Buy?": 0.2,
  "Could diffusion models become YouTube and Meta’s next growth drivers?": 0.5,
  "Here's Why We Think Abbott Laboratories (NYSE:ABT) Is Well Worth Watching": 0.6,
  "Trump Says 200% Pharma Tariffs Are Coming. Wall Street Shrugs.": 0.1,
  "Powell's ouster 'one of the biggest underestimated event risks in the coming months - U.S. President Donald Trump's potential removal of Federal Reserve Chairman Jerome Powell could lead to a ‘meltdown’ in currency and bond markets and a spike in inflation expectations, Deutsche Bank said on Friday. Earlier this week, Russell Vought, director of the U.S. Office of Management and Budget, accused Powell of ‘gross’ mismanagement of the Fed and said renovations to the Fed's": -0.7,
  "Why Target Tumbled 27% in the First Half of 2025": -0.5,
  "Inflation data, big bank earnings, and Netflix results: What to watch this week": 0.5,
  "Big Banks, Netflix, Pepsico, GE Aerospace: Earnings this week": 0.0,
  "Where have all the dividends gone?!": -0.6,
  "When Should You Buy NIKE, Inc. (NYSE:NKE)?": 0.2,
  "Salesforce, Inc. (NYSE:CRM) Shares Could Be 28% Below Their Intrinsic Value Estimate": -0.7,
  "Drone Stocks are the Next Big Thing - Secretary of Defense, Hegseth’s drone dominance orders are favoring drone stocks and is a clear no brainer. The order removed prior DOD policies from 2021 and 2022 that restricted the U.S. military from buying drones and components made by Chinese companies. It also assigns to combat units authority to buy, test and train with small UAS drones that comply with statutes, according to reports. \"While our adversaries": 0.6,
  "U.S. Market No Longer the Only Game in Town? Global Flows Say So - Despite U.S. equities hitting all-time highs, global capital rotation suggests the U.S. exceptionalism narrative is losing momentum with investors increasingly looking to Europe and emerging markets U.S. Equity Inflows Cooling Off Offshorelisted U.S. focused ETFs saw $4.7B in net outflows over the past 20 weeks with 11 outflow weeks during that stretch This marks a shift from the $160B in inflows": -0.6,
  "Prediction: Taiwan Semiconductor Manufacturing Stock Is the Safest AI Chip Bet": 0.8,
  "At 45, I'm on track for comfortable retirement — but I’m gripped with regret over the money I haven't saved": -0.6,
  "OKLO futures and price point - I sold some LEAP puts on OKLO (DEC 2027) taking advantage of the no cost margin impact on my account. I have 2 \"in the money\" options at $45 ($22 / share cost if called) and one at $55 (27 / share if called). I was curious what people's thoughts were on closing the $45 price points for the current profit I have and re-opening at possibly $65 point": 0.6,
  "Wells Fargo, Citi, Netflix, J&J, and More Stocks to Watch This Week": 0.5,
  "Is Target Corporation (TGT) a Strong Buy for Passive Income?": 0.5,
  "How Reliable Is Colgate-Palmolive Company (CL) for Long-Term Dividend Income?": 0.1,
  "Can Bristol-Myers Squibb Company (BMY) Provide Stable Long-Term Income?": 0.2,
  "Can McDonald’s Corporation (MCD) Keep Serving Up Dividend Growth?": 0.2,
  "Is Chevron Corporation (CVX) One of the Best Energy Stocks for Passive Income Investors?": 0.5,
  "Is The Coca-Cola Company (KO) a Timeless Passive Income Stock?": 0.2,
  "Mobileye (MBLY) Slashes 15.5% on Intel Corp. Unloads $900-Million Stake": -0.8,
  "D-Wave Quantum (QBTS) Loses 11.8% as 2 Tech Giants Could Threaten its Competitive Edge": -0.8,
  "Stock Market Week Ahead: Blue Chips, Big Banks, GE Aerospace And Netflix Launch Q2, Congress Mulls Cryptos": 0.2,
  "Superman Leads Blockbuster Summer Box Office Weekend": 0.8,
  "Goldman Sachs Starts Coverage on Lam Research (LRCX) Stock, Gives Buy": 0.6,
  "Goldman Sachs Begins Coverage on Applied Materials (AMAT) Stock With Buy Rating": 0.8,
  "Goldman Sachs Begins Coverage of Analog Devices (ADI) Stock, Gives Buy": 0.8,
  "TD Cowen Upgrades Texas Instruments (TXN) Stock to Buy": 0.8,
  "Here’s the net worth you need to be in the top 10% of Americans — why it’s a lot higher than you might think": 0.5,
  "China Biotech’s Stunning Advance Is Changing the World’s Drug Pipeline": 0.8,
  "From Boarding Pass to Cash Stack: $YOU’s Identity Play Has Legs - What's up my fellow midcap misfits! Today I bring to your attention the airport fast lane turned public equity: Clear Secure **Ticker:** $YOU **$$$ Scroll to the end if you want the ADHD Portfolio Manager's Cliff Notes $$$** YOU has been quietly cashing checks while everyone's been distracted by NVDA vs. ARM cage matches. Im talking real profits, government-grade access, and a fat": 0.6,
  "Why do I feel like this is such an opportunity? ENVX - Really like this company at its current price, $14.07. I love start ups with potential for literally billions of customers (why I bought 1100 shares of ASTS in 2023 for about $2.60 each) I did about 11 hours of DD this weekend on about 20 stocks and this is the only one that has peaked my interest. I’m new to the battery market": 0.8,
  "Late Lakers Owner Jerry Buss' Empire Started With Him Buying A Building In West LA For $1,000-His Daughter Just Sold The Team For $10 Billion": 0.8,
  "(Item 1.01) . Entry into a Material Definitive Agreement. On July 13, 2025, Becton, Dickinson and Company, a New Jersey corporation (the “ Company ” or “ BD ”), entered into definitive agreements with Waters Corporation, a Delaware corporation (“ Waters ”), pursuant to which the Company’s Biosciences and Diagnostic Solutions business (the “ Biosciences and Diagnostic Solutions Business ”) will be combined with Waters in a Reverse Morris Trust transaction. As a result of the transaction,\n\n(Item 1.01) by reference. The Merger Agreement The Merger Agreement provides that, immediately following the Spin-Off, SpinCo will merge with Merger Sub and become a wholly owned subsidiary of Waters. In the Merger, each share of SpinCo Common Stock outstanding will automatically be converted into the right to receive a number of shares of common stock of Waters equal to an exchange ratio calculated such that following the Merger, former holders of SpinCo Common Stock will own,\n\n(Item 1.01) by reference. * * * The above descriptions of each of the Separation Agreement and the Merger Agreement have been included to provide investors and security holders with information regarding the terms of each of the Separation Agreement and the Merger Agreement. They are not intended to provide any other factual information about the Company, SpinCo, Waters, Merger Sub or their respective subsidiaries and affiliates, or any of their respective businesses. The Merger Agreement contains": 0.1,
  "Prime Day 2025 U.S. retailers drove $24.1 billion in online spend, up 30.3% from 2024, according to new data from Adobe - July 12 (Reuters) - Online spending soared $24.1 billion across U.S. retailers during the stretch from July 8 to 11 – dubbed \"Black Friday in Summer\", outpacing Adobe Analytics' prior forecast, as eager shoppers rushed to snap up deep discounts on back-to-school essentials. Retailers recorded online sales growth of 30.3% during events that": 0.8,
  "Q1 Earnings Roundup: Union Pacific (NYSE:UNP) And The Rest Of The Transportation and Logistics Segment": 0.0,
  "Similar to Los Alamos in 1940s, Los Lunas getting transformed by tech": 0.5,
  "MCoBeauty Is Bringing Its Dupes to Europe, Rolling Out Across the U.K. at Superdrug": 0.5,
  "Intel (INTC): Buy, Sell, or Hold Post Q1 Earnings?": 0.0,
  "1 Cash-Heavy Stock with Promising Prospects and 2 to Ignore": 0.5,
  "2 Cash-Producing Stocks to Target This Week and 1 to Question": 0.2,
  "2 Large-Cap Stocks Worth Your Attention and 1 to Brush Off": 0.2,
  "1 Surging  Stock to Keep an Eye On and 2 to Turn Down": 0.2,
  "Malaysia Controls AI Chip Exports as US Targets China Smuggling": 0.1,
  "Tesla, Circle, and 6 Other Stocks to Short, According to J.P. Morgan": -0.6,
  "apple to buy mistral, apple lost? - \\[edit: to the MANY DOWNVOTERS, ok if you disagree but let us know why, thx\\]; pls no debate about mistral, or if you like them, if they are good, if we should support eu more and blabla; my point is mistral is the last ai company a company with trillions on the bank should buy; so is apple running out of options? if yes why? do the top-tier": -0.5,
  "GSK seeks FDA nod for expanded use of RSV vaccine in adults": 0.5,
  "Coca-Cola Is a Great Company, But I Think This Stock Is a Better Investment": 0.5,
  "What to Expect From Bristol-Myers Squibb's Q2 2025 Earnings Report": 0.2,
  "Earnings Preview: What To Expect From Comcast's Report": 0.5,
  "Bitcoin’s Mysterious Creator Is (Almost) the World’s 10th Richest Person": 0.6,
  "Big banks are trying to put Trump tariff tumult in their rear-view mirror": 0.5,
  "Why i hold UNH while reducing positions on other stocks - From April to July 2025, institutions were quietly accumulating **UnitedHealth (UNH)** adding **\\~12 million shares** and increasing portfolio allocation by **\\~34%**. We're talking **Vanguard (+8M)** and **BlackRock (+2.3M)** At the same time, due to market uncertainty, filings show many funds were trimming **TSLA, NVDA, and even AAPL**, yet UNH got more love. Then in June? A **$6.2M LEAPS call sweep** (Dec 2025, $290 strike).": 0.8,
  "My 3 Top Stocks to Buy in a Market That's Highly Volatile (Again)": 0.5,
  "Billionaire Warren Buffett Owns These 3 Quantum Computing Stocks. Should You?": 0.5,
  "Chevron identifies zinc contamination in Mars crude, leading to disrupted supply": -0.6,
  "Apple doesn’t threaten Visa, Mastercard, judge rules": 0.2,
  "Here is Why Hess Corporation (HES) Gained This Week": 0.5,
  "FedEx Network 2.0: Tracking closures, layoffs across the US": -0.6,
  "Target to open 8 new stores this summer": 0.5,
  "Tesla stock needs 'Elon Musk magic,' expert says": 0.5,
  "Trump's spending bill will likely boost costs for insurers, shrink Medicaid coverage": -0.7,
  "Warren Buffett Has $65.8 Billion Invested in These 4 Artificial Intelligence (AI) Stocks. Here's the Best of the Bunch.": 0.5,
  "Should You Invest in the Strive U.S. Energy ETF (DRLL)?": 0.2,
  "Should You Invest in the iShares U.S. Insurance ETF (IAK)?": 0.2,
  "Should You Invest in the VanEck Agribusiness ETF (MOO)?": 0.2,
  "Should First Trust Value Line Dividend ETF (FVD) Be on Your Investing Radar?": 0.5,
  "Should SPDR Russell 1000 Low Volatility Focus ETF (ONEV) Be on Your Investing Radar?": 0.5,
  "Tylenol maker Kenvue ousts CEO amid board's strategic review": -0.5,
  "Calculating The Intrinsic Value Of CSX Corporation (NASDAQ:CSX)": 0.0,
  "Tariffs, Earnings Season Blunt Wall Street Pre-Bell; Asia Mixed, Europe Off": -0.5,
  "Tariff threats, Bitcoin surges, inflation data: 3 things": 0.2,
  "This Week In AI Chips - Decentralized AI Cloud Initiative Transforming Global Infrastructure": 0.5,
  "Silver jumps, Boeing higher, Lionsgate possible takeover: Trending Tickers": 0.5,
  "Target’s Roundel powers up offsite campaigns with AI-driven analysis": 0.5,
  "Stocks Decline Pre-Bell Amid Tariff Tensions; Investors Await Inflation Data, Earnings": -0.5,
  "Kenvue CEO Mongon leaves the consumer health company as it continues its strategic review": 0.1,
  "These Were the 2 Worst-Performing Stocks in the Dow Jones Industrial Average in June 2025": -0.7,
  "CoreWeave Data Center to Double City’s Power Needs as AI Strains US Supply": -0.5,
  "Why Reebok’s founder is taking on the new footwear trade war": 0.1,
  "7 Stocks' Earnings Growth Is About To Go Gangbusters": 0.8,
  "Ferrara holding company in talks to buy French confectioner CPK": 0.5,
  "Chevron Blames Offshore Well Start-Up for Mars Crude Quality Issues": -0.5,
  "Mexico retailers poised for Q2 bump despite inflation rebound": 0.5,
  "Nike lines up new Converse CEO amid lacklustre performance": -0.5,
  "India Coke bottler Kandhari expands with Wave Beverages acquisition": 0.5,
  "Redburn Rothschild Downgrades Adobe Inc. (ADBE) to ‘Neutral’ Rating; Lowers Price Target": -0.7,
  "Mizuho Securities Maintains ‘Outperform’ Rating on Micron Technology, Inc. (MU); Raises PT": 0.8,
  "Ozark Trail Bottles Recalled After Reports of Vision Loss; Walmart Issues Full Refund": -0.6,
  "Jefferies Maintains ‘Buy’ Rating on CVS Health Corporation (CVS); Raises PT": 0.6,
  "Hospital Capex Headwind: Temporary Setback or Lasting Risk for ISRG?": 0.1,
  "ABT to Report Q2 Earnings: CGM and Cardiac Devices in Focus": 0.5,
  "Caterpillar Is 1 of the Largest Industrials Companies by Market Cap. But Is It a Buy?": 0.5,
  "If You Invested $1000 in Booking Holdings a Decade Ago, This is How Much It'd Be Worth Now": 0.5,
  "Top Billionaire Tech Insiders Shed Billions in 2025 Sell-Off": -0.7,
  "ASML Likely to Beat Q2 Earnings Estimates: How to Play the Stock?": 0.5,
  "Biotech Stocks Are Ready to Rebound. Gilead Sciences and 2 More to Watch Now.": 0.8,
  "Walmart's Omnichannel Strategy: Core Catalyst Behind E-Commerce Surge": 0.6,
  "How to retire in 10 short years no matter where you live in America — even if you’re starting with $0 savings": 0.5,
  "Can IonQ Stock Hit $55 in 2025?": 0.2,
  "Investors Heavily Search Pfizer Inc. (PFE): Here is What You Need to Know": 0.5,
  "Target Corporation (TGT) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Why Investors Need to Take Advantage of These 2 Retail-Wholesale Stocks Now": 0.5,
  "The Home Depot, Inc. (HD) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Investors Heavily Search Intel Corporation (INTC): Here is What You Need to Know": 0.5,
  "Investors Heavily Search Eli Lilly and Company (LLY): Here is What You Need to Know": 0.5,
  "Investors in Honeywell International (NASDAQ:HON) have seen decent returns of 70% over the past five years": 0.8,
  "Take the Zacks Approach to Beat the Markets: Amarin, Mogo, 3M in Focus": 0.5,
  "Reebok founder on Trump tariffs: It's virtually impossible to make sneakers in US": -0.5,
  "Are Options Traders Betting on a Big Move in Thermo Fisher Stock?": 0.2,
  "Countdown to Abbott (ABT) Q2 Earnings: A Look at Estimates Beyond Revenue and EPS": 0.5,
  "U.S. Bancorp (USB) Q2 Earnings on the Horizon: Analysts' Insights on Key Performance Measures": 0.2,
  "Elevance Health (ELV) Q2 Earnings Preview: What You Should Know Beyond the Headline Estimates": 0.5,
  "Inside the World of Superyachts. Read Our Conversation With a Yacht Lending Exec.": 0.5,
  "Cigna Group's Q2 2025 Earnings: What to Expect": 0.0,
  "Will ALD and Etch Deal Wins Anchor LRCX's Systems Revenue Growth?": 0.2,
  "Stocks Rise, Trump Speaks Out, Cryptocurrencies Surge - What Happened Today? Folks, it's been another restless Monday. - Just before the U.S. stock market opens, several key stocks and sectors are getting restless: Top U.S. Stocks Pre-Market Movers for July 14th: Tesla (TSLA) up over 1% Boeing (BA) also up about 1% Cryptocurrency Concepts Are Taking Off Azure (NIO) surges about 5% as new energy vehicles heat up again Meanwhile, Trump is on Truth Social": 0.5,
  "What to Expect From Southern Company's Q2 2025 Earnings Report": 0.0,
  "HSBC: USD Selling Looks Like a Bubble Bottom May Be Near? - HSBC just dropped a note saying the relentless dollar selling is starting to look like an \"anti-bubble.\" Basically, everyone's been piling on the short side so hard this year that it might be time for a bottom. The dollar's down about 8% so far, driven by messy US policies and tariffs that have really rattled its safe-haven cred. HSBC thinks this one-sided bearish": 0.2,
  "Pre-market overview for 14 July 2025 - Markets are weak this morning with Dow futures down over 100 points after Trump announced reciprocal 30% tariffs on the EU and Mexico. Sentiment is somewhat volatile ahead of second quarter earnings and tomorrow CPI data However some stocks are showing relative strength despite headline pressure TSLA +1.3% premarket Musk teased an epic reveal before the end of the year after leaving Tesla design studio typical Elon spark": 0.2,
  "Netflix Stock Price Levels to Watch as Earnings Report Set for Thursday": 0.1,
  "Sector Update: Energy Stocks Lean Lower Premarket Monday": -0.5,
  "4 Resilient Consumer Product Stocks to Watch Amid Market Challenges": 0.5,
  "Rivian downgraded, PayPal upgraded: Wall Street's top analyst calls": 0.2,
  "Zimmer to acquire Monogram Technologies for $177 million, boosting robotics portfolio": 0.8,
  "Adobe (ADBE) Loses 7.2% in 4 Weeks, Here's Why a Trend Reversal May be Around the Corner": -0.5,
  "Save the Date: 5th Palm Beach CorpGov Forum Nov 5-6": 0.2,
  "Intel vs. Qualcomm: Which Chipmaker is Better Poised for Mobile & 5G?": 0.5,
  "Are Consumer Staples Stocks Lagging  Altria Group (MO) This Year?": 0.1,
  "Is Agenus (AGEN) Stock Outpacing Its Medical Peers This Year?": 0.5,
  "Asian stocks steady amid Trump's new tariff measures, China stocks rise on strong trade data; Wall Street futures fall - Asian stocks were mostly steady on Monday as investors reacted to new trade tariffs announced by U.S. President Donald Trump, while Chinese shares rose on strong June trade data. Heightened global trade friction also weighed on market sentiment as U.S. President Donald Trump imposed 30 percent tariffs on imports from the European Union and Mexico": -0.5,
  "Salesforce Seen Gaining Strategic Edge With Informatica Acquisition, RBC Says": 0.8,
  "Amgen (AMGN) is a Top-Ranked Growth Stock: Should You Buy?": 0.6,
  "Here's Why Yum Brands (YUM) is a Strong Growth Stock": 0.8,
  "AT&T vs. Comcast: Which Telecom Stock is a Better Buy Right Now?": 0.5,
  "Apple Faces Calls to Reboot AI Strategy With Shares Slumping": -0.5,
  "EU issues tough warning of countermeasures if US-EU trade talks break down - will markets falter? - Background Sorting: Trade tensions between the US and Europe have heated up again over the past two weeks. Despite the departure of the Biden administration, Trump reinstated some of the tariffs on Europe prior to his campaign, particularly related to automobiles, precision manufacturing equipment and green energy products. Today, EU Vice-President Sefcovic made it clear that if negotiations": -0.6,
  "RTX's Raytheon Unit Secures a Contract to Aid RAM GMLS Program": 0.5,
  "Intel Stock Falls as It Cuts Thousands of Jobs. It Faces These Big Questions.": -0.6,
  "Why the S&P 500 could reach 10,000": 0.5,
  "Big Week of Inflation Data, Q2 Earnings Reports": 0.2,
  "Alphabet (GOOGL) Seals $2.4B Windsurf Deal to Fuel AI Coding Race": 0.5,
  "FDA Accepts GSK Filing for Expanded Use of RSV Shot in Younger Adults": 0.5,
  "Morgan Stanley, Goldman to Settle Lawsuit Over Archegos Trades": 0.5,
  "MRK's Buyout Spree to Broaden Product Portfolio: Can it Aid Growth?": 0.5,
  "The future of film. Netflix or some other company? - Netflix has announced that they will begin showing AI generated ads in 2026. It's pretty clear what happens from there. What starts as 15-30 second AI-generated advertisements shown in the middle of your favorite TV series eventually evolves into 40-50 minute AI-generated episodes that *become* your new favorite TV series. At some point in the not too distant future, and perhaps sooner than you think,": 0.2,
  "Netflix Investors Factoring in Upbeat Q2 Earnings, Wedbush Says": 0.6,
  "Update: Market Chatter: Lockheed Martin May Get More F-35A Orders Under Senate Funding Proposal": 0.5,
  "Energy Is Taking a Hit Today. Oil Prices Are Lower.": -0.5,
  "Software stocks: Morgan Staley sees improving outlook for front office": 0.6,
  "Strength in Aerospace Market Drives Howmet: Will the Momentum Last?": 0.5,
  "Nike’s Running Comeback: Why Retailers Say It’s Real": 0.5,
  "Netflix, 3M, Schlumberger are part of Zacks Earnings Preview": 0.1,
  "Target will open 3 new stores in these Arizona cities. Here's what to know": 0.2,
  "Robust Trading, NII Growth to Aid Morgan Stanley's Q2 Earnings": 0.8,
  "Can Home Depot's Technology Investments Fix Sluggish DIY Sales Trends?": 0.1,
  "NextEra Energy Outpaces Industry in a Month: How to Play the Stock?": 0.5,
  "ServiceNow's Workflow Adoption Rises: A Sign for More Upside?": 0.5,
  "Zacks Investment Ideas feature highlights: Fastenal, Taiwan Semiconductor Manufacturing and Netflix": 0.5,
  "Rivian CEO RJ Scaringe’s voting control slips following divorce settlement": -0.5,
  "RGTI's High Price/Book Ratio Sparks Debate: Time to Hold or Sell?": 0.2,
  "From Smartphones to AI: ARM's Expanding Global Tech Influence": 0.6,
  "Jefferies lifts price targets on home improvement stocks, sees multi-year catalyst": 0.8,
  "Pre-Markets in the Red to Start a Fresh Week": -0.5,
  "Autodesk & PTC, Becton Dickson & Waters, crypto: Trending Tickers": 0.0,
  "AI is overvalued - I am going to preface this with the fact I have worked in the AI field with some big companies for about 10 years now and understand everything about AI and how it works. I think a AI bubble is here, we are overvalueing every company that seems to use AI for the sole reason that it uses AI. We are creating a bubble of artificial valuation. AI has many uses": -0.6,
  "Waters Stock Is Falling on Deal to Combine With Becton Dickinson Unit": -0.5,
  "What to Expect From QUALCOMM's Q3 2025 Earnings Report": 0.2,
  "Elevance to Report Q2 Earnings: Will Rising Costs Pressure Profits?": -0.5,
  "Is Netflix Stock a Buy Before July 17?": 0.2,
  "Piper Sandler downgrades Best Buy on weak appliance sales": -0.7,
  "The Zacks Analyst Blog Highlights Microsoft, Alibaba Group, Merck, Monarch Cement and Team": 0.5,
  "Illimis secures funding for GAIA-based Alzheimer’s therapeutics": 0.6,
  "How High Can Nvidia Stock Go as Jensen Huang Heads to China?": 0.5,
  "Synopsys Set to Close $35 Billion Ansys Deal After China’s Nod": 0.5,
  "Tesla stock higher on potential for xAI investment; full merger would be the 'next stage,' analyst says": 0.6,
  "Astera Labs Drops 33% Year to Date: Buy, Sell or Hold the Stock?": -0.5,
  "OppFi Soars 222% in a Year: Should Investors Buy, Hold, or Fold?": 0.5,
  "RealSense secures $50m in Series A funding post-Intel spinout": 0.6,
  "Goldman's Q2 Earnings on the Deck: Here's How to Play the Stock Now": 0.5,
  "Netflix earnings on deck: What Wall Street is looking for": 0.2,
  "WHO endorses Gilead’s Yeztugo for HIV prevention": 0.5,
  "Fifth Third to Report Q2 Earnings: What's in Store for the Stock?": 0.0,
  "Tylenol parent Kenvue has a new CEO, and he has lots of work to do to mollify activist investors": -0.6,
  "Americans Have Been Wary About Big Purchases—But They Weren't Last Week": 0.5,
  "Kenvue Seeks Its Own Band-Aid With CEO Departure and Strategic Review. The Stock Rises.": 0.5,
  "Pegasystems Shares Rise 7% Year to Date: Should You Buy the Stock?": 0.5,
  "NextEra Energy, Inc. (NEE): A Bull Case Theory": 0.5,
  "PE-Backed McGraw Hill, NIQ Global Intelligence Unveil IPO Terms": 0.2,
  "Will Citigroup (C) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Mark Zuckerberg Explains Meta’s AI Spending Spree": 0.2,
  "Bitcoin may still be a Hold, even at record prices: Opening Bid takeaways": 0.5,
  "Mexico’s ‘Cool-Head’ Approach Tested by Latest Trump Threat": 0.1,
  "UnitedHealth's Commercial Unit: A Stabilizer Amid Healthcare Turmoil?": 0.5,
  "Shopify Inc. (SHOP): A Bull Case Theory": 0.5,
  "Grocery e-commerce sales jump nearly 30% in June": 0.8,
  "Why Micron Stock Dropped on Monday": -0.5,
  "Air India Chief Says Preliminary Crash Report Raises Fresh Questions": -0.5,
  "Big Bank earnings: 3 key points to watch": 0.0,
  "Prime Day event drove over $24B in US e-commerce sales, GenAI traffic was up 3,300%": 0.8,
  "Top Stock Movers Now: Autodesk, Fortinet, Waters, and More": 0.5,
  "Meta CEO Mark Zuckerberg touts AI build-out, says company will spend hundreds of billions on data centers": 0.5,
  "Tesla latest: Elon Musk wants shareholders to invest in xAI": 0.5,
  "Stocks to Watch Monday: Tesla, Robinhood, Kenvue, Synopsys": 0.2,
  "Why SanDisk Stock Slumped on Monday": -0.5,
  "Bank of America Says If Something Breaks the Economy, It’ll Happen This Summer: How Investors Can Play It": 0.1,
  "Trump to Unveil $70 Billion in AI and Energy Investments": 0.5,
  "The S&P 500 Can Hit 6,600. Why Strategists Are So Confident.": 0.8,
  "Equinix (NasdaqGS:EQIX) Welcomes Shane Paladin as New Chief Customer and Revenue Officer": 0.5,
  "Merck to Acquire Verona for $10 Billion, Targeting Life Beyond Keytruda": 0.5,
  "Meet the leaders of MBB, the consulting giants advising the world's most powerful CEOs": 0.5,
  "Oracle's Safra Catz Quietly Tops Bezos With $1.8 Billion Stock Sale": 0.5,
  "Honeywell Poised for Q2 Beat, 'Decent' Q3 Outlook, BofA Says": 0.6,
  "Merck (NYSE:MRK) Partners With Gates Foundation For HIV PrEP Trials In 16 Countries": 0.5,
  "Starbucks to mandate workers return to office 4 days/week as CEO Brian Niccol continues turnaround efforts": -0.5,
  "GE Aerospace (GE): A Bull Case Theory": 0.5,
  "US Equity Indexes Inch Up Ahead of Mega-Cap Banks' Earnings, Consumer Price Index": 0.2,
  "PepsiCo's Productivity Plan: A Cure for Cost Headwinds?": 0.5,
  "Pepsi (PEP): A Bull Case Theory": 0.5,
  "Trump to announce $70 billion in AI and energy investments": 0.8,
  "Altria Group, Inc. (MO): A Bull Case Theory": 0.5,
  "$MEOH (Methanex): Why no love? - Let me disclose upfront: * I've held MEOH for 10+ years * My avg cost is low $20s. * I’m not trying to offload shares, I’m holding and might add. * I'm posting here to get thoughts, build awareness (of course it helps boost my port value), and understand why it gets little or no attention. # What is Methanex? * World's largest methanol producer. * Converts natural gas": 0.2,
  "Equity Markets Rise Intraday as Investors Track Tariff Updates": 0.5,
  "Sector Update: Financial Stocks Advance in Afternoon Trading": 0.5,
  "Japan Is Worrying the Bond Market. How Treasuries Can Avoid a Slump, for Now.": 0.1,
  "IREN Limited (IREN): A Bull Case Theory": 0.5,
  "Adobe Raises 2025 Earnings View: Is It on Track to Deliver Results?": 0.5,
  "Is Nvidia Topping Out? Why Micron Might Be the Next AI Winner": 0.5,
  "Sold Leaps, stock exploded - Hi folks, looking for guidance. I made the mistake of selling 2 year covered call leaps OTM. Expiry DEC 2026. I had a goal amount to profit from the sale of the stock and realized the leap premium would reach that goal for me. This past year some major contracts have spiked the stock to crazy levels way past the ITM. What’s would you do in this situation? Try and": 0.2,
  "Top Midday Decliners": -0.5,
  "Autodesk Drops Plan to Buy PTC. The Stock Is Climbing.": 0.5,
  "Starbucks Tells White-Collar Workers to Come to the Office More—Or Take a Buyout": -0.5,
  "Jim Cramer Reiterates “Own It, Don’t Trade It” on Apple Stock": 0.5,
  "Why Astronics (ATRO) Stock Is Trading Lower Today": -0.5,
  "Jim Cramer on NIKE: “Elliot Hill is Making All the Right Moves”": 0.6,
  "Jim Cramer on International Business Machines: “I Like IBM Very Much”": 0.8,
  "Jim Cramer Highlights Hershey’s Troubles": -0.5,
  "Jim Cramer Thinks Boeing “Stock’s Going Much Higher”": 0.8,
  "NextEra Energy Stock: This Long Call Spread Trade Might Earn $607": 0.5,
  "JPMorgan, Wells Fargo Lead Bank Earnings. Morgan Stanley, Goldman On Deck.": 0.5,
  "CVS Up on Medicare Advantage Strength: Is It a Buy Before Q2 Earnings?": 0.5,
  "Meta Just Poached More Top AI Talent. Should You Buy META Stock Here?": 0.5,
  "Philip Morris Poised to Top Q2 EPS Estimates, Weaker Dollar Boosts Outlook, UBS Says": 0.5,
  "Netflix Investors Have Factored in 'Modest' Quarterly Earnings Beat, 2025 Guidance Upgrade, Wedbush Says": 0.5,
  "Episource is notifying millions of people that their health data was stolen": -0.8,
  "Starbucks to shift to four-day work from office from three, says CEO": 0.2,
  "Billionaire Ray Dalio says an American ‘economic heart attack’ is coming — here's how to protect yourself": -0.5,
  "Equity Markets Higher Ahead of Inflation Figures, Producer Data": 0.5,
  "200 million reasons NFTs will never die": 0.6,
  "Starbucks CEO Brian Niccol increases in-office mandate; offers exit payouts to opt out": -0.5,
  "Procter & Gamble (PG) Slides After Evercore Cuts Rating Ahead of Earnings": -0.5,
  "Cognition AI to buy Windsurf, doubling down on AI-driven coding": 0.5,
  "Apple’s first foldable phone is set for 2026 and UBS thinks it may be as cheap as $1,800. Here’s what else to know": 0.2,
  "Honeywell Poised to Exceed Quarterly Results, Lift Outlook, BofA Says": 0.8,
  "JPMorgan Forms New Banking Team Focused on Bespoke Financings": 0.5,
  "Google Strikes $2.4B Deal With Windsurf": 0.5,
  "Servicenow, Copart, Berkshire - your opinion on buying these stocks now? - Right now, these three stocks are my hottest picks on the watchlist. Servicenow is around 20% down from its ATH, had a bigger drawdown around April but I missed this opportunity. Right now, it's one of the few tech stocks that are big but not one of the FAANG companies that are not on ATH. Copart is around 28% down from its ATH,": 0.5,
  "Mark Zuckerberg's Privacy Showdown in Delaware": 0.1,
  "Sector Update: Consumer Stocks Mixed Late Afternoon": 0.0,
  "Boeing Stock Rises, Analysts Adjust Targets After Air India Crash Progress": 0.5,
  "Meta Stock Gains As Zuckerberg Pledges 'Hundreds Of Billions' For AI Superintelligence Push": 0.8,
  "US Equity Markets End Higher as Investors Await Inflation Data": 0.5,
  "Kenvue Yo-Yoes After Tylenol-Maker Unveils New CEO, Strategic Review": 0.1,
  "Amazon Cloud Summit To Put AI In Focus Following 'Record' Prime Day": 0.5,
  "Boeing Stock Up After Air India Crash Report. What We Still Don’t Know.": 0.2,
  "Dave Ramsey says 'it's stupid' that Seattle man has $180K in debt despite making more than six figures a year": -0.8,
  "Following YouTube, Meta announces crackdown on ‘unoriginal’ Facebook content": -0.5,
  "These Stocks Are Moving the Most Today: Boeing, MicroStrategy, Waters, Autodesk, Ansys, Fastenal, Kenvue, and More": 0.0,
  "Top Research Reports for Eli Lilly, Netflix & GE Aerospace": 0.0,
  "Trump Meets With NATO Chief. What It Means for Defense Stocks.": 0.2,
  "Meta's big AI bet: Zuckerberg announces massive data center plans": 0.6,
  "Autodesk Stock Rallies As Firm Nixes Rumored PTC Acquisition": 0.6,
  "Financial Stocks Rise Ahead of Busy Week for Earnings, Inflation Data": 0.5,
  "Starbucks Stock Is Slipping. Why This Analyst Says to Sell.": -0.8,
  "Stock Market Today: Dow Creeps Up, Nasdaq Closes At A High; Palantir Hits New Milestone (Live Coverage)": 0.5,
  "Earnings to Watch This Week": 0.0,
  "Microsoft Stock Gets Price-Target Hike On Cloud, AI Businesses": 0.8,
  "Procter & Rivian downgraded, Starbucks gets a new Sell rating": -0.5,
  "JPMorgan Q2 Earnings Preview: Reading the Consumer Pulse": 0.5,
  "Musk says he will seek shareholder approval for Tesla investment in xAI": 0.5,
  "Apple Not Rushing To Follow Samsung With Folding-Screen iPhone": 0.2,
  "BlackRock’s Assets Expected to Hit New Record": 0.8,
  "Equity Markets Close Higher as Investors Await Key Economic Reports": 0.5,
  "Restaurant Stocks Are in Trouble. How They’re Losing the Competition for Diners’ Dollars.": -0.8,
  "Bank Earnings: What to Expect From JPMorgan, Wells Fargo, and More": 0.5,
  "Tech, Media & Telecom Roundup: Market Talk": 0.0,
  "Nasdaq Reaches New High as Investors Brush Off Tariff Concerns": 0.8,
  "Midland Unveils Costco's Biggest Texas Store": 0.5,
  "Earnings live: Second quarter earnings season set to kick off with big banks leading the way": 0.5,
  "ETFs to Consider as Bitcoin Climbs to Record Levels": 0.5,
  "Starbucks Wants Corporate Staff in the Office Four Days a Week": -0.5,
  "CEO Brian Niccol asks Starbucks workers to come back to the office—or he’ll pay them to leave": -0.6,
  "ETFs to Play on AI's Growing Momentum": 0.5,
  "Meta's Zuckerberg Says New AI Data Center 'Supercluster' Is Set to Come Online Next Year": 0.5,
  "Tesla's Autopilot system is in the spotlight at a Miami trial over a student killed while stargazing": -0.5,
  "Pfizer (PFE) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Chevron (CVX) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Apple (AAPL) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Tesla (TSLA) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "Walmart (WMT) Rises Higher Than Market: Key Facts": 0.5,
  "Lam Research (LRCX) Stock Sinks As Market Gains: Here's Why": -0.5,
  "UnitedHealth Group (UNH) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Procter & Gamble (PG) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Microsoft: Next Stop $600 or Has the Growth Stock Run Up Too Far, Too Fast?": 0.2,
  "Lockheed Martin (LMT) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "RTX (RTX) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Nuclear's Moment: Securing US AI Supremacy": 0.5,
  "Will Nvidia Announce Something Big on July 16?": 0.5,
  "Citi Updates SMCI to $52 PT, Stays Neutral Amid AI Optimism, Margin Concerns": 0.2,
  "Markets Close in the Green; Nasdaq at Fresh Highs": 0.8,
  "This Artificial Intelligence (AI) Stock Is Underappreciated and Undervalued": 0.8,
  "How JPMorgan Is Playing the Private Lending Boom": 0.2,
  "Vertiv $135 PT, Buy Rating — UBS Says Fears Over AWS Are Misguided": 0.6,
  "Tesla (TSLA) Gets $285 PT, Neutral — Goldman Flags Weaker U.S. EV Demand": -0.5,
  "Salesforce (CRM) $430 PT, Market Outperform Reaffirmed by JMP": 0.5,
  "Apple (AAPL) $240 PT, Buy — Citi Sees Tariff Boost Now, AI Risks Later": 0.5,
  "Why Netflix Stock Skyrocketed 50% in the First Half of 2025 and Why There Might Be More to Come": 0.8,
  "Meta built its AI reputation on openness — that may be changing": -0.5,
  "Wedbush Reaffirms Outperform on Nvidia (NVDA) — AI Demand Remains Strong": 0.8,
  "Morgan Stanley Raises Amazon PT to $300 — Manageable Tariffs, Strong AI Outlook": 0.8,
  "Meta’s AI Push Grows with PlayAI Deal, Instagram Engagement Hits New High": 0.8,
  "Big Bank earnings, CPI data, Fed commentary: What to Watch": 0.2,
  "Lockheed Martin delivers 72 F-35 jets facing upgrade delays, Bloomberg News reports": -0.5,
  "Check Your Pennies — They Could Be Worth $200K": 0.5,
  "What is a good rebalancing strategy and what makes a bad one? - I (27) have been investing for a few years casually and this last year I've been more serious and contributing quite a bit into my account. My intended strategy is approximately 38/58/4, 38% in S&P 500 etfs 58% in international etfs and 4% in bonds. So far my biggest single position is IVV at 20% of my account. My question is how": 0.1,
  "Billionaire fund manager reveals two major red flags to avoid 90% of bad investments": 0.2,
  "Australia looks to scrap surcharges on most card payments": 0.8,
  "Philip Morris International (PM): A Bull Case Theory": 0.5,
  "How 1 Rocket Engineer's Vegetarian Engine Could Capture 99% Of CO2 Emissions": 0.8,
  "Credo Technology Group (CRDO): A Bull Case Theory": 0.5
}