{
  "Home Stocks Go Ape Over Google. Why Zillow and Others Aren’t Scared.": 0.6,
  "VC Firm a16z Flags Stablecoins, Tokenization and Privacy as Key Themes for 2026": 0.5,
  "Is Texas Instruments Incorporated (NASDAQ:TXN) Expensive For A Reason? A Look At Its Intrinsic Value": 0.1,
  "The Best Stocks to Invest $1,000 in to Start the New Year Off Right": 0.6,
  "Investors Should Be Encouraged By Fortinet's (NASDAQ:FTNT) Returns On Capital": 0.8,
  "Wall Street Bullish on Lam Research Corporation (LRCX), Here’s What You Need to Know": 0.8,
  "Goldman Sachs Downgrades Arm Holdings (ARM) Amid Limited AI Cycle Exposure and Non-Traditional Market Challenges": -0.5,
  "US High Growth Tech Stocks to Watch": 0.0,
  "Diamondback Energy Insiders Sold US$365m Of Shares Suggesting Hesitancy": -0.5,
  "Roper Technologies (NASDAQ:ROP) Has A Pretty Healthy Balance Sheet": 0.6,
  "GE HealthCare Technologies Inc. (NASDAQ:GEHC) is largely controlled by institutional shareholders who own 87% of the company": 0.1,
  "Britain hits ‘peak Costa’ as coffee chain’s losses double": -0.6,
  "The Power Bill, the AI Dip, and the Date That Could Flip 2026 Stocks": 0.2,
  "Insider Buying: Smart Money Just Spent +$100M on These 3 Stocks": 0.5,
  "Paypal Casino 2026 - Online Casino That Accept Paypal By Cafe Casino": 0.1,
  "From Rust to Riches: 2 Auto Parts Names Built for 2026": 0.5,
  "Wall Street Braces For Another Year Of High-Value Transactions Following A Record-Breaking 2025": 0.8,
  "2026 Sector Playbook: 3 Sectors Trading Below Fair Value": 0.5,
  "Moderately bullish activity in Marvell with shares down 1.95%": 0.5,
  "3 Top Cybersecurity Stocks to Buy in January": 0.5,
  "(Item 8.01) . Other Events On Dec. 29, 2025, Public Service Company of Colorado (PSCo), a Colorado corporation and wholly owned subsidiary of Xcel Energy Inc. filed a natural gas rate case with the Colorado Public Utilities Commission (CPUC) seeking an increase in revenue of $190 million or 11.6%. The request is based on a 10.75% return on equity, an equity ratio of 55% and a 2025 test year with a projected rate base of $4.7 billion.": 0.2,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. As part of Apple Inc.’s (“Apple’s”) previously announced Principal Accounting Officer transition plan, Apple’s Board of Directors appointed Ben Borders, 45, as Apple’s Principal Accounting Officer, effective January 1, 2026. Mr. Borders succeeds Chris Kondo in the role of Principal Accounting Officer. Mr. Borders joined Apple in November 2010 and assumed his current position in January 2026.": 0.2,
  "(Item 8.01) Other Events. Adjustment to Dividend Rate on Variable Rate Series A Perpetual Stretch Preferred Stock On December 31, 2025, Strategy Inc (the “Company”) increased the regular dividend rate per annum on the Company’s Variable Rate Series A Perpetual Stretch Preferred Stock effective for monthly periods commencing on or after January 1, 2026 from 10.75% to 11.00%. The Company announced this new rate via its website, www.strategy.com/strc. Cash Dividend Declaration On January 2, 2026, the Company": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On January 2, 2026, Tesla, Inc. published the press release which is attached hereto as Exhibit 99.1 and is incorporated herein by reference. This information is intended to be furnished under\n\n(Item 2.02) of Form 8-K and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “ Exchange Act ”), or incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act as shall be expressly set forth by specific reference in such a filing .": 0.1,
  "How Kraft Heinz Lost Its Lock on Mac and Cheese—and American Shoppers": -0.5,
  "Spotting Winners: Electronic Arts (NASDAQ:EA) And Consumer Internet Stocks In Q3": 0.5,
  "Semiconductor Manufacturing Stocks Q3 Teardown: KLA Corporation (NASDAQ:KLAC) Vs The Rest": 0.2,
  "3 Reasons to Sell PCAR and 1 Stock to Buy Instead": -0.5,
  "3 Volatile Stocks with Open Questions": -0.5,
  "1 Cash-Producing Stock to Target This Week and 2 Facing Challenges": 0.2,
  "1 Growth Stock Set to Flourishand 2 We Avoid": 0.5,
  "1 S&P 500 Stock with Competitive Advantages and 2 We Brush Off": 0.2,
  "1 Unpopular Stock That Deserves a Second Chance and 2 We Question": -0.5,
  "2 Nasdaq 100 Stocks for Long-Term Investors and 1 That Underwhelm": 0.2,
  "2 Financials Stocks for Long-Term Investors and 1 We Find Risky": 0.2,
  "1 High-Flying Stock with Exciting Potential and 2 We Turn Down": 0.5,
  "1 Large-Cap Stock on Our Watchlist and 2 We Brush Off": 0.2,
  "2 Large-Cap Stocks Worth Your Attention and 1 We Question": 0.2,
  "1 Services Stock to Own for Decades and 2 We Ignore": 0.2,
  "3 Unpopular Stocks That Deserve Some Love": 0.5,
  "2 Nasdaq 100 Stocks with Solid Fundamentals and 1 We Turn Down": 0.2,
  "Best Income Ideas for 2026: Dividend Stocks, Energy Pipelines, and Other Top Picks": 0.8,
  "Copart (NASDAQ:CPRT) investors are sitting on a loss of 31% if they invested a year ago": -0.7,
  "Hybrid AI will drive 'whole new wave' of opportunity in 2026": 0.6,
  "Monolithic Power Systems' (NASDAQ:MPWR) three-year total shareholder returns outpace the underlying earnings growth": 0.5,
  "Charter Communications (NASDAQ:CHTR) Use Of Debt Could Be Considered Risky": -0.6,
  "2026 portfolios: Why this strategist is watching these 5 stocks": 0.2,
  "US High Growth Tech Stocks To Watch This January 2026": 0.5,
  "Insmed To Present at the 44th Annual J.P. Morgan Healthcare Conference": 0.2,
  "Those who invested in Analog Devices (NASDAQ:ADI) five years ago are up 89%": 0.5,
  "Are Strong Financial Prospects The Force That Is Driving The Momentum In Adobe Inc.'s NASDAQ:ADBE) Stock?": 0.5,
  "Intuit (INTU) Slid on Cautious FY2026 Guidance": -0.6,
  "SGA U.S. Large Cap Growth Exited Its Position in Workday (WDAY)": -0.2,
  "Here’s Insiders Fund’s View on Axon Enterprises (AXON)": 0.2,
  "Insider Buying Drove Strong Stock Performance at Marvel Technologies (MRVL)": 0.8,
  "Applied Materials (AMAT): “The Arms Dealer of the Semiconductor Revolution.”": 0.5,
  "Is Cadence Design Systems, Inc. (NASDAQ:CDNS) Worth US$313 Based On Its Intrinsic Value?": 0.1,
  "Billionaire Peter Thiel Sold Nvidia and Tesla to Buy This Other AI Stock": 0.5,
  "INSM Stock Up 78% in 6 Months: Here's What You Need to Know": 0.6,
  "What to Expect From Charter Communications' Next Quarterly Earnings Report": 0.0,
  "SPAR Group, Inc. Strengthens Executive Leadership Team; Appoints Jean Richer as Head of North American Sales & Marketing and Announces Executive Share Purchases": 0.8,
  "HONEYWELL TO RELEASE FOURTH QUARTER FINANCIAL RESULTS AND ANNOUNCE 2026 OUTLOOK DURING ITS INVESTOR CONFERENCE CALL ON THURSDAY, JANUARY 29": 0.0,
  "Here's Why You Should Add Inogen Stock to Your Portfolio Now": 0.6,
  "Equities to Get Boost From Robust Earnings in 2026 But Near-Term Fed Path Uncertain, Analysts Say": 0.5,
  "REGN Soars 41% in Six Months: Is There More Upside Potential in 2026?": 0.6,
  "MRVL's Custom Silicon Business Scales Up: What's Coming Next?": 0.5,
  "Will Monster Beverage's Expansion Strategy & Innovations Aid?": 0.5,
  "Zscaler (ZS) Upgraded to Outperform Amid AI and Zero Trust Growth": 0.8,
  "T‑Mobile Continues to Power New York's Holiday Season on America's Best Network": 0.6,
  "Gryphon Investors Completes Sale of 3Cloud to Cognizant": 0.5,
  "The Maker of Biscoff Cookies Bets on a Global Expansion": 0.5,
  "CSCO's Security Revenues Decline: Can Strong Portfolio Revive Growth?": 0.1,
  "Software Has Been Battered by AI. Shopify, Veeva, and 3 More Stocks to Play a Turnaround.": 0.2,
  "BMO and Mizuho Bullish on Linde (LIN), Forecasting 10%+ EPS Growth": 0.8,
  "Why Is Lam Research (LRCX) Stock Rocketing Higher Today": 0.6,
  "FTSE 100 reshuffle 2025: Burberry, Games Workshop and British Land join as WPP, Frasers and B&M exit": 0.2,
  "European Equities Traded in the US as American Depositary Receipts Gain Friday": 0.2,
  "BofA unveils its top 10 U.S. ideas for Q1 2026": 0.2,
  "Adobe (ADBE) Reaffirms AI Leadership With Strong Revenue and Cash Flow, Piper Sandler Reaffirms Outperform Rating": 0.8,
  "Here's Why Investors Should Give Old Dominion Stock a Miss Now": -0.8,
  "3 Cybersecurity Stocks to Watch in 2026 as Identity and Endpoint Converge": 0.5,
  "Investopedia's top stock picks for 2026, one is Berkshire Hathaway": 0.5,
  "Exploring 3 High Growth Tech Stocks In The US Market": 0.0,
  "Top Midday Decliners": -0.5,
  "3 Cash-Flow Machines Investors May Want Heading Into 2026": 0.5,
  "Applied Materials (AMAT) Stock Trades Up, Here Is Why": 0.5,
  "Marvell Technology (MRVL) Stock Trades Up, Here Is Why": 0.5,
  "These Healthcare and Bank Stocks Had Incredible Runs in 2025. Why Gains Will Continue This Year.": 0.8,
  "The Memory Market Is Going to Boom in 2026: 1 Top Stock to Buy Hand Over Fist Before It Skyrockets (Hint: It's Not Micron)": 0.8,
  "Palantir Leaves Software Peers Behind": 0.8,
  "ARK Comes Roaring Back in 2025": 0.8,
  "AppLovin Stock Extends Its Santa Claus Skid. What to Know.": 0.1,
  "What a “Normal” Economy Could Mean for These 3 Travel Stocks": 0.2,
  "Where Will O'Reilly Automotive Be in 1 Year?": 0.0,
  "LRCX Outperformed in 2025, but Valuation and Options Activity Flag 2026 Risks": 0.1,
  "Funds Plow Money Into AppLovin, Broadcom, Google — And This Top 100 Stock": 0.5,
  "US Equity Markets Rise, Carried by Tech, Healthcare Sectors": 0.6,
  "Regeneron to Report Fourth Quarter and Full Year 2025 Financial and Operating Results and Host Conference Call and Webcast on January 30, 2026": 0.0,
  "Analog Devices, Inc. (ADI) Balances Analyst Optimism With Insider Share Sale": 0.2,
  "These Stocks Moved the Most Today: Tesla, Baidu, Western Digital, Micron, RH, Vertiv, Sable Offshore, AppLovin, and More": 0.0,
  "Stock Market Today: Dow Up With 'January Barometer' On Watch; Nvidia Stock Climbs (Live Coverage)": 0.5,
  "O’Reilly Automotive, Inc. Announces Dates for Its Fourth Quarter and Full-Year 2025 Earnings Release and Conference Call": 0.0,
  "S&P 500 Posts Slight Weekly Decline as Calendar Turns to 2026": -0.2,
  "AppLovin Stock Just Plunged Below a Key Support Level. Should You Buy the Dip?": -0.5,
  "How We Kept AppLovin Stock Positive Before Software Took Its Hit": 0.5,
  "Cisco Systems (CSCO) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Airbnb, Inc. (ABNB) Stock Declines While Market Improves: Some Information for Investors": -0.2,
  "MercadoLibre (MELI) Stock Dips While Market Gains: Key Facts": 0.1,
  "Take-Two Interactive (TTWO) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "Synopsys (SNPS) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "PepsiCo (PEP) Gets Price Target Bump, but BofA Remains Cautious on Staples": 0.1,
  "Barclays Sees Renewed Investor Interest in Honeywell (HON) into Spring 2026": 0.6,
  "B. Riley Raises Target on Applied Materials (AMAT) on HBM and DRAM Capex Upside": 0.5,
  "Strong AI Tailwinds Lift KLAC Despite Ongoing China Export Risks": 0.6,
  "2 Spectacular Artificial Intelligence (AI) Stocks to Buy Hand Over Fist in 2026, According to Wall Street": 0.8,
  "Union Pacific, Norfolk Southern defend completeness of merger application": 0.5,
  "Exelon Corporation: Reliable Growth and Long-Term Value": 0.8,
  "Best Stock to Buy Right Now: Coca-Cola vs. Monster Beverage": 0.5,
  "Samsara (IOT): Durable AI-Driven Growth With Room to Run": 0.6,
  "Should You Be Excited About Comcast Corporation's (NASDAQ:CMCSA) 23% Return On Equity?": 0.6,
  "Mega-rich Americans are ditching stocks and hoarding historic highs of cash. Here’s where their wealth’s going instead": -0.5,
  "3 Phenomenal Stocks That Could Double in 2026": 0.8,
  "Marvell Technology, Inc.'s (NASDAQ:MRVL) Fundamentals Look Pretty Strong: Could The Market Be Wrong About The Stock?": 0.5,
  "A Look At The Intrinsic Value Of Autodesk, Inc. (NASDAQ:ADSK)": 0.2,
  "This could be a better — and safer — way into the AI trade in 2026": 0.6,
  "The Returns At Honeywell International (NASDAQ:HON) Aren't Growing": -0.5,
  "Has Monster Beverage Corporation's (NASDAQ:MNST) Impressive Stock Performance Got Anything to Do With Its Fundamentals?": 0.2,
  "2026 should be record year within the last decade of video games": 0.8,
  "AT&T to launch new service for customers as it takes on T-Mobile": 0.5,
  "This Robotic Surgery Pioneer Could Be Worth $1 Million for Long-Term Holders": 0.8,
  "This Stock Has Soared About 4,000% in Just 2 Decades. After Declining Last Year, Is It Finally a Buy?": 0.5,
  "Here Are 3 Financial Stocks Making Big AI Moves in 2026": 0.5,
  "Palo Alto Networks (NASDAQ:PANW) pulls back 4.8% this week, but still delivers shareholders solid 24% CAGR over 5 years": 0.6,
  "DexCom, Inc.'s (NASDAQ:DXCM) Stock Been Rising: Are Strong Financials Guiding The Market?": 0.5,
  "Calculating The Fair Value Of Exelon Corporation (NASDAQ:EXC)": 0.1,
  "3 Cybersecurity Stocks You Can Buy and Hold for the Next Decade": 0.5,
  "Major tech CEO sounds alarm on AI agents": -0.6,
  "Regeneron (REGN) Valuation Check After Japan Clears Dupixent for Pediatric Severe Asthma Expansion": 0.5,
  "Paychex (PAYX): Exploring Valuation After a 20% Share Price Drop Despite Growing Earnings": 0.5,
  "Is CSX (CSX) Still Undervalued After Its Recent 1-Year Shareholder Return?": 0.2,
  "Siebert Williams Initiates Coverage On American Electric Power Company, Inc. (AEP)": 0.2,
  "(Item 1.01) . Entry into a Material Definitive Agreement Completion of Separation of Versant from Comcast On January 2, 2026 (the “Distribution Date”), after the close of trading on Nasdaq, the previously-announced separation (the “Separation”) of Versant Media Group, Inc. (“Versant”) from Comcast Corporation (“Comcast”) was completed. The separation of Versant, which comprises a strong portfolio of cable television networks and complementary digital platforms (the “Spin Business”), was achieved through Comcast’s distribution (the “Distribution”) of 100% of\n\n(Item 1.01) .\n\n(Item 1.01) of this Current Report on Form 8-K and the Separation and Distribution Agreement attached as Exhibit 2.1 to this Current Report on Form 8-K are incorporated by reference in this\n\n(Item 1.01) of this Current Report on Form 8-K related to the TLA/Revolver Credit Agreement, TLB Credit Agreement and First Supplemental Indenture is incorporated by reference in this\n\n(Item 1.01) of this Current Report on Form 8-K is incorporated herein by reference.\n\n(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Resignation of Directors Effective as of 11:59 p.m. Eastern Time on January 2, 2026, Thomas J. Reid and Jason S. Armstrong (collectively, the “Resigning Directors”) resigned from the Board of Directors (the “Board”) of Versant. The Resigning Directors’ resignation from the Board was not due to any disagreement with Versant. Appointment of Directors and Officers Effective\n\n(Item 5.02) . In connection with their joining the Board, in addition to Ms. Montiel who had previously already been appointed as a member and the Chair of the Audit Committee, certain other directors of Versant were appointed to the Audit, Compensation and Governance Committees of the Board (the “Committees”) effective as of 11:59 p.m. Eastern Time on January 2, 2026. The current composition of the Committees is as follows: · the Audit Committee consists of Maritza\n\n(Item 5.02) . In addition, effective as of 11:59 p.m. Eastern Time on January 2, 2026, Greg Wright was appointed to serve as the Chief Accounting Officer and Controller of Versant. Mr. Wright (age 48) served as Vice President, External Reporting & Treasury Controller for Comcast from 2022 until the Separation and as Vice President for Comcast from 2017 to 2022, where he oversaw the company’s external financial reporting function as well as enterprise-wide accounting for treasury,\n\n(Item 5.02) . Mr. Wright’s employment agreement is on a form generally consistent with those of our named executive officers.\n\n(Item 8.01) . Other Events. On January 5, 2026, Versant issued a press release announcing the completion of the Separation. The full text of the press release is filed as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated by reference in this\n\n(Item 8.01) .": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition The information pursuant to\n\n(Item 2.02) in this report on Form 8-K is being furnished as contemplated by General Instruction B(2) to Form 8-K and shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of that Section. On January 5, 2026, we announced our expected net sales for the third quarter of fiscal year 2026 ended December 31, 2025. The complete release is attached to": 0.0,
  "(Item 8.01) Other Events. ATM Updates On January 5, 2026, Strategy Inc (\"Strategy\") announced an update with respect to sales made under its at-the-market offering program (\"ATM\") of the following securities during the periods and as of the dates indicated below: During Period December 29, 2025 to December 31, 2025 As of December 31, 2025 Security Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) STRF Stock": 0.1,
  "(Item 8.01) . Other Events. On January 5, 2026, Comcast Corporation (“Comcast”) issued a press release announcing the completion of the previously-announced separation of Versant Media Group, Inc. (“Versant”) from Comcast, effective as of 11:59 p.m. Eastern Time on January 2, 2026. The separation of Versant, which comprises a strong portfolio of cable television networks and complementary digital platforms, was achieved through Comcast’s distribution (the “Distribution”) of 100% of the shares of Versant Class A common stock\n\n(Item 8.01) .": 0.1,
  "PayPal (PYPL): Revisiting Valuation After New AI-Focused PYUSD Financing Partnership with USD.AI": 0.5,
  "The Bull Case For Constellation Energy (CEG) Could Change Following Its AI Data Center Nuclear Contracts – Learn Why": 0.5,
  "Dow Jones Futures: Muted Reaction To Trump's Venezuela Move; Nvidia, AMD, Taiwan Semi Due": 0.1,
  "3 Nasdaq 100 Stocks Worth Your Attention": 0.0,
  "1 Growth Stock to Stash and 2 That Underwhelm": -0.5,
  "1 S&P 500 Stock with Exciting Potential and 2 We Question": 0.5,
  "3 Large-Cap Stocks We’re Skeptical Of": -0.5,
  "2 Cash-Producing Stocks to Keep an Eye On and 1 Facing Headwinds": 0.2,
  "1 Value Stock Worth Investigating and 2 We Turn Down": 0.0,
  "3 of Wall Street’s Favorite Stocks on Our Buy List": 0.5,
  "3 Profitable Stocks That Fall Short": -0.5,
  "1 Cash-Producing Stock with Solid Fundamentals and 2 That Underwhelm": 0.2,
  "Is It Too Late To Consider Applied Materials (AMAT) After A 53% One Year Run?": -0.5,
  "Assessing DexCom (DXCM) Valuation As Shares Lag Over The Past Year": -0.5,
  "Agoda Reveals Growing Interest for Year-End Domestic Travel with Kuala Lumpur at the Forefront in 2025": 0.5,
  "Is Palo Alto Networks (PANW) Offering Value After Recent Share Price Weakness": 0.2,
  "A Look At O'Reilly Automotive (ORLY) Valuation After Recent Share Price Softness": 0.1,
  "3 of China’s most innovative pharma companies": 0.5,
  "FloQast CFO on why the demand for accountants is ‘skyrocketing’": 0.6,
  "ASML Holding (ENXTAM:ASML) Is Up 8.8% After AI-Fueled EUV Demand Triggers Broker Upgrade – What's Changed": 0.6,
  "ASML stock gains on upgrade to Top Pick at Bernstein": 0.8,
  "Earnings Preview: What to Expect From NXP Semiconductors’ Report": 0.5,
  "US Stock Market Today: S&P 500 Futures Rise On Solid Global Growth And Rate Doubts": 0.8,
  "Palo Alto Networks in talks to acquire Koi Security for $400m": 0.5,
  "California woman was dropped by insurer over drone-captured images. What to know": -0.5,
  "History Says the Nasdaq Will Soar in 2026: 2 AI Stocks to Buy Now, According to Wall Street": 0.8,
  "SPAR Group names Jean Richer to lead North American sales and marketing": 0.5,
  "The Ultimate Growth Stock to Buy With $1,000 Right Now": 0.8,
  "Kraft Hockeyville Extends Community Impact with Biggest Prize Pool Yet to Celebrate 20th Anniversary": 0.8,
  "Declining Stock and Decent Financials: Is The Market Wrong About Texas Instruments Incorporated (NASDAQ:TXN)?": -0.5,
  "Trending tickers: Chevron, TSMC, ASML and Auction Technology": 0.0,
  "Former consumer goods exec takes stake in Treasury Wine Estates": 0.5,
  "Oil, Tech Issues Lift Wall Street Pre-Bell; Asia, Europe Gain": 0.5,
  "Zenas shares crash after top drug misses expectations in immune disease study": -0.8,
  "Returns expected to spike in the new year": 0.5,
  "High Growth Tech Stocks In The US Market January 2026": 0.5,
  "ASML (ASML) Surges 8.8%: Is This an Indication of Further Gains?": 0.6,
  "Comcast Announces Completion of Separation of Versant Media Group, Inc.": 0.2,
  "Why The Narrative Around DoorDash NasdaqGS DASH Is Shifting After Recent Analyst And Market Updates": 0.5,
  "Texas Instruments' Quarterly Earnings Preview: What You Need to Know": 0.2,
  "Insiders Fund’s Investment Thesis for AppFolio (APPF)": 0.0,
  "GOOGL, AMZN, and DASH: J.P. Morgan Picks the Top Internet Stocks to Buy for 2026": 0.6,
  "Canada Alternative Lending Databook Report 2025: Market Size & Forecast by Value and Volume Across 100+ KPIs 2020-2029": 0.0,
  "Stocks Rise Pre-Bell as Investors Assess US Military Operation in Venezuela": 0.5,
  "PepsiCo and Coca-Cola Reassess Venezuela as U.S. Pressure Shifts Landscape": 0.1,
  "VERSANT Begins Trading on Nasdaq Today as Independent Company Following Completion of Comcast Spin-Off": 0.5,
  "Crane Company Completes Acquisition of Precision Sensors & Instrumentation and Announces Date for Fourth Quarter 2025 Earnings Release and Teleconference": 0.2,
  "NVIDIA Soars 39% in 2025: Will the Stock Carry Momentum in 2026?": 0.5,
  "Crypto wallet firm Ledger faces customer data breach through payment processor Global-e": -0.7,
  "Baker Hughes Closes Sale of Precision, Sensors & Instrumentation Product Line to Crane Company": 0.2,
  "This Week In Digital Payment - South Africa Embraces Cashless Revolution With Rapid Growth": 0.8,
  "Watch 5 AI-Powered Medical Stocks for a Strong Portfolio in 2026": 0.5,
  "Cactus secures majority stake in Baker Hughes’ SPC unit": 0.5,
  "Beat the Market the Zacks Way: LATAM, General Motors, Amgen in Focus": 0.5,
  "Cognizant acquires 3Cloud to boost global Azure expertise": 0.6,
  "Stagwell (STGW) Launches 'The Machine': Marketing's First Agentic Operating System": 0.5,
  "GE HealthCare to announce fourth quarter and full year 2025 results on February 4, 2026": 0.0,
  "Geordie AI Selected for the 2026 CrowdStrike, AWS & NVIDIA Cybersecurity Startup Accelerator": 0.5,
  "CrowdStrike, AWS, and NVIDIA Select 35 Startups for the 2026 Cybersecurity Startup Accelerator": 0.6,
  "Why CrowdStrike's CEO says you need AI to fight AI": 0.5,
  "The road to victory for Mercedes in F1 heats up with AI": 0.5,
  "Here Are Monday’s Top Wall Street Analyst Research Calls: Adobe, Arista Networks, ASML, Coinbase Global, IBM, Marvell Technology, NetFlix, and More": 0.2,
  "S&P 500 Continues Its Stellar Run to Open New Year: 4 Solid Picks": 0.8,
  "Is Credo Technology Still a Buy After 55% Gain in the Past 6 Months?": 0.2,
  "5 Things to Know Before the Stock Market Opens": 0.0,
  "Hush Security Selected for the 2026 CrowdStrike, AWS & NVIDIA Cybersecurity Startup Accelerator": 0.6,
  "Is MRVL Stock a Buy, Sell or Hold at a P/S Multiple of 7.67X?": 0.0,
  "Is Falcon Flex Now the Main Driver of CrowdStrike's ARR Growth?": 0.2,
  "Jefferies downgrades Adobe, upgrades IBM as AI reshapes 2026 software outlook": 0.2,
  "Can Platformization Continue Fueling PANW's NGS ARR Growth?": 0.2,
  "Why CrowdStrike CEO just spent a reported $300 million to become a partial owner of the Mercedes F1 team": 0.2,
  "Evoke Security Selected for the 2026 CrowdStrike, AWS & NVIDIA Cybersecurity Startup Accelerator": 0.5,
  "Fortinet to Announce Fourth Quarter and Full Year 2025 Financial Results": 0.0,
  "AI took investors on a date in 2025. In 2026, analysts say it's time to foot the bill.": 0.1,
  "ReturnPro Launches Shopify App Offering First-of-its-Kind, End-to-End Returns Capabilities": 0.8,
  "TI accelerates the shift toward autonomous vehicles with expanded automotive portfolio": 0.6,
  "What You Need To Know Ahead of PepsiCo's Earnings Release": 0.0,
  "Alnylam to Webcast Presentation at 44th Annual J.P. Morgan Healthcare Conference": 0.2,
  "Goldman boosts TSMC price target, Comcast spinoff to begin trading": 0.5,
  "These 3 Turnaround Contenders Could Be Set for a Big 2026 Break": 0.6,
  "Chevron, US Oil Stocks Rally as Trump Vows Venezuela Revival": 0.6,
  "AI Bubble or Not, These 3 Stocks Make Excellent Long-Term Plays to Buy in January": 0.6,
  "AT&T Declines 5% in Three Months: Should You Buy the Dip?": 0.2,
  "Can Intel's Xeon 6900 Processors Drive Long-Term Growth?": 0.5,
  "Does MercadoLibre's Expanding Credit Book Elevate Risk in 2026?": -0.5,
  "PayPal downgraded, Costco upgraded: Wall Street's top analyst calls": 0.2,
  "Wall Street Bulls Look Optimistic About AppLovin (APP): Should You Buy?": 0.8,
  "Wall Street Bulls Look Optimistic About PDD Holdings Inc. Sponsored ADR (PDD): Should You Buy?": 0.8,
  "U.S. Energy Company Shares Rise": 0.5,
  "Trump's Maduro ousting: Oil prices tick higher, oil stocks rally": 0.6,
  "AT&T Stock Had a Miserable 2025. Why This Analyst Says 2026 Will Be Better.": 0.5,
  "Afero and Texas Instruments Partner to Build a Secure IoT Platform Designed for a Connected World": 0.6,
  "Are Functional Waters and Energy Drinks Reviving PepsiCo's PBNA Unit?": 0.5,
  "Sevii Selected for the 2026 CrowdStrike, AWS & NVIDIA Cybersecurity Startup Accelerator": 0.6,
  "Strong AI-Driven Quarter and Dividend Spotlight Might Change The Case For Investing In KLA (KLAC)": 0.6,
  "Versant stock price sinks on Nasdaq trading debut as Comcast spinoff tests investor appetite for legacy cable TV": -0.6,
  "What to Expect From Comcast Corporation's Q4 2025 Earnings Report": 0.2,
  "These 3 Stocks Trade at Discounts the Market Won’t Ignore Forever": 0.5,
  "What to Expect From IDEXX Laboratories’ Next Quarterly Earnings Report?": 0.2,
  "IBM Stock Gets Upgraded to Buy. Why This Other Tech Stock Was Downgraded.": 0.5,
  "Intellia Stock Declines Around 55% in 3 Months: Here's Why": -0.8,
  "ShowSeeker and Innovar Solutions Combine to Reimagine Ad Sales Management": 0.5,
  "Chevron Lead Energy Stocks Rally Amid Venezuela Oil Hopes": 0.6,
  "Cognizant's 3Cloud Buyout to Accelerate AI Transformation for Clients": 0.8,
  "Assessing KLA (KLAC) Valuation After Strong Q3 Beat And AI Outlook As Shares Slip Slightly": 0.5,
  "2025's Most Upgraded Stocks—And What 2026 Might Hold": 0.5,
  "BofA says these are the best 7 AI chip stocks to own in 2026": 0.5,
  "European Equities Traded in the US as American Depositary Receipts Rise Monday": 0.5,
  "Palo Alto Eyes $400 Million Cyber Deal": 0.5,
  "Jefferies’ top software stocks to own led by Microsoft, Meta": 0.5,
  "3 Top Ranked Stocks to Buy for 2026 (LLY, WFRD, PGY)": 0.5,
  "NXP’s New S32N7 Unlocks the Full Potential of SDVs": 0.6,
  "Top Midday Stories: Oil Stocks Rise After US Attack on Venezuela; QXO Receives $1.2 Billion Investment From Apollo-Affiliated Funds": 0.5,
  "Comcast Spinoff Versant Starts Trading Today. The Stock Is Dropping.": -0.8,
  "LOS ANGELES LAKERS GAMES ON SPECTRUM FRONT ROW™ IN APPLE IMMERSIVE TIP OFF JANUARY 9": 0.2,
  "Why Is Shopify (SHOP) Stock Rocketing Higher Today": 0.6,
  "DoorDash (DASH) Stock Trades Up, Here Is Why": 0.5,
  "The Best Stocks to Buy With $1,000 Right Now": 0.5,
  "Venezuela Fuels Broad Sector Rally But These Oil And Gas Plays Slide": -0.5,
  "Why Adobe Stock Is Falling Today": -0.5,
  "Looking for a Growth Stock? 3 Reasons Why AppLovin (APP) is a Solid Choice": 0.6,
  "Xumo Introduces Advanced Identity Solution to Power Smarter Streaming Investments": 0.5,
  "TSMC Shares Jump Most Since April After Goldman Lifts Target": 0.8,
  "Thinking about trimming NVDA, 4 straight sessions of gap‑up opens and intraday fades - I’m starting to think it might be time to trim or sell some of my NVDA position. For the fourth trading day in a row, NVIDIA (NVDA) has gapped up at the open, only to sell off or fade during the session. That kind of price action is starting to stand out. To me, it feels like: Strength is getting sold": -0.6,
  "This Underrated Industrial Stock Could Be the Purest Play on AI Infrastructure": 0.6,
  "How New Drug Launches And Patent Risks Are Rewriting The Story For Amgen (AMGN)": 0.2,
  "Investing in Old Dominion Freight Line (NASDAQ:ODFL) five years ago would have delivered you a 61% gain": 0.8,
  "The Bull Case For Quanta Services (PWR) Could Change Following Major Grid And Data Center Expansion - Learn Why": 0.5,
  "Stocks Jump After U.S. Captures Venezuela’s Maduro": -0.5,
  "Don’t Push for Growth in 2026, Push for Yield: The Case for 3 Top Dividend Stocks": 0.5,
  "Advanced Energy, IBD Stock Of The Day, Breaks Out. So Do Several Chip Peers.": 0.5,
  "Intel Stock Gets an AI Upgrade. Why This Analyst Is Optimistic.": 0.8,
  "MercadoLibre and 2 More Global Stocks Ready to Rebound": 0.6,
  "KYMR Skyrockets 82.4% in a Year: More Upside Potential in 2026?": 0.6,
  "Versant launches, Comcast spins off E!, CNBC and MS NOW": 0.0,
  "This Stock Faces ‘Unprecedented AI Demand.’ It’s One Analyst’s Top Pick.": 0.6,
  "Biotech and Pharma Stocks Tumble as Investors Race into Energy": -0.6,
  "Exelon to Announce Fourth Quarter Results on Feb. 12": 0.0,
  "Back to Investing after years off the markets. - Hey guys. For context I'm from Argentina so 120 dollars monthly here is a decent amount of money to invest in stocks. With that being said, I opened my portfolio through a broker that allows me to access the US market without any fees or restrictions that I would face if I use any CEDEARS (basically US stocks mirrored in Argentine pesos), and started my tiny": 0.2,
  "Sector Update: Tech Stocks Rise Monday Afternoon": 0.5,
  "Novo Nordisk Rolls Out Wegovy's Weight Loss Pill in US": 0.5,
  "UP, Norfolk Southern Push Back on Class I Challenges to Merger Filing": 0.1,
  "Why Big Oil has a long road ahead in Venezuela, the 'fallen angel of global crude markets'": -0.5,
  "This Exclusive Costco Perk Is Also Boosting Company Sales": 0.6,
  "5 Things Costco Needs to Do to End Its Stock Slump": -0.5,
  "What Analysts Think Is Shifting The Story For Take-Two Interactive Software (TTWO)": 0.2,
  "Is Adobe (ADBE) Turning Its AI Ambitions Into a Slower-Growth Story?": -0.5,
  "MercadoLibre (MELI) Shares Skyrocket, What You Need To Know": 0.8,
  "Zscaler Appoints Sunil Frida as Chief Marketing Officer to Drive Next Phase of Global Growth": 0.6,
  "These Stocks Moved the Most Today: Chevron, Valero Energy, Comcast, Tesla, CoreWeave, IBM, Coinbase, and More": 0.0,
  "Power Integrations Names Chris Jacobs Senior Vice President, Marketing and Product Strategy": 0.2,
  "Zenas BioPharma, A Top 1% Stock, Quadrupled In 2025. Why It Just Collapsed.": -0.5,
  "Versant Stock Slides in Its First Day of Trading. Here's What You Need to Know About the Comcast Spin-Off.": -0.5,
  "Stock Market Today: Dow Surges As Maduro Makes This Plea; This AI Stock Clears An Entry (Live Coverage)": 0.5,
  "My 2 Favorite Growth Stocks to Buy Right Now": 0.5,
  "The S&P 500's Top-Performing Sectors: 3 Lead the Pack in 2025": 0.5,
  "Is Intuit’s (INTU) Cautious Outlook and DEI ROI Audit Push Reframing Its Risk‑Reward Story?": 0.1,
  "Chevron, Halliburton, Other Energy Shares Gain on Venezuela Windfall Hopes": 0.6,
  "Is Costco (COST) Pricing Too High After Recent Share Price Weakness?": -0.5,
  "NVIDIA Kicks Off the Next Generation of AI With Rubin — Six New Chips, One Incredible AI Supercomputer": 0.8,
  "Is Costco Stock Set to Rebound Higher in 2026?": 0.5,
  "Castration-sensitive Prostate Cancer Market Projected to Grow at a 13.2% CAGR (2020-2034), Driven by Expanded Approval and Wider Commercialization Opportunity in nmCSPC Segment | DelveInsight": 0.6,
  "PepsiCo (PEP) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Workday (WDAY) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Stock Market Today, Jan. 5: SLB Surges on Venezuela-Driven Oil Volatility and Digital Growth Momentum": 0.6,
  "Amgen (AMGN) Stock Declines While Market Improves: Some Information for Investors": -0.5,
  "Gilead Sciences (GILD) Stock Declines While Market Improves: Some Information for Investors": -0.5,
  "Potential Venezuela Opening Could Be A Game Changer For MercadoLibre’s (MELI) Expansion Narrative": 0.8,
  "Does CrowdStrike’s Expanded AI Security Accelerator With AWS and NVIDIA Reshape Its Long‑Term Narrative (CRWD)?": 0.2,
  "Is It Time To Reassess American Electric Power (AEP) After Its 32.7% One-Year Rally?": 0.2,
  "Honeywell International Inc. (HON) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Copart, Inc. (CPRT) Outperforms Broader Market: What You Need to Know": 0.5,
  "Diamondback Energy (FANG) Stock Dips While Market Gains: Key Facts": 0.1,
  "Kraft Heinz (KHC) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "What’s Up With SentinelOne? An Ultra-Deep Value Opportunity": 0.5,
  "(Item 8.01) of this Current Report on Form 8-K is incorporated herein by reference.\n\n(Item 8.01) of this Current Report on Form 8-K is incorporated herein by reference.\n\n(Item 8.01) Other Events. On January 6, 2026 (the “Redemption Date”), Electronic Arts Inc. (the “Company”) redeemed all of the $400,000,000 outstanding aggregate principal amount of its 4.800% Notes due 2026 (the “Notes”) with cash on hand at a redemption price equal to 100% of the aggregate principal amount thereof, plus accrued and unpaid interest thereon to, but excluding, the Redemption Date, in accordance with the terms of the Indenture (as defined below). The Notes were issued": 0.1,
  "(Item 1.01) . Entry into a Material Definitive Agreement. On January 5, 2026, T-Mobile USA, Inc. (“T-Mobile USA”), a Delaware corporation and wholly-owned subsidiary of T-Mobile US, Inc. (“Parent”), entered into a Second Amended and Restated Credit Agreement (the “Credit Agreement”) by and among T-Mobile USA, as borrower, JPMorgan Chase Bank, N.A., as administrative agent, and the lenders, swingline lenders and L/C issuers party thereto. The Credit Agreement amends and restates in its entirety the Amended and\n\n(Item 1.01) of this Current Report on Form 8-K is also responsive to": 0.1,
  "(ITEM 8.01) . OTHER EVENTS. As previously disclosed, on May 16, 2025, Charter Communications, Inc., a Delaware corporation (“Charter”), entered into a Transaction Agreement (the “Transaction Agreement”) by and among Charter, Charter Communications Holdings, LLC, a Delaware limited liability company and subsidiary of Charter (“Charter Holdings”), and Cox Enterprises, Inc., a Delaware corporation (“Cox Enterprises”), pursuant to which (i) Cox Enterprises will sell and transfer to Charter 100% of the equity interests of certain subsidiaries of Cox": 0.1,
  "Shareholder Activism Worked in 2025. The Surge Will Continue This Year.": 0.8,
  "Why Constellation Energy Stock Slumped Today": -0.5,
  "NVDA at CES feels like they’re already playing the next AI cycle - Just my 2 cents after watching Jensen at CES. This didn’t feel like a simple “faster GPU” update. More like NVDA quietly setting up **what comes** ***after*** **Blackwell**. Rubin being a *full platform* (chip + networking + system) stood out to me. That’s how they keep everyone locked into the ecosystem, not just selling cards. Also interesting that Jensen said next-gen stuff": 0.6,
  "Will TI’s Afero IoT Push and New Auto Chips Reframe Texas Instruments' (TXN) Innovation Narrative?": 0.2,
  "PayPal Casinos 2026: High 5 Casino Selected as Leading PayPal Casino": 0.8,
  "Agoda reveals: Perhentian Islands is Malaysia's top emerging destination": 0.8,
  "Melius Sets $135 Target on Marvell (MRVL) as Custom Silicon Demand Accelerates": 0.6,
  "What are your top stock picks in 2026? - I’ll be honest, my portfolio blew up over the last couple years mostly due to poor trading decisions and trying to time the market. I’ve stepped away from day trading and options for now, and I’m working on building a more stable, long-term portfolio from scratch. This time I’m focusing on growth stocks that have a shot at outperforming the S&P or broader ETFs. So far,": -0.6,
  "What are the significant announcements made today by Nvidia CEO Jensen Huang at CES 2026 - There was a lot of information provided to us during the keynote speech by Jensen Huang. At CES 2026, NVIDIA unveiled its most ambitious AI roadmap yet, headlined by the Rubin platform, a six-chip, extreme-codesigned AI system, and a suite of open models spanning healthcare, robotics, and autonomous driving. The company also showcased its vision for “physical AI” with": 0.6,
  "A Look Back at Maintenance and Repair Distributors Stocks’ Q3 Earnings: Fastenal (NASDAQ:FAST) Vs The Rest Of The Pack": 0.2,
  "A Look Back at Ground Transportation Stocks’ Q3 Earnings: Old Dominion Freight Line (NASDAQ:ODFL) Vs The Rest Of The Pack": 0.2,
  "Gilead Sciences (GILD): Buy, Sell, or Hold Post Q3 Earnings?": 0.0,
  "Microchip Technology (MCHP): Buy, Sell, or Hold Post Q3 Earnings?": 0.2,
  "3 Reasons ADBE is Risky and 1 Stock to Buy Instead": -0.5,
  "Is Surging AI Custom Silicon Demand Reshaping the Investment Case for Marvell Technology (MRVL)?": 0.5,
  "1 Growth Stock with Explosive Upside and 2 We Turn Down": 0.5,
  "2 S&P 500 Stocks with Competitive Advantages and 1 We Avoid": 0.0,
  "3 Large-Cap Stocks with Exciting Potential": 0.6,
  "2 Profitable Stocks for Long-Term Investors and 1 We Brush Off": 0.2,
  "2 Safe-and-Steady Stocks with Solid Fundamentals and 1 Facing Headwinds": 0.2,
  "A Look At Ross Stores (ROST) Valuation As Store Expansion Accelerates With Solid Same Store Sales": 0.8,
  "Assessing ASML Holding’s (ENXTAM:ASML) Valuation After Strong Recent Share Price Momentum": 0.5,
  "The Venezuela News Lifted Some Oil Stocks. The Losers May Be Better Bets.": 0.5,
  "2 Soaring Stocks to Hold for the Next 20 Years": 0.5,
  "Novo Nordisk launches Wegovy weight-loss pill in US, triggering price war with Eli Lilly - [https://www.theguardian.com/business/2026/jan/05/novo-nordisk-launches-wegovy-weight-loss-pill-us-price-war](https://www.theguardian.com/business/2026/jan/05/novo-nordisk-launches-wegovy-weight-loss-pill-us-price-war) Novo Nordisk (NVO) has officially launched the **Wegovy Pill** in the US, sparking a major price war in the weight-loss market. **Key Takeaways:** * **Affordable Pricing:** The oral pill starts at **$149/month** ($5/day), a massive drop from the \\~$1,000 cost of injectable versions. * **High Efficacy:** Trials show roughly **17% weight loss**, making it nearly as effective as the": 0.2,
  "Is It Too Late To Consider Axon Enterprise (AXON) After A 3-Year 229% Surge?": 0.2,
  "Is Lam Research (LRCX) Still Attractive After A 153% One Year Share Price Surge": 0.5,
  "Zacks Investment Ideas feature highlights Amazon, Walmart, Costco, Nvidia, Tesla  and Alphabet's": 0.5,
  "The Zacks Analyst Blog Eli Lilly, Medtronic, Intuitive Surgical, Regeneron Pharmaceuticals and Johnson & Johnson": 0.0,
  "The Zacks Analyst Blog Chevron, Lockheed, Northrop, CrowdStrike and Palo Alto": 0.0,
  "Is It Too Late To Consider DoorDash (DASH) After Its Strong 1 Year Share Price Run?": 0.2,
  "Big Pharma Has More Going for It Than Obesity Drugs": 0.5,
  "Mondelēz lifts sales as Albertsons tackles in-store retail media measurement": 0.5,
  "Monolithic Power Systems Insiders Sold US$236m Of Shares Suggesting Hesitancy": -0.5,
  "Here's What Cadence Design Systems' (NASDAQ:CDNS) Strong Returns On Capital Mean": 0.5,
  "Roper Technologies, Inc.'s (NASDAQ:ROP) Intrinsic Value Is Potentially 67% Above Its Share Price": 0.8,
  "Assessing Shopify (SHOP) Valuation After Recent Share Price Momentum": 0.5,
  "A Look At Take-Two Interactive Software (TTWO) Valuation After A Strong 1 Year Shareholder Return": 0.6,
  "The CEO trying to revive some of what made GE so special": 0.5,
  "Assessing Texas Instruments (TXN) Valuation After Recent Short Term Share Price Weakness": 0.2,
  "Tech, Oil Shares Undergird Wall Street Pre-Bell; Asia Up, Europe Flat": 0.5,
  "Amgen buys protein-degrading startup Dark Blue for up to $840M": 0.5,
  "Zenas’ stock drops 51% despite lead asset’s Phase III rare disease win": -0.6,
  "3 Warren Buffett Stocks to Buy Hand Over Fist in January 2026": 0.5,
  "DoorDash’s CEO blasts ‘appalling’ claim that a major delivery app gives drivers a desperation score: ‘I would fire anyone who tolerated this’": 0.5,
  "Prediction: Synopsys Stock Will Soar Over the Next Decade. Here's 1 Nvidia-Related Reason Why.": 0.8,
  "What You Need to Know Ahead of Mondelez International’s Earnings Release": 0.1,
  "Comscore Completes Recapitalization Transaction with Preferred Stockholders Following Approval from Common Stockholders": 0.5,
  "OncoNano Medicine Announces Research Collaboration with Gilead to Apply ON-BOARD™ Delivery Technology to Gilead’s Drug Candidate": 0.6,
  "AI trade is still in a 'picks & shovels' market, analyst says": 0.2,
  "What to Expect From Amgen's Q4 2025 Earnings Report": 0.1,
  "PrePublic Equity Partners Spins Out of Top 20 US VC Firm to Democratize Access to Late Stage Venture Secondaries": 0.5,
  "5 Stocks Wall Street Repriced Higher Heading Into 2026": 0.5,
  "Regeneron Pharmaceuticals' Quarterly Earnings Preview: What You Need to Know": 0.5,
  "Apple obviously fails to secure RAM for the next 2 years - Apple has underperformed in 2025 among MAG7 (Only the worse performer was AMZN). Starting 2026, Apple has continued to underperform. Apple obviously has issues to secure RAM for the next 2 years and it could hit Apple´s future pricings and gagdets. Apple keeps getting rotten and underperforming on the stock market while other Mag7s had a good start. [High memory prices prompt Apple": -0.8,
  "Microchip shares rise after preannouncement as recovery gains momentum": 0.8,
  "Princeton in Palm Beach: Yacht Club Cocktails and Lookahead to CorpGov Forum at Reunions 2026": 0.5,
  "BostonGene and AstraZeneca Announce Strategic Collaboration to Advance Foundation Model-Driven Oncology Development": 0.5,
  "Microchip, Under Armour rise in premarket; Adidas falls": 0.2,
  "SiMa.ai Announces First Integrated Capability with Synopsys to Accelerate Automotive Physical AI Development": 0.5,
  "Take-Two Interactive Software, Inc. to Report Third Quarter Fiscal Year 2026 Results on Tuesday, February 3, 2026": 0.0,
  "Roper Technologies schedules fourth quarter 2025 financial results conference call": 0.0,
  "Keysight Technologies Appoints Liz Morali as Head of Investor Relations": 0.5,
  "Kahuna Labs Appoints Atul Nanda as Executive Advisor to Guide Product Strategy and Support Industry Engagement": 0.5,
  "An Intrinsic Calculation For Workday, Inc. (NASDAQ:WDAY) Suggests It's 40% Undervalued": 0.8,
  "Here Are Tuesday’s Top Wall Street Analyst Research Calls: AT&T, CoreWeave, Digital Realty, Palantir Technologies, ServiceNow, Shopify, SoFi Technologies, and More": 0.5,
  "Why Weebit Nano (ASX:WBT) Is Down 15.9% After Licensing ReRAM To Texas Instruments And Setting 2026 Revenue Target": -0.5,
  "S&P 500 Giant Vistra Follows Competitor Constellation Energy's Lead With $4 Billion Natural Gas Bet": 0.5,
  "Charter Offers Senior Unsecured Notes": 0.1,
  "U.S. Small Business Employment Remains Consistent Throughout 2025": 0.5,
  "Here's How Much You'd Have If You Invested $1000 in Marriott International a Decade Ago": 0.5,
  "Credit Card Processing for Nicotine Pouches is on Tower Payments' Radar for 2026": 0.2,
  "Cactus (WHD) Soars 5.7%: Is Further Upside Left in the Stock?": 0.6,
  "Is Beyond Meat Stock a Long-Term Buy?": 0.5,
  "Hyundai Motor Group plans to deploy humanoid robots at U.S. factory from 2028 - Hyundai Motor Group plans to deploy humanoid robots at its U.S. manufacturing plant in Georgia starting in 2028, marking a step toward ⁠automating higher-risk and repetitive manufacturing tasks, the South Korean company said. Hyundai unveiled the production version of ‍the Atlas humanoid robot, ‍developed by its ‍unit Boston Dynamics, at the Consumer Electronics Show in Las Vegas. The company did not": 0.5,
  "How Lantronix is Redefining Edge AI Development for Drones": 0.5,
  "AMGEN ACQUIRES DARK BLUE THERAPEUTICS, BOLSTERING ONCOLOGY PIPELINE": 0.6,
  "Index Exchange Launches Gracenote-Powered Show-Level Reporting with Spectrum Reach": 0.5,
  "LitePoint Accelerates Wi-Fi 8 Innovation with Qualcomm Technologies Through Advanced Testing": 0.6,
  "Cadence Launches Partner Ecosystem to Accelerate Chiplet Time to Market": 0.6,
  "Marvell to Acquire XConn Technologies, Expanding Leadership in AI Data Center Connectivity": 0.6,
  "Hubble Network Announces Collaboration with Texas Instruments to Expand Global Bluetooth® Connectivity": 0.5,
  "PayPal Ads Launches Transaction Graph Insights and Measurement to Improve Commerce Advertising Outcomes": 0.5,
  "Investors Heavily Search Shopify Inc. (SHOP): Here is What You Need to Know": 0.5,
  "Investors Heavily Search AppLovin Corporation (APP): Here is What You Need to Know": 0.5,
  "Investors Heavily Search Costco Wholesale Corporation (COST): Here is What You Need to Know": 0.5,
  "With 86% ownership of the shares, Fastenal Company (NASDAQ:FAST) is heavily dominated by institutional owners": 0.2,
  "T-Mobile US (NASDAQ:TMUS) Is Looking To Continue Growing Its Returns On Capital": 0.6,
  "Synopsys Showcases Vision For AI-Driven, Software-Defined Automotive Engineering at CES 2026": 0.6,
  "Germany Cards and Payments Market Report 2025: Opportunities, Trends, and Risks to 2029 - Growing Preference for Online Shopping is Encouraging Several Firms to Enter the Ecommerce Space": 0.6,
  "American Airlines to roll out free Wi-Fi for loyalty program members": 0.8,
  "Can Allot's Strong SECaaS Momentum Fuel Continued ARR Growth?": 0.5,
  "Electronic Arts Earnings Preview: What to Expect": 0.2,
  "Is Baker Hughes (BKR) Quietly Redefining Its Core Through These Latest Portfolio Moves?": 0.5,
  "TIGIT Inhibitors Drugs Clinical Trials & Global Market Opportunity Report 2026-2030: Roche, Gilead Sciences, Merck, Arcus Biosciences, Compugen, and Vir Biotechnology Advance Deep Oncology Pipelines": 0.5,
  "How Power Integrations’ (POWI) New Marketing Chief from Micron and ADI Has Changed Its Investment Story": 0.2,
  "Truist says these are the best 7 GenAI stocks to own in 2026": 0.6,
  "Dark Blue Therapeutics acquired by Amgen for up to $840 million": 0.8,
  "Wall Street Bulls Look Optimistic About Shopify (SHOP): Should You Buy?": 0.8,
  "Is ASML (ASML) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Wall Street Analysts See Cisco (CSCO) as a Buy: Should You Invest?": 0.5,
  "Salesforce and Adobe Start 2026 With a 5% Plunge—Should Investors Buy or Bail?": -0.6,
  "PANW Plunges 14% in 3 Months: Should You Hold or Fold the Stock?": -0.6,
  "CoreWeave initiated, Shopify downgraded: Wall Street's top analyst calls": -0.5,
  "Stocks Are Inching Higher": 0.5,
  "AMAT Stock Rises 114% From Its 52-Week Low: Time to Hold or Fold?": 0.5,
  "Marvell Stock Pops as It Gears Up for the Next Generation of AI With XConn Acquisition": 0.8,
  "Top Robotics Stocks That Could Drive Impressive Returns in 2026": 0.8,
  "Has Arm Holdings (ARM) Run Too Far After Recent Volatile Price Swings?": -0.5,
  "NRC Greenlights Constellation’s $167 Million Digital Modernization Plan for Limerick Clean Energy Center; State-of-the-Art Technology Upgrades Will Enhance Reliability, Diagnostic Capability and Cyber Resilience": 0.8,
  "Uber, Lyft Surge Following Nvidia's Self-Driving Tech Announcement - The rideshare stocks are up today after NVDA unveiled its new autonomous driving platform. UBER jumped by 5.6%, LYFT saw a 3% rise, while TSLA took a slight dip of 3.2%. Nvidia's push into autonomous driving technology seems to be fueling optimism in the space, especially for Uber and Lyft, who have been investing heavily in self-driving tech. However, TSLA's pullback could indicate some short-term profit-taking": 0.6,
  "Shaya Prager Announces Opal Holdings Leasing Activity of 250,000 Square Feet Across Portfolio in 2025": 0.5,
  "UnitedHealth, Chipotle, Starbucks, Mobileye: Top Analyst Calls": 0.5,
  "What are your top stock picks for 2026? - After Christmas, I went fully to cash. Over the past few years I was glued to the screen trading nonstop and ended up neglecting family, so I deliberately stepped away to reset and spend more time with them. Now that 2026 is here, I’m starting to rebuild my portfolio. I’m looking at names like ASTS, RKLB, MU, SMCI, and GRAB as longer-term value plays, while also": 0.4,
  "NVIDIA CEO Announces New AI Paradigm Shifts": 0.5,
  "AIG CEO to step down in June, Ford posts strong Q4 sales": 0.5,
  "If The US Beats China in EVs This ETF Is Going To Soar | DRIV": 0.5,
  "NXP and GE HealthCare Accelerate AI Innovation in Acute Care": 0.5,
  "Cactus Secures 65% Stake in BKR's Surface Pressure Control Business": 0.5,
  "Jobs Week to Commence on Wednesday": 0.0,
  "Cisco’s Long Road Back Shows How Tech Manias Can Bury The Best Companies": -0.5,
  "NXP Semiconductors Partners with GE Healthcare: A Big Step for Edge AI in Healthcare - NXP Semiconductors has teamed up with GE Healthcare to advance edge AI in healthcare. This move could be a game-changer, especially as edge AI reduces cloud reliance and enhances real-time data processing. With NXP’s leadership in edge computing and GE’s presence in healthcare, I believe this partnership has strong growth potential. Given the increasing demand for AI in healthcare, NXPI": 0.8,
  "AI Is ‘Transformative’ for Economy. Duolingo and 5 Other Stocks to Play the Shift.": 0.8,
  "PepsiCo Announces Industry-First AI and Digital Twin Collaboration with Siemens and NVIDIA": 0.5,
  "Honeywell Aerospace's Growth Picks Up: Can the Momentum Sustain?": 0.5,
  "Siemens brings the industrial metaverse to life with Digital Twin Composer": 0.5,
  "Why These 3 Mega-Caps Could Still Surprise Investors in 2026": 0.5,
  "REGN vs. ILMN: Which Stock Should Value Investors Buy Now?": 0.2,
  "BYD vs. TTWO: Which Stock Is the Better Value Option?": 0.5,
  "Could Apple's stock price really drop to $200? I'm waiting to average down， am I being too patient? - I'm curious about everyone's take on Apple Inc. (AAPL). I've been waiting for a chance to buy the dip, targeting around $200. The question is: Is this expectation realistic? Or am I fixated on a price that may never materialize? On one hand: Compared to Apple's own historical valuations, current levels aren't cheap Growth has slowed": -0.5,
  "KLA Jumps 96% in a Year: Is There More Room for the Stock to Grow?": 0.6,
  "JNJ vs. AZN: Which Drug Stock Comes Out on Top for Investors?": 0.2,
  "Texas Instruments to webcast Q4 2025 and 2025 earnings conference call": 0.0,
  "Outlaw Light Closes 2025 as a Category Challenger and Positioned for Accelerated Growth in 2026": 0.8,
  "NXP Advances Edge AI Leadership with New eIQ Agentic AI Framework": 0.6,
  "Siemens Unveils Technologies to Accelerate the Industrial AI Revolution at CES 2026": 0.5,
  "NBCUniversal, RPA, FreeWheel, and Newton Research Introduce Agentic AI Buying Across Linear and Digital for Premium Video": 0.5,
  "Amgen Agrees to Buy Dark Blue Therapeutics in Up to $840 Million Deal": 0.5,
  "Will Take-Two (TTWO) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Will Microchip Tech (MCHP) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Is It Too Late To Consider Buying Qualcomm (QCOM) After Record FY2025 EPS?": 0.2,
  "Kraft Heinz (KHC) Valuation Check As Expanded Kraft Hockeyville Program Draws Fresh Attention": 0.2,
  "How Rising Agoda Demand in Malaysia and Strong Cash Returns Could Shape Booking Holdings (BKNG)": 0.5,
  "The Best Stocks to Invest $1,000 in Right Now": 0.5,
  "Lisbon ends ban on new holiday lets after crackdown backfires": 0.1,
  "Next impresses as FTSE 100 rockets to fresh high": 0.8,
  "Ticker symbol “CLOV” S&P 500 Aspirations or Investor Fantasy? - When Clover AI is the first thing doctors think about in the morning, CLOV belongs in the S&P 500. Share of mind→ market share. 1. Clover becomes a healthcare software company, not just an insurer. 2. Clover AI (Counterpart Health) isn’t admin software, it’s clinical decision intelligence. It helps doctors decide what to do at the point of care, improving outcomes directly. The moat is": 0.6,
  "FTSE 100 hits new record high as New Year rally gains momentum": 0.8,
  "FTSE hits new record as global markets edge higher": 0.8,
  "ARM Stock Down 20% in a Year vs Industry Gains: Buy Signal or Caution?": -0.5,
  "ComEd Announces New Agreements Signed to Ensure Large Load Customers Pay their Fair Share to Connect with and Use the Grid": 0.2,
  "Paychex (PAYX) Q1 2025 Earnings Call Transcript": 0.2,
  "Evaluating Electronic Arts (EA) Valuation After Strong Multi Year Shareholder Returns": 0.6,
  "MCHP Raises Q3 Net Sales Guidance, Shares Rise on Improving Prospects": 0.8,
  "Investors in US drillers go all in on the ‘Donroe doctrine’": 0.2,
  "Stock Market Today, Jan. 6: Dow and S&P 500 Set New Records for New Year Rally": 0.8,
  "Equities Rise Intraday as Markets Weigh Services Sector Data": 0.5,
  "Sector Update: Consumer Stocks Higher in Afternoon Trading": 0.5,
  "How Rising AI Chip Rivalry And Institutional Flows At Arm Holdings (ARM) Have Changed Its Investment Story": 0.5,
  "Universal Partners With Nvidia on AI Music Creation, Discovery - Universal Music Group NV is partnering with Nvidia Corp. to boost the role of artificial intelligence in music discovery and creation, as record labels seek to capitalize on the fast-growing technology while managing the risks AI poses to their catalogs. The collaboration between the world’s largest record label and the leading AI chipmaker is the first of its kind, Universal said. https://www.bloomberg.com/news/articles/2026-01-06/universal-partners-with-nvidia-on-ai-music-creation-discovery": 0.6,
  "Why Microchip Technology Rallied Double-Digits Today": 0.5,
  "Marriott Bonvoy To Provide Unmatched Fan Access to FIFA World Cup 2026™": 0.6,
  "Nvidia, Palantir, Seagate And More: Louis Navellier Says Forget The 'Junk Rally' And Buy These Quality Stocks In 2026 Instead": 0.6,
  "US Restaurant 2026 Same-Store Sales Seen Improving 'Modestly' as Macro Risks Persist, UBS Says": 0.2,
  "Is Airbnb (ABNB) Priced Right After Mixed Returns And DCF Valuation Gap?": 0.1,
  "Why Is Photronics (PLAB) Stock Rocketing Higher Today": 0.6,
  "Assessing AppLovin (APP) Valuation After Profit Taking SEC Scrutiny And Technical Support Break": -0.5,
  "Vertex Pharmaceuticals (VRTX) Stock Trades Up, Here Is Why": 0.5,
  "Is It Time To Reassess PayPal (PYPL) After A 32% One-Year Share Price Decline": -0.5,
  "Should PepsiCo’s (PEP) Industrial Metaverse Bet with Siemens and NVIDIA Require Action From Investors?": 0.1,
  "Beloved theme park hotel closes its doors forever": -0.8,
  "Is This Robotic Surgery Titan the Secret to 100% Gains by 2030?": 0.6,
  "Seagate Technology (STX) Shares Skyrocket, What You Need To Know": 0.8,
  "Why Lam Research (LRCX) Stock Is Trading Up Today": 0.5,
  "Axon (AXON) Shares Skyrocket, What You Need To Know": 0.5,
  "Jack in the Box, Kura Sushi, Starbucks, Wendy's, and The Cheesecake Factory Stocks Trade Up, What You Need To Know": 0.5,
  "Zeta Global, Cadence Design Systems, Atlassian, DigitalOcean, and Bentley Systems Stocks Trade Up, What You Need To Know": 0.5,
  "Musk’s xAI Closed $20 Billion Funding With Nvidia Backing": 0.5,
  "Microchip Technology, NXP Semiconductors, Texas Instruments, Western Digital, and Allegro MicroSystems Stocks Trade Up, What You Need To Know": 0.5,
  "Qualcomm, Vishay Intertechnology, Power Integrations, Teradyne, and Entegris Shares Skyrocket, What You Need To Know": 0.8,
  "Analog Devices, Applied Materials, KLA Corporation, Monolithic Power Systems, and onsemi Shares Are Soaring, What You Need To Know": 0.8,
  "xAI says it raised $20B in Series E funding": 0.5,
  "Sector Update: Tech Stocks Climb Late Afternoon": 0.5,
  "Dow Finally Closes Above 49,000. S&P 500 Also Hits Record.": 0.8,
  "Stock market today: Dow crosses 49,000, S&P 500 jumps to new high in record-setting start to year": 0.8,
  "Short term 9-12 month position in AMD - AMDs growth will surprise a lot of investors, as right now the street is questioning the ability of Lisa Su to deliver the numbers she has guided. I have a long term AMD position (5-10 years) as well, but I do believe because AMD will see super fast growth their could be a potential narrative shift that AMD could hurt NVIDIA, and we could see an NVIDA": 0.6,
  "IBD Stock Of The Day: Seagate Breaks Out To New Highs After AI-Fueled 219% 2025 Rally": 0.8,
  "Sandisk stock soars after Nvidia CEO calls memory storage \"unserved market\"": 0.8,
  "Constellation Energy Stock: Why Nuclear Is the New Tech Trade": 0.5,
  "Stocks to Watch Tuesday: AIG, Vistra, Microchip, Under Armour": 0.0,
  "Amon: AI Not a Bubble for Qualcomm": 0.5,
  "Sandisk’s 1,000% Rally Gets Turbocharged by Nvidia CEO’s Remarks": 0.8,
  "A Consumer-Spending Shift Is Coming. 11 Stocks to Benefit.": 0.5,
  "Fastenal Company Announces Conference Call to Review 2025 Annual and Fourth Quarter Earnings": 0.1,
  "Dow, S&P 500 Hit New Peaks as Investors Look Past Geopolitical Risks": 0.8,
  "Memory Stocks Surge as Shortage Is Expected to Worsen": 0.6,
  "Top Research Reports for JPMorgan Chase, RTX & Applied Materials": 0.5,
  "GE HealthCare Recommends Shareholders Reject \"Mini-Tender\" Offer by Potemkin Limited": -0.8,
  "Heard on the Street Recap: Sandisk Flies Higher": 0.5,
  "Why SanDisk Rocketed Higher, Yet Again, Today": 0.5,
  "Canal Capital Management adds Akre Focus ETF": 0.2,
  "Is Charter Communications (CHTR) Pricing Reflect Its Cash Flow And Earnings Valuation Gap": 0.1,
  "A Look At Mondelez International (MDLZ) Valuation After Recent Share Price Weakness": 0.1,
  "US Equity Indexes Rise With Materials, Health Leading Broad-Based Rally": 0.8,
  "VC says this will be the next phase of the AI revolution": 0.6,
  "Stock Market Today, Jan. 6: Alumis Shares Surge on Positive Phase 3 Psoriasis Data for Envudeucitinib": 0.8,
  "What's the 'Next Big Thing' in AI? Here's What Nvidia and AMD Execs Say It Could Be": 0.5,
  "Stock Market Today, Jan. 6: Dow Jones Sets Record High As Tech Rally Continues": 0.8,
  "Palo Alto Networks (PANW) Rises Higher Than Market: Key Facts": 0.5,
  "Shopify (SHOP) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "AppLovin (APP) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Datadog (DDOG) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "ASML (ASML) Laps the Stock Market: Here's Why": 0.5,
  "Intuit (INTU) Laps the Stock Market: Here's Why": 0.5,
  "Is MU going to fly to the moon? - MU hitting new highs again today. Seeing it break 340 is absolutely insane. I have been telling my circle that memory is the real bottleneck of this AI wave. Since HBM is completely sold out, Micron is basically a money printing machine now. What is your price target? My only regret is not buying more": 0.8,
  "A Fresh Look At Starbucks (SBUX) Valuation As Shares Rebound And Earnings Expectations Diverge": 0.5,
  "Autodesk (ADSK) Outperforms Broader Market: What You Need to Know": 0.5,
  "What Catalysts Are Quietly Shifting The Narrative For Insmed (INSM)?": 0.2,
  "Datadog’s Sticky AI Platform And R&D Spend Might Change The Case For Investing In DDOG": 0.5,
  "(Item 1.01) . Entry into a Material Definitive Agreement Registration Rights Agreement On January 7, 2026, in connection with the closing of the Mergers (as defined below), CEG Parent entered into a registration rights agreement (the “Registration Rights Agreement”) with certain of the former stockholders of Calpine who received shares of Stock Consideration (as defined below) in the Mergers, each of whom is listed on the": 0.0,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On January 7, 2026, CoStar Realty Information, Inc., a subsidiary of CoStar Group, Inc. (“CoStar” or the “Company”), entered into a second amendment (the “Amendment”) to its employment agreement with Andrew C. Florance, Founder and Chief Executive Officer (“CEO”) of the Company (the “Employment Agreement”). The Amendment, which became effective as of January 1, 2026, deletes": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. As previously disclosed on a Current Report on Form 8-K filed with the Securities and Exchange Commission (the “SEC”) on June 16, 2025, as amended on June 17, 2025, Warner Bros. Discovery, Inc. (“we,” “us,” “our” or the “Company”) and our wholly-owned subsidiary, Discovery Communications, LLC, entered into an employment agreement with David Zaslav, our Chief": 0.1,
  "ADP data, Constellation Brands earnings, CES 2026: What to Watch": 0.0,
  "2025 International Travel Overview: Agoda Unveils the Ranking of Top Overseas Destinations Among South Korean Travelers": 0.5,
  "Is Mondelez International (MDLZ) Pricing Look Attractive After Recent Share Price Weakness": 0.5,
  "Does Datadog (DDOG) Offer Value After Recent Share Price Weakness?": 0.2,
  "Microchip Technology (MCHP) Surges 11.6% on Net Sales Beat, Bright Outlook": 0.8,
  "Seagate (STX) Touches All-Time High as Jensen Huang Bullish for Storage Market": 0.8,
  "Western Digital (WDC) Soars to All-Time High as Nvidia CEO Posts Bullish Outlook": 0.8,
  "Sandisk Corp. (SNDK)at All-Time High as Memory Market Set to Become ‘One of the Largest’": 0.8,
  "Should You Buy ASML Stock Before Jan. 28?": 0.2,
  "Taking A Fresh Look At Intuitive Surgical (ISRG) Valuation After A Strong Recent Share Price Run": 0.5,
  "Datadog (DDOG) Valuation Check After Recent Share Price Pullback And Long Term Return Strength": 0.5,
  "Is Palantir Stock a Buy for 2026?": 0.2,
  "Charter Prices $3.0 Billion Senior Unsecured Notes": 0.0,
  "Is Broadcom (AVGO) Still Sensibly Priced After A 5x Three Year Share Price Surge": 0.2,
  "A Look At Costco (COST) Valuation After Mizuho Upgrade And Renewed Growth Optimism": 0.5,
  "Assessing Keurig Dr Pepper (KDP) Valuation After Mixed Short And Long Term Share Returns": 0.1,
  "Assessing Airbnb (ABNB) Valuation After Recent Share Price Momentum": 0.5,
  "Is Western Digital (WDC) Pricing In Too Much After A 349% One Year Surge?": -0.5,
  "Autolink Unveils World's First Deep Fusion EEA at CES 2026": 0.6,
  "Palo Alto Networks (PANW) Valuation Check After Recent Share Price Pullback": 0.2,
  "Micron (MU) Shares Get Bullish Target Hike as DRAM Prices Accelerate": 0.8,
  "Guggenheim Lifts Palo Alto Networks (PANW) Rating Following Deal Activity and AI Tailwinds": 0.6,
  "Analysts Turn Bullish on ASML With Price Target Raised to $1,500": 0.8,
  "WeRide's Robotaxi GXR becomes world's first Robotaxi to adopt NVIDIA DRIVE Thor X chip - \"Our vision is that someday, every single car, every single truck, will be autonomous\" said by Jensen Huang. WeRide was mentioned and highlighted during Jensen Huang keynote in NVIDIA global L4 Robotaxi ecosystem. As part of that ecosystem, WeRide's next gen Robotaxi powered by NVIDIA DRIVE Thor X, running on HPC 3.0 high performance computing platform, developed with Lenovo Vehicle": 0.8,
  "3 Reasons We Love DoorDash (DASH)": 0.6,
  "90% of Investors Plan to Own AI Stocks in 2026: Here Are 2 That Should Be in Your Portfolio": 0.6,
  "Did Strong Quarterly Beat and Efficiency Gains Just Shift Cintas' (CTAS) Investment Narrative?": 0.2,
  "Autolink Announce Collaboration with AMD to Drive Innovation in Intelligent Connected Vehicles": 0.8,
  "1 Momentum  Stock with Promising Prospects and 2 We Question": 0.5,
  "2 Cash-Producing Stocks with Impressive Fundamentals and 1 We Brush Off": 0.5,
  "1 Profitable Stock to Research Further and 2 We Ignore": 0.2,
  "2 Software Stocks for Long-Term Investors and 1 We Brush Off": 0.2,
  "Musk's xAI Raises $20 Billion With Backing From Nvidia and Cisco": 0.8,
  "Bank of America resets Nvidia stock forecast after key event": 0.5,
  "Arm Holdings (ARM) Valuation Check After Rival Chip Design Deal And AI Royalty Optimism": 0.2,
  "Does Garmin’s New AI-Powered Unified Cabin Platform Reshape the Bull Case for GRMN?": 0.2,
  "A Look At Charter Communications (CHTR) Valuation After Recent Senior Unsecured Notes Issuance": 0.1,
  "Comcast (CMCSA) Valuation Check After Recent Share Price Weakness": 0.2,
  "MSCI Spares MicroStrategy — but the Market’s War Over Its Bitcoin Premium Remains": 0.1,
  "2 Elite Growth Stocks That Could Help Set You Up for Life": 0.8,
  "What MercadoLibre Needs to Prove in 2026": 0.0,
  "How Shopify’s AI‑Native “Agentic Commerce” Push Could Impact Shopify (SHOP) Investors": 0.1,
  "Heard on the Street Tuesday Recap: Sandisk Flies Higher": 0.5,
  "Why Palantir Technologies Surged 135% in 2025, and Why It Could Go Even Higher": 0.8,
  "MSCI Drops Plan To Exclude Crypto Treasury Companies After Triggering Oct. 10 Crash": -0.6,
  "MicroStrategy surges after MSCI stalls delisting": 0.6,
  "hedging the impending AI doom bubble - I am not here to debate the bubbliness of it all, or the merits or demerits of AI and all that, or the timeline on which it will collapse. my original bet (made in late 2023) was buying NVDIA, Snap, and Palantir puts that will expire worthless in two weeks unless I spend more to roll them. which I will not, so this is obviously not financial advice,": -0.5,
  "Assessing Gilead Sciences (GILD) Valuation After Recent Share Price Momentum": 0.2,
  "Assessing Cisco Systems (CSCO) Valuation After Recent Short Term Share Price Softness": 0.2,
  "Vertex’s Upgraded IgA Nephropathy Outlook Might Change The Case For Investing In Vertex (VRTX)": 0.5,
  "H-E-B and Market Basket Top dunnhumby’s Ninth Annual U.S. Grocery Rankings; Woodman’s Places Third": 0.5,
  "Bear of the Day: Starbucks (SBUX)": -0.5,
  "Scenic Biotech Enters License and Research Agreement with Ono Pharmaceutical": 0.5,
  "DISCO Pharmaceuticals Enters License Agreement to Advance Novel Cancer Surfaceome Targeted Therapies": 0.6,
  "Metplanet valued at three-month high relative to bitcoin holdings after MSCI decision": 0.6,
  "Strategy rises as MSCI shelves plans to exclude crypto treasury firms from indexes": 0.5,
  "Mondelēz plans US creative review following new marketing exec hire": 0.2,
  "US Stock Market Today S&P 500 Futures Dip As Lower Yields Meet Cost Pressures": -0.5,
  "1 Artificial Intelligence (AI) Stock to Buy Before It Soars 140% to Join Nvidia and Tesla as a Trillion-Dollar Company": 0.8,
  "AI ‘Fatigue’ Leaves Investors Focused on S&P’s Other 493 Stocks": -0.3,
  "Musk’s xAI secures $20bn in Series E funding round": 0.8,
  "Qualcomm in talks with Samsung Electronics for contract manufacturing, South Korean newspaper says": 0.5,
  "MSCI Backs Off Crypto Treasury Exclusion: Fears of Forced Selling by DATs Removed, For Now": 0.2,
  "Trending tickers: Micron, Sandisk Corporation, Ventyx Biosciences, BP and Reckitt": 0.0,
  "2 Unstoppable Growth Stocks to Buy and Hold Through 2035": 0.8,
  "Bank of America Says These 2 Healthcare Stocks Are Top Ideas for 1Q26": 0.5,
  "Hyundai isn't just making robots — it's making subscriptions": 0.2,
  "Investors in Monster Beverage (NASDAQ:MNST) have seen respectable returns of 61% over the past five years": 0.8,
  "Zacks Investment Ideas feature highlights Palantir, Oklo, Centrus, Constellation and Microsoft": 0.5,
  "This Week In AI Chips - AI Powers Shift In-Car Experience Through Strategic Partnerships": 0.5,
  "US High Growth Tech Stocks to Watch in January 2026": 0.5,
  "OneSource Virtual Announces Strategic, Majority Growth Investment from TA": 0.5,
  "META Platforms’ (META) Manus Acquisition Another Step in the Right Direction": 0.8,
  "What Is Honeywell International Inc.'s (NASDAQ:HON) Share Price Doing?": 0.1,
  "Top 2 Tech Stocks That Could Sink Your Portfolio In Q1": -0.8,
  "Intel Stock Jumps as Management Teases New Gaming Chips": 0.8,
  "Is ASML Holding (ENXTAM:ASML) Pricing In Too Much After Its Recent Share Price Surge?": -0.5,
  "Cisco’s Long Road Back Shows How Tech Manias Can Bury Even the Best Companies": -0.7,
  "WBD once again rejects Paramount offer in favor of Netflix deal - Paramount Skydance has guaranteed the backing of billionaire Larry Ellison in its hostile offer for Warner Bros. Discovery, but has fallen short of upping the amount. WBD has rebuffed Paramount’s interest in prior offers before and during the official sale process. WBD has entered into an agreement to sell its streaming and studio business to Netflix. Paramount has been vying to acquire the": -0.5,
  "Palantir Technologies (NASDAQ: PLTR) Stock Price Prediction for 2026: Where Will It Be in 1 Year": 0.2,
  "Palantir Tops 2025 List of Stocks With Biggest Fund Inflows": 0.5,
  "Stocks Mostly Decline Pre-Bell as Investors Await Fresh Labor Market Data": -0.5,
  "Strength Seen in Paccar (PCAR): Can Its 3.7% Jump Turn into More Strength?": 0.6,
  "IDEXX Stock Up 64.7% in a Year: What's Driving the Growth?": 0.6,
  "CoStar Group Provides Full Year 2026 and Medium-Term Outlook with Significant Adjusted EBITDA Expansion": 0.8,
  "Strategy’s STRC perpetual preferred stock returns to $100, may trigger more bitcoin buying": 0.5,
  "Nvidia CEO: How synthetic data generation is helping train AI": 0.5,
  "TSM Hits 52-Week High: Should You Hold the Stock or Book Profits?": 0.2,
  "GE Vernova Stock Rises 13.2% in Three Months: Should You Invest Now?": 0.6,
  "BofA double-upgrades Regeneron, citing stronger Eylea outlook and 2026 catalysts": 0.8,
  "Warner Bros shareholders urged to reject amended Paramount bid": -0.5,
  "Netflix Welcomes Warner Bros. Discovery Rejection of Paramount Skydance Revised Offer": 0.2,
  "What to Expect From Meta Platforms’ Q4 2025 Earnings Report": 0.2,
  "Can Trade Desk's CTV Momentum Hold Off Rising Competition?": 0.2,
  "Cybersecurity Stocks: More Acquisitions Expected In 2026 Amid AI Boom": 0.5,
  "Last Year's No. 1 S&P 500 Stock Is Top Dog Again In 2026": 0.8,
  "Amgen buys Dark Blue Therapeutics in $840m oncology deal": 0.5,
  "Paypal Casinos 2026 - Online Casino That Accept Paypal By Betwhale Casino": 0.1,
  "These 7 Stocks Are Analyst Favorites For Magnificent Earnings Growth; Google Stock Nears Buy Point": 0.8,
  "Cognizant Schedules Fourth Quarter 2025 Earnings Release and Conference Call": 0.0,
  "AbbVie to Host Full-Year and Fourth-Quarter 2025 Earnings Conference Call": 0.0,
  "Alnylam Pharmaceuticals (NASDAQ:ALNY) Seems To Use Debt Quite Sensibly": 0.5,
  "Stocks making big moves yesterday: Herbalife, Vertex Pharmaceuticals, Micron, Amkor, and Palantir Technologies": 0.0,
  "Here Are Wednesday’s Top Wall Street Analyst Research Calls: Applied Digital, BigBear.ai, Block, Deckers Outdoors, GitLab, Hershey, McDonald’s, Moderna, and More": 0.5,
  "US online holiday spending hits record levels despite slower growth, Adobe says": 0.5,
  "Dow Jones Futures Rise After S&P 500 Hits High; Amazon Leads New Buys": 0.5,
  "Metaplanet confirms $451m Bitcoin spend as treasuries ride crypto market price wave": 0.5,
  "Bank of America Out With Q1 2026 Top US Ideas Dividend Picks": 0.2,
  "Comcast price target lowered to $44 from $46 at Benchmark": -0.5,
  "T-Mobile Announces Proposed Public Offering of Senior Notes": 0.1,
  "Warner Bros rejects updated Paramount takeover bid, backs Netflix deal": 0.2,
  "How long will Jensen Huang be Nvidia's CEO?": -0.2,
  "Western Digital (WDC) Surges 16.8%: Is This an Indication of Further Gains?": 0.8,
  "BrightInsight’s Patient App, developed with Sanofi, shows positive impact in patient treatment adherence and persistence": 0.8,
  "If You Invested $1000 in Analog Devices a Decade Ago, This is How Much It'd Be Worth Now": 0.5,
  "Here's How Much You'd Have If You Invested $1000 in Paccar a Decade Ago": 0.5,
  "Laser Photonics Announces Appointment of Respected Marketing Executive Nicole Joyce": 0.5,
  "Accelerated Demand Lifted Western Digital Corp (WDC) in Q4": 0.6,
  "Dan Ives Sees 25% Tech Stock Breakout — Micron And Three Bargain Stocks Stand Out": 0.6,
  "Dave Ramsey Says If You Weren't a 'Slave' To Credit Card, Car Debt, You Could Walk Out Of Your 9-To-5 The Next Time Your Boss Acts Like A 'Jerk'": 0.5,
  "O'Reilly Automotive's Quarterly Earnings Preview: What You Need to Know": 0.0,
  "‘Largest LBO in history’: Warner rejects Paramount again, scoffing at $87 billion worth of debt in its $108 billion bid": -0.8,
  "Warner Bros rejects revised Paramount bid as risky leveraged buyout": -0.6,
  "Warner Bros rejects fresh takeover offer from Paramount in favour of Netflix": 0.2,
  "Warner Bros rejects Paramount bid despite Larry Ellison’s $40bn pledge": 0.1,
  "Newmont Stock Is Interesting, but Here's What I'd Buy Instead": 0.2,
  "ISRG Trading 4% Below All-Time High: Should You Buy the Stock Now?": 0.5,
  "Exchange-Traded Funds Lower, Equity Futures Mixed Pre-Bell Wednesday Amid Economic Date Releases": 0.1,
  "Is AMD About to Surpass Nvidia In the AI Chip Race?": 0.5,
  "Michael Burry Was Right About Valero Energy. Is He Right About an AI Bubble?": 0.2,
  "3 Stocks to Boost Your Portfolio as Dow Hits All-Time Closing High": 0.8,
  "Cadence Announces Fourth Quarter and Fiscal Year 2025 Financial Results Webcast": 0.0,
  "T-Mobile Introduces Its Most Value-Packed Plan Ever": 0.8,
  "Two Builders Who Broke the Rules Headline Jobber Summit 2026: Netflix Co-Founder Marc Randolph and 1-800-GOT-JUNK? Founder Brian Scudamore": 0.2,
  "Marshall Mohr Joins Capstan Medical Board of Directors": 0.5,
  "Micron Announces Groundbreaking for Historic New York Megafab": 0.8,
  "Dexcom Enters Next Era of Continued Innovation With Jake Leach as President and Chief Executive Officer": 0.8,
  "Arm Announces Earnings Release Date for Third Quarter Fiscal Year Ended 2026": 0.1,
  "Old Dominion Freight Line to Webcast Fourth Quarter and Year-End 2025 Conference Call": 0.0,
  "VIVUS Introduces Lower Pricing on QSYMIA® at Costco Locations Across Hawaii": 0.5,
  "1 Analyst Just Doubled His Price Target on ASML Stock. Should You Buy Shares Now?": 0.5,
  "Here is What to Know Beyond Why Intuitive Surgical, Inc. (ISRG) is a Trending Stock": 0.2,
  "Vertex Pharmaceuticals Incorporated (VRTX) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Is Trending Stock Strategy Inc (MSTR) a Buy Now?": 0.0,
  "Investors Heavily Search Cisco Systems, Inc. (CSCO): Here is What You Need to Know": 0.5,
  "Adobe Inc. (ADBE) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Robinhood Markets and Starbucks have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "These 5 Software Stocks Prove Profitability Beats Growth in 2026": 0.6,
  "Why Intel Stock Soared 84% in 2025": 0.8,
  "ADP employment report shows white-collar jobs wipeout": -0.7,
  "AI Spending Hits Mania—Is It Time to Bail on the Magnificent 7?": -0.6,
  "Lam Research (LRCX) Is Up 19.1% After Analysts Spotlight Its AI-Focused Chipmaking Tools": 0.8,
  "Warners Bros. Discovery board urges shareholders to reject amended Paramount bid": -0.5,
  "Micron Stock: Price Target increased to $400 by UBS and Piper Sandler (January 7, 2026) - Just saw the news in my IBKR News Feed. UBS and Piper Sandler both increased the price target for the Micron Stock to Overweight and $400. While posting this MU is at $337 premarket. Sources: [https://www.cnbc.com/2025/12/11/ubs-raises-micron-price-target-heading-into-earnings-next-week.html](https://www.cnbc.com/2025/12/11/ubs-raises-micron-price-target-heading-into-earnings-next-week.html) [https://www.investing.com/news/company-news/micron-technology-stock-hits-alltime-high-at-32563-93CH-4432799](https://www.investing.com/news/company-news/micron-technology-stock-hits-alltime-high-at-32563-93CH-4432799)": 0.8,
  "Bitcoin Drops. Why the Crypto Rally Is Taking a Pause Today.": -0.5,
  "New AI Platform Launches to Combat $28 Billion Scam Economy Targeting Seniors": 0.5,
  "Stock Market News for Jan 7, 2026": 0.0,
  "Company News for Jan 7, 2026": 0.0,
  "WBD rejects Paramount Skydance bid, Strategy pops, Discord IPO": 0.2,
  "INTC Rolls Out Core Ultra Series 3 Chips: Will it Boost Prospects?": 0.5,
  "Venezuela-driven pop in oil stocks may fade, but some gains to hold: Citi": 0.2,
  "Broadcom (AVGO) Rose on Record Earnings and Higher Demand": 0.8,
  "Thomson Reuters Fourth-Quarter and Full-Year 2025 Earnings Announcement and Webcast Scheduled for February 5, 2026": 0.0,
  "Amazon (AMZN) Is Considered a Good Investment by Brokers: Is That True?": 0.5,
  "Is It Worth Investing in Micron (MU) Based on Wall Street's Bullish Views?": 0.5,
  "Strategy Stock Won’t Get Booted From Indexes, MSCI Says": 0.5,
  "NVTS Surges 54% in 6 Months: Should You Hold or Fold the Stock?": 0.5,
  "CDNS Boosts Physical AI With Spec-to-Packaged Chiplet Ecosystem": 0.5,
  "If You Own UPS Stock, Take a Look at This Instead": -0.5,
  "Wayfair upgraded, Instacart initiated: Wall Street's top analyst calls": 0.5,
  "Microchip Tech (MCHP) Surges 11.7%: Is This an Indication of Further Gains?": 0.6,
  "Here's Why Take-Two Interactive (TTWO) is a Strong Growth Stock": 0.8,
  "Broadcom (AVGO) Q3 2024 Earnings Call Transcript": 0.0,
  "TSMC Stock Can Keep Winning From AI, J.P. Morgan Says. It’s Not Good for Intel.": 0.5,
  "NXP Semiconductors (NXPI) Recently Broke Out Above the 20-Day Moving Average": 0.5,
  "Warner Bros. Discovery rejects Paramount’s bid again, calls it a ‘leveraged buyout’": -0.5,
  "Reliable, High-Speed Internet from Xfinity Coming to Centreville, MD": 0.8,
  "Can Credo's Solid Cash Position Give It an Edge Against Rivals?": 0.5,
  "Dow Slips From Record High as Stock Market Takes a Breather": -0.5,
  "ASML Stock Rises 58.2% in 6 Months: Should You Buy, Sell or Hold?": 0.5,
  "Warner Bros tells investors to reject sweetened £80bn Paramount bid": -0.5,
  "Is It Too Late To Consider Buying CrowdStrike (CRWD) After Recent Pullback In The Share Price": 0.2,
  "Why Applied Materials (AMAT) Is Up 13.9% After Renewed AI-Focused Factory Spending Expectations And What's Next": 0.6,
  "Warner Bros. Discovery (WBD) Valuation Check As Recent Share Price Swings Reshape Market Expectations": 0.2,
  "Sandisk stock rose 27% yesterday. Here’s why": 0.8,
  "4 Fascinating Things About DoorDash That Investors Should Know": 0.5,
  "ADP Rebounds to +41K, JOLTS & ISM Services After the Open": 0.5,
  "ADP Jobs, ISM Services Data Will Keep Fed On Hold; S&P 500 Steady": 0.2,
  "What Palantir Needs to Prove in 2026": 0.1,
  "UniFirst Maintains Outlook; Fiscal First-Quarter Earnings Decline": -0.5,
  "MSCI retains Strategy in indices, keeps door open for other bitcoin treasuries": 0.2,
  "Resort from 'Biggest Loser' show files for Chapter 11 bankruptcy": -0.8,
  "Crypto selloff accelerates, sending bitcoin back to $91,000": -0.7,
  "Market Awaits JOLTS Numbers": 0.0,
  "Regeneron Pharmaceuticals to Have Multiple Pipeline Updates in 2026, BofA Says": 0.5,
  "Why Strategy Stock Is Climbing Today": 0.5,
  "Unitech Launches World's First Industrial-Grade Windows on ARM Tablet, Bringing Enterprise Mobility to the Frontline": 0.8,
  "Microsoft Dips 9% in 3 Months: 3 Reasons Why the Stock is Still a Buy": 0.5,
  "Online Holiday Spending Hit Records. AI Helped.": 0.8,
  "3 Reasons Why Investors Should Stay Away From MELI Stock Right Now": -0.8,
  "Intuit (INTU) Valuation Check As New Buy Ratings And Dividend Increase Highlight AI Growth Story": 0.6,
  "Can MongoDB's Strong Partner Ecosystem Drive Long-Term Growth?": 0.5,
  "These 3 Sectors Look Too Cheap to Ignore in 2026": 0.5,
  "Is BigBear.ai Stock Your Ticket to Becoming a Millionaire?": 0.5,
  "The Protocol: Ledger customer data breached from Global-e platform": -0.8,
  "Why Regeneron (REGN) Stock Is Trading Up Today": 0.5,
  "AMD's \"AI Everywhere, for Everyone\" Push: Is the Stock Ready to Rally?": 0.5,
  "Generative Artificial Intelligence (AI) in Chatbots Global Market Analysis Report 2025 Featuring Major Players - Amazon, Google, Microsoft, Meta, IBM, Salesforce - Long-term Forecast to 2029 and 2034": 0.5,
  "December Private Sector Hiring Rebounds Less Than Expected, ADP Data Show": -0.5,
  "Warner Bros. Board Rejects Paramount Offer, Backs Netflix Deal": 0.2,
  "4 Diversified Operations Stocks to Watch Despite Industry Headwinds": 0.5,
  "China Begins Review of Meta's $2 Billion Manus Acquisition": 0.1,
  "UBS lifts Micron estimates after bullish management meetings": 0.8,
  "Add These 4 GARP Stocks to Your Portfolio to Receive Handsome Returns": 0.8,
  "New Wi-Fi 8 Expands AVGO's Connectivity Portfolio: What's Ahead?": 0.2,
  "Palantir Involved in the Capture of Nicolás Maduro? Markets Think Peter Thiel-Linked Company 'Heavily Involved,' Says This Industry Commentator": 0.5,
  "RBC Says \"2026 May Bring a Rebound for Canadian Software Stocks\"": 0.6,
  "REGN vs. ILMN: Which Stock Is the Better Value Option?": 0.0,
  "What Tesla Needs to Prove in 2026": 0.1,
  "Top Midday Stories: Warner Bros. Board Urges Shareholders to Reject Revised Paramount Offer; China Asks Tech Companies to Halt Nvidia Chip Orders": -0.5,
  "ALMS Surges as Envudeucitinib Meets Goals in Plaque Psoriasis Studies": 0.8,
  "Reasons Why You Should Retain Paychex Stock in Your Portfolio": 0.5,
  "S&P 500 Edges Higher After Latest Updates on the Economy": 0.5,
  "Apple and Dell Face Soaring Memory Prices. How the Stocks Can Handle the Threat.": 0.2,
  "How to Identify Stock Market Winners Early in 2026": 0.5,
  "Stocks Edge Up; Oil Futures Decline": 0.2,
  "Will Regeneron (REGN) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "How to Trade the Magnificent 7 Stocks in 2026": 0.5,
  "Assessing Whether Adobe (ADBE) Looks Undervalued After A Choppy Year Of Share Price Performance": 0.2,
  "A Look At Seagate Technology (STX) Valuation As AI Data Center And HAMR Demand Builds": 0.5,
  "ALAB Stock Rallies 20% in One Year: Should You Buy, Hold, or Sell?": 0.5,
  "Has Intel (INTC) Shares Run Too Far After 101% One Year Rally?": -0.5,
  "The Prospects of a Bumper West African Cocoa Crop Weighs on Prices": -0.5,
  "US Equity Indexes Mixed in Midday Trading": 0.0,
  "Can Retirees Count on JEPQs 10.4% Dividend and Monthly Payments?": 0.1,
  "IREN Stock Trading at a P/S of 24.12X: Should You Buy, Sell or Hold?": 0.2,
  "Exclusive: Nukkleus CEO Reveals 'Drone And Anti-Drone' M&A Focus Following Israeli Defense Tech Acquisition": 0.5,
  "Homes.com Will Be Profitable in 2030, CoStar Says. Investors Aren’t Thrilled.": -0.5,
  "Exelon's Regulatory Strength Offset by Affordability Pressures, RBC Says": 0.1,
  "Warner Bros. Rejects Latest Paramount Bid, Favoring Netflix": 0.2,
  "Bitcoin Slips As Strategy Jumps Despite Negative MSCI Rule": -0.5,
  "Amazon Stock: This Option Trade Works For E-Commerce Giant": 0.5,
  "Warner Bros. Board Recommends Shareholders Reject Paramount's Amended Bid in Favor of Netflix Deal": 0.5,
  "HP Pitches A More Practical AI Workplace": 0.5,
  "Hyundai Mobis and Qualcomm Sign Comprehensive Agreement to Collaborate on SDV architecture for ADAS": 0.5,
  "Warner Bros Rejects Revised $108 Billion Paramount Bid, Backs Netflix Offer": 0.2,
  "Micron Price Target Raised to $400 at UBS on AI-Driven Memory Demand": 0.8,
  "xAI Raises $20 Billion In Mega Round": 0.8,
  "Intel Confirms New Gaming Chip Push": 0.5,
  "Siemens, Nvidia Deepen Industrial AI Push": 0.5,
  "Tech Stocks Are Stuck. It’s a Good Time to Buy.": 0.6,
  "Why Micron Stock Is Winning Big in the AI Memory Boom": 0.8,
  "Let me tell you something I heard about MU... - A company specializing in automotive supply chains made a strategic decision several years ago to heavily support American electric vehicles (primarily Ford and GM). However, both automakers subsequently cut their pure electric projects. In early 2025, this supply chain company initiated major layoffs. Fortunately, its non EV projects remain quite robust. Their primary semiconductor supplier is MU. In the latter half of the year, MU": 0.2,
  "This Might Be the Most Underrated Artificial Intelligence Stock to Own in 2026": 0.5,
  "Where Will PayPal Stock Be in 1 Year?": 0.0,
  "Strategy Stock Is Getting a Boost—But the Battle to Keep It in Indexes Isn't Over": 0.2,
  "Reddit's Top Stocks 2026 ETF Experiment - I've allocated $1000 into a weighted portfolio of reddit's top 15 favorite stocks for 2026. Credit to u/timeinthemarket for compiling the list. Stocks are ranked by # of mentions in [r/stocks](https://www.reddit.com/r/stocks/), [r/wsb](https://www.reddit.com/r/wsb/) and [r/investing](https://www.reddit.com/r/investing/) on several 2026 stock recommendation posts. I'll report back same time next year if I remember! * 1 RKLB (13.26%) * 2 ASTS (11.60%) * 3 AMZN (10.50%) * 4 NBIS (9.39%) * 5": 0.5,
  "Lip-Bu Tan Says They 'Over-Delivered' On 18A Timeline As Intel Shows Off Next Gen Panther Lake AI Laptop Chips At CES 2026": 0.5,
  "Why Warner Bros Rejected Paramount’s Latest Offer in Favor of Netflix": 0.1,
  "Nordstrom pushes Rack expansion despite retail slowdown": -0.5,
  "Is Amazon Stock a Buy for 2026?": 0.2,
  "Anthropic reportedly raising $10B at $350B valuation": 0.5,
  "Gold falls more than 1% as investors lock in profits": -0.5,
  "The Round-Number Rally: Dow 50K Isn’t the Only Big Target in Global Markets": 0.5,
  "Intel stock rallies as CES debut of Panther Lake chip marks make-or-break moment": 0.6,
  "Google has overtaken Apple's market cap, becoming the second most valuable company in the world - Google (NASDAQ:GOOG) climbed 2.3% today to hit a new all-time high of $325.02, with its market capitalization now $3.92 trillion. This move surpassed Apple's (NASDAQ:AAPL) market capitalization of $3.86 trillion making Google's parent Alphabet the world's second-largest company by market value. Sources: - https://www.benzinga.com/markets/equities/26/01/49763932/stock-market-news-wednesday-wall-street-today-sp500-record-highs-alphabet-intel-apple - https://companiesmarketcap.com/": 0.8,
  "US Equity Indexes Mixed as Job Openings Unexpectedly Drop While ISM Services Hits Highest for 2025": 0.2,
  "Equities Mixed Intraday After Job Market Data": 0.0,
  "Anthropic eyes $350 billion valuation in massive round, Journal reports": 0.5,
  "Shopify competitor Swap raises $100M six months after raising $40M": 0.8,
  "Mag 7 Stock Amazon Continues Its Winning Ways; Earns Rating Upgrade": 0.8,
  "Ross Stores' Q3 Comps Surge: Can Momentum Carry Into FY26?": 0.6,
  "Daily Roundup of Key US Economic Data for Jan. 7": 0.0,
  "Constellation Energy (CEG) Valuation Check After Recent Share Price Weakness And Strong Long Term Returns": 0.5,
  "Why Arm Holdings Plunged Nearly 20% in December": -0.8,
  "These 2 Dividend Payers Are Some of the Best Stocks to Buy for 2026": 0.8,
  "Dow Jones Tech Titan Apple Stock Offers Buy Point, But Has Broken Key Level": 0.1,
  "The 3 Best Chip Stocks to Buy for 2026 Are Companies You Have Probably Never Heard Of": 0.5,
  "AI, chips, and robots dominated CES 2026. It's just the beginning.": 0.5,
  "Exclusive-Arm launches 'Physical AI' unit, joining rush to robotics by tech and automakers": 0.5,
  "GameStop Proposes CEO Pay Package Tied to ‘Extraordinary Growth.’ The Stock Is Rising.": 0.8,
  "Before Retiring, Warren Buffett Sold Apple and Bank of America Stock and Bought This Incredible Stock That's Up 78% in 6 Months": 0.8,
  "The 3 Best Cybersecurity Stocks to Buy for 2026": 0.5,
  "Brady Stock Is up 13% This Past Year, but Here's Why One Fund Cashed Out Completely": 0.2,
  "The Dow and S&P 500 Are in the Red": -0.5,
  "Cisco: Closing the Gap: bitsIO Wins Splunkie Award for Data and AI-Powered Nonprofit Solutions": 0.6,
  "40 stocks likely to outperform in 2026: Boyar pres. explains": 0.2,
  "How Investors May Respond To Intuitive Surgical (ISRG) Surging da Vinci Usage and New FDA Approvals": 0.5,
  "Why Are CrowdStrike (CRWD) Shares Soaring Today": 0.5,
  "Why Is Intel (INTC) Stock Rocketing Higher Today": 0.6,
  "Jay Stein, Who Turned Universal’s Studio Tour Into a Theme-Park Empire, Dies at 88": 0.5,
  "3 Growth Stocks to Invest $1,000 in Right Now": 0.5,
  "Former Apple CEO John Sculley to Pay $40 Million for West Palm Beach Condo": 0.2,
  "Freight Railroad CSX Lays Off 166 Management Workers": -0.8,
  "Tesla Rival Lucid Unveils Prototype Robotaxi In Collaboration With Uber Amid Strong Q4 Deliveries": 0.8,
  "Intel Is Doubling Back Down on Gaming. Does That Make INTC Stock a Buy Here?": 0.5,
  "Treasury Yields Mixed Ahead of Claims Data": 0.0,
  "Is Chipotle Stock Serving Up a 'Spicy Revival Story' in 2026?": 0.6,
  "US Equity Indexes Mixed as S&P 500, Dow Jones Retreat From All-Time Highs": -0.2,
  "Chasing Sandisk and Micron May Be Hazardous to Your Portfolio": -0.6,
  "Coinbase exec names 2 factors driving bitcoin back toward highs in 2026": 0.5,
  "Sector Update: Financial Stocks Decline Late Afternoon": -0.5,
  "Sector Update: Tech Stocks Retreat Late Afternoon": -0.5,
  "Stock market today: Dow, S&P 500 slide from records as rally loses steam amid growing risks": -0.6,
  "Diamondback Energy, Inc. Schedules Fourth Quarter 2025 Conference Call for February 24, 2026": 0.0,
  "AMGEN TO PRESENT AT THE 44TH ANNUAL J.P. MORGAN HEALTHCARE CONFERENCE": 0.2,
  "Viper Energy, Inc., a Subsidiary of Diamondback Energy, Inc., Schedules Fourth Quarter 2025 Conference Call for February 24, 2026": 0.0,
  "US Equity Markets End Mixed Wednesday as Investors Assess Recent Labor, Services Data": 0.1,
  "Citi Raises Cintas (CTAS) Target but Keeps Sell Rating": -0.5,
  "Regeneron Stock Lagged Behind the S&P 500 Last Year. Why This Firm Moved Off the Sidelines.": 0.2,
  "DoorDash to Announce Fourth Quarter and Full Year 2025 Financial Results on February 18, 2026": 0.0,
  "Five9 Announces Upcoming Conference Participation": 0.0,
  "Lam Research Corporation Announces December Quarter Financial Conference Call": 0.0,
  "AppLovin to Announce Fourth Quarter and Full Year 2025 Results": 0.0,
  "Why Elon Musk And Tesla Aren't 'Losing Sleep' Over Nvidia's Self-Driving Announcement": 0.5,
  "Microsoft announces quarterly earnings release date": 0.0,
  "Has Tesla (TSLA) Outrun Its Valuation After Mixed Recent Share Price Performance?": -0.2,
  "Troubled coffee shop chain files Chapter 11 bankruptcy, seeks sale": -0.8,
  "Costco Wholesale Corporation Reports December Sales Results": 0.0,
  "Constellation Completes Calpine Transaction, Powering America’s Clean Energy Future": 0.8,
  "Intel Stock Is Soaring. Is the Turnaround Gamble Finally Paying Off?": 0.5,
  "Why Globalstar Stock Crashed Today": -0.8,
  "Alphabet Surpasses Apple in Market Cap for First Time Since 2019": 0.5,
  "Dollar steady, range-bound as investors assess US labor data": 0.2,
  "Tesla Stock Can’t Handle the Robot Competition": -0.6,
  "Mobileye Stock Soars After $900 Million Deal for Mentee. The Reason for the Reaction.": 0.6,
  "Intel to Report Fourth-Quarter and Full-Year 2025 Financial Results": 0.0,
  "What happened to Mondelez International in last 7 days? The stock lost more than 5% - 2025 was also a very bad year for Mondelez, with more than -10%. I know the problem of the inflation and the increasing cost of cocoa. But I don't understand the reason for the last dropping of the stock price. The only news I hear about the stock is that Robert F. Kennedy criticized the ultra proccessed foods. But": -0.6,
  "Alphabet’s Market Cap Rallies Past Apple for First Time in Nearly Seven Years": 0.8,
  "JPMorgan to replace Goldman as Apple Card issuer": 0.5,
  "3 Red-Hot Growth Stocks to Buy in 2026": 0.8,
  "Dow, S&P 500 Fall From Records as Traders Assess Trump's Move to Ban Institutional Home Buying": -0.5,
  "Productivity needed from AI to justify high valuations, expert says": 0.2,
  "Nvidia Sees a Big Sales Opportunity in China. Locking It Up Hasn't Been Easy": 0.2,
  "Question for IBKR users, Cost of selling & re-buying US individual stocks? - Hey everyone, For Canadian users, For those of you who use Interactive Brokers (IBKR) and trade US individual stocks, what are the actual fees when you: Sell a US stock you already hold. Re-buy the another US stock. Specifically: Do you pay FX fees when selling and re-buying (even though funds stay in USD)? Are there commissions or exchange fees per trade?": -0.2,
  "Stocks to Watch Wednesday Recap: Strategy, Boeing, Netflix, Paramount": 0.0,
  "These Stocks Moved the Most Today: Strategy, Sandisk, Alphabet, First Solar, GameStop, Cal-Maine, and More": 0.2,
  "Top Stock Reports for Micron Technology, Roche & UnitedHealth": 0.5,
  "How Qualcomm chips are powering humanoid robots: CFO explains": 0.2,
  "Constellation Sales Fall as Hispanic Pullback Continues": -0.6,
  "How NXP Semiconductors Stock Gained 11.4% Last Month": 0.6,
  "Transource and BHE Transmission to Build Nearly 200-Mile 765-kV Transmission Line in Wisconsin": 0.5,
  "Constellation Energy Completes Calpine Deal": 0.5,
  "S&P 500, Dow Jones Slid From Peaks Amid Sell-Off in Old Economy Sectors, Mounting Geopolitical Crisis": -0.7,
  "Stock Market Today: Dow Slips Back Below 49K; Trump Takes On Defense Firms (Live Coverage)": 0.1,
  "Analyst Upgrades And Short-Interest Drop Might Change The Case For Investing In Regeneron (REGN)": 0.5,
  "Google Co-Founder Larry Page Spends $173.4 Million on Two Miami Homes": 0.5,
  "Weighing Weebit Nano’s Valuation After The Texas Instruments Deal And New 2026 Revenue Guidance": 0.2,
  "HYDAWAY DIGITAL ENTERS INTO GPU COMPUTE SERVICES AGREEMENT WITH FOSTER & CO.": 0.2,
  "Boston Dynamics Debuts Tesla Optimus Rival Atlas Robot, Teams Up With Google DeepMind As Hyundai Prepares Deployment": 0.5,
  "Top analyst drops eye-popping price target on ASML stock": 0.8,
  "Should You Forget Tesla and Buy 3 Artificial Intelligence (AI) Stocks Instead?": 0.2,
  "Applied Materials (AMAT) Falls More Steeply Than Broader Market: What Investors Need to Know": -0.6,
  "Why ASML (ASML) Dipped More Than Broader Market Today": -0.5,
  "Constellation Energy Corporation (CEG) Dips More Than Broader Market: What You Should Know": 0.1,
  "Alphabet (GOOGL) Gains As Market Dips: What You Should Know": 0.5,
  "Alphabet Inc. (GOOG) Increases Despite Market Slip: Here's What You Need to Know": 0.5,
  "Qualcomm (QCOM) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Why Paypal (PYPL) Dipped More Than Broader Market Today": -0.5,
  "Starbucks (SBUX) Falls More Steeply Than Broader Market: What Investors Need to Know": -0.5,
  "Chase to become new issuer of Apple Card": 0.5,
  "Fortinet (FTNT) Rises As Market Takes a Dip: Key Facts": 0.5,
  "Why Lam Research (LRCX) Dipped More Than Broader Market Today": -0.5,
  "Why the Market Dipped But Booking Holdings (BKNG) Gained Today": 0.2,
  "Why Texas Instruments (TXN) Dipped More Than Broader Market Today": -0.5,
  "Western Digital (WDC) Dips More Than Broader Market: What You Should Know": -0.5,
  "Solana Mobile to airdrop 30% of smartphone token supply": 0.5,
  "Veteran analyst sounds alarm on Palantir stock after Venezuela raid": -0.5,
  "United Parcel Service (UPS) Is Up 6.3% After Margin-Focused Earnings Beat From Efficiency Reimagined": 0.8,
  "Paccar (PCAR) Falls More Steeply Than Broader Market: What Investors Need to Know": -0.5,
  "Here's Why KLA (KLAC) Fell More Than Broader Market": -0.6,
  "Exec Edge NYSE Firesides Scheduled Feb 3, 2026": 0.0,
  "Stock Market Today, Jan. 7: Banks Slide as Stock Rally Slows": -0.5,
  "Larry Page loosens business ties to CA amid state’s proposed wealth tax, report": -0.5,
  "Nvidia vs. Palantir: Which Is the Better AI Stock for 2026?": 0.2,
  "Stock Market Today, Jan. 7: Intel Surges After Panther Lake AI PC Chips Spark Investor Optimism": 0.8,
  "Constellation Closes Deal for Calpine, Creating Biggest Electricity Generator": 0.6,
  "'Screw MasterCard' — Dave Ramsey Tells Dad With $26K In Consumer Debt And Weekly Overdrafts To Feed His Triplets First": -0.8,
  "Warner Discovery Rejects Paramount’s Amended Hostile Bid": -0.5,
  "Stock market today: Dow, S&P 500, Nasdaq futures fall after Wall Street's early 2026 rally stalls": -0.5,
  "Why Alphabet Stock Topped the Market Today": 0.5,
  "The reason Costco stores feel less busy is surprisingly simple": 0.2,
  "AAPL price debate: still a “safe premium” or quietly becoming dead money? - Seeing some product rumors today, Perhaps you can search for it yourselves. That’s where I think the real debate is: AAPL is still trading at a clear premium, yet revenue growth is slow, iPhone upgrades feel incremental, and services growth while solid isn’t exactly accelerating. Bulls say: It’s still the ultimate defensive tech Massive buybacks ecosystem lock in justify the multiple Bears": -0.5,
  "Markets Settle Mixed on Big Day for Data": 0.2,
  "Google is like a hexagonal warrior with no weaknesses. - GOOG spans an incredibly broad range of industries, including search advertising, YouTube, cloud services, Android/Play, AI research/products, and various hardware and new ventures. This company doesn't rely on a single strategy; instead, it advances on six fronts simultaneously. If one area falters, the others can step up to compensate. Which aspect of GOOG do you value most when investing?": 0.8,
  "T-Mobile Agrees to Sell $2.0 Billion of Senior Notes": 0.5,
  "WWE fans forced to switch platforms after major Netflix change": -0.6,
  "JPMorgan Chase Reaches a Deal to Take Over the Apple Credit Card - JPMorgan Chase has reached an agreement to take over the Apple Card program from Goldman Sachs, becoming the new issuer of Apple’s co-branded credit card which is one of the largest in the U.S. with roughly $20 billion in outstanding balances. Goldman is selling the card balances at a discount of more than $1 billion, reflecting challenges with credit performance such as": 0.2,
  "JPMorgan Chase Reaches Deal to Take Over Apple Credit Card": 0.5,
  "JPMorgan in Deal for Apple Credit Cards": 0.5,
  "Waymo’s Robo-Taxi Lead Widens as Tesla Plays Catch-Up in the Autonomous Race": 0.5,
  "ChatGPT’s Market Share Retreat Raises New Questions About OpenAI’s Long-Term Value": -0.5,
  "Cisco’s 25-Year Journey Back to Its Dot-Com Peak Offers a Cautionary Tech Lesson": 0.1,
  "Can AI Legally Turn $100,000 Into $1 Million? Microsoft AI CEO Mustafa Suleyman Says That's The Real Test Of Intelligence": 0.5,
  "Broad-Based Earnings Growth Expected in 2026": 0.6,
  "Is It Too Late To Consider Synopsys (SNPS) After Strong Multi‑Year Share Price Gains": 0.2,
  "Intel Corp. (INTC) Soars 6.5% Ahead of FY25 Earnings": 0.8,
  "Why Intel Stock Popped Today": 0.5,
  "T-Mobile tops Verizon, AT&T in key network rankings": 0.8,
  "CSX lays off 5% of management staff, furloughs conductors": -0.6,
  "Samsung’s Profit Triples After AI Supercharges Memory Market": 0.8,
  "How PayPal’s New Transaction Graph Analytics Program Will Impact PayPal Holdings (PYPL) Investors": 0.5,
  "PACCAR (PCAR) Is Up 5.3% After Surging Class 8 Orders And Insider Buying - Has The Bull Case Changed?": 0.6,
  "Should You Forget Palantir and Buy These 2 Tech Stocks Instead?": 0.2,
  "Tesla's Chinese Rival Geely Mulling US Market Debut In The Next 2-3 Years: Report": 0.5,
  "Loaded some $30 1/30 calls for $SOFI - Hey everyone, this is my next play: I am buying $30 calls expiring 1/30 for $SOFI. This play is a reversal/earnings play. SOFI has reached a bottom at the $26 range, and has since bounced to 26.98, where it closed. Here is my thesis: First off, SoFi is a digital financial services company that offers banking, loans, investing, and personal finance tools all in one app to": 0.4,
  "Intel Stock Soars to Start the Year: Is It a Buy?": 0.6,
  "Trump Team Works Up Sweeping Plan to Control Venezuelan Oil for Years to Come - https://www.wsj.com/business/energy-oil/trump-venezuela-oil-us-control-plan-265a39c1 > President Trump and his advisers are planning a sweeping initiative to dominate the Venezuelan oil industry for years to come, and the president has told aides he believes his efforts could help lower oil prices to his favored level of $50 a barrel, according to people familiar with the matter. > A plan under consideration envisions the U.S.": -0.6,
  "The Bull Case For Kenvue (KVUE) Could Change Following New Asia-Pacific CMO Appointment - Learn Why": 0.5,
  "Is It Too Late To Consider AstraZeneca (LSE:AZN) After A 35% One-Year Rally?": 0.2,
  "A Look At Cognizant Technology Solutions (CTSH) Valuation After Closing The 3Cloud Acquisition": 0.2,
  "If You'd Invested $2,000 in Nvidia 5 Years Ago, Here's How Much You'd Have Today": 0.5,
  "Faraday Future Announces the FX Super One Roadmap for Mass Production, Sales, Delivery, Service and Ramp-Up and Its Entry into Embodied AI Robotics, along with Its Execution Plan for FF's Five-Year Business Plan": 0.5,
  "Dow Jones Futures Fall; Eli Lilly Breaks Out, Google Trumps Apple": 0.2,
  "Why Nebius Group Stock Fell 11% in December": -0.5,
  "Lucid, Nuro and Uber unveil robotaxi at CES ahead of 2026 launch": 0.5,
  "A Look At AstraZeneca (LSE:AZN) Valuation After Strong Recent Share Price Returns": 0.5,
  "Is It Too Late To Consider Seagate Technology Holdings (STX) After Its 254% One-Year Surge": 0.2,
  "Assessing NXP Semiconductors (NXPI) After Recent Share Price Strength And Mixed Valuation Signals": 0.2,
  "Microchip Technology (MCHP) Is Up 16.0% After Raising Q4 Sales Guidance On Broader Demand Recovery": 0.8,
  "Is Marvell Technology (MRVL) Attractively Priced After Recent Share Price Weakness": 0.5,
  "How Investors Are Reacting To Apple (AAPL) Shifting Apple Card To JPMorgan And Doubling Down On AI Services": 0.2,
  "Is Axon (AXON) Stock a Buy in 2026?": 0.2,
  "Beating Back the Bubble: A Defensive Fund Portfolio for These Times": 0.2,
  "Exclusive-Nvidia requires full upfront payment for H200 chips in China, sources say": -0.6,
  "BLUETTI Brings Together Texas Instruments, Covestro, Leave No Trace at CES 2026 to Explore the Future of Clean Energy": 0.5,
  "Assessing NXP Semiconductors (NXPI) Valuation After Recent Share Price Pullback": 0.5,
  "TomTom enhances maps and navigation with Microsoft Azure integration": 0.6,
  "JPMorgan Chase becomes the new issuer of the Apple Card": 0.5,
  "Alphabet (GOOGL) Gains Market Outperform Rating With Google Ad Revenue Growth and Data Center Expansion": 0.6,
  "Palantir (PLTR) Gets Buy Rating Amid Expanding AI Backlog": 0.8,
  "Datadog (DDOG) Stock Pullback Seen as Buying Opportunity for 2026": 0.6,
  "Elastic (ESTC) Strengthens Cybersecurity Leadership Through Major Federal Collaboration": 0.8,
  "This Under-the-Radar AI Stock Looks Primed to Skyrocket in 2026": 0.8,
  "Should You Buy Netflix Stock After Its Recent 32% Plunge?": -0.5
}