{
  "Ericsson announces completion of Aduna transaction": 0.5,
  "Email Encryption Market Forecast Report 2025-2030 | Rising Breaches, BEC Frauds, Regulatory Pressure, and Tech Advancements Fueling Expansion": 0.5,
  "Intuit Launches Intelligent Automations to Simplify Accounting for Businesses": 0.8,
  "Paccar weighs risks of tariffs, US security threat investigation": 0.1,
  "Ransomware attacks against oil and gas firms surge": -0.7,
  "Cadence Design Systems Raises Full-Year Outlook Following Second-Quarter Beat": 0.8,
  "QuickBooks' New AI Agents Explained: What Each One Does - Expert Consumers Report": 0.5,
  "U.S. Exporters Get Welcome Surprise in Trump Tax Law": 0.6,
  "Here's Why Texas Instruments (NASDAQ:TXN) Can Manage Its Debt Responsibly": 0.8,
  "Investors ignore increasing losses at Warner Bros. Discovery (NASDAQ:WBD) as stock jumps 7.0% this past week": 0.2,
  "Here’s Why Roper Technologies (ROP) Shares Traded Down in Q2": -0.5,
  "Stocks Gain Pre-Bell as Investors Monitor Latest US-China Trade Talks; Fed Meeting, Earnings on Deck": 0.5,
  "Cadence to pay $140m fine for illegal tech exports to China": -0.8,
  "Three Stocks That May Be Undervalued In July 2025": 0.5,
  "US High Growth Tech Stocks To Watch In July 2025": 0.5,
  "eFuse Market Global Forecast Report 2025-2030: Quad Flat No Leads (QFN) Packages to Dominate eFuse Market Amid Compact Design Demand": 0.5,
  "3 Things to Know About Netflix Stock Before You Buy": 0.0,
  "Saudi Arabia Home Energy Management System Market Overview and Company Analysis Report 2025-2033 Featuring Honeywell, General Electric, Comcast, Panasonic, Johnson Controls, Schneider Electric, Bosc": 0.2,
  "The total return for Analog Devices (NASDAQ:ADI) investors has risen faster than earnings growth over the last five years": 0.6,
  "Hologic Focuses on Breast Health Turnaround This Year: Can It Deliver?": 0.5,
  "U.S. Small Business Job Growth Remains Stable in July": 0.5,
  "Cintas Corporation Makes Forbes Global 2000 List for the Fourth Year in a Row": 0.5,
  "Cadence Q2 Earnings & Revenues Surpass Estimates, Rise Y/Y, Stock Up": 0.8,
  "New Torq AMP Alliance Program Debuts with Wiz, Zscaler, and Leading Global Cloud Platform to Accelerate Autonomous SecOps": 0.6,
  "Winners in Second Annual Stevie® Awards for Technology Excellence Announced": 0.8,
  "Do Options Traders Know Something About Airbnb Stock We Don't?": 0.5,
  "Ansys 2025 R2 Enables Next-Level Productivity by Leveraging AI, Smart Automation, and Broader On-Demand Capabilities": 0.8,
  "Investors Heavily Search Zscaler, Inc. (ZS): Here is What You Need to Know": 0.5,
  "Why Investors Need to Take Advantage of These 2 Computer and Technology Stocks Now": 0.5,
  "lululemon athletica inc. (LULU) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "TNS Half Year 2025 Robocall Report: Bad Actors Exploiting Non-IP Networks of Smaller Carriers": -0.7,
  "Earnings Preview: What To Expect From Paychex's Report": 0.5,
  "Vertex Gears Up to Report Q2 Earnings: Is a Beat in the Cards?": 0.5,
  "Cathie Wood Goes Shopping: 3 Stocks She Just Bought": 0.5,
  "Linde (LIN) Q2 Earnings on the Horizon: Analysts' Insights on Key Performance Measures": 0.2,
  "30-Year-Old Says She's Clipping Coupons & Shopping Aldi Sales While Teens Make 6 Figures — 'How Do People Get Rich Without Working Their Lives Away?'": -0.6,
  "iBusiness Funding and Intuit Collaborate on Adding Access to SBA Financing Options from Approved SBA Lenders for Small Businesses": 0.5,
  "Is Datadog (DDOG) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Is Cisco (CSCO) a Buy as Wall Street Analysts Look Optimistic?": 0.6,
  "Is PDD Holdings Inc. Sponsored ADR (PDD) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Are You a Growth Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Here's Why Airbnb, Inc. (ABNB) is a Strong Momentum Stock": 0.8,
  "BMO says WSJ report on RFK potential headwind for Gilead": 0.1,
  "Harmony Biosciences Holdings, Inc. (HRMY) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "Marriott International (MAR) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "PANW Bets Big on Secure Browsing: Is it Reshaping SASE Strategy?": 0.5,
  "ASML Slides From Buy to Hold — Analyst Cites Slower Growth Ahead": -0.6,
  "Cadence Design Systems Stock Pops as Firm Settles With US, Raises Outlook": 0.8,
  "A Look At The Fair Value Of GlobalFoundries Inc. (NASDAQ:GFS)": 0.1,
  "INTRODUCING SPECTRUM REACH ARCHITECT: AI-POWERED INSIGHTS FOR ADVERTISERS": 0.6,
  "Shippers line up against railroad mergers": -0.5,
  "Transcontinental Reality Check: Norfolk Southern Falls On Union Pacific Buyout": -0.5,
  "Roblox vs. Take-Two: Which Gaming Stock Is in a Better Position Now?": 0.2,
  "Faire Appoints Former DoorDash COO Christopher Payne to Board of Directors": 0.5,
  "CDW (CDW) Upgraded to Buy: Here's What You Should Know": 0.6,
  "Cadence Design Stock Soars on Earnings. It’s an ‘Essential’ Play on Chips.": 0.8,
  "Will AppLovin (APP) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "US Multi-Industrials Stocks Poised to Benefit From Recent Trade Deals, BofA Says": 0.8,
  "KLA Hits Highs Amid Massive Big Tech AI Spend; Accelerating Growth, Earnings On Watch": 0.8,
  "Linde Declares Dividend in Third Quarter 2025": 0.0,
  "How Will Services, Mac and iPad Fare in Apple's Q3 Earnings?": 0.2,
  "ComEd, Metropolitan Mayors Caucus Award Grants to Power Clean Energy Projects, Boost Local Public Safety": 0.6,
  "Pacific Reach and Dilawri Acquire The Ritz-Carlton, Toronto": 0.5,
  "Intuit (INTU) Launches New App Partner Program With Four Tiers And Enhanced APIs": 0.5,
  "US Equity Indexes Fall With Treasury Yields Ahead of Fed Policy Statement, Big-Tech Results": -0.5,
  "July 2025 Insider-Owned Growth Leaders": 0.0,
  "US High Growth Tech Stocks To Watch": 0.5,
  "Rapid Expansion and Innovation Drive $36 Billion Global Point-of-Care Diagnostics Market, Says New Kalorama Report": 0.8,
  "The Honourable Percy P. Mockler Joins Food Banks Canada Board": 0.5,
  "Cintas Corporation Announces 15.4% Increase in Quarterly Cash Dividend": 0.8,
  "Why Uber (UBER) Shares Are Sliding Today": -0.5,
  "Why Marvell Technology (MRVL) Stock Is Up Today": 0.5,
  "Why Boeing (BA) Stock Is Falling Today": -0.5,
  "Cadence (CDNS) Shares Skyrocket, What You Need To Know": 0.8,
  "Dow Jones Health Care Giant J&J, Three Others In Or Near Buy Zones": 0.5,
  "DoorDash adds 6 grocery retailers": 0.5,
  "CSX Corporation (CSX) Might Not Want The Union Pacific Deal, Says Jim Cramer": 0.1,
  "Sector Update: Energy Stocks Gain Late Afternoon": 0.5,
  "Exelon Corporation Declares Dividend": 0.0,
  "Electronic Arts Reports Q1 FY26 Results": 0.0,
  "This Stock Breaks Out On 16% Surge After S&P 500 Sector Giant Pulls Trigger On $13.6 Billion Deal": 0.6,
  "NXP Semiconductors N.V. (NXPI) Struggled Due To Auto, Says Jim Cramer": -0.5,
  "Electronic Arts Posts Better-Than-Expected First-Quarter Results": 0.8,
  "Electronic Arts: Fiscal Q1 Earnings Snapshot": 0.0,
  "Electronic Arts tops Q1 forecasts, but weak Q2 guidance dampens outlook": -0.5,
  "Booking reports Q2 beat on strong travel demand, shares down on cautious outlook": -0.5,
  "Booking Holdings (BKNG) Beats Q2 Earnings and Revenue Estimates": 0.8,
  "Visa, Booking, Mondelez all beat on earnings: After-hours movers": 0.5,
  "Electronic Arts’s (NASDAQ:EA) Q2: Beats On Revenue But Full-Year Sales Guidance Misses Expectations Significantly": -0.6,
  "Electronic Arts (EA) Q1 Earnings and Revenues Beat Estimates": 0.8,
  "Here's What Key Metrics Tell Us About Booking Holdings (BKNG) Q2 Earnings": 0.2,
  "Teradyne beats quarterly revenue estimates on robust chip-testing demand": 0.8,
  "FTAI Aviation (FTAI) Tops Q2 Earnings Estimates": 0.8,
  "Airbnb, Inc. (ABNB) Falls More Steeply Than Broader Market: What Investors Need to Know": -0.5,
  "Axon Enterprise (AXON) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "Vertex Pharmaceuticals (VRTX) Ascends While Market Falls: Some Facts to Note": 0.5,
  "Compared to Estimates, Electronic Arts (EA) Q1 Earnings: A Look at Key Metrics": 0.2,
  "Nvidia AI chip challenger Groq said to be nearing new fundraising at $6B valuation": 0.5,
  "Diamondback Energy (FANG) Rises As Market Takes a Dip: Key Facts": 0.5,
  "Electronic Arts Beats First-Quarter Bookings Forecasts Ahead of Big Game Launches": 0.8,
  "VXUS Tops $100B as ETF Investors Embrace International Stocks": 0.6,
  "Booking (NASDAQ:BKNG) Reports Strong Q2": 0.8,
  "(Item 2.02) Results of Operations and Financial Condition. On July 30, 2025, Meta Platforms, Inc. (\"Meta\") issued a press release and will hold a conference call regarding its financial results for the quarter ended June 30, 2025. A copy of the press release is furnished as Exhibit 99.1 to this report. The information furnished with this\n\n(Item 2.02) , including Exhibit 99.1, shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference into any other filing under the Securities Act of 1933, as amended, or the Exchange Act, except as expressly set forth by specific reference in such a filing. Meta is making reference": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On July 30, 2025 , GE HealthCare Technologies Inc. (“GE HealthCare”) issued a press release announcing its second quarter 2025 financial results. A copy of this press release is furnished as Exhibit 99 to this Current Report on Form 8-K. The information furnished pursuant to\n\n(Item 2.02) , including Exhibit 99, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities under that Section and shall not be deemed to be incorporated by reference into any filing of GE HealthCare under the Securities Act of 1933, as amended, or the Exchange Act, except as expressly set forth by specific reference in such filing.": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition 3": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition On July 30, 2025, Microsoft Corporation issued a press release announcing its financial results for the fiscal quarter and year ended June 30, 2025. A copy of the press release is furnished as Exhibit 99.1 to this report. In accordance with General Instruction B.2 of Form 8-K, the information in this Current Report on Form 8-K, including Exhibit 99.1, shall not be deemed to be “filed” for purposes": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. On July 30, 2025, The Kraft Heinz Company issued a press release announcing results for the first quarter ended June 28, 2025. A copy of the press release is furnished as Exhibit 99.1 to this Current Report on Form 8-K. The information furnished pursuant to this\n\n(Item 2.02) , including Exhibit 99.1, shall not be deemed to be “filed” for purposes of Section 18 of, or otherwise regarded as filed under, the Securities Exchange Act of 1934, as amended (the “Exchange Act”), nor shall it be deemed incorporated by reference into any filing under the Securities Act of 1933, as amended, or in the Exchange Act, except as shall be expressly set forth by specific reference in such filing.": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition The information, including the exhibit attached hereto, in this Current Report is being furnished and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of that section. The information in this Current Report shall not be incorporated by reference into any registration statement or other document pursuant to the Securities Act of": -0.2,
  "(Item 2.02) . Results of Operations and Financial Condition On July 30, 2025, Old Dominion Freight Line, Inc. issued a press release regarding its financial results for its second quarter of 2025, ended June 30, 2025. A copy of this press release is furnished as Exhibit 99.1.": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition. On July 30, 2025, Verisk Analytics, Inc. (the “Registrant”) issued a press release announcing its financial results for the quarter ended June 30, 2025. A copy of the press release is annexed as Exhibit 99.1 and incorporated by reference herein. All information in the press release is furnished but not filed.": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. On July 30, 2025, QUALCOMM Incorporated (the Company) issued a press release regarding the Company’s financial results for its third quarter of fiscal 2025. A copy of that press release is furnished as Exhibit 99.1 hereto and incorporated herein by reference. The press release includes Non-GAAP financial measures as defined in Regulation G. The press release also includes the most directly comparable financial measures calculated and presented in": 0.1,
  "(Item 1.01) . Entry into a Material Definitive Agreement. On July 29, 2025, Verisk Analytics, Inc., a Delaware corporation (the “Company”), entered into an Agreement and Plan of Merger (as amended, restated or otherwise modified from time to time, the “Merger Agreement”) by and among the Company, Lenny Merger Sub, Inc., an Illinois corporation and an indirect, wholly owned subsidiary of the Company (“Merger Sub”), ExactLogix, Inc., an Illinois corporation d/b/a AccuLynx.com (“ExactLogix”), and Richard Spanton, Jr.,": 0.1,
  "(ITEM 2.02) . RESULTS OF OPERATIONS AND FINANCIAL CONDITION. On July 30, 2025, DexCom, Inc. (“Dexcom” or the “Company”) issued a press release announcing its financial results for the quarter ended June 30, 2025, the management changes described below, and certain other information. A copy of the press release is furnished as Exhibit 99.1 to this report. The information in this\n\n(Item 2.02) , including Exhibit 99.1 hereto, is furnished and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that section. The information contained herein and in the accompanying exhibit is not incorporated by reference in any filing of Dexcom under the Securities Act of 1933, as amended, or the Exchange Act, whether made before or after\n\n(ITEM 5.02) . DEPARTURE OF DIRECTORS OR CERTAIN OFFICERS; ELECTION OF DIRECTORS; APPOINTMENT OF CERTAIN OFFICERS; COMPENSATORY ARRANGEMENTS OF CERTAIN OFFICERS. On July 25, 2025, Kevin R. Sayer notified the Board of Directors (the “Board”) of the Company of his intent to retire from his role as Chief Executive Officer effective January 1, 2026. In connection with his retirement, on July 25, 2025, the Board appointed Mr. Sayer as Executive Chairman of the Board, effective January 1,\n\n(Item 5.02) (c)(3) of Form 8-K.": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On July 30, 2025, the Registrant issued a press release announcing that the Registrant's financial results for the fourth quarter and fiscal year ended June 30, 2025 were available through an earnings release available on the Registrant's website. A copy of the Registrant's earnings release is attached hereto as Exhibit 99 and is hereby incorporated by reference.": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. On July 30, 2025 , Cognizant Technology Solutions Corporation (the “Company”), issued a press release to report the Company’s financial results for the quarter ended June 30, 2025. The full text of the press release and the infographic embedded in and part of such press release are attached to this current report on Form 8-K as Exhibits 99.1 and 99.2, respectively.*\n\n(Item 2.02) ,": 0.2,
  "(Item 8.01) Other Events. On July 30, 2025, PANW and CyberArk issued a joint press release announcing the entry into the Merger Agreement, pursuant to which, upon the terms and subject to the conditions set forth therein, Merger Sub will merge with and into CyberArk (the “Merger”), with CyberArk continuing as the surviving corporation in the Merger and a wholly owned subsidiary of PANW. A copy of the press release is attached as Exhibit 99.2 to this": 0.1,
  "Escape the Heat: Agoda's Summer 'Cool-cation' Destination Guide": 0.5,
  "Earnings To Watch: KLA Corporation (KLAC) Reports Q2 Results Tomorrow": 0.2,
  "[Latest] Global NOR Flash Market Size/Share Worth USD 10.73 Billion by 2034 at a 8.2% CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trends, Forecast, Segmentation, Growth Rate, Value, SWOT Analysis)": 0.5,
  "1 Mega-Cap Stock to Own for Decades and 2 Facing Challenges": 0.2,
  "Hyatt Has Room for Improvement. The Stock Is a Buy.": 0.5,
  "5 Insightful Analyst Questions From CSX’s Q2 Earnings Call": 0.5,
  "Booking Holdings Inc (BKNG) Q2 2025 Earnings Call Highlights: Strong Growth in Revenue and Bookings": 0.8,
  "Electronic Arts Inc (EA) Q1 2026 Earnings Call Highlights: Strong Start to the Fiscal Year Amid ...": 0.8,
  "Mondelez International Inc (MDLZ) Q2 2025 Earnings Call Highlights: Strong Global Performance ...": 0.8,
  "Jim Cramer on Honeywell: “It’s Crazy That the Stock Pulled Back This Hard”": 0.6,
  "This Is the Best Reason to Invest in Intel Now. And It Might Be the Only One.": 0.6,
  "Do Wall Street Analysts Like Fortinet Stock?": 0.2,
  "[Latest] Global Lenacapavir Injection Market Size/Share Worth USD 5.68 Billion by 2034 at a 5.1% CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trends, Forecast, Segmentation, Growth Rate, Value, SWOT Analysis)": 0.5,
  "JW Marriott brand hotel to debut in Uzbekistan": 0.5,
  "Should You Buy Datadog Stock Before Aug. 7?": 0.2,
  "After Crashing 10%, Should You Buy the Dip on This Critical Artificial Intelligence (AI) Stock?": 0.5,
  "Eli Lilly eyes SoC status as Jaypirca proves superior to Imbruvica in CLL/SLL": 0.5,
  "Linde Commissions World-Scale Helium Storage Cavern": 0.5,
  "Clarivate Announces Maroun S. Mourad as President, Intellectual Property": 0.5,
  "GE HealthCare reports second quarter 2025 financial results": 0.0,
  "GE HealthCare: Q2 Earnings Snapshot": 0.0,
  "GE HealthCare (NASDAQ:GEHC) Surprises With Q2 Sales": 0.5,
  "Infectious Disease Treatment Market Report 2025-2030 | Long-acting Injectables, Self-testing Kits, and Combination Therapies Fueling Growth": 0.6,
  "GE HealthCare Raises 2025 Outlook After Earlier Reduction": 0.5,
  "Oreo and Reese’s fans have been ‘begging’ for a mashup for a decade. Now it’s here": 0.8,
  "Xcel Energy Selects GridUnity to Modernize Transmission Interconnection in the WECC Region": 0.5,
  "Old Dominion Freight Line Reports Second Quarter 2025 Earnings Per Diluted Share of $1.27": 0.5,
  "RBL Launches TruPartner Score™: Raising the Bar for Authenticity in Tech Partner Marketing": 0.5,
  "Verisk Signs Definitive Agreement to Acquire AccuLynx": 0.0,
  "Mondelēz, Hershey team up on Reese’s Oreo cups and cookies": 0.5,
  "Resideo Signs Agreement To Accelerate Payment of All Potential Monetary Obligations Under Indemnification and Reimbursement Agreement with Honeywell and Eliminate All Future Payments": 0.8,
  "Investing in Trade Desk (NASDAQ:TTD) five years ago would have delivered you a 70% gain": 0.8,
  "Is Cadence Design Systems, Inc.'s (NASDAQ:CDNS) Stock's Recent Performance Being Led By Its Attractive Financial Prospects?": 0.5,
  "Resideo Announces Intention To Separate ADI Business, Creating Two Independent Public Companies": 0.5,
  "AEP: Q2 Earnings Snapshot": 0.0,
  "Chart Industries (GTLS) Gets 15.8% Boost from Earnings, $13.6-Billion Merger": 0.8,
  "Check Point Software (CHKP) Q2 Earnings and Revenues Surpass Estimates": 0.8,
  "GE HealthCare shares rise as earnings beat and guidance raised": 0.8,
  "Down 57% From Highs, Is Lululemon Stock Still Worth Watching?": 0.2,
  "Old Dominion: Q2 Earnings Snapshot": 0.0,
  "Verisk Reports Second-Quarter 2025 Financial Results": 0.0,
  "Could This Once-Hot AI Stock Get Another Shot at Stardom?": 0.5,
  "Verisk: Q2 Earnings Snapshot": 0.0,
  "GE HealthCare Technologies (GEHC) Q2 Earnings and Revenues Top Estimates": 0.8,
  "Cybersecurity upstart Legion emerges from stealth with $38 million from Accel, Coatue, and others": 0.8,
  "AI Chips Today - BluSky Expands with Strategic Delta Data Center Land Acquisition": 0.5,
  "Old Dominion Freight Line (NASDAQ:ODFL) Misses Q2 Revenue Estimates, Stock Drops": -0.5,
  "AEP beats profit estimates, expects new five-year capital plan of $70 billion": 0.8,
  "Baker Hughes to Acquire Chart Industries in 13.6B Energy Tech Deal": 0.5,
  "Ontario Expands Access to Dexcom G7 CGM Under the Ontario Drug Benefit (ODB) Program": 0.6,
  "Cloudbrink Adds Native Identity Management and Crowdstrike Integration to its SASE, Creating a Unified Platform with Higher Security and Less Complexity": 0.8,
  "Helion Secures Land and Begins Building on the Site of World’s First Fusion Power Plant": 0.8,
  "Cisco Canada and Peterborough Regional Health Centre Transform Transitional Care": 0.5,
  "Retab raises $3.5M and launches most powerful document AI platform on the market": 0.8,
  "Ramp Raises $500 Million at $22.5 Billion Valuation to Accelerate AI and Build the Future of Finance": 0.8,
  "Cognizant Launches AI Training Data Services to Accelerate AI Model Development at Enterprise Scale": 0.6,
  "Has Mondelez International, Inc. (NASDAQ:MDLZ) Stock's Recent Performance Got Anything to Do With Its Financial Health?": 0.1,
  "This Early Telltale Sign Yielded 38% Gain For Netflix In Two Months": 0.6,
  "Cognizant and WRITER Partner to Accelerate AI-Driven Transformation Across Industries": 0.5,
  "American Electric Power (AEP) Surpasses Q2 Earnings and Revenue Estimates": 0.8,
  "CoStar Sues Zillow For Rampant Copyright Infringement": -0.8,
  "Dow Jones Futures: Market Rally Falls As Fed, Microsoft, Meta Loom; 7 Early Movers": -0.2,
  "Old Dominion Freight Line (ODFL) Q2 Earnings and Revenues Lag Estimates": -0.6,
  "1 Incredible Reason to Buy AppLovin Before Aug. 6": 0.8,
  "Legion Emerges From Stealth With $38M to Redefine AI-Driven Security Operations": 0.8,
  "Verisk’s (NASDAQ:VRSK) Q2 Earnings Results: Revenue In Line With Expectations, Full-Year Outlook Slightly Exceeds Expectations": 0.5,
  "US private payrolls increase in July": 0.5,
  "Verisk Analytics (VRSK) Q2 Earnings and Revenues Beat Estimates": 0.8,
  "Marvell Technology stock soars 10% on Microsoft AI chip prospects": 0.8,
  "Palo Alto Plans CyberArk Buyout: Can This Boost PANW's Identity Edge?": 0.5,
  "Accountants Embrace AI and Strategic Advisory Services to Fuel Growth, Yet Continue to Face Tech and Talent Barriers, According to 2025 Intuit QuickBooks Survey": 0.5,
  "Exchange-Traded Funds, Equity Futures Higher Pre-Bell Wednesday Ahead of Fed Rate Decision": 0.5,
  "Stocks Hold Steady. GDP Was Better Than Expected.": 0.5,
  "Chip stocks targets raised at Morgan Stanley on ’exceptional’ AI strength": 0.8,
  "GE HealthCare Tops Estimates, Lifts Profit Outlook on Smaller Tariff Impact": 0.8,
  "First look: Old Dominion Q2 earnings": 0.2,
  "SiMa.ai Expands Strategic Collaboration with Synopsys to Accelerate Automotive AI Innovation": 0.6,
  "CALICHE DEVELOPMENT PARTNERS PUTS WORLD'S LARGEST HELIUM SALT CAVERN IN SERVICE WITH LONG-TERM LINDE CONTRACT": 0.8,
  "New Data Presented at AAIC Demonstrates Investigational LEQEMBI® (lecanemab-irmb) 360 mg Subcutaneous Maintenance Dosing Could Offer a New Option for Ongoing Treatment of Early Alzheimer's Disease": 0.6,
  "Fortinet Fabric-Ready Technology Alliance Partner Program Surpasses 3,000 Integrations Across More Than 400 Partners": 0.8,
  "Sustainability Roundtable, Inc. and Aquila Clean Energy Announce the Purchase of 30 MW of Purchaser-Caused Solar Energy through SR Inc’s Net Zero Consortium for Buyers (NZCB)": 0.5,
  "The AREA Welcomes ShapesXR as a Member": 0.5,
  "Scoop Up These 4 Top-Ranked Liquid Stocks to Augment Portfolio Returns": 0.6,
  "Is Trending Stock Texas Instruments Incorporated (TXN) a Buy Now?": 0.2,
  "Is Trending Stock The Trade Desk (TTD) a Buy Now?": 0.2,
  "Is Most-Watched Stock Gilead Sciences, Inc. (GILD) Worth Betting on Now?": 0.2,
  "PDD Holdings Inc. Sponsored ADR (PDD) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Shareholders Are Optimistic That Fastenal (NASDAQ:FAST) Will Multiply In Value": 0.8,
  "Zillow sued by Homes.com owner CoStar for 'massive' copyright violations": -0.8,
  "American Companies Prove Robust, Adding More Than 100,000 New Jobs, ADP Report Shows": 0.8,
  "Jefferies Raises Netflix (NFLX) PT, Maintains Buy Rating": 0.6,
  "Texas Instruments (TXN) International Revenue Performance Explored": 0.0,
  "The REESE'S and OREO® Brands Announce Iconic Collaboration, Finally Giving Fans What They Have Been Asking For": 0.8,
  "Biogen (BIIB) Q2 Earnings on the Horizon: Analysts' Insights on Key Performance Measures": 0.5,
  "Stay Ahead of the Game With Vertex (VRTX) Q2 Earnings: Wall Street's Insights on Key Metrics": 0.5,
  "Axon (AXON) Q2 Earnings Preview: What You Should Know Beyond the Headline Estimates": 0.2,
  "Treasury Yields Rise on Stronger-Than-Expected Indicators": 0.8,
  "Software startup Observe raises $156 million in Sutter Hill-led fundraise": 0.8,
  "Compared to Estimates, Old Dominion (ODFL) Q2 Earnings: A Look at Key Metrics": 0.2,
  "ADP (ADP) Reports Q4 Earnings: What Key Metrics Have to Say": 0.2,
  "Compared to Estimates, AEP (AEP) Q2 Earnings: A Look at Key Metrics": 0.2,
  "Compared to Estimates, GE HealthCare (GEHC) Q2 Earnings: A Look at Key Metrics": 0.2,
  "Are Computer and Technology Stocks Lagging  Couchbase (BASE) This Year?": 0.1,
  "Peloton upgraded, Booking downgraded: Wall Street's top analyst calls": 0.2,
  "Do Options Traders Know Something About PACCAR Stock We Don't?": 0.2,
  "The One Tech Company Selling Picks and Shovels to the AI Gold Rush": 0.5,
  "Add These 4 GARP Stocks to Your Portfolio to Receive Handsome Returns": 0.8,
  "$25 billion CyberArk deal seen as ’a home run’ for Palo Alto": 0.8,
  "AppLovin (APP) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "GE HealthCare Technologies Insiders Sold US$2.1m Of Shares Suggesting Hesitancy": -0.5,
  "Airbnb, Inc. (ABNB) Reports Next Week: Wall Street Expects Earnings Growth": 0.5,
  "DoorDash, Inc. (DASH) Reports Next Week: Wall Street Expects Earnings Growth": 0.5,
  "Monster Beverage (MNST) Earnings Expected to Grow: Should You Buy?": 0.5,
  "Booking Holdings Q2 Earnings Beat Estimates, Revenues Grow Y/Y": 0.8,
  "Most firms still grappling with accounting talent crunch": -0.5,
  "American Electric's Q2 Earnings Beat Estimates, Revenues Increase Y/Y": 0.8,
  "Palo Alto Networks to Enter Identity Security Space With $25 Billion CyberArk Acquisition": 0.5,
  "ADP, GDP & FOMC: Alphabet Soup of Market Data": 0.1,
  "July Private Sector Hiring Rises More Than Expected, ADP Data Show": 0.6,
  "Starbucks CEO Brian Niccol promises a return to glory days: Opening Bid top takeaway": 0.5,
  "Automatic Data Processing Q4 Earnings & Revenues Beat Estimates": 0.8,
  "Verisk Earnings & Revenues Surpass Estimates in Q2, Increase Y/Y": 0.8,
  "Must-Watch Streaming Stocks Powering Digital Content Wave": 0.6,
  "Altria, Marvell, Vertiv: Trending Tickers": 0.0,
  "Two-Year Real-World Study of LEQEMBI® in the United States Presented at Alzheimer's Association International Conference (AAIC) 2025": 0.5,
  "SPECTRUM'S SEAMLESS ENTERTAINMENT NOW EVEN EASIER WITH ENHANCED DIGITAL SELF-SERVICE FEATURES": 0.6,
  "Q2 Advance GDP Ticks in Unexpectedly High": 0.5,
  "Norfolk Stock Drops on Union Pacific Merger. That Isn’t Supposed to Happen.": -0.6,
  "Zillow is the target of a massive infringement lawsuit that could force it to pay north of $1 billion in damages": -0.7,
  "Old Dominion Freight Line CEO Remains Confident In Long-Term Growth Despite Downturn": 0.8,
  "Electronic Arts Q1 Earnings Decline Year Over Year, Revenues Increase": 0.2,
  "ASHTY vs. FAST: Which Stock Is the Better Value Option?": 0.2,
  "Top Midday Stories: US GDP, Private Payrolls Rise More Than Expected; Visa Posts Higher Non-GAAP Earnings, Revenue": 0.5,
  "Electronic Arts Poised to Outpace Market Growth Through 2027, Wedbush Says": 0.8,
  "Top Stock Movers Now: Humana, Hershey, VF Corp., and More": 0.5,
  "Booking's Alternative Accommodation Business Continued to Perform in Q2, Morgan Stanley Says": 0.5,
  "Teradyne Stock Is the Top Performer in the S&P 500. Here’s Why.": 0.8,
  "Ad Fatigue Hits Hard in Southeast Asia: 2 in 3 Consumers Tune Out Repetitive Ads": -0.7,
  "Why Mondelez (MDLZ) Shares Are Plunging Today": -0.8,
  "Why Verisk (VRSK) Stock Is Trading Lower Today": -0.5,
  "Why Is Electronic Arts (EA) Stock Rocketing Higher Today": 0.6,
  "Why Saia (SAIA) Stock Is Down Today": -0.5,
  "Why GE HealthCare (GEHC) Shares Are Getting Obliterated Today": -0.8,
  "Why Are Resideo (REZI) Shares Soaring Today": 0.6,
  "Circle Internet Drops 6% in a Month: Buy, Sell or Hold the Stock?": -0.5,
  "A Twitchy Market Is Punishing Stocks for the Slightest Earnings Dings": -0.7,
  "Why Costco (COST) is a Top Dividend Stock to Buy in August": 0.6,
  "Prologis to Develop Largest Rooftop Community Solar Portfolio in Northern Illinois": 0.8,
  "US travel demand lags behind Europe & Asia, Booking CFO says": -0.5,
  "Dexcom CEO Kevin Sayer to step down": -0.5,
  "Can Taboola's Realize Platform Drive Scalable, AI-Powered Ad Growth?": 0.5,
  "Old Dominion not changing course as downturn lingers": 0.1,
  "Old Dominion Stock Dips After Q2 Earnings & Revenues Miss Estimates": -0.6,
  "Old Dominion falls, Teradyne soars, Palo Alto Networks & CyberArk": 0.2,
  "Booking Holdings (BKNG) Q2 Revenue Climbs to US$6,798 Million Amidst Lower Earnings": -0.5,
  "American Electric Power Lifts Annual GAAP Outlook, To Announce $70 Billion Capital Plan": 0.5,
  "Buy Texas Instruments (TXN) for its Innovation and Steady Dividend Income": 0.6,
  "Cintas (CTAS) Announces 15% Dividend Increase Continuing 42-Year Growth Streak": 0.8,
  "Buy Honeywell (HON) for its Innovation-Led Dividend Performance": 0.6,
  "Daily Roundup of Key US Economic Data for July 30": 0.0,
  "Exploring US High Growth Tech Stocks For Potential Portfolio Expansion": 0.5,
  "US Equity Indexes Mixed as Strong Economic Data Help Push Yields Higher Ahead of Fed Decision": 0.5,
  "Exelon (EXC) Declares US$0.40 Dividend for September 2025 Payout": 0.2,
  "Why Old Dominion Freight Line (ODFL) Stock Is Falling Today": -0.5,
  "Sector Update: Financial Stocks Mixed Wednesday Afternoon": 0.0,
  "Sector Update: Energy Stocks Retreat Wednesday Afternoon": -0.5,
  "Flight to Safety? Maybe Take a Stroll to Staples Stocks.": 0.1,
  "Mondelez International (MDLZ) Announces REESE'S OREO Collaboration And 6% Dividend Increase": 0.8,
  "Xcel Energy Inc. Board Declares Dividend on Common Stock": 0.5,
  "Is AI causing tech worker layoffs? That's what CEOs suggest, but the reality is complicated": 0.1,
  "Charter Communications, Inc. (CHTR)’s Management Is “Dreaming,” Says Jim Cramer": -0.6,
  "Baker Hughes Company (BKR)’s Had A Good Quarter, Says Jim Cramer": 0.6,
  "GE HealthCare Core Operating Margin Faces Tariffs Heat, Raises Annual Outlook": 0.5,
  "Sector Update: Financial": 0.0,
  "Steady ship: A guide to navigating market volatility": 0.5,
  "Sector Update: Energy Stocks Fall Late Afternoon": -0.5,
  "Fed Rate-Cut Odds Slide On Powell Framework; S&P 500 Slips": -0.5,
  "Electronic Arts Q1, Steve Madden Q2 miss, Harley-Davidson deal": -0.2,
  "Sector Update: Financial Stocks Retreat Late Afternoon": -0.5,
  "Pacific Reach, Dilawri Group team up to buy The Ritz-Carlton Toronto": 0.2,
  "Cognizant Attempts World's Largest Vibe Coding Event to Accelerate AI Literacy Across Thousands of Employees": 0.6,
  "Cognizant Reports Second Quarter 2025 Results": 0.0,
  "Warner Bros Discovery to lay off 10% of film group, source says": -0.7,
  "Dexcom Reports Second Quarter 2025 Financial Results, Updates Full Year 2025 Guidance and Announces CEO Succession Plan": 0.5,
  "Lam Research Corporation Reports Financial Results for the Quarter Ended June 29, 2025": 0.0,
  "Synopsys Announces Earnings Release Date for Third Quarter Fiscal Year 2025": 0.0,
  "Sage Therapeutics Announces Second Quarter 2025 Financial Results": 0.0,
  "Booking Holdings Beats Q2 Expectations With 'Steady' Travel Demand Despite Uncertainty": 0.6,
  "DexCom: Q2 Earnings Snapshot": 0.0,
  "Cognizant: Q2 Earnings Snapshot": 0.0,
  "While shippers cite merger concerns, rival railroad looks instead to ‘collaborations’": 0.2,
  "Wingstop’s smart kitchen improves speed and sales, executives say": 0.6,
  "Lam Research: Fiscal Q4 Earnings Snapshot": 0.0,
  "Calpine and CyrusOne Announce Thad Hill Energy Center Powered Land to Support Hyperscale Data Center Development in Texas": 0.5,
  "Stock Market Today: Dow Drops After Fed Powell Comments; Meta, Microsoft Soar On Earnings (Live Coverage)": 0.5,
  "GE HealthCare Stock Falls Despite Earnings Beat. Tariffs Are Creating Confusion.": -0.5,
  "Cognizant sees quarterly revenue above estimates on strong enterprise demand": 0.8,
  "Lam Research forecasts upbeat quarterly revenue on strong chip equipment demand": 0.8,
  "Cato Networks' CEO Feels 'Zero Pressure' From Hyperscalers": 0.5,
  "Stocks to Watch Recap: Freeport-McMoran, Hershey, Palo Alto, Starbucks": 0.0,
  "DexCom (DXCM) Q2 Earnings and Revenues Top Estimates": 0.8,
  "Cognizant (CTSH) Q2 Earnings and Revenues Surpass Estimates": 0.8,
  "Lam Research (LRCX) Q4 Earnings and Revenues Top Estimates": 0.8,
  "DexCom’s (NASDAQ:DXCM) Q2 Sales Beat Estimates": 0.8,
  "Cactus Announces Second Quarter 2025 Results": 0.0,
  "Cognizant (CTSH) Q2 Earnings: Taking a Look at Key Metrics Versus Estimates": 0.2,
  "Lam Research (NASDAQ:LRCX) Reports Upbeat Q2, Provides Optimistic Revenue Guidance for Next Quarter": 0.8,
  "Fortinet (FTNT) Declines More Than Market: Some Information for Investors": -0.5,
  "Here's Why Lululemon (LULU) Fell More Than Broader Market": -0.5,
  "Compared to Estimates, DexCom (DXCM) Q2 Earnings: A Look at Key Metrics": 0.2,
  "Trump Ends the ‘De Minimis’ Tax Exemption Globally. What It Means for Retail Stocks.": 0.2,
  "Robinhood or AppLovin Could Join S&P 500 if Paramount Is Dumped": 0.2,
  "Nvidia, AI Chip Stocks Score Price-Target Hikes": 0.5,
  "Fortinet (FTNT) Gets PT Hike—But Can It Deliver Beyond Q2?": 0.2,
  "“I’ve Already Got CrowdStrike”: Customer Confidence Highlights CRWD’s AI Strength": 0.6,
  "Datadog’s (DDOG) AI Growth Accelerates, Driven by OpenAI—But for How Long?": -0.2,
  "(Item 2.02) Results of Operations and Financial Condition. On July 31, 2025, Apple Inc. (“Apple”) issued a press release regarding Apple’s financial results for its third fiscal quarter ended June 28, 2025. A copy of Apple’s press release is attached hereto as Exhibit 99.1. The information contained in this Current Report shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or incorporated by reference": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition.": 0.0,
  "(ITEM 2.02) . RESULTS OF OPERATIONS AND FINANCIAL CONDITION. 3": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition On July 31, 2025, Comcast Corporation (“Comcast”) issued a press release reporting the results of its operations for the three and six months ended June 30, 2025. The press release is attached hereto as Exhibit 99.1. Exhibit 99.2 sets forth the reasons Comcast believes that presentation of the non-GAAP financial measures contained in the press release provides useful information to investors regarding Comcast's results of operations and financial\n\n(Item 2.02) or Exhibit 99.1 or Exhibit 99.2 to be treated as \"filed\" under the Securities Exchange Act of 1934, as amended, or incorporated by reference into its filings under the Securities Act of 1933, as amended.": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On July 31, 2025, Biogen Inc. issued a press release announcing its results of operations and financial condition for the second quarter ended June 30, 2025. A copy of the press release is furnished as Exhibit 99.1 and is incorporated herein by reference. The press release is being furnished pursuant to\n\n(Item 2.02) of this Current Report on Form 8-K and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934 (the “Exchange Act”) or otherwise subject to the liabilities of that Section, nor shall such document be deemed incorporated by reference in any filing under the Securities Act of 1933 or the Exchange Act.": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On July 31, 2025, MicroStrategy Incorporated d/b/a Strategy (the “Company”) issued a press release announcing the Company’s financial results for the quarter ended June 30, 2025. A copy of this press release is attached as Exhibit 99.1 to this Current Report on Form 8-K. The information disclosed pursuant to\n\n(Item 2.02) in this Current Report on Form 8-K (including Exhibit 99.1) shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as expressly set forth by specific reference in such a\n\n(Item 8.01) . Other Events. As contemplated by the prospectus supplement for the IPO of STRC, on July 31, 2025, the Company announced that its board of directors declared monthly cash dividends of $0.80 per share payable on the Variable Rate Perpetual Stretch Preferred Stock (“STRC Stock\"). The calculation of the monthly dividend takes into account the dividend accrued from July 29, 2025, the issuance date of the STRC Stock. Payment will be made on August 31,": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition On July 31, 2025, Xcel Energy released earnings results for the second quarter of 2025. See additional information in the Earnings Release furnished as exhibit 99.01.": 0.2,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On July 27, 2025 and July 31, 2025, respectively, Warner Bros. Discovery, Inc. (“we,” “us,” “our,” “WBD” or the “Company”) and our wholly-owned subsidiaries Discovery Communications, LLC (“DCL”) and Warner Bros. Entertainment, Inc. (“WBE”) entered into employment arrangements with Bruce Campbell, our Chief Revenue and Strategy Officer, and with JB Perrette, our President and Chief Executive": 0.1,
  "(Item 8.01) . Other Events. On July 31, 2025, MicroStrategy Incorporated d/b/a Strategy (the “Company”) entered into a Sales Agreement (the “Sales Agreement”) with TD Securities (USA) LLC, Barclays Capital Inc., The Benchmark Company, LLC, Clear Street LLC and Morgan Stanley & Co. LLC, as sales agents (each an “Agent” and collectively, the “Agents”), pursuant to which the Company may issue and sell shares of its Variable Rate Series A Perpetual Stretch Preferred Stock, $0.001 par value": 0.0,
  "(Item 1.01) Entry into a Material Definitive Agreement. Merger Agreement On July 30, 2025, Palo Alto Networks, Inc., a Delaware corporation (“PANW”), entered into an Agreement and Plan of Merger (the “Merger Agreement”) by and among PANW, Athens Strategies Ltd., a company organized under the laws of the State of Israel and a wholly owned subsidiary of PANW (“Merger Sub”), and CyberArk Software Ltd., a company organized under the laws of the State of Israel (“CyberArk”). Pursuant": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On July 31, 2025, KLA Corporation (the “Company”) issued a press release announcing selected financial and operating results for its fourth quarter of and full fiscal year 2025. A copy of the press release is furnished as Exhibit 99.1 to this Current Report on Form 8-K. The information in\n\n(Item 2.02) of this Current Report on Form 8-K and the exhibit attached hereto shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities under that section, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, regardless of any general incorporation language in such filing.": 0.1,
  "Warner Bros Discovery to lay off 10% of film group: source": -0.7,
  "BTIG Lifts Datadog (DDOG) PT to $169 on Strong Competitive Gains, New Product Success": 0.8,
  "Jefferies Raises CrowdStrike (CRWD) PT to $530 from $520 Amid Cybersecurity Outlook": 0.5,
  "American Electric Power (AEP) Board Approves Quarterly Dividend": 0.5,
  "Mondelez International, Inc. (MDLZ) Recalls RITZ Peanut Butter Cracker Sandwich Products": -0.5,
  "3 Market-Beating Stocks with Competitive Advantages": 0.5,
  "1 Healthcare Stock to Consider Right Now and 2 That Underwhelm": -0.5,
  "3 Unpopular Stocks We Steer Clear Of": -0.5,
  "2 Momentum  Stocks Worth Investigating and 1 We Avoid": 0.2,
  "1 Profitable Stock with Exciting Potential and 2 We Turn Down": 0.5,
  "Agoda launches campaign to drive tourism as Singapore celebrates 60 years of independence": 0.6,
  "Chips Are Getting Stale. How Walmart, Kroger, and Other Food Titans Are Reinventing Snacks.": 0.1,
  "Warner Bros. Discovery and 3 Other Hollywood Stocks to Ride the Box-Office Boom": 0.5,
  "5 Revealing Analyst Questions From Honeywell’s Q2 Earnings Call": 0.2,
  "5 Must-Read Analyst Questions From Keurig Dr Pepper’s Q2 Earnings Call": 0.5,
  "Cognizant Technology Solutions Corp (CTSH) Q2 2025 Earnings Call Highlights: Strong Revenue ...": 0.8,
  "The Smartest Growth Stock to Buy With $1,000 Right Now": 0.5,
  "T-Mobile US, Inc. (TMUS): “It Was A Beautiful Quarter,” Says Jim Cramer": 0.8,
  "Marvell Technology, Inc. (MRVL)’s On Fire Due To AI, Says Jim Cramer": 0.6,
  "Texas Instruments Incorporated (TXN): “It’s Great That They Don’t Play The Game,” Says Jim Cramer": 0.6,
  "Two-Wheeler Ignition Switch Market Analysis and Company Report 2025-2029, with Honeywell, JPM, JS Enterprises, Kunal, Minda Industries, Prakant Electronics, Rado Products, Sonu Auto, Swiss Auto and More": 0.1,
  "Leading HVAC Controls Companies Shaping the Future in 2025 and Beyond": 0.5,
  "Roblox Q2 Earnings Beat Sends Leveraged RBLU Soaring": 0.8,
  "Multiple Sclerosis Clinical Trials Market Landscape Report 2025 Featuring Biogen, Novartis, Sanofi, Merck, Teva, Bayer, Roche, Bristol-Myers Squibb, Laboratory Corp of America, IQVIA": 0.2,
  "Resideo Tech (REZI) Jumps as Firm Slashes $140-Million Annual Obligations": 0.6,
  "Xcel Energy Second Quarter 2025 Earnings Report": 0.0,
  "Biogen signals Leqembi sales gaining momentum, lifts profit forecast": 0.8,
  "Dexcom Earnings Beat. Diabetes Device Maker Names New CEO.": 0.5,
  "Xcel: Q2 Earnings Snapshot": 0.0,
  "Sales of Leqembi® totaled 23.1 billion yen in the second quarter 2025": 0.5,
  "Niio Launches Streaming Art & Signage Service, Bringing Curated Visual Art Experiences to Every Screen": 0.6,
  "Palo Alto Networks Broadens Cybersecurity Consolidation With $25B Deal": 0.5,
  "Is the Party Over for Lululemon Stock?": -0.5,
  "Texas Instruments and ASML Are Falling. Could Other AI Growth Stocks Be Next?": -0.5,
  "Biogen lifts full-year outlook amid Alzheimer’s drug strength, sending shares up": 0.8,
  "Exelon Reports Second Quarter 2025 Results": 0.0,
  "Exelon: Q2 Earnings Snapshot": 0.0,
  "Pacific Reach and Dilawri partner to acquire the Ritz-Carlton in Toronto": 0.5,
  "Uber Eats now lets merchants message customers about their orders": 0.5,
  "Clean Cult and Whole Foods Market partner on eco-friendly packaging solutions": 0.5,
  "Xcel Energy's quarterly profit boosted by rate hikes, rising power demand": 0.5,
  "Biogen Inc. (BIIB) Surpasses Q2 Earnings and Revenue Estimates": 0.8,
  "Xcel Energy (XEL) Surpasses Q2 Earnings Estimates": 0.8,
  "Biogen (NASDAQ:BIIB) Reports Bullish Q2": 0.8,
  "Comcast shares leap on top and bottom line beat in Q2": 0.8,
  "3 Stocks Possibly Trading Below Their Estimated Value By Up To 44.5%": 0.5,
  "Comcast Posts Better-Than-Expected Q2 Results": 0.8,
  "Palo Alto Networks to acquire CyberArk in $25bn deal": 0.5,
  "J.D. Power: New Wireless Carrier Benchmark Study Highlights Importance of Strong Value Proposition": 0.6,
  "Monster Beverage to Report Financial Results  for 2025 Second Quarter on August 7, 2025": 0.0,
  "Exelon (EXC) Beats Q2 Earnings Estimates": 0.8,
  "82% Of This NXP Semiconductors Insider's Holdings Were Sold": -0.5,
  "Calculating The Intrinsic Value Of Monster Beverage Corporation (NASDAQ:MNST)": 0.1,
  "Genius Gourmet Launches 30g Sparkling Clear Protein Drink Nationwide at Costco": 0.6,
  "High coffee prices brew interest in bean-free alternatives": 0.5,
  "Dow Jones Futures Rise As Microsoft, Meta Soar On Earnings After Fed's Powell Hits Rate-Cut Hopes": 0.8,
  "Intuitive Surgical (ISRG) Soared on Solid Financial Results": 0.8,
  "India's garment and jewellery sectors fear for US orders after tariff shock": -0.6,
  "Comcast (CMCSA) Q2 Earnings and Revenues Surpass Estimates": 0.8,
  "Arm Holdings Stock Sinks Amid Soft Profit Forecast, Firm May Make Own Chips": -0.6,
  "Arm Holdings (ARM) Stock Plunges After Disappointing Q2 EPS Outlook": -0.8,
  "Dexterra Group Announces Appointment of President, Dexterra USA": 0.5,
  "Comcast’s (NASDAQ:CMCSA) Q2 Sales Top Estimates, Stock Soars": 0.8,
  "Electronic Arts First Quarter 2026 Earnings: Beats Expectations": 0.8,
  "Mondelez International Stock: Analyst Estimates & Ratings": 0.0,
  "Strength Seen in Marvell (MRVL): Can Its 7.1% Jump Turn into More Strength?": 0.6,
  "Tieton Cider Works, The Eighth Fastest Growing Cider Brand in the U.S., Rooted in Central Washington in the Shadow of Mt. Rainer and Mt. Adams, Secures Notable Five-State Costco Deal for Imperial Magic Berry Cider": 0.6,
  "What O'Reilly Automotive's Earnings Say About the Health of Its Business": 0.5,
  "DexCom Stock Falls Despite Q2 Earnings Beat & 2025 Sales View Raise": 0.2,
  "Microsoft Nears $4 Trillion Market Cap After Another Strong Quarter Reddit Earnings Tonight Could Surprise - Microsoft just dropped its Q4 earnings and, honestly, it’s pretty impressive. The company beat on both revenue and earnings again, with Azure cloud revenue hitting $75 billion for the year up 34%. CEO Satya Nadella said AI and cloud are driving business transformation everywhere, and judging by the numbers, it’s hard to argue. The stock popped about 9% in": 0.8,
  "Patriot.TV and Evergreen Media Join Forces Forging Advertising Alliance as Conservative Media Rises Nationwide": 0.6,
  "Kellanova misses quarterly profit estimates amid US consumer spending squeeze": -0.6,
  "Dexcom raises sales expectations, discusses G8 plans": 0.5,
  "Marriott International Elevates Caribbean Escapes Through Celestial Connections": 0.5,
  "Fox Takes Stake in IndyCar Owner Penske Entertainment": 0.2,
  "Carbyne Raises $100 Million in Funding to Accelerate AI-Powered Emergency Response and Intelligence": 0.8,
  "Wurl and TVision Unveil New Report Linking Emotion Alignment to Higher Ad Attention on Streaming TV": 0.5,
  "Fluid Conservation Systems Taps T-Mobile to Save Critical Water Resources": 0.5,
  "Resideo Technologies (REZI) Surges 16.2%: Is This an Indication of Further Gains?": 0.6,
  "How to Boost Your Portfolio with Top Computer and Technology Stocks Set to Beat Earnings": 0.5,
  "How to Find Strong Computer and Technology Stocks Slated for Positive Earnings Surprises": 0.8,
  "Why Investors Need to Take Advantage of These 2 Oils-Energy Stocks Now": 0.5,
  "Take-Two Interactive Software, Inc. (TTWO) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Is Trending Stock Marvell Technology, Inc. (MRVL) a Buy Now?": 0.2,
  "Is Trending Stock Airbnb, Inc. (ABNB) a Buy Now?": 0.2,
  "Soligenix Drug Matches FDA-Approved Amgen Therapy In Rare Disease Trial": 0.8,
  "Is Baker Hughes Company's (NASDAQ:BKR) Latest Stock Performance A Reflection Of Its Financial Health?": 0.1,
  "Honeywell International (NASDAQ:HON) Has Some Way To Go To Become A Multi-Bagger": 0.5,
  "With 81% institutional ownership, Amgen Inc. (NASDAQ:AMGN) is a favorite amongst the big guns": 0.6,
  "Applaud's Aldwych Release Brings Agentic AI to HR, Letting Employees Get Work Done (Not Just Answers)": 0.6,
  "Top Wide-Moat Stocks to Buy for Long-Term Wealth and Stability": 0.8,
  "Ionis Beats on Q2 Earnings & Sales, Stock Up 5% on Raised '25 Outlook": 0.8,
  "International Markets and Cadence (CDNS): A Deep Dive for Investors": 0.5,
  "Unlocking Q2 Potential of Diamondback (FANG): Exploring Wall Street Estimates for Key Metrics": 0.5,
  "Gear Up for Amgen (AMGN) Q2 Earnings: Wall Street Estimates for Key Metrics": 0.2,
  "Exploring Analyst Estimates for Marriott (MAR) Q2 Earnings, Beyond Revenue and EPS": 0.2,
  "Company News for Jul 31, 2025": 0.0,
  "Comcast Rides High On Theme Park And Studio Success": 0.8,
  "Wall Street Analysts Look Bullish on Netflix (NFLX): Should You Buy?": 0.8,
  "Compared to Estimates, Comcast (CMCSA) Q2 Earnings: A Look at Key Metrics": 0.2,
  "Exelon (EXC) Q2 Earnings: Taking a Look at Key Metrics Versus Estimates": 0.2,
  "Xcel (XEL) Q2 Earnings: Taking a Look at Key Metrics Versus Estimates": 0.5,
  "Biogen (BIIB) Q2 Earnings: Taking a Look at Key Metrics Versus Estimates": 0.5,
  "Compared to Estimates, Lam Research (LRCX) Q4 Earnings: A Look at Key Metrics": 0.2,
  "GE Healthcare (GEHC) Drops 7.8% on Slow Order Growth": -0.6,
  "Old Dominion (ODFL) Drops on 4th Day as Earnings Disappoint": -0.8,
  "Roblox (NYSE:RBLX) Reports Sales Below Analyst Estimates In Q2 Earnings, But Stock Soars 17.7%": 0.5,
  "Why Exelon (EXC) is a Top Value Stock for the Long-Term": 0.8,
  "Why This 1 Growth Stock Could Be a Great Addition to Your Portfolio": 0.8,
  "Meta, Microsoft upgraded: Wall Street's top analyst calls": 0.5,
  "Comcast Posts Revenue Growth, With Theme Park and Xfinity Mobile Gains": 0.6,
  "Are Wall Street Analysts Bullish on Gilead Sciences Stock?": 0.5,
  "Zacks.com featured highlights include Walt Disney, TE Connectivity, Fortinet, Banco Bilbao Vizcaya Argentaria and ON Semiconductor": 0.2,
  "Are Wall Street Analysts Bullish on Monster Beverage Stock?": 0.5,
  "Constellation and GridBeyond Launch AI-Powered Demand Response Program in PJM to Improve Grid Flexibility and Save Customers Millions": 0.8,
  "Borderlands® 4 Coming to Nintendo Switch™ 2 on October 3": 0.5,
  "Datadog (DDOG) Expected to Beat Earnings Estimates: Should You Buy?": 0.5,
  "Gilead Sciences (GILD) Expected to Beat Earnings Estimates: Should You Buy?": 0.5,
  "Constellation Energy Corporation (CEG) Reports Next Week: Wall Street Expects Earnings Growth": 0.6,
  "Earnings Preview: Microchip Technology (MCHP) Q1 Earnings Expected to Decline": -0.5,
  "Axon Enterprise (NASDAQ:AXON) Is Doing The Right Things To Multiply Its Share Price": 0.8,
  "Micron Technology's (NASDAQ:MU) 18% CAGR outpaced the company's earnings growth over the same five-year period": 0.2,
  "Take-Two Interactive (TTWO) Reports Next Week: Wall Street Expects Earnings Growth": 0.5,
  "Warner Bros. Discovery (WBD) Expected to Beat Earnings Estimates: Can the Stock Move Higher?": 0.5,
  "Marvell (MRVL) Teams Up With Rebellions for Custom AI Infrastructure": 0.5,
  "Comcast Stock Rises After Earnings. The Focus Is All on One Number.": 0.5,
  "Meta Stock Surges Near Record High. Everything to Know About the Facebook Parent’s Blowout Earnings.": 0.8,
  "Charter Receives Stockholder Approvals Necessary to Complete Cox Communications Transaction": 0.5,
  "Form 8.3 - Qualcomm Inc": 0.0,
  "Meet the Experts Powering ‘Marketers Connect’: Vereigen Media’s Premier B2B Event in San Francisco": 0.5,
  "Biogen's Q2 Earnings & Sales Beat, 2025 Outlook Raised, Stock Up": 0.8,
  "Micron (MU) Unveils World’s First PCIe Gen6 SSD for AI Data Centers": 0.8,
  "KeyBanc downgrades Palo Alto Networks on CyberArk acquisition concerns": -0.5,
  "Israeli cyber startup Noma Security raises $100 million in private funding round": 0.8,
  "European Equities Traded in the US as American Depositary Receipts Falling Thursday": -0.5,
  "This Financial Services Stock Dusts Itself Off After Earnings Plunge": 0.2,
  "Lam Research's Q4 Earnings Beat Expectations, Revenues Rise Y/Y": 0.8,
  "Biogen Lifts Outlook As Rare Disease And Alzheimer's Drug Sales Accelerate": 0.8,
  "Comcast Awaits NBA Boost as Peacock Losses Hit $10 Billion": -0.6,
  "Why Did Lam Research Stock Drop Today?": -0.5,
  "Exelon's Q2 Earnings Surpass Estimates, Sales Lag, Delivery Volume Up": 0.5,
  "Xcel Energy Beats Q2 Earnings Estimates, Sales Miss, Adds Customers": 0.2,
  "Why Arm Holdings Stock Was Sliding Today": -0.5,
  "Absolutely everything you need to know about AMZN earnings today - Okay guys, so Amazon is set to release its Q2 earnings after the market closes today with an analyst call at 5 pm. This is gonna be a big one. Did anyone catch META yesterday? Fuck. For Amazon, analysts expect revenue around $162 billion (up 10%) and EPS between $1.32 and $1.33, with operating income projected at $16.7 to $16.87 billion. And during this": 0.2,
  "DTC Strength vs. Weak In-Store Traffic: lululemon's Balancing Act": 0.2,
  "Qualcomm Slides After Posting Lackluster Phone Chip Sales": -0.6,
  "Why Did Micron Stock Drop Today?": -0.5,
  "Activist investor may target CSX, citing slumping financial performance": -0.5,
  "Arm Holdings slips on guidance, AbbVie Q2 beat, Bristol-Myers outlook": 0.1,
  "Summit downgrades Lam Research on limited catalysts beyond 2025": -0.6,
  "Qualcomm stock slumps: CEO talks Q3 results, AI, smart glasses": 0.1,
  "$FIG is indicating $95-100, per CNBC - That values it at \\~$59B, at $100/share, and implies close to $40B overvaluation. The article below has stale numbers but wanted to include for context. >The indications, which are signals from market makers of the level where trading may begin, imply as much as a 112% gain above the IPO price of $33 apiece. The shares were marketed for $30 to $32 per share, after the company increased": -0.8,
  "Cyberark's Slowing Revenue May Have Influenced Acquisition by Palo Alto Networks, UBS Says": 0.1,
  "Market Chatter: Starbucks' Schultz Urges Employees to Back CEO Niccol's Growth Plans": 0.5,
  "Starbucks Q3 Earnings Hurt by Lower Comps, Signs of Turnaround Emerge": 0.2,
  "Judge orders Workday to supply an exhaustive list of employers that enabled AI hiring tech": -0.5,
  "Comcast's Q2 Earnings Surpass Estimates, Revenues Increase Y/Y": 0.8,
  "Cognizant Q2 Earnings Beat Estimates: Will Raised View Aid Shares?": 0.5,
  "QUALCOMM (QCOM) Reports Q3 Revenue Of US$10 Billion With Increased Earnings": 0.8,
  "PYPL Stock Falls 10% Post Q2 Earnings: Should You Buy, Hold or Fold?": -0.5,
  "Will PepsiCo's Focus on Premium Drinks Drive the Next Leg of Growth?": 0.5,
  "Exploring US High Growth Tech Stocks For July 2025": 0.5,
  "Why AppLovin Stock Was Gaining Today": 0.2,
  "GOOG - when will it take off? - I’ve been slowly and steadily investing in GOOG - by looking at the books, it looks like a strong performer. Over the last few years, I’ve invested around $20K in it. The returns are not as staggering as other Mag 7 - it’s one of the worst performer of my portfolio. Still at 50% absolute gains, but dwarfed by how other Mag 7 grew in that period.": 0.2,
  "Apple Rebound Looks Elusive as AI Woes Draw Investor Scrutiny": -0.5,
  "AstraZeneca (LSE:AZN) Advances Lung Cancer Care With Revna Biosciences In Ghana": 0.5,
  "Will Alphabet ever escape the looming spectre of open ai and the feds? - Posted some pretty great numbers. Similar to Microsoft which is up 5% as a result. Alphabet was up a couple of days but now down a few days later. Open ai announced 700m users daily and Google dropped 2% on the news. If the court remedy comes out to break up parts of Google it's gonna drop line 10% I reckon.": -0.6,
  "Honeywell International (HON) Amends Bylaws, Adds Role for National Security Compliance": 0.2,
  "Should You Buy FIG Stock Following the Figma IPO Today?": 0.2,
  "Why Comcast Stock Popped Today": 0.5,
  "Shopify (SHOP) Empowers FST Corp. With Enhanced E-Commerce Capabilities": 0.8,
  "Comcast Beats Second-Quarter Estimates Amid Record Wireless Subscriber Jump": 0.8,
  "Arm Holdings (ARM) Announces 2026 Q2 Revenue Guidance of US$1.01B to US$1.11B": 0.5,
  "Norwegian Cruise Line pops, Lam Research slips, Reddit earnings": 0.2,
  "Meta's earnings blowout has destroyed tech's AI concern: Opening Bid top takeaway": 0.6,
  "Trump pressures 17 pharma CEOs to cut US drug prices": 0.5,
  "10 Dividend Stocks Poised to Outperform": 0.5,
  "Trump Sends Letters to 17 Pharmaceutical Companies Asking Them to Lower Costs": 0.5,
  "Lam Research, Qualcomm, FormFactor, Applied Materials, and KLA Corporation Shares Are Falling, What You Need To Know": -0.5,
  "Skyworks Solutions, Micron, Vishay Intertechnology, Photronics, and Kulicke and Soffa Shares Plummet, What You Need To Know": -0.7,
  "Applovin Corp (APP) Divests Gaming Subsidiaries in $400M Tripledot Deal": 0.5,
  "Roth Capital Raised the Firm’s PT on AST SpaceMobile (ASTS), Kept a Buy Rating": 0.5,
  "Datadog, Palo Alto Networks, Sprout Social, Monday.com, and Braze Shares Are Falling, What You Need To Know": -0.5,
  "Why Procore (PCOR) Shares Are Trading Lower Today": -0.5,
  "Jim Cramer Says “I Don’t Want You to Get Married to lululemon”": -0.5,
  "Top Stock Reports for Costco, HSBC & Booking Holdings": 0.0,
  "Stocks to Watch Thursday: Figma, Microsoft, eBay, Meta": 0.5,
  "July US Nonfarm Payrolls Expected to Rise by Only 105,000, Unemployment Rate Rising to 4.2%.": -0.6,
  "Battlefield 6’s Game-Changing Multiplayer and More Revealed During Blockbuster Global Event": 0.8,
  "Lam Research Projects Strong FY26, But China-Driven Growth Faces Market Skepticism": -0.5,
  "Why Diamondback Energy (FANG) Earns its Strong Buy Rating in 2025": 0.8,
  "These Were the S&P 500’s Best and Worst Stocks in July": 0.0,
  "Trump sends letters to pharma CEOs demanding they reduce drug prices in 60 days": -0.8,
  "Qualcomm's China Exposure A Key Risk Despite Xiaomi Partnership: Analyst": -0.5,
  "US labor market adds 73,000 jobs in July while May, June reports see 'larger than normal' downward revisions": -0.6,
  "CoreWeave, Arm Holdings, AbbVie: Trending Tickers": 0.0,
  "Intuit to Announce Fourth-Quarter and Full-Year Fiscal 2025 Results on Aug. 21; Investor Day Set for Sep. 18": 0.0,
  "Xencor Appoints Raymond Deshaies, Ph.D., to Board of Directors": 0.5,
  "AMGEN ANNOUNCES WEBCAST OF 2025 SECOND QUARTER FINANCIAL RESULTS": 0.1,
  "Schlumberger Limited (SLB)’s A Great Company Doing Terribly, Says Jim Cramer": -0.6,
  "Baker Hughes Company (BKR) Is “So Smart,” Says Jim Cramer": 0.6,
  "CSX Corporation (CSX) Might Be Bought Too, Says Jim Cramer": 0.5,
  "KLA CORPORATION REPORTS FISCAL 2025 FOURTH QUARTER AND FULL YEAR RESULTS": 0.0,
  "Amazon Q2 earnings are in: AWS growing at half the rate of GCP and ads continue to grow! - Source: [https://ir.aboutamazon.com/files/doc\\_financials/2025/q2/AMZN-Q2-2025-Earnings-Release.pdf](https://ir.aboutamazon.com/files/doc_financials/2025/q2/AMZN-Q2-2025-Earnings-Release.pdf) **- In after hours, stock was down \\~2.5% moments after the earnings were reported.** # 1. Earnings |Metric|Q2 2024|Q2 2025|Y/Y growth| |:-|:-|:-|:-| |Net sales (in $ billions)|147.977|167.702|13.0%| |Operating Income (in $ billions)|14.672|19.171|30.7%| |Diluted EPS ($)|1.26|1.68|33.3%| |Net income (in $ billions)|13.485|18.164|34.7%| |Operating cash flow (in $ billions)|25.281|32.515|28.6%| |Free cash flow (in $ billions)|53.9|18.2|\\-65.7%| # 2.": -0.2,
  "Reddit shares jump as much as 10% on second-quarter sales and guidance beat - Reddit shares jumped much as 10% after the company reported second-quarter earnings on Thursday that beat on sales and guidance. Here’s how the company did compared with LSEG estimates: * **Earnings per share:** 45 cents vs. 19 cents expected * **Revenue:** $500 million vs. $426 million expected Reddit’s sales grew 78% year-over-year in the second quarter and was 17% above consensus": 0.8,
  "KLA Corporation (NASDAQ:KLAC) Reports Upbeat Q2, Next Quarter’s Sales Guidance is Optimistic": 0.8,
  "Insperity Unveils Updated HR Solutions Portfolio": 0.5,
  "Arm AI Ambitions Grow, But Analysts Warn Of Margin Trouble Ahead": -0.5,
  "What Trump's Big Pharma CEO letters mean for drug pricing power": 0.2,
  "Do Higher Prices Mean Lower Sales? Hershey Thinks It's Found the Sweet Spot": 0.5,
  "Trump threatens NHS with higher drug prices": -0.8,
  "KLA: Fiscal Q4 Earnings Snapshot": 0.0,
  "These Stocks Moved the Most Today: Microsoft, Meta, CoreWeave, Qualcomm, Roblox, Norwegian, Arm, Carvana, eBay, and More": 0.5,
  "Stocks Erase Early Gains as Chip Makers and Big Pharma Retreat": -0.5,
  "CSX working with Goldman Sachs to explore strategic options, Bloomberg News reports": 0.5,
  "MicroStrategy’s (NASDAQ:MSTR) Q2 Sales Top Estimates": 0.8,
  "Apple reports biggest revenue growth since December 2021 - Apple versus consensus estimates for the quarter ending June 28: * Earnings per share: $1.57 vs. $1.43 expected * Revenue: $94.04 billion vs. $89.53 billion expected * iPhone revenue: $44.58 billion vs. $40.22 billion expected * Mac revenue: $8.05 billion vs. $7.26 billion expected * iPad revenue: $6.58 billion vs. $7.24 billion expected * Other Products revenue: $7.40 billion vs. $7.82 billion expected * Services revenue.": 0.8,
  "Genpact Appoints Thimaya Subaiya to Board of Directors": 0.5,
  "Amazon (AMZN) Tops Q2 Earnings and Revenue Estimates": 0.8,
  "2 Top Artificial Intelligence Stocks to Buy in August": 0.5,
  "KLA (KLAC) Surpasses Q4 Earnings and Revenue Estimates": 0.8,
  "Trump Talks Tough on Drug Prices but His Demands Have Softened": -0.5,
  "How to play software stocks in a shaky macro climate": 0.1,
  "CrowdStrike Holdings (CRWD) Declines More Than Market: Some Information for Investors": -0.5,
  "Micron (MU) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Datadog (DDOG) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Marvell Technology (MRVL) Dips More Than Broader Market: What You Should Know": -0.5,
  "Synopsys (SNPS) Falls More Steeply Than Broader Market: What Investors Need to Know": -0.6,
  "Workday (WDAY) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "META will have to stop buybacks or offer debt to fund AI investment - https://www.sec.gov/Archives/edgar/data/1326801/000162828025036719/meta-06302025xexhibit991.htm Page 7 \"Condensed consolidated statement of cash flows\". In 2025 META has spent $46B on investment activities on the back of $50B in net cash provided by operating activities. In q2 investment activities was $300M more than cash provided by operating activities ($25.6b v $25.9B) They have also spent $35B on financing activities in 2025, $22B from buying back stock.": -0.5,
  "Chevron, SLB Deals Signal U.S. Return to Iraqi Oilfields": 0.5,
  "KLA (KLAC) Q4 Earnings: Taking a Look at Key Metrics Versus Estimates": 0.2,
  "Here's Why Ross Stores (ROST) Fell More Than Broader Market": -0.5,
  "Autodesk (ADSK) Falls More Steeply Than Broader Market: What Investors Need to Know": -0.6,
  "Since 7/5/21 when Andy Jassy was named CEO, AMZN is up 18.3%, while the S&P is up 45.1%. - While I understand AMZN was trading very richly in 2021, this was still shocking to read. Everyone always hypes up AMZN in this subreddit though it candidly has been a horrible investment in the last 4 years. Am I crazy to say AMZN is a bit of an emperor with new clothes?": -0.6,
  "Figma’s 250% IPO Pop Gives It Edge in Creative AI Software Fight": 0.5,
  "Visa Adds More Stablecoin Features, Unveiling Avalanche, Stellar Support": 0.5,
  "Why Palo Alto Networks Stock Plummeted by More Than 5% Today": -0.7,
  "How Figma Made Design Everyone’s Business": 0.5,
  "Trump increases tariff on Canada to 35%, White House says - https://www.reuters.com/business/trump-increases-tariff-canada-35-white-house-says-2025-07-31/ > WASHINGTON, July 31 (Reuters) - U.S. President Donald Trump signed an executive order on Thursday increasing tariffs on Canadian goods to 35% from 25%, the White House said. > The new rates goes into effect on August 1. > \"In response to Canada's continued inaction and retaliation, President Trump has found it necessary to increase the tariff on Canada from 25% to": -0.8,
  "Materials Dividends Spotlight: Linde’s (LIN) Consistent Payout and Global Reach": 0.6,
  "(ITEM 5.07) Submission of Matters to a Vote of Security Holders The Linde plc Annual General Meeting of Shareholders was held on July 29, 2025 (the “AGM”), at which shareholders voted upon the items set forth below. The total number of shares that were present or represented by proxy at the Annual Meeting was 393,235,938 which was 83.53% of the shares outstanding and entitled to vote and which constituted a quorum. The final voting results of the": 0.0,
  "(ITEM 2.02) Results of Operations and Financial Condition On August 1, 2025, Linde plc issued a press release setting forth Linde plc’s results of operations for the quarter ended June 30, 2025. A copy of Linde plc’s press release is furnished herewith as Exhibit 99.1 and is hereby incorporated by reference in this\n\n(Item 2.02) .\n\n(Item 2.02) hereof: Exhibit No. Description 99.1 Press Release dated August 1, 2025 104 Cover Page Interactive Data File (embedded within the Inline XBRL document) 2": 0.0,
  "(Item 8.01) Other Events Adoption of Compensation Plan for Independent Directors On July 29, 2025, the Board of Directors (the “Board”) of MercadoLibre, Inc. (the “Company”), upon the recommendation of the Compensation Committee of the Board, approved compensation for independent directors, as defined by the Board, for service during the one year periods commencing at the Company’s annual shareholders’ meeting in 2025, 2026 and 2027 (or, to the extent applicable for any independent director whose service did": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On August 1, 2025, Regeneron Pharmaceuticals, Inc. issued a press release announcing its financial and operating results for the quarter ended June 30, 2025. A copy of the press release is being furnished to the Securities and Exchange Commission as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated by reference to this\n\n(Item 2.02) . The information included or incorporated in this\n\n(Item 2.02) , including Exhibit 99.1, shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, nor shall such information and exhibit be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended, except as shall be expressly set forth by specific reference in such a filing.": 0.1,
  "(ITEM 5.07) . SUBMISSION OF MATTERS TO A VOTE OF SECURITY HOLDERS. On July 31, 2025, Charter Communications, Inc. (“Charter”) held a special meeting of stockholders (the “Special Meeting”) to consider certain proposals related to the Transaction Agreement, dated as of May 16, 2025 (the “Transaction Agreement”), by and among Charter, Charter Communications Holdings, LLC, a subsidiary of Charter (“Charter Holdings”), and Cox Enterprises, Inc. (“Cox Enterprises”), pursuant to which (i) Cox Enterprises will sell and transfer": 0.1,
  "Big 4 has spent almost a TRILLION on AI - In the last 3 years Microsoft, Amazon, Facebook and Google has spent close to a TRILLION DOLLARS on AI. How much profit have they made from AI? Close to nothing. Look at Microsoft. Co-pilot has basically been bolted on to Office. Then Microsoft jacked up the price. But would people actually pay for Co-pilot on its own? Most probably not. So Microsoft can brag this": -0.6,
  "I don’t get analyzing companies - I’m fairly new to investing. I also spend a ton of time researching different companies. You know, doing my due diligence. But I can never seem to come to the conclusion “hey this is it” and feel confident about a purchase. It’s always buy a few and hold my breath hoping it goes up. I try to take the Warren buffet approach and look for “value plays” but I’m": -0.5,
  "The Healthcare sector is due for a bounce - 1. I sold my healthcare positions (panic sold at 33% loss on nvo) 2. My magic ball told me so 3. Inverse me etf would be up and i sold But in all seriousness i am expecting NVO to get to 290-305. If it falls below 290 i am buying with everything i can. The new CEO is supported by the majority shareholder group, and has": 0.5,
  "Trump doubles down on Most Favored Nation plan to target drug prices": 0.5,
  "Report: CSX talks with investment bank about merger options": 0.5,
  "Constellation Energy Corporation (CEG) Gains Following FERC Approval on Calpine Deal": 0.6,
  "Figma stock skyrockets 198% in explosive NYSE debut": 0.8,
  "Why Investors Rely on PepsiCo (PEP) Among the Best Retirement Dividend Stocks": 0.8,
  "Jim Cramer Says “I Was Surprised By the News From PayPal”": 0.2,
  "Jim Cramer Notes Cadence “Blew Away the Numbers With a Tremendous Quarter”": 0.8,
  "Jim Cramer Says Celestica “Belong in an Elite Camp of Contract Manufacturers”": 0.6,
  "Jim Cramer on Netflix: “It’s Going To Be Fine”": 0.6,
  "Comcast Corporation (CMCSA) Network Traffic Rises 76% from 2019 to 2024": 0.5,
  "Jim Cramer Says “We Don’t Want Fortinet”": -0.5,
  "RBC Capital Reduces PT on Charter Communications (CHTR) Stock": -0.5,
  "Jim Cramer Highlights Baker Hughes’ $13.6 Billion LNG Move": 0.5,
  "Train Stocks Could Fare Well as Union Pacific and Norfolk Southern Merge. Picking Winners.": 0.8,
  "Starbucks Shortlists Dozen Firms Including Tencent for China Investment": 0.5,
  "1 Growth Stock to Add to Your Roster and 2 We Question": 0.2,
  "1 Cash-Producing Stock for Long-Term Investors and 2 We Turn Down": 0.2,
  "3 Profitable Stocks with Open Questions": 0.0,
  "1 Volatile Stock for Long-Term Investors and 2 We Find Risky": -0.5,
  "2 Utilities That Stand to Gain From Big Tech’s Power Play": 0.5,
  "OpenTable Launches Gen-Al Powered Concierge to Arm Diners with Instant Insights for its 60,000+ Global Restaurants": 0.5,
  "An Exit Interview With Outgoing L.L. Bean CEO Stephen Smith": 0.2,
  "Exclusive-Three Intel senior executives to retire amid manufacturing shake up": -0.5,
  "Next-Gen Compact Computer-on-Modules Empower Intelligent Edge Applications Powered by NXP i.MX 95": 0.5,
  "Why the dip in tech today? - Hi, I’m a new trader and I’ve been putting my money in mostly tech stocks. There was just a big dip in some of the companies I have shares in, notably NVIDIA, AMD, and Amazon. That last one especially confuses me because it just reported good earnings. Can anyone help me understand?": -0.2,
  "Exelon Corp (EXC) Q2 2025 Earnings Call Highlights: Navigating Challenges with Strategic ...": 0.2,
  "Xcel Energy Inc (XEL) Q2 2025 Earnings Call Highlights: Strong EPS Growth and Strategic Investments": 0.8,
  "Airbnb: A Capital-Light Compounder Hiding in Plain Sight": 0.5,
  "KLA Corp (KLAC) Q4 2025 Earnings Call Highlights: Record Free Cash Flow and Dividend Increase ...": 0.8,
  "Do Wall Street Analysts Like CSX Stock?": 0.2,
  "Merck & Co. assembles an Alzheimer’s comeback with a next-gen precision focus": 0.8,
  "Advanced Authentication Market Outlook Report 2025-2029: Advanced Authentication Market to Surge by USD 75.57 Billion from 2024-2029, Driven by Online Transactions Boom": 0.8,
  "3 Reasons to Buy Costco Stock Like There's No Tomorrow": 0.5,
  "European drugmakers fall after Trump raises stakes over US drug price cuts": -0.5,
  "Trending tickers: Figma, Apple, Amazon, Reddit and IAG": 0.0,
  "Xcel Energy ‘prepared to go to trial’ to fight Marshall Fire liability": -0.5,
  "r/Stocks Daily Discussion & Fundamentals Friday Aug 01, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is": 0.2,
  "Linde Reports Second-Quarter 2025 Results": 0.0,
  "Zeolites Company Evaluation Report 2025 | BASF, Honeywell, and Clariant Lead with Global Reach, Innovation in Catalysis, and Strategic Expansion Initiatives": 0.6,
  "Weekly Recap: 13 Finance Press Releases You Need to See": 0.2,
  "AEP expects to add 24 GW of load by 2030, mainly from data centers": 0.2,
  "How come Azure manages to still grow 33%, while GCP 32% (1/3 of size) and AWS only 17% - My question is if they are doing some shady reporting or are they really that good? For example Openai uses azure credits that still msft pays. A company that I know received 1 billion in azure credits in exchange of shares in the company. Are these counted in the 33% growth that msft pays? Wouldn't it": 0.1,
  "2 Top Stocks I Wouldn't Hesitate to Invest $1,000 in Right Now": 0.8,
  "Regeneron Reports Second Quarter 2025 Financial and Operating Results": 0.0,
  "Barnburner Figma IPO Offers Good Omen as Klarna Reconsiders Debut": 0.6,
  "Linde beats Q2 top and bottom line forecasts, offers profit outlook; shares up": 0.8,
  "Old Dominion Freight Line Second Quarter 2025 Earnings: EPS Misses Expectations": -0.6,
  "Here's Why We Think Roper Technologies (NASDAQ:ROP) Might Deserve Your Attention Today": 0.5,
  "Regeneron: Q2 Earnings Snapshot": 0.0,
  "Regeneron’s (NASDAQ:REGN) Q2: Strong Sales": 0.8,
  "Weekly Recap: 12 Tech Press Releases You Need to See": 0.0,
  "Design software maker Figma extends gains after blockbuster NYSE trading debut": 0.8,
  "Morgan Stanley Raised PT on Cisco from $67 to $70, Keeps Overweight Rating": 0.8,
  "Scotiabank Initiated MercadoLibre, Inc (MELI) With a Buy Rating": 0.6,
  "Old Dominion Freight Line notes some progress in Q2 revenue": 0.5,
  "Institutional investors control 84% of Marvell Technology, Inc. (NASDAQ:MRVL) and were rewarded last week after stock increased 8.5%": 0.8,
  "Boasting A 30% Return On Equity, Is Charter Communications, Inc. (NASDAQ:CHTR) A Top Quality Stock?": 0.6,
  "Slowing Rates Of Return At CSX (NASDAQ:CSX) Leave Little Room For Excitement": -0.6,
  "Supernus strengthens neuropsychiatric portfolio with Sage Therapeutics": 0.5,
  "Regeneron cancer bispecific rejected again; Allogene discloses trial death": -0.5,
  "CDW Names Mukesh Kumar Chief Services and Solutions Officer": 0.2,
  "Global Stocks to Watch: Novo Nordisk, AXA, Daimler Truck": 0.0,
  "You can now Venmo the US Treasury to help pay down the national debt — should you give a patriotic 'gift' to Uncle Sam?": 0.2,
  "Buy 5 Wide Moat Stocks to Enhance Your Portfolio Returns": 0.5,
  "Buy META as Solid Q2 Reduces Concerns on Monetization of AI Spending": 0.6,
  "PayPal Shares Sink Despite Upbeat Outlook. Is Wall Street Missing the Turnaround?": -0.5,
  "Global Pharma Stocks Fall After Trump Demands Cuts in Drug Prices": -0.8,
  "CrowdStrike Earnings Preview: What to Expect": 0.0,
  "Palo Alto Networks investigating ransomware threat related to SharePoint exploitation": -0.5,
  "2 Dividend Stocks You Won't Find in the Schwab U.S. Dividend Equity ETF (SCHD). And They're Better Buys.": 0.5,
  "Keurig Dr Pepper's (NASDAQ:KDP) Soft Earnings Don't Show The Whole Picture": 0.1,
  "AI Chips Today - Revolutionizing Business Processes With AI-Driven Solutions": 0.5,
  "3 Companies Including Zscaler That May Be Priced Below Estimated Value": 0.2,
  "High Growth US Tech Stocks To Watch In August 2025": 0.5,
  "Regeneron (REGN) Tops Q2 Earnings and Revenue Estimates": 0.8,
  "Regeneron shares edge higher as second quarter earnings surpass estimates": 0.8,
  "Tariffs update from this morning's Tariff enforcement day. - \"Trump signed an order to hike tariffs on Canada to 35%, while he kept a baseline minimum rate of 10% across all partners. The tariffs on Canada go into effect Friday, while many of the other \"reciprocal\" rates take effect Aug. 7.\" * Trump granted Mexico, the US's largest trading partner, a 90-day reprieve on higher tariffs, saying he would extend the country's current tariff rates": -0.5,
  "United States Surgical Robots Market Competition, Forecast & Opportunities Report 2025-2030, with Medtronic, Intuitive Surgical, Stryker, Medrobotics, TransEnterix, Think Surgical, Accuray, and More": 0.2,
  "The Cognizant Technology Solutions Corporation (NASDAQ:CTSH) Second-Quarter Results Are Out And Analysts Have Published New Forecasts": 0.2,
  "Visa Isn't Worried About Stablecoins. 3 Stablecoins to Watch as Companies Explore This Powerful Growth Catalyst.": 0.5,
  "PayPal’s Comeback Is Gaining Steam: Is the Stock a Buy Again?": 0.5,
  "Big Stock Market Leaders Tend To Do This After Breaking Out": 0.2,
  "What Aiming To Be The Next Disney Could Mean For Netflix Stock": 0.2,
  "4 Crypto-Centric Stocks to Buy Before Bitcoin Resumes Its Rally": 0.6,
  "Dow Jones Futures Fall On Global Trump Tariff Hikes, Amazon Earnings; Jobs Report Due": -0.5,
  "Verisk Analytics Second Quarter 2025 Earnings: EPS Beats Expectations": 0.6,
  "Texas Instruments Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "Does PepsiCo’s prebiotic cola have potential to pop?": 0.2,
  "Exchange-Traded Funds, Equity Futures Lower Pre-Bell Friday Amid Revived Trade War Fears": -0.7,
  "Awake Chocolate seeks to triple sales of caffeinated functional snacks": 0.5,
  "Regeneron posts better-than-expected Q2 results, downplays tariff impact": 0.8,
  "Arm Invests Ahead Of Return, Stock Drops": -0.5,
  "Here's How Much You'd Have If You Invested $1000 in Cadence Design Systems a Decade Ago": 0.5,
  "Here’s Why Roper Technologies (ROP) Fell in Q2": -0.5,
  "Verisk Analytics (VRSK) Fell Along with Other Defensive Stocks in Q2": -0.5,
  "Celestica and Westlake have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Baron Asset Fund’s Comments on CoStar Group (CSGP)": 0.0,
  "Figma stock gains 5% after blockbuster 250% debut rally": 0.8,
  "AI/R Accelerates Personalization at Scale Through Webjump’s Latest Adobe Milestone": 0.6,
  "Is Most-Watched Stock Shopify Inc. (SHOP) Worth Betting on Now?": 0.2,
  "Analog Devices, Inc. (ADI) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Cadence Design Systems, Inc. (CDNS) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Fortinet, Inc. (FTNT) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Costco Wholesale Corporation (COST) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Aristotle Capital’s Global Equity Strategy Sold PayPal Holdings (PYPL) for a More Compelling Opportunity": 0.6,
  "A Look At The Fair Value Of Applied Materials, Inc. (NASDAQ:AMAT)": 0.1,
  "Stocks making big moves this week: GE HealthCare, EXL, 1-800-FLOWERS, Leslie's, and Fiverr": 0.5,
  "Should Axon Enterprise Stock be in Your Portfolio Pre-Q2 Earnings?": 0.2,
  "Roll Out the Magenta Welcome Mat: T-Mobile Completes UScellular Deal": 0.8,
  "Zscaler Completes Acquisition of Red Canary to Accelerate Innovations in Agentic AI-driven Security Operations": 0.5,
  "Mondelez International Second Quarter 2025 Earnings: Revenues Beat Expectations, EPS Lags": 0.2,
  "UScellular Completes Sale of Wireless Operations": 0.0,
  "GE HealthCare Technologies Inc. Just Beat EPS By 19%: Here's What Analysts Think Will Happen Next": 0.5,
  "What Analyst Projections for Key Metrics Reveal About Fortinet (FTNT) Q2 Earnings": 0.2,
  "Shopify (SHOP) Q2 Earnings on the Horizon: Analysts' Insights on Key Performance Measures": 0.5,
  "Gear Up for Airbnb (ABNB) Q2 Earnings: Wall Street Estimates for Key Metrics": 0.2,
  "China State Media Questions Nvidia's Chip Security Will It Hit $NVDA’s China Sales Again? - China’s state media just publicly questioned Nvidia’s chip security, asking them to provide clear proof that their AI chips specifically the H20 don’t have backdoors or privacy risks. They even published a piece titled “Nvidia, how can I trust you?” which feels pretty direct This comes not long after the U.S. relaxed export rules, allowing Nvidia to sell these chips": -0.6,
  "Regeneron Stock Is Rising on Earnings. This Sanofi Collaboration Is Helping.": 0.6,
  "Qualys Gears Up to Report Q2 Earnings: What's in Store for the Stock?": 0.2,
  "Regeneron's Pipeline Hit By Catalent Delays, But Dupixent Shines": 0.5,
  "Market sinks as Trump announces slew of new tariffs, including 50% on Brazil, as US job market slows - This is the full new tariff list, in descending order: **50%** * Brazil **41%** * Syria **40%** * Laos * Myanmar **39%** * Switzerland **35%** * Canada *(goods not exempted by USMCA)* * Iraq * Serbia **30%** * Algeria * Bosnia and Herzegovina * China *(most goods; some exemptions)* * Libya * South Africa **25%** *": -0.8,
  "Are Wall Street Analysts Predicting Keurig Dr Pepper Stock Will Climb or Sink?": 0.2,
  "Pheton Holdings Ltd Issues Statements Addressing Recent Market Activity and Misleading Rumors": 0.1,
  "HCI Announces SPARK TALENT 2025 in San Antonio, TX on October 7-9, 2025: A Cutting-Edge Summit on Workforce Planning, Talent Acquisition & AI in HR": 0.8,
  "Brokers Suggest Investing in Intuit (INTU): Read This Before Placing a Bet": 0.2,
  "Regeneron (REGN) Q2 Earnings: How Key Metrics Compare to Wall Street Estimates": 0.5,
  "Compared to Estimates, Linde (LIN) Q2 Earnings: A Look at Key Metrics": 0.2,
  "T-Satellite boosts network reach where mobile signal is absent": 0.5,
  "Avis Budget downgraded, Sprouts upgraded: Wall Street's top analyst calls": 0.2,
  "Cognizant Technology Solutions Stock: Analyst Estimates & Ratings": 0.0,
  "The Zacks Analyst Blog Highlights Costco Wholesale, HSBC, Booking and Smith-Midland": 0.2,
  "Wall Street strategist explains how to navigate an ’AI Bubble’": 0.2,
  "EU-US Steel Agreement Stalemate: Tariffs Remain in Place, Quota Negotiations Will Determine the Fate of the Steel Sector - What happened? The EU and the US have just reached a broad trade agreement imposing a 15% tariff on EU exports (covering automobiles, pharmaceuticals, semiconductors, and other sectors), avoiding the originally planned 30% punitive tariff. However, steel and aluminum remain subject to tariffs as high as 50% until both sides reach a final agreement on the": 0.1,
  "Marriott to Report Q2 Earnings: What's in Store for the Stock?": 0.2,
  "Here's Why Astrazeneca (AZN) is a Strong Momentum Stock": 0.6,
  "If you've ever posted about when to start DCA'ing into the market, today is the day. - Lots of posts about people hesitant to start investing when it's at all time highs. The answer is always DCA and a sharp pullback like today is the best time you could possibly start if you have a long time horizon. I don't know the future, it may go down tomorrow, but the more people you see panic": 0.6,
  "Constellation Energy Corporation's (NASDAQ:CEG) Intrinsic Value Is Potentially 60% Above Its Share Price": 0.8,
  "Figma's blockbuster IPO could fuel wave of new listings": 0.5,
  "Stocks Slump on Tariffs and Weak US Job Growth": -0.7,
  "Trump Administration to experiment with including GLP-1 drugs in Medicaid & Medicare - What will the impact be on the Healthcare providers like Centene, Elevance, United, Cigna, Molina etc... More blood in the short term, or is this priced in ? UNH and Centene already announced the Utilization rate is higher than expected, but it was in : behavioral health, home health services, cancer drugs and gene therapies. Do GLP-1 drugs count as Gene therapy?": 0.2,
  "Figma Stock Rises After Record IPO Surge. Cathie Wood Bought in, There’s a Hurdle for Others.": 0.6,
  "Software-defined Wide Area Network (SD-WAN) Market worth $21.67 billion by 2030 | MarketsandMarkets™": 0.5,
  "The most overlooked, undervalued, recession proof, opportunity in this macro environment: $EZPW - **Something big happened Wednesday night and nobody’s talking about it.** EZCORP ($EZPW), of all companies, posted a stealthy *double beat*: earnings up 33.6%, revenue up 2.8%. No flashy branding, no AI, no datacenter capital burn. Just... pawnshops. This is a company built on *short-term credit* and *collateralized lending*. And while everyone’s been watching Nvidia, this pawn empire (with operations across the U.S.": 0.4,
  "Charter Communications, Inc. (CHTR) Releases Q2 2025 Earnings": 0.0,
  "AMD is evolving from a chip supplier to a full-fledged AI computing platform player - The MI350 is close enough to Nvidia's performance that AMD can finally charge something closer to a premium price. This chip is no longer just an affordable alternative - it's being used in real-world, mission-critical AI workloads. Most importantly, this is the “early inflection point” in the changing competitive landscape you've been watching. Revenue and margin gains are real At": 0.8,
  "JNJ or AZN: Which Pharma Giant is a Better Buy Post Q2 Results?": 0.2,
  "Why PayPal’s latest crypto move is huge for the industry": 0.8,
  "Update: T-Mobile US Closes Acquisition of Array Digital Infrastructure's Wireless Operations": 0.5,
  "Smart Mobility Powers Dual Circulation": 0.5,
  "UBS and Barclays Raise PT on KLA Corporation (KLAC)": 0.5,
  "Zscaler, Inc. (ZS) Nears 52-Week High; UBS Raises PT to $365": 0.8,
  "Lam Research Corporation (LRCX) Reports Fourth-Quarter 2025 Results; Mizuho Raises PT to $120": 0.5,
  "Regeneron Stock Rises on Q2 Earnings and Sales Beat, Eylea HD Sales Up": 0.8,
  "Intuitive Surgical, Inc. (ISRG) Installs 395 da Vinci Systems in Q2, Forecasts 17% Procedure Growth": 0.6,
  "Booking Holdings Inc. (BKNG) Bets on AI to Fuel Next Phase of Travel Innovation": 0.6,
  "Adobe’s Failed Acquisition of Figma Has Cost the Company Over $38 Billion and Counting — Here’s How High It Could Go": -0.8,
  "PepsiCo, Inc. (PEP) Shutters Detroit Facility, Lays Off 83 Workers Amid Cost Cuts": -0.8,
  "Texas Instruments Incorporated (TXN) Unveils Historic $60B U.S. Chip Expansion Plan": 0.8,
  "Micron Technology, Inc. (MU) Launches World’s First PCIe Gen6 SSD for AI Data Centers": 0.8,
  "Starbucks earnings report draws sharp views from veteran trader, hedge funder": 0.2,
  "Nike, Deckers, On Running among footwear stocks under pressure as Trump outlines latest tariff plans": -0.6,
  "Palantir, AMD, Shopify Headline Another Busy Week of Tech Earnings": 0.5,
  "GEHC vs. BSX: Which Stock Is the Better Value Option?": 0.2,
  "CyberArk (CYBR) Downgraded After Acquisition by Palo Alto Networks": -0.5,
  "Will Analog Devices (ADI) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Qualcomm’s (QCOM) Strong Q3 Performance Shows Resilience—But Apple’s Exit Could Hurt": 0.2,
  "GAMB – Risk/reward too good to ignore right now - So yeah, I just loaded up more GAMB and honestly, it feels like one of the few actual asymmetric plays left under $500M market cap. Stock’s been bleeding for weeks, I get it. But fundamentals? Still rock solid. Profitable. Growing revenue. Dominating SEO in online gambling they’re not the casino, they’re the toll booth. You wanna place a bet online? Chances are you’re going through": 0.8,
  "Stock Market Falls On Trump Tariffs, Jobs Report; Microsoft, Meta, Amazon Also In Focus: Weekly Review": -0.5,
  "Why Regeneron (REGN) Stock Is Trading Up Today": 0.5,
  "Exelon Stock: Is Wall Street Bullish or Bearish?": 0.2,
  "Amazon Stock Falls Despite Q2 Earnings & Revenues Beat Estimates": 0.2,
  "MELI Set to Report Q2 earnings: Time to Hold or Fold the Stock?": 0.2,
  "CDW, CRA, Crane NXT, Diebold Nixdorf, and Exponent Shares Are Falling, What You Need To Know": -0.5,
  "KBRA Assigns Preliminary Ratings to VRTX 2025-HQ": 0.0,
  "Five9, Snowflake, SoundHound AI, PubMatic, and CrowdStrike Shares Are Falling, What You Need To Know": -0.5,
  "MongoDB, Okta, Asana, Zscaler, and Zoom Shares Are Falling, What You Need To Know": -0.5,
  "Electronic Arts (EA) Unveils Battlefield 6 With Exciting New Features And Modes": 0.8,
  "KLA Corporation Q4 Earnings Surpass Estimates, Revenues Increase Y/Y": 0.8,
  "T-Mobile US (TMUS) Enhances Water Conservation With Advanced IoT Solutions For FCS": 0.5,
  "Comcast (CMCSA) Announces US$0.33 Dividend In Q2 With Strong Earnings and Share Buybacks": 0.8,
  "AMD, Broadcom, Marvell Technology, Micron, and Nvidia Stocks Trade Down, What You Need To Know": -0.5,
  "Microchip Technology, MACOM, NXP Semiconductors, Sensata Technologies, and Skyworks Solutions Shares Are Falling, What You Need To Know": -0.5,
  "CSX (CSX) Explores M&A Options Following Union Pacific's US$72 Billion Acquisition": 0.5,
  "KLA (KLAC) Announces Q4 Earnings Growth With Revenue Surpassing US$3 Billion": 0.8,
  "Starbucks CEO announces 'sunset' of entire line of stores. 3 are in Tennessee": -0.6,
  "New Leadership at CDW (CDW): Mukesh Kumar Joins as Chief Services and Solutions Officer": 0.5,
  "MarineMax, Sally Beauty, Sportsman's Warehouse, and Lululemon Shares Plummet, What You Need To Know": -0.7,
  "Dow Jones Leader Plows To New Highs As Gold Stock Glows": 0.5,
  "SentinelOne (S) Gains High-Level CCN Certification Enhancing Government Security Reach": 0.6,
  "Figma’s 33-year-old cofounder is a former LinkedIn intern who launched the $68 billion Wall Street darling with $100k from Peter Thiel": 0.2,
  "Bitcoin Slips, Coinbase Stock Drops as Market's Friday Ills Hit Crypto": -0.5,
  "Celestica Inc. (CLS) Is Up Huge, Says Jim Cramer": 0.6,
  "Starbucks Corporation (SBUX): Don’t Worry About Luckin Coffee, Says Jim Cramer": 0.5,
  "Cadence Design Systems, Inc. (CDNS)’s Numbers Show NVIDIA Is In Great Shape In China, Says Jim Cramer": 0.8,
  "Tesla must pay $329 million in damages in fatal Autopilot case, jury says - A jury in Miami has determined that Tesla should be held partly liable for a fatal 2019 Autopilot crash, and must compensate the family of the deceased and an injured survivor damages of $329 million. The payout includes $129 million in compensatory damages, and $200 million in punitive damages against Tesla. Attorneys for the plaintiffs had asked the jury to award": -0.8,
  "The Procter & Gamble Company (PG): “It’s Just Not Great,” Says Jim Cramer": -0.6,
  "Baker Hughes Company (NASDAQ:BKR) Looks Like A Good Stock, And It's Going Ex-Dividend Soon": 0.6,
  "Starbucks, CAVA, Shake Shack, Bloomin' Brands, and Cracker Barrel Shares Are Falling, What You Need To Know": -0.5,
  "Arm Holdings (ARM) Drops 13% on Disappointing Q2": -0.8,
  "Investors Are Flocking to Figma. Why Is the Design Software Maker's Stock So Hot?": 0.6,
  "MicroStrategy, Robinhood stocks reel despite shocking earnings": -0.6,
  "Tempus AI Stock Before Q2 Earnings Release: To Buy or Not to Buy?": 0.2,
  "Wall Street Circles Starbucks as China Deal Heats Up--Tech Giants and PE Titans in Bidding War": 0.5,
  "What Companies Have Said About Jobs in the Past Quarter": 0.0,
  "Transferwise Stocks Option Blackrock as Fundmanager SEEKING ADVISE PLEASE - Hello guys, I’m a complete newbie. Please enlighten and advise me. I have invested 2100€ on Wise’s stocks - where they store your money as stocks and the fund manager is blacrock. I had some gains for a month now of around 41€, but then yesterday or today there was a big dip of 8%, my earnings went negative and I lost a total of": -0.2,
  "Datadog (NASDAQ:DDOG) pulls back 4.5% this week, but still delivers shareholders notable 9.2% CAGR over 5 years": 0.5,
  "CSX on the Hot Seat from Activist Ancora Following UP-NSC Takeover": 0.1,
  "Oil Rig Count Drops by 5; Crude Prices Slump Ahead of OPEC+ Weekend Meeting": -0.7,
  "Colgate-Palmolive, Rocket, Regeneron: Trending Tickers": 0.0,
  "Public Keys: Strategy Eyes Domination, Metaplanet Bitcoin Barrage, and Coinbase XRP Boost": 0.5,
  "AMGEN ANNOUNCES 2025 THIRD QUARTER DIVIDEND": 0.0,
  "These Stocks Moved the Most Today: Apple, Amazon, Figma, Reddit, Eastman Chemical, MicroStrategy, Coinbase, and More": 0.5,
  "IPO Mania Is Back Thanks to Figma, Circle and CoreWeave": 0.5,
  "McDonald’s, Palantir, Novo Nordisk Earnings: What to Watch Next Week": 0.2,
  "Health Care Roundup: Market Talk": 0.0,
  "Energy & Utilities Roundup: Market Talk": 0.0,
  "How the crypto treasury craze is creating ‘true scarcity,’ says BitMine chairman Tom Lee": 0.5,
  "The Trade Desk (TTD) Stock Moves -1.01%: What You Should Know": -0.5,
  "Costco (COST) Increases Despite Market Slip: Here's What You Need to Know": 0.5,
  "Why AppLovin (APP) Dipped More Than Broader Market Today": -0.5,
  "Constellation Energy Corporation (CEG) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "Here's Why Zscaler (ZS) Fell More Than Broader Market": -0.5,
  "Workday (WDAY) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Stock Market Week Ahead: Caterpillar, Palantir And Black Hat Week": 0.2,
  "The Best Way to See China? On Futuristic, Punctual, Very Fast Trains": 0.6,
  "Starbucks CEO talks rising coffee prices and tariffs": 0.0,
  "Earnings, Fed commentary, consumer credit: What to Watch": 0.0,
  "Airbnb Announces Music Partnership With Lollapalooza": 0.5,
  "MicroStrategy Stock Drops 9%. New Equity Guidelines Could Be the Reason.": -0.6,
  "Global AI Data Center Infrastructure Leader Zettabyte Receives Strategic Investment from Lam Capital": 0.5,
  "Why Arm Holdings Stock Sank by Over 15% This Week": -0.7,
  "AMD Stock Gets Bullish Re-Rating as Export Ban Relief Sparks $800M Upside": 0.8,
  "Marvell (MRVL) Remains in AI Winners Camp as Morgan Stanley Nudges Target Higher": 0.6,
  "Palo Alto Networks (PANW) to Acquire CyberArk in $25 Billion AI Security Deal": 0.5,
  "Where do you park dry powder? - Rate on my money market 4%, so I’m staying liquid. Gold has been treading water since spring and every dividend stock I’ve looked at seems…unattractive for th3 4isk/return. What are banks gonna do with all this cash? Alternatives?": 0.2,
  "Palo Alto Networks (PANW) to Acquire CyberArk in $25 Billion AI Security Deal - https://uk.finance.yahoo.com/news/palo-alto-networks-panw-acquire-235908242.html * On July 30, Reuters reported that Palo Alto Networks has agreed to buy Israeli peer CyberArk Software for an estimated $25 billion, its biggest deal yet.* Does PANW’s current price weakness present a buy opportunity? Are you accumulating?": 0.5,
  "Thoughts on Monday open after tariff news? - As we all know the tarrif news sent shock into the markets Friday, what is everyone’s opinions on the markets movements from this point on say Monday open? Do you guys see it move lower, higher and why? Big earnings that week aswell, will be a very volatile week. I’m guessing earnings will be strong from most big dogs but what are you guys expecting upon guidance": 0.2,
  "Warning? Cramer says \"I will buy Amazon hands over fist\" and Amazon Kuiper will rival Tesla (he means Starlink) - It seems like a lot of Redditors are thinking of buying the Amazon dip. I did as well. But I know you guys like to meme on Cramer so just want to share what he said during his morning show. Other things he said: * Microsoft's cloud revenue might be somewhat inflated by OpenAI (although": 0.2,
  "What’s your biggest ‘I should’ve held’ stock regret? - You know. Every investor has some kind of regret related to selling too soon such as Apple or Nvidia or anything else. Stock that, if you had just held on, might have changed your life. What's your \"I sold it too early\" stock and what made you do it? Tell me your story": 0.2,
  "T-Mobile US, Inc. and T-Mobile USA, Inc. Announce Final Results of its Exchange Offers and Consent Solicitations for Certain of Array Digital Infrastructure, Inc.’s Outstanding Debt Securities": 0.0,
  "Rule of 40 AI plays: INOD, IDCC, RDVT - too good to be true or legit opportunities? - I found some sub mid-cap stocks that meet the rule of 40 \\[(revenue growth + net margin) > 40\\]. They are technology based and fall in the AI bucket. I'm assuming a decent amount of their recent impressive growth is due to the AI hype but I'm sure there is some validity to their growth. I was": 0.2,
  "Does any have a way to track VIX and MOVE? - I am in need of a way to track realtime VIX and MOVE without going to a Bloomberg terminal and when these move I want to be alerted. Preference is a website and/or app that focus on these two measures of volatility. I need over the next 2 years. Anyone else tracking these. Okay so f it tracks crypto volatility too. Don’t want to": 0.1,
  "AP Top Financial News at 11:33 a.m. EDT": 0.0,
  "Buy and Hold Investors Shouldn’t Overlook Roper Technologies’ (ROP) Consistency": 0.5,
  "Consumer Confidence Is Down. Marriott’s CEO Explains Why the Appetite for Travel Won’t Waver.": 0.2,
  "Income Stocks Spotlight: What Makes Cisco Systems (CSCO) Stand Out": 0.5,
  "Microsoft finally revealed Azures true revenue. What do we all think? - Microsoft used to bundle all kinds of other devices like O365, server licenses, etc. into their “Intelligent Cloud” segment, muddying comparisons with AWS and GCP. Looks like this time, they finally caved and reported numbers. The growth always looked sus to me in the real world given everyone anecdotally swears by AWS and I know very few who use Azures compute or data": -0.6,
  "Linde PLC (LIN) Q2 2025 Earnings Call Highlights: Record EPS and Operating Margin Amidst ...": 0.8,
  "PayPal Stock Dropped 9% After Earnings. Is it a Red Flag, or a Buying Opportunity?": -0.5,
  "1 Underrated Reason to Buy This Unstoppable Stock": 0.5,
  "Undervalued and Profitable: 3 Artificial Intelligence (AI) Stocks for Buffett-Minded Investors": 0.8,
  "Best Stock to Buy Right Now: Target vs. Costco": 0.5,
  "This Surprising Pizza Stock Is Beating the Market in 2025. Time to Buy?": 0.6,
  "AstraZeneca Second Quarter 2025 Earnings: Revenues Beat Expectations, EPS Lags": 0.2,
  "This Growth Stock Is a Pure No-Brainer Buy Right Now": 0.8,
  "The Best Stocks to Invest $1,000 in Right Now": 0.5,
  "Uncertain economic times? That means it's gold's time to shine": 0.6,
  "Lyft's Margin Makeover: Will Investors Ride the Upside?": 0.5,
  "3 Dividend Stocks to Hold for the Next 20 Years": 0.5,
  "Fabless future no longer unthinkable for Intel": 0.2,
  "/r/Stocks Weekend Discussion Saturday - Aug 02, 2025 - This is the weekend edition of our stickied discussion thread. Discuss your trades / moves from last week and what you're planning on doing for the week ahead. Some helpful links: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips *": 0.2,
  "Is there going to be anymore nvidia /palantir type stocks - Im reading stories of people investing in nvidia at 5 dollars a share or AMD at 3 dollars a share. When they were quality companies. I also talked to someone who bought palantir shares cheap after the ipo and made so much money. As someone new to investing its so hard to find anything in the AI or now Quantum field or chip making": 0.2,
  "The Motley Fool's Just-Released Report Shows U.S. Inflation Is at 2.7%. Here's How 2 Consumer Goods Staples Are Faring.": 0.5,
  "3 Unstoppable Stocks to Buy in August": 0.5,
  "Insiders are the top stockholders in PDD Holdings Inc. (NASDAQ:PDD), and the recent 7.1% drop might have disappointed them": -0.6,
  "Doritos thinks this flavor is its next ‘Cool Ranch’": 0.5,
  "The Smartest Artificial Intelligence (AI) Stocks to Buy With $1,000 Right Now": 0.8,
  "The Smartest Dividend Stocks to Buy With $500 Right Now": 0.5,
  "TD Cowen Reaffirms Buy on Axon (AXON) Ahead of Earnings, Sees 29% Full-Year Growth": 0.8,
  "Oppenheimer Raises The Trade Desk (TTD) Target on Strong Growth Forecasts": 0.8,
  "Wells Fargo Raises Arm Holdings (ARM) Price Target on AI Growth Momentum": 0.6,
  "Broadcom (AVGO) Stock Rated Buy by Goldman Sachs on AI and M&A Strength": 0.8,
  "Jim Cramer on Intel CEO: “He Totally Understands Everything”": 0.6,
  "Stifel Raises Price Target on Baker Hughes (BKR) After Strong Q2 2025 Earnings": 0.8,
  "Jim Cramer on Starbucks: “I Think it Was a Very Positive Quarter”": 0.8,
  "Jim Cramer on Costco: “I Think They’re Doing Everything Right”": 0.8,
  "Jim Cramer on Micron: “I Think You Buy a Little Bit Here”": 0.6,
  "Jim Cramer on Chipotle: “It’s Just Gotten A Lot More Expensive”": 0.2,
  "3 Top Stocks to Buy With $1,000 in August": 0.5,
  "At US$222, Is Analog Devices, Inc. (NASDAQ:ADI) Worth Looking At Closely?": 0.2,
  "Workday (NASDAQ:WDAY) shareholders are still up 37% over 3 years despite pulling back 8.1% in the past week": 0.6,
  "2 Monster Stocks to Hold for the Next 5 Years": 0.5,
  "Berkshire takes $3.8 billion Kraft Heinz write-down, operating profit falls": -0.6,
  "These 4 Measures Indicate That Broadcom (NASDAQ:AVGO) Is Using Debt Safely": 0.6,
  "Warren Buffett's Berkshire Hathaway Records $5 Billion Write-Down of Kraft Heinz Stock": -0.7,
  "Is C3.ai Stock a Buy?": 0.0,
  "Profits drop at Warren Buffett's Berkshire Hathaway as it writes down its Kraft Heinz investment": -0.5,
  "Mondelez International's (NASDAQ:MDLZ) Dividend Will Be Increased To $0.50": 0.5,
  "Exelon Second Quarter 2025 Earnings: EPS Beats Expectations, Revenues Lag": 0.2,
  "Berkshire Operating Profits Fall 4% in 2nd Quarter. Company Takes Write-Down of Kraft Equity Stake.": -0.6,
  "GE HealthCare Technologies Second Quarter 2025 Earnings: EPS Beats Expectations": 0.8,
  "I keep missing big I keep missing big stock stock moves because I didn’t catch the news fast enough. Does anyone else struggle with this? - Hi fellow traders, I've felt lately like no matter how diligent I am about keeping up with the market, I still somehow end up missing out on some substantial gains just because I wasn't on top of specific news or catalysts in a timely manner. It's maddening because sometimes": -0.6,
  "Take-Two Interactive Software Insiders Sell US$18m Of Stock, Possibly Signalling Caution": -0.5,
  "PepsiCo Insiders Sold US$19m Of Shares Suggesting Hesitancy": -0.5,
  "Drugmakers are pouring billions of dollars into new US manufacturing. It still won’t achieve all of Trump’s tariff goals": 0.2,
  "Did anyone here buy UNH in 500 to 600 range here? - Just wondering if anyone here has brought UNH in above priced range. If so why did u buy it and how are u coping right now since this massive drop. From what I can see on redddit lot of people brought at 300 and are panicking as stock is tanking more. I do think we might see dip below 200 at this rate.": -0.6,
  "Results: Biogen Inc. Exceeded Expectations And The Consensus Has Updated Its Estimates": 0.8,
  "Berkshire’s Quarterly Earnings Drop on Insurance Results, Currency Moves": -0.5,
  "For US Companies, Europe Is Hard to Resist: Credit Weekly": 0.2,
  "r/Stocks Weekly Thread on Meme Stocks Saturday - Aug 02, 2025 - The meme stock scheduled posts will now run weekly and post Saturday afternoon and won't be a sticky; you're probably seeing this because automod sent you here! [Full list of meme stocks here.](https://www.reddit.com/r/stocks/wiki/meme-stocks) This will be updated every once in a while. ------ Welcome traders who just can't help them selves discuss the same exact stock that's been discussed 100s of times a": 0.1,
  "Why Michael Saylor Calls Strategy's STRC Preferred Stock His Firm's 'iPhone Moment'": 0.5,
  "Comcast takes drastic action as customers rapidly cut service": -0.8,
  "Amgen (AMGN) Board Declares US$2.38 Dividend for Q3 2025": 0.5,
  "Old Dominion Freight Line (ODFL) Sees 10% Stock Drop Over Last Quarter": -0.7,
  "Investors are flocking to Figma. Why is the design software maker's stock popular? - An estimated 95% of Fortune 500 companies use it, with its clients including many tech heavyweights like Amazon (AMZN), Google parent Alphabet (GOOGL), Oracle (ORCL), and Netflix (NFLX). https://www.investopedia.com/why-investors-are-excited-about-design-software-maker-figma-s-stock-adobe-11783398 August 2025": 0.8,
  "GOOGL question? - Y’all, Google is under investigation from DOJ or EU I think. Not sure if they are still ongoing or what not. If so, does anyone know when they conclude the investigation? I just want to know if they are still being investigated or they already got slapped with fine or penalty. OR, the expected outcome or estimated conclusion by when? I am interested in buying but I would like to know these": -0.5,
  "What do we think of the $FLY IPO - IPOs and Space especially have been hot. Recently, $VOYG gained 1x on 1st day of trading, $FIG did 3x (and even more after that). I cant help but think that a space name will do the same, but they have been unsuccessful in 4 of their 6 flights and negative earnings (similar to $VOYG tho). And they are IPOing on the back of their lunar landing": 0.2,
  "After recent jobs data, Moody's model raises recession probability to 49% - Moody's forecast model for recession, which has had zero false positives, now predicts 49% probability of recession. >Every time that particular model gets over 50 (50%) we've had a recession. And we've never had a false positive. Never has it risen above 50, and we've not gotten a recession. ([source](https://www.moodys.com/web/en/us/about/insights/podcasts/moodys-talks-inside-economics/on-an-economic-tight-rope.html)) Their chief economist, Mark Zandi, subjectively states, \"In my heart of hearts, I": -0.6,
  "Lina Khan points to Figma IPO as vindication of M&A scrutiny": 0.5,
  "Buffett's Berkshire takes $3.8 billion Kraft Heinz write-down": -0.7,
  "What are yalls thoughts on WYFI IPO? - NEW YORK, July 29, 2025 /PRNewswire/ -- **WhiteFiber, Inc. (\"WhiteFiber\" or the \"Company\")**, today announced the launch of its initial public offering of 7,812,500 ordinary shares. The initial public offering price is expected to be between $15.00 and $17.00 per share. In connection with the proposed offering": 0.5,
  "What are your favorite institutional-grade investing newsletters/reports/sources of information - Can be paid or free. I'm a big fan of Lyn Alden and Darius Dale, in addition to BCA research. I've recently wanted to sub to doomberg and a couple others, but I'm curious to see what better ones am I missing out on": 0.6,
  "MercadoLibre (MELI) Q2 Earnings Report Preview: What To Look For": 0.2,
  "What To Expect From Vertex Pharmaceuticals’s (VRTX) Q2 Earnings": 0.2,
  "Warren Buffett's stock still struggling since May peak": -0.5,
  "Axon (AXON) To Report Earnings Tomorrow: Here Is What To Expect": 0.5,
  "Berkshire Hathaway issues stern warning over Trump's tariffs as profits impacted — here's what investors need to know": -0.5,
  "AP Top Financial News at 11:35 p.m. EDT": 0.0,
  "AP Top Extended Financial Headlines at 11:35 p.m. EDT": 0.0,
  "It’s a pivotal week for earnings — and a reality check for consumers battling tariffs and high prices": -0.5,
  "Virginia’s Pension Sells Walmart Stock, Buys Carnival, Airbnb": 0.2,
  "Should You Forget Costco? Why These Unstoppable Stocks Are Better Buys": 0.2,
  "Up 33% Year to Date, Is Netflix Stock Still a Buy?": 0.5,
  "My 3 Favorite Stocks to Buy Right Now": 0.5,
  "If recession is certain, would one divest away from VGT into few individual stocks? - I got about a million dollars in VGT and I’m starting to get worried about looming recession. Would it be smart for me to move away from it into few stocks that I believe will perform well in face of economic slowdown over the next 3-5 years, such as GOOG, MSFT, and NVDA? Much appreciated.": -0.6,
  "What To Expect in Markets This Week: Earnings From Palantir, AMD, McDonald’s and More": 0.5,
  "3 Dividend Stocks to Double Up on Right Now": 0.5,
  "1 Green Flag for Dutch Bros Stock Right Now": 0.6,
  "Take-Two Interactive Stock Is Beating the Market in 2025. Could a New Game Release Next Year Propel It to Even Greater Heights?": 0.6,
  "2 Biotech Stocks That Could Soar 29% and 165% According to Wall Street's Top Analysts": 0.8,
  "The AI Boom Continues: 3 Top AI Stocks to Buy for the Rest of 2025": 0.8,
  "The blood-soaked British success story testing Labour’s mettle": 0.2,
  "An Intrinsic Calculation For Palo Alto Networks, Inc. (NASDAQ:PANW) Suggests It's 37% Undervalued": 0.8,
  "Cadence Design Systems Sees Insider Stock Selling": -0.5,
  "Starbucks Corporation's (NASDAQ:SBUX) institutional investors lost 8.0% last week but have benefitted from longer-term gains": 0.2,
  "When Should You Buy Microchip Technology Incorporated (NASDAQ:MCHP)?": 0.1,
  "What to Watch With Constellation Energy (CEG) Before Investing": 0.2,
  "Job market concerns take center stage as earnings season rolls on: What to watch this week": 0.1,
  "Waller and Bowman say waiting to cut rates threatens economy. These dissents are the first time two governors have done so since 1993. - [Source CNBC](https://www.cnbc.com/2025/08/01/fed-governors-bowman-waller-explain-their-dissents-say-waiting-to-cut-rates-threatens-economy.html) [CME FedWatch](https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html) Both Governors, Christopher Waller and Michelle Bowman, sought a 25-basis-point reduction, as maintaining the status quo poses risks to the economy. Noted tariffs have only a temporary impact on inflation. These dissents are the first time two governors have done so since 1993. Bowman (who also serves": 0.2,
  "We Like O'Reilly Automotive's (NASDAQ:ORLY) Returns And Here's How They're Trending": 0.6,
  "The Trade Desk, Inc. (NASDAQ:TTD) is largely controlled by institutional shareholders who own 72% of the company": 0.1,
  "If You Invested $10K In ASML Stock 10 Years Ago, How Much Would You Have Now?": 0.0,
  "Roper Technologies Second Quarter 2025 Earnings: EPS Beats Expectations": 0.8,
  "Linde Second Quarter 2025 Earnings: Revenues Beat Expectations, EPS Lags": 0.2,
  "Kraft Heinz (NASDAQ:KHC) Is Paying Out A Dividend Of $0.40": 0.2,
  "Why Starbucks must start delivering big-time": 0.5,
  "Trillions On The Sidelines: Could Corporate Cash Be The Key To Bitcoin's Next Big Move?": 0.5,
  "Institutional owners may ignore Fastenal Company's (NASDAQ:FAST) recent US$2.7b market cap decline as longer-term profits stay in the green": 0.5,
  "Is It Time To Consider Buying DexCom, Inc. (NASDAQ:DXCM)?": 0.5,
  "Boasting A 66% Return On Equity, Is Automatic Data Processing, Inc. (NASDAQ:ADP) A Top Quality Stock?": 0.6,
  "Starbucks Stock: Store Sales Slump, but Is a Turnaround Near?": 0.2,
  "Regeneron Pharmaceuticals Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "May AI Take Your Order, Please?": 0.0,
  "Estimating The Intrinsic Value Of Xcel Energy Inc. (NASDAQ:XEL)": 0.1,
  "Why Drug Prices for Some Big Medicines Will Remain High for a Longer Time": -0.6,
  "Atlassian Insiders Sell US$17m Of Stock, Possibly Signalling Caution": -0.5,
  "Where Will Arista Networks Be in 1 Year?": 0.0,
  "Lam Research Full Year 2025 Earnings: EPS Beats Expectations": 0.8,
  "The Best Growth Stocks I'd Buy Right Now": 0.8,
  "Atlassian (TEAM) Rovo + Vertical Ecosystem Be Its Moment? - I’m thinking about whether Atlassian’s AI-powered Rovo, tied to its vertically integrated ecosystem, could spark an “iPod moment” like Apple’s in 2003. Back then, Apple was a niche PC player, and the iPod + iTunes ecosystem made them a consumer titan. Atlassian’s in a similar spot strong with its interconnected suite (Jira, Confluence, Trello, Bitbucket) used by 83% of Fortune 500, but middle-tier against Microsoft,": 0.2,
  "Chart Industries (GTLS) Soars 15.7% on $13-Billion Merger, Impressive Earnings": 0.8,
  "Will we retroactively be declared to have already have been in a recession at this time? - The National Bureau of Economic Research (NBER) is the official arbiter of U.S. recessions. They retrospectively declared that the recession, which would become known as the \"Great Recession\", began in December 2007. Here are the BLS Non-Farm Payrolls numbers for October, November, and December of 2007, based on the final revised figures: October 2007: +103,000 jobs November 2007:": 0.0,
  "Why You Should Stop Spending $100 on Starbucks a Month and Invest in Real Estate Instead": -0.7,
  "Palantir, Advanced Micro, Walt Disney, Pfizer, ZoomInfo, and More Stocks to Watch This Week": 0.5,
  "Is Jerome Powell doing the right thing by holding rates higher for longer? - Jerome Powell absolutely knows the labor market is weakening under the surface, but he’s jawboning intentionally when he keeps saying “the labor market is strong” and the “Economy is solid.” There is no way Powell can truthfully say the labor market is strong when: Leading economic indicators continue to plummet. Quits rate is the Lowest since 2020 (shows workers don’t feel": -0.8,
  "MercadoLibre, Inc. (MELI): A Bull Case Theory": 0.5,
  "Is Figma today’s Beyond Meat IPO? - In 2019 Beyond Meat was oversubscribed, same as Figma today. Beyond Meat saw about 160% surge on day 1, Figma about 250%. Beyond Meat meant to disrupt meat with sustainability and health, Figma design with AI. Both highly valued, venture backed, private unicorns. Is this just another FOMO?": 0.5,
  "Starbucks' problems may be too big to fix": -0.8,
  "Mastercard denies pressuring game platforms, Valve tells a different story": 0.1,
  "Bitcoin vs Stocks: Which $15,000 Investment Would Make You a Billionaire?": 0.5,
  "Is UnitedHealth Once in a lifetime buy? - I've been keeping an eye on UnitedHealth Group after the dip. With the current valuation and the fact that it's a healthcare giant, it feels like one of those once in a lifetime buy, kind of like buying Apple on a temporary pullback. But I can't help and think of what happened with PayPal. Tons of people thought it was a no brainer when it dropped under": 0.5,
  "4 Genius Artificial Intelligence (AI) Stocks to Buy in August": 0.6,
  "Should You Forget Amazon? Why You Might Want to Buy This Unstoppable Growth Stock Instead": 0.5,
  "(Item 2.02) . Results of Operation and Financial Condition. On August 4, 2025, ON Semiconductor Corporation announced in a news release its financial performance for the second quarter ended July 4, 2025 and other related material information (the “ Earnings Release ”). A copy of the Earnings Release is attached hereto as Exhibit 99.1 and incorporated herein by reference. The information in\n\n(Item 2.02) of this Current Report on Form 8-K, including Exhibit 99.1, is being furnished under\n\n(Item 2.02) and shall not be deemed to be “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “ Exchange Act ”), or otherwise subject to liability under that section, nor shall such information be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, regardless of any general incorporation language in such filing, except as shall be expressly set forth": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On August 4, 2025, IDEXX Laboratories, Inc. (the “Company”) announced its financial results for the quarter ended June 30, 2025. The full text of the press release issued in connection with the announcement is furnished as Exhibit 99.1 to this Current Report on Form 8-K. In accordance with general instructions to Form 8-K, the information in this Form 8-K and the Exhibit 99.1 attached hereto is being furnished under\n\n(Item 2.02) and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934 (the “Exchange Act”) or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933 or the Exchange Act, except as expressly set forth by specific reference in such a filing.\n\n(Item 2.02) shall be deemed to be furnished, and not filed. Exhibit No. Description of Exhibit 99.1 Press Release entitled “IDEXX Laboratories Announces Second Quarter Results,” issued by the Company on August 4, 2025. 104 Cover Page Interactive Data File (embedded within the Inline XBRL document) 1": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On August 4, 2025, the Registrant issued a press release, a copy of which is attached hereto as Exhibit 99.1 and is incorporated herein by reference.": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. On August 4, 2025, Diamondback Energy, Inc. (the “Company”) issued a press release announcing financial and operating results for the second quarter ended June 30, 2025, including the second quarter 2025 base cash dividend (the “earnings release”). A copy of the earnings release is furnished to the Securities and Exchange Commission (the “SEC”) as Exhibit 99.1 to this Current Report on Form 8-K. The Company also issued a": 0.0,
  "(Item 8.01) . Other Events. On August 1, 2025, Xcel Energy Inc. (“Xcel Energy”) entered into an equity distribution agreement (the “Equity Distribution Agreement”) with (i) Barclays Capital Inc., BMO Capital Markets Corp., BNP Paribas Securities Corp., BNY Mellon Capital Markets, LLC, BofA Securities, Inc., CIBC World Markets Corp., Citigroup Global Markets Inc., Goldman Sachs & Co. LLC, Huntington Securities, Inc., Jefferies LLC, J.P. Morgan Securities LLC, KeyBanc Capital Markets Inc., Mizuho Securities USA LLC, Morgan Stanley": 0.1,
  "(Item 2.02) - Results of Operations and Financial Condition On August 4, 2025, Palantir Technologies Inc. (including its subsidiaries, “Palantir,” or the “Company”) issued a press release announcing its financial results for the fiscal quarter ended June 30, 2025. A copy of the press release is attached as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated by reference herein. The information furnished under this\n\n(Item 2.02) and in the accompanying Exhibit 99.1 shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that section, nor incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, regardless of any general incorporation language in such filing, unless expressly incorporated by specific reference in such filing.": 0.0,
  "(Item 8.01) Other Events. ATM Updates On August 4, 2025, MicroStrategy Incorporated d/b/a Strategy (“Strategy” or the “Company”) announced updates with respect to its at-the-market offering programs: ATM Program Summary During Period July 28, 2025 to August 3, 2025 As of August 3, 2025 Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) Common ATM - - - $17,042.7 Securities Offered: Class A Common Stock, $0.001 par": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition On August 4, 2025, Axon Enterprise, Inc. (the “Company”) issued a shareholder letter regarding the Company’s financial results for the quarter ended June 30, 2025. The full text of the letter is attached hereto as Exhibit 99.1 and is incorporated herein by reference. The information pursuant to\n\n(Item 2.02) in this report on Form 8-K is being furnished and shall not be deemed filed for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that section, and such information shall not be deemed incorporated by reference into any of the Company’s filings under the Securities Act of 1933, as amended (the “Securities Act”), or the Exchange Act, except as expressly": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On August 4, 2025, Vertex Pharmaceuticals Incorporated (the \"Company\") issued a press release in which it reported its consolidated financial results for the three and six months ended June 30, 2025. A copy of that press release is attached to this Current Report on Form 8-K as Exhibit 99.1 and is incorporated herein by reference. The information set forth in Exhibit 99.1 shall not be deemed to be\n\n(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On August 4, 2025, the Company announced the retirement of David Altshuler, Executive Vice President and Chief Scientific Officer, effective August 1, 2026.": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (e) As previously disclosed in its quarterly report on Form 10-Q for the three months ended March 31, 2025, the board of directors (the “ Board ”) of Tesla, Inc., a Texas corporation (the “ Company ”) established a special committee (the “ Special Committee ”) to consider certain compensation matters involving Elon Musk, the Company’s Chief": 0.1,
  "MOAT, VOO or picking on my own - So after 2.5 years of trying different methods (fundamental analysis, intrinsic value, technical analysis), I give up trying because I can’t beat the market. After reading “The Buffet Way”, I decided to bet on wide moat, exemplary managed, undervalued companies. I am in between 4 methods: 1- VanEck MOAT ETF: They choose wide moat, undervalued stocks evaluated by Morningstar updated every quarter. MER 0.46%, it is beating": 0.6,
  "American Consumers Are Getting Thrifty Again": 0.6,
  "3 Stocks That Could Be Easy Wealth Builders": 0.5,
  "Marriott (MAR) Q2 Earnings Report Preview: What To Look For": 0.2,
  "Earnings To Watch: Amgen (AMGN) Reports Q2 Results Tomorrow": 0.5,
  "Intel (INTC) Plans to Separate Networking and Communications Unit Into Stand-alone Company, Highlights Reuters": 0.5,
  "The AI job cuts are accelerating": -0.6,
  "Taiwan cultivates young overseas chip talent with summer camps, university courses": 0.5,
  "3 Volatile Stocks with Questionable Fundamentals": -0.8,
  "1 Growth Stock to Stash and 2 That Underwhelm": -0.5,
  "1 Small-Cap Stock with Competitive Advantages and 2 Facing Headwinds": 0.2,
  "2 Volatile Stocks to Target This Week and 1 We Question": 0.2,
  "3 Market-Beating Stocks with Promising Prospects": 0.5,
  "3 Low-Volatility Stocks That Fall Short": -0.6,
  "1 Unpopular Stock That Should Get More Attention and 2 We Question": 0.5,
  "3 Market-Beating Stocks to Consider Right Now": 0.5,
  "Dow Jones Futures: Market Tries To Steady After Sell-Off; Palantir, AMD Earnings Ahead": 0.5,
  "Bitcoin Still on Track for $140K This Year, But 2026 Will Be Painful: Elliott Wave Expert": 0.2,
  "The Westin Singapore Launches Exclusive \"Move Well Marathon Package\" for SCSM 2025 Participants": 0.6,
  "2025 CrowdStrike Threat Hunting Report: Adversaries Weaponize and Target AI at Scale": 0.2,
  "2 Growth Stocks That Could Skyrocket in 2025 and Beyond": 0.8,
  "QUALCOMM Stock Outlook: Is Wall Street Bullish or Bearish?": 0.5,
  "Do Wall Street Analysts Like Amgen Stock?": 0.2,
  "Wow markets don’t seem like they will open Monday red - Given last Friday’s happenings, I thought markets would immediately trade on Monday in the red starting with overnight trading. Afterall, the weak jobs report - tgt with downward revisions for past two months - were serious red flags for the economy’s resilience. But seems like markets are taking that as positive - that it will reinforce rate cuts likelihood and be a leg up": 0.6,
  "Building Automation System Market Set to Double by 2030 Amid Rising IoT Integration": 0.6,
  "McDonald’s Earnings, New Tariff Deadline, PMIs: What to Watch This Week": 0.2,
  "HAZMAT Suits Market Forecast Report 2025-2030, with Profiles of 3M, DuPont de Nemours, Honeywell, Ansell, Dragerwerk, Kimberly-Clark, Lakeland Industries, Alpha Pro Tech, Halyard Health, and Kappler": 0.2,
  "Could Shopify Help You Become a Millionaire?": 0.5,
  "The Zacks Analyst Blog Highlights Adobe, Disney, Intuit, Rollins and Johnson & Johnson": 0.5,
  "Cash Windfall From Trump’s Tax Law Is Starting to Show Up at Big Companies": 0.5,
  "Analyst bullish on Palantir stock before earnings - Wedbush reiterated an outperform rating and a price target of $160 for Palantir stock ahead of its earnings, according to a recent research note. Analysts led by Daniel Ives said the recent deal with the U.S. Army represents an additional tailwind, which places Palantir in the sweet spot to benefit from \"a tidal wave of federal spending on AI.\" \"We continue to believe that Palantir’s unique AI": 0.8,
  "Tesla's July China-made EV sales fall 8.4% - Tesla's (TSLA.O), opens new tab sales of China-made electric vehicles in July fell 8.4% from a year earlier, reversing a mild increase in June, in the face of rising competition from rivals offering lower-priced new models. Deliveries of Tesla's China-made Model 3 and Model Y vehicles, including exports to Europe and other markets, reached 67,886 units last month, down 5.2% from June, data from the China Passenger": -0.6,
  "The Zacks Analyst Blog Highlights Interactive Brokers, Visa, Robinhood Markets and PayPal Holdings": 0.5,
  "Mach42™ Unveils Breakthrough AI Solution for Analog Circuit Analysis": 0.6,
  "These 3 stocks are 'great buying opportunities,' CIO says": 0.8,
  "Five Wisconsin businesses disclosed layoffs in July affecting 170 workers": -0.5,
  "The Zacks Analyst Blog Highlights PayPal, Visa and Mastercard": 0.5,
  "Stocks Set to Open Higher as Investors Bet on Fed Rate Cuts": 0.8,
  "Since BLS Reports are about to lose relevance/credibility what other reports are you watching? ADP maybe? - Let’s be real. If Trump wins and drops one of his people into the BLS, the jobs report is toast. Fully cooked. We’re talking “everything is fine” vibes while the economy bleeds out. This isn’t tinfoil hat territory either. It’s already kind of happening. Look at May 2025: the BLS initially reported 139,000 jobs added. Two months later,": -0.8,
  "Got $3,000? 3 Artificial Intelligence (AI) Stocks to Buy and Hold for the Long Term": 0.5,
  "Underground Pipe and Cable Locator Global Market Insights 2025, with Key Player Profiles for SPX, Vivax-Metrotech, Leica, Subsite, IPEK, IBAK, System Studies, Agilent, Shawcor, Roper, and Ridgid": 0.2,
  "Can Summer Box Office Rebound Take Warner Bros. ‘Up, Up and Away’?": 0.5,
  "Aeluma Appoints Industry Veteran Christopher Stewart as Chief Financial Officer": 0.6,
  "Lilly’s Push to $1 Trillion Derailed by Trade Risks and Obesity Drug Speedbumps": -0.5,
  "Option Volatility And Earnings Report For Aug 4 - 8": 0.0,
  "Adobe Inc.'s (NASDAQ:ADBE) Stock Has Been Sliding But Fundamentals Look Strong: Is The Market Wrong?": 0.5,
  "Axon Enterprise, Inc.'s (NASDAQ:AXON) Stock's On An Uptrend: Are Strong Financials Guiding The Market?": 0.5,
  "Market Chatter: Union Pacific-Norfolk Southern Deal Faces Pushback From Rail Customers": -0.5,
  "Silicon Photonics Company Evaluation Report 2025 | Cisco, Intel, and Lumentum Lead with High-Speed Interconnects, Strategic Acquisitions, and Global Expansion": 0.8,
  "AI is helping hackers automate and customize cyberattacks": -0.8,
  "Central Bank Outlook Lifts Wall Street Pre-Bell; Asia, Europe Up": 0.5,
  "Warner Bros. Discovery Signs New Post-Split Contracts for Perrette and Campbell": 0.5,
  "Berkshire's Kraft Heinz Impairment May Pressure Earnings": -0.5,
  "5 Things to Know Before the Stock Market Opens": 0.0,
  "Manufacturing issues at Novo facility disrupt Regeneron drug review": -0.5,
  "This Week In AI Chips - CAST Unveils MCP Server Transforming Enterprise AI Solutions": 0.6,
  "Travel guru The Points Guy wants to revamp the luxury travel points system with Journey": 0.5,
  "GILD Likely to Beat on Q2 Earnings: Buy, Sell or Hold the Stock?": 0.2,
  "Broadcom Inc. to Announce Third Quarter Fiscal Year 2025 Financial Results on Thursday, September 4, 2025": 0.0,
  "Armis Rapidly Surpasses $300M ARR as Demand For Cyber Exposure Management and Cyber-Physical Systems Security Soars": 0.8,
  "Autodesk extends invitation to join financial results conference call": 0.2,
  "Chainlink Launches Data Streams for U.S. Equities and ETFs To Power Secure Tokenized RWA Markets Onchain": 0.6,
  "Cisco Schedules Conference Call for Q4 Fiscal Year 2025 Financial Results": 0.0,
  "UP-NS merger puts intermodal giants on the wrong side of the map": -0.6,
  "Monster Beverage (NASDAQ:MNST) Seems To Use Debt Rather Sparingly": 0.5,
  "Tariff latest, Rate cuts and big earnings: Three Things": 0.5,
  "onsemi (NASDAQ:ON) Q2: Beats On Revenue But Stock Drops": -0.5,
  "Cisco Systems Stock: Is Wall Street Bullish or Bearish?": 0.5,
  "Here’s Why Baron Real Estate Fund Bought Airbnb (ABNB)": 0.2,
  "Basically for ACHR to run, everything has to line up - As someone who’s been holding ACHR through the ups and downs, this week’s 14% drop didn’t shake me. Sentiment across eVTOLs is clearly cooling off after the hype wave earlier this year & Archer’s still pre revenue, which means every move is amplified. No news from the company, just light volume & some options hedging JPMorgan raised their price target from $9 to $10": 0.2,
  "A Macy’s private label gets a ‘Palm Royale’ collab": 0.2,
  "MercadoLibre Q2 Preview: Will Fintech Gains Offset FX Pain?": 0.2,
  "Tesla shareholders are rejoicing as it is more likely to pay Elon $29 Billion instead of $50 Billion - [Reuters/Yahoo](https://finance.yahoo.com/news/tesla-approves-96-million-share-102426782.html) Tesla has granted 96 million new shares worth about $29 billion to CEO Elon Musk. \"The interim award shares vest only if Musk remains in a key executive role through 2027. They also come with a five-year holding period except to cover tax payments or the purchase price.\" \"It added that if the Delaware courts": 0.6,
  "IDEXX Laboratories Stock Jumps as Pet Health Care Firm Lifts Full-Year Outlook": 0.8,
  "Workday to Announce Fiscal 2026 Second Quarter Financial Results on August 21, 2025": 0.0,
  "Workday to Hold Annual Financial Analyst Day on September 16, 2025": 0.0,
  "Roper Technologies to present at Oppenheimer Technology Conference": 0.5,
  "AI Adoption May Reprice Adobe, Amazon, Johnson Controls": 0.2,
  "ON Semiconductor Results Show Stabilizing End Markets": 0.5,
  "IDEXX Laboratories Raises Full-Year Outlook Following Second-Quarter Beat": 0.8,
  "Meta Platforms and Elevance Health have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Is AAPL Stock a Buy Now as Tim Cook Vows to Win in the AI Race?": 0.5,
  "Netflix (NFLX) Surged as Multiple Tailwinds Align": 0.8,
  "Are Wall Street Analysts Predicting Intel Stock Will Climb or Sink?": 0.2,
  "Warner Bros. Discovery Stock Outlook: Is Wall Street Bullish or Bearish?": 0.1,
  "TTM Technologies Beats Q2 Earnings Estimates, Shares Fall on Weak View": -0.5,
  "AppOmni Innovations Combat Rising Security Risks From SaaS and AI": 0.5,
  "Constellation Accepting Applications for 2025 Energy to Educate Grants": 0.5,
  "SquareX Researchers Reaffirms their Browser Security Thought Leadership with Multiple Vulnerability Disclosures in Key Black Hat and DEF CON 33 Talks": 0.5,
  "AIM ImmunoTech Builds Positive Momentum and Reiterates Focus on Driving Ampligen® Clinical Development Toward Pancreatic Cancer Approval": 0.8,
  "Investors Heavily Search Comcast Corporation (CMCSA): Here is What You Need to Know": 0.5,
  "Is Most-Watched Stock Palo Alto Networks, Inc. (PANW) Worth Betting on Now?": 0.2,
  "Here is What to Know Beyond Why Netflix, Inc. (NFLX) is a Trending Stock": 0.2,
  "These 2 Medical Stocks Could Beat Earnings: Why They Should Be on Your Radar": 0.5,
  "QUALCOMM Incorporated (QCOM) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Micron Technology, Inc. (MU) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Adobe Inc. (ADBE) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Should You Think About Buying Honeywell International Inc. (NASDAQ:HON) Now?": 0.2,
  "KLA Full Year 2025 Earnings: EPS Beats Expectations": 0.8,
  "QUALCOMM Third Quarter 2025 Earnings: EPS Beats Expectations": 0.8,
  "Marvell Technology, Inc. Announces Conference Call to Review Second Quarter of Fiscal Year 2026 Financial Results": 0.0,
  "Estimating The Fair Value Of Paychex, Inc. (NASDAQ:PAYX)": 0.5,
  "ON Semiconductor Corp. (ON) Q2 Earnings Miss Estimates": -0.7,
  "Cognizant (CTSH) International Revenue Performance Explored": 0.0,
  "Countdown to CDW (CDW) Q2 Earnings: A Look at Estimates Beyond Revenue and EPS": 0.2,
  "Apple (AAPL) International Revenue in Focus: Trends and Expectations": 0.5,
  "Don't Overlook Mondelez (MDLZ) International Revenue Trends While Assessing the Stock": 0.2,
  "Countdown to Atlassian (TEAM) Q4 Earnings: Wall Street Forecasts for Key Metrics": 0.2,
  "Monster Beverage (MNST) Q2 Earnings on the Horizon: Analysts' Insights on Key Performance Measures": 0.2,
  "Seeking Clues to Gilead (GILD) Q2 Earnings? A Peek Into Wall Street Projections for Key Metrics": 0.5,
  "Countdown to Warner Bros. Discovery (WBD) Q2 Earnings: A Look at Estimates Beyond Revenue and EPS": 0.2,
  "Unveiling Take-Two (TTWO) Q1 Outlook: Wall Street Estimates for Key Metrics": 0.0,
  "What Analyst Projections for Key Metrics Reveal About Microchip Tech (MCHP) Q1 Earnings": 0.2,
  "North Korean spies posing as remote workers have infiltrated hundreds of companies, says CrowdStrike": -0.7,
  "I&M, Google Filing to Support Reliability Through Demand Response Structure": 0.5,
  "SES Space & Defense Awarded Sustainment Tactical Network Contract to Support U.S. Army": 0.6,
  "Market gains, Trump eyes new BLS & Fed officials, Musk: 3 Things": 0.5,
  "PepsiCo: A Great Long-Term Value Play": 0.8,
  "Is Netflix Stock a Buy, Sell, or Hold in 2025?": 0.0,
  "Why the Opendoor Stock Surge is a Red Flag for Investors: Meme Stocks and Market Euphoria": -0.8,
  "Everspin Appoints Sean Dougherty Vice President of Sales": 0.5,
  "New to Investing? This 1 Computer and Technology Stock Could Be the Perfect Starting Point": 0.6,
  "ON Semiconductor Corp. (ON) Reports Q2 Earnings: What Key Metrics Have to Say": 0.5,
  "Idexx (IDXX) Q2 Earnings: How Key Metrics Compare to Wall Street Estimates": 0.5,
  "Tesla board approves near $30 billion alternative pay deal for Musk": 0.8,
  "Navigating the Robotaxi Revolution: Uber, Lyft, EPS Preview": 0.2,
  "The Nashville area is one of the top metro areas college grads are flocking to. Here's why": 0.6,
  "Are You a Value Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Is Applied Materials (AMAT) Stock Outpacing Its Computer and Technology Peers This Year?": 0.5,
  "Berkshire Earnings Key Takeaways: Strong Profit, No Buybacks, and a Falling Stock": -0.5,
  "Warren Buffett's Berkshire Hathaway Skids As Q2 Operating Profit Falls 4%": -0.5,
  "Why This 1 Momentum Stock Could Be a Great Addition to Your Portfolio": 0.8,
  "ON Semiconductor Faces Pricing Pressures, But CEO Sees Market Stabilization Ahead": 0.5,
  "r/Stocks Daily Discussion Monday - Aug 04, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.2,
  "IDEXX Stock Up on Q2 Earnings & Revenue Beat, Margins Expand": 0.8,
  "Trump to Name New Fed Governor, BLS Head in Coming Days": 0.1,
  "Form 8.3 - Qualcomm Incorporated": 0.0,
  "Micron Technology, Inc.'s (NASDAQ:MU) institutional investors lost 5.7% last week but have benefitted from longer-term gains": 0.5,
  "Even though NXP Semiconductors (NASDAQ:NXPI) has lost US$4.7b market cap in last 7 days, shareholders are still up 88% over 5 years": 0.5,
  "Strategy Incorporated (MSTR) Raises $2.5B in IPO, Acquires 21,021 Bitcoins": 0.5,
  "Bentley Systems to Report Q2 Earnings: What's in Store for the Stock?": 0.0,
  "Nvidia Stock Climbs. What Comes Next for the AI Trade.": 0.5,
  "Datadog Stock Before Q2 Earnings: Buy Now or Wait for Results?": 0.2,
  "Is Costco Stock Still the Safest Bet? Data Backs the Defensive Case": 0.5,
  "Strategy will no longer issue MSTR at below 2.5x mNAV": -0.2,
  "Crypto Treasuries Expand as Public Companies Make Bold Monday Moves": 0.5,
  "BC-Most Active Stocks": 0.0,
  "For a Few CEOs, Pay Keeps Growing—by the Billions": 0.5,
  "Xcel Energy Second Quarter 2025 Earnings: Beats Expectations": 0.8,
  "CDW Set to Report Q2 Earnings: Is a Beat in the Cards?": 0.5,
  "Constellation Energy (CEG) to Invest Billions in Pennsylvania": 0.8,
  "Ford names commercial business unit president": 0.1,
  "Former Coupa CPO Michael Van Keulen Joins Flywl as Strategic Advisor": 0.5,
  "Amazon's slowing cloud growth could continue to drag on its stock": -0.6,
  "CARDINALS AND SPECTRUM ANNOUNCE MARKETING PARTNERSHIP": 0.5,
  "ComEd, Metropolitan Mayors Caucus Announce 17 Northern Illinois Communities Complete Training to Become \"EV Ready\"": 0.5,
  "Broadvoice | GoContact Names New Chief Product Officer": 0.2,
  "ON Semiconductor's Q2 Earnings Lag Estimates, Revenues Fall Y/Y": -0.6,
  "Onsemi posts quarterly revenue drop, sees dull third-quarter profit on market uncertainty": -0.7,
  "“Libertarian” FCC Commissioner Was Believed to Be Uncomfortable with Paramount Deal: Exclusive": -0.5,
  "SNIA Announces Storage.AI": 0.2,
  "Wells Fargo cuts Lululemon target on margin pressure": -0.5,
  "4 Auto Stocks Likely to Outperform Q2 Earnings Estimates": 0.5,
  "Should You Buy, Sell, or Hold SkyWater Stock Before Q2 Earnings?": 0.0,
  "ON Semi Earnings Met Expectations. The Stock Is Falling, Anyway.": -0.5,
  "Amazon overhauls Wondery podcast studio, cuts 110 jobs": -0.6,
  "U.S. News & World Report Names Cintas One of the Best Companies to Work For 2025-2026": 0.8,
  "Will These 5 Pharma, Biotech Bigwigs Surpass Q2 Earnings Forecasts?": 0.5,
  "Novo Nordisk Before Q2 Earnings: How Should Investors Play the Stock?": 0.2,
  "Buy, Sell or Hold Astera Labs Stock? Key Tips Ahead of Q2 Earnings": 0.5,
  "Top Stock Movers Now: IDEXX, Wayfair, Berkshire Hathaway, and More": 0.5,
  "Top Midday Stories: Berkshire Hathaway Earnings, Revenue Fall; Tesla Grants CEO Musk 96 Million New Shares": -0.2,
  "What To Expect from AMD Q2 Earnings?": 0.0,
  "What Makes GE HealthCare (GEHC) a New Strong Buy Stock": 0.8,
  "Fastenal (FAST) Upgraded to Buy: Here's Why": 0.8,
  "Former Commerce Secretary Wilbur Ross weighs in on Trump firing of BLS commissioner: Opening Bid top takeaway": 0.1,
  "Why Shopify Stock Is Rising Today": 0.5,
  "Is MRVL Stock a Buy, Sell or Hold at a P/E Multiple of 7.15X?": 0.0,
  "Will AMD Stock Climb on Strong Data Center Revenues in Q2 Earnings?": 0.5,
  "Palantir's Army deal, ON Semi earnings, Opendoor jumps": 0.5,
  "AT&T Surges 46.8% in a Year: Should T Stock Be in Your Portfolio?": 0.6,
  "DoorDash Set to Report Q2 Earnings: What's in Store for the Stock?": 0.0,
  "Are Wall Street Analysts Predicting Meta Platforms Stock Will Climb or Sink?": 0.1,
  "Why Alphabet Stock Popped on Monday": 0.5,
  "Should You Buy Take-Two Interactive Software (TTWO) Stock Before Aug. 7? Here's What History Says.": 0.1,
  "Fortinet Stock Before Q2 Earnings: Buy Now or Wait for Results?": 0.2,
  "US Equity Indexes Rebound in Midday Trading": 0.5,
  "DET-IX Enhances Infrastructure with Arista 7060X5 Series Switches": 0.0,
  "The PermaBulls have been right all along, and perhaps my brain is the smoothest of them all. - I have been firmly in the bear camp for 1/2 decade. My post history will outline many of the reasons why, but I think I've finally had to come to accept that this market will never see the likes of a massive, dot com, global financial crisis style correction ever again. A global pandemic that shut the": 0.2,
  "Should You Buy, Sell or Hold Shopify Stock Before Q2 Earnings?": 0.2,
  "Why The Trade Desk (TTD) Stock Is Trading Up Today": 0.5,
  "Why onsemi (ON) Shares Are Sliding Today": -0.5,
  "Looking for a Growth Stock? 3 Reasons Why Microsoft (MSFT) is a Solid Choice": 0.8,
  "JPMorgan drops 3-word verdict on Amazon stock post-earnings": 0.1,
  "Screenshots I took of comments from investing subreddits April 2025. Market is up ~27% since - https://imgur.com/a/j3vlh6q Ironically, commenters should have listened to the quote they were attempting to mock - be greedy when others are fearful. When the tariff fears were at their peak in April and market was down 16% YTD, I couldn’t believe the comments I was seeing all over reddit. This is just a small sampling of pure panic comments that": 0.2,
  "Coinbase stock hit with analyst downgrade citing 'limited support' for current valuation": -0.6,
  "G2 and AWS Expand Partnership to Create Frictionless Software Buying Experience with Generative AI-Powered Insights": 0.5,
  "Rise in connected medical devices and AI prompts network architecture evolution": 0.5,
  "Marriott Q2: Gaming, lodging, & leisure earnings preview": 0.2,
  "Berkshire Hathaway's shares fall after $3.8 billion write-down, operating profit weakness": -0.7,
  "Figma sheds $11 billion in market value days after blockbuster IPO": -0.8,
  "Amazon denies report it’s shutting down Wondery podcast studio": 0.2,
  "‘China’s Google’ to launch self-driving cars in UK": 0.5,
  "Datadog (DDOG) In Talks To Acquire Israeli Cybersecurity Firm Upwind Security": 0.5,
  "GlobalFoundries (GFS) Announces US$16 Billion Semiconductor Manufacturing Expansion": 0.8,
  "FIG crash (should I pull or stay) - I’m new to investing and for some reason decided it would be good to go in with most on my money when FIG was at it’s near peak 127 and since then only crashed to 95, causing me to lost a big big chunk of my account, so I’m wondering if I should pull out and take the loss or should I stay incase it goes back": -0.8,
  "Airbnb Set to Report Q2 Earnings: What's in the Cards for the Stock?": 0.2,
  "MicroStrategy Stock Rises After Bitcoin Purchase. Saylor Doubles Down on Treasury Approach.": 0.8,
  "S&P 500 Companies' Earnings Growth Largely Steady as Revenue Expansion Accelerates, Oppenheimer Says": 0.6,
  "AppLovin Stock Before Q2 Earnings: To Buy or Not to Buy?": 0.2,
  "Biogen Inc. (BIIB): A Bull Case Theory": 0.5,
  "Joint Stock Company Kaspi.kz (KSPI): A Bull Case Theory": 0.5,
  "Blockchain-Based Lender Figure Files Confidentially for US IPO": 0.5,
  "US Equity Indexes Rebound, Treasury Yields Drop as Bets for September Fed Rate-Cut Continue to Surge": 0.6,
  "Sector Update: Health Care Stocks Advance Monday Afternoon": 0.5,
  "Diamondback CEO: US Shale Oil Remains Stunted by ‘Macro Uncertainty’": -0.5,
  "Palantir is set to report second quarter earnings after announcing $10 billion US Army deal": 0.5,
  "3 Stocks to Watch in August: McDonald’s, Walmart, and Nvidia": 0.5,
  "META: Liquidity, Growth, and AI Fuel Institutional Appetite": 0.5,
  "PayPal Maintains its Huge FCF Guidance Despite a Q2 Drop - Is PYPL Stock Too Cheap?": 0.5,
  "Why Nvidia Is the Biggest Risk to the Stock Market—Not Tariffs": 0.1,
  "Coinbase Earnings Disappointed. Wall Street Is Split on the Stock.": -0.5,
  "Legendary investor Vinod Khosla advises Gen Z to invest in this one skill because ChatGPT can teach you everything else": 0.5,
  "Unity, Domo, Five9, Health Catalyst, and Shopify Shares Skyrocket, What You Need To Know": 0.5,
  "Bill.com, PagerDuty, Semrush, PubMatic, and MicroStrategy Stocks Trade Up, What You Need To Know": 0.5,
  "Ross Stores, Urban Outfitters, Zumiez, Camping World, and Kohl's Stocks Trade Up, What You Need To Know": 0.5,
  "HireRight Appoints Jim Desmond as Chief Information Security Officer": 0.5,
  "PrideStaff Launches New Fort Worth (West) Office to Strengthen Workforce Solutions in North Texas": 0.5,
  "Chipmaker Onsemi's CEO Warns of 'Cautious' Customer Behavior. The Stock Is Falling": -0.6,
  "Gilead Sciences Reports Earnings Thursday. Can The Highly Ranked Drugmaker Beat Its 237% Profit Surge Last Quarter?": 0.5,
  "Palantir’s Ultra-Expensive Valuation Sparks Worry Into Results": -0.5,
  "‘Cannot do business in the state of California’: Gas prices could hit $8/gallon as two refineries shut down": -0.8,
  "Alphabet Sells All Its CrowdStrike Stock": -0.5,
  "Apple CEO Tells Staff AI 'Ours to Grab'": 0.5,
  "Nvidia Stock Climb Ahead of AI Earnings Wave as Vast Data Deal Brews": 0.6,
  "ATD Research: AI Tools Are Benefitting Instructional Designers": 0.6,
  "Amazon to Cut Wondery Staff, Regorganize Audio Business": -0.5,
  "AMD to report Q2 earnings as Wall Street looks to AI, PC sales growth": 0.5,
  "INTC Stock Price Prediction: Where Intel Could Be by 2025, 2026, and 2030": 0.5,
  "COST Stock Price Prediction: Where Costco Could Be by 2025, 2026, and 2030": 0.5,
  "NVDA Stock Price Prediction: Where Nvidia Could Be by 2025, 2026, 2030": 0.5,
  "ABNB Stock Price Prediction: Where Airbnb Could Be by 2025, 2026, and 2030": 0.5,
  "Equity Markets Rise Intraday Following Friday's Decline": 0.5,
  "Bitcoin Bounces, Ethereum and XRP Flash Strong Signals: Analysis": 0.6,
  "Buildkite Names Software Industry Leader Kevin Gounden as CEO to Accelerate AI-Enabled Software Delivery": 0.6,
  "Watch These 3 \"Mag 7\" Stocks Showing Positive Momentum": 1.0,
  "Ironclad Taps Former Google, Snowflake, Docusign, Skadden Executives for Key Leadership Roles": 0.6,
  "NVIDIA & 2 Other Profitable Stocks to Retain in August": 0.5,
  "This is Your Browser On AI. Any Questions?": 0.2,
  "Top Research Reports for NextEra Energy, Applied Materials & Petrobras": 0.5,
  "Don't Trust Cloud Utilization, Says Todd Smith of TAHO": -0.5,
  "Google says its AI-based bug hunter found 20 security vulnerabilities": 0.5,
  "Nat-Gas Prices Tumble on Higher US Nat-Gas Production": -0.7,
  "AMD earnings on deck: Have investors been 'overenthusiastic'?": -0.5,
  "Symbotic Inc. (SYM): A Bull Case Theory": 0.5,
  "Tesla Offers Musk $30 Billion to Stay--With Strings Attached": 0.2,
  "Equity Markets Rise Even After Decline in June Factory Orders": 0.2,
  "Why Meta (META) Stock Is Up Today": 0.5,
  "Why Microsoft (MSFT) Stock Is Trading Up Today": 0.5,
  "Buy AMD Stock for New Peaks as Q2 Earnings Approach?": 0.6,
  "U.S. Natural Gas Futures Settle Lower": -0.5,
  "Sector Update: Consumer Stocks Higher Late Afternoon": 0.5,
  "Tom Lee's BitMine Builds $3 Billion Ethereum Stash, Now Third Largest Public Crypto Treasury": 0.8,
  "Why BitMine—Sort of Like Strategy for Ether—Is Hot With Investors": 0.6,
  "Palantir Explodes 525%--CTO Becomes Billionaire, Insiders Dump Billions": -0.7,
  "Apple Stock: Time To Buy Or Sell? What Investors Need To Know.": 0.5,
  "Stock market today: Dow jumps 580 points, S&P 500, Nasdaq have best day since May as Wall Street bounces back": 0.8,
  "Vertex Announces Results from Phase 2 Study of VX-993 for the Treatment of Acute Pain": 0.5,
  "Axon reports Q2 2025 revenue of $669 million, up 33% year over year": 0.8,
  "Vertex Reports Second Quarter 2025 Financial Results": 0.0,
  "Diamondback Energy, Inc. Announces Second Quarter 2025 Financial and Operating Results": 0.5,
  "Viper Energy, Inc., a Subsidiary of Diamondback Energy, Inc., Reports Second Quarter 2025 Financial and Operating Results": 0.5,
  "Letter to Stockholders Issued by Diamondback Energy, Inc": 0.0,
  "Citi Bullish on Semis Despite Slump. This Stock Is the Firm’s Top Pick.": 0.8,
  "Weave Names Abhi Sharma as Chief Technology Officer": 0.5,
  "MercadoLibre Inc., Reports Second Quarter 2025 Financial Results": 0.0,
  "Acadia Pharmaceuticals Appoints Scott Cenci as Chief Information and Data Officer": 0.5,
  "Data Center Spending Strength Bodes Well For Nvidia Stock": 0.8,
  "The Kraft Heinz Company (KHC): A Bull Case Theory": 0.5,
  "How Idexx Laboratories Is Riding The 'Puppy Boom' To New Highs": 0.8,
  "lululemon athletica inc. (LULU): A Bull Case Theory": 0.5,
  "Palantir stock surges after company reports first billion-dollar quarter": 0.8,
  "Why AI Stock Broadcom Was Rising on Monday": 0.2,
  "Palantir tops $1 billion in revenue for the first time, boosts guidance - Palantir topped Wall Street’s estimates Monday, surpassing $1 billion in quarterly revenue for the first time, and hiking its full-year guidance. Here’s how the company did versus LSEG estimates: Earnings per share: 16 cents adj. vs. 14 cents expected Revenue: $1.00 billion vs. $940 million expected The artificial intelligence software provider’s revenues grew 48% during the period. Analysts hadn’t expected the $1": 0.8,
  "Axon: Q2 Earnings Snapshot": 0.0,
  "MercadoLibre misses profit estimates as Brazil free-shipping boost hurts margins": -0.5,
  "US Equity Markets End Higher After EU Postpones Planned Tariffs on US Goods": 0.8,
  "CRISPR Therapeutics Provides Business Update and Reports Second Quarter 2025 Financial Results": 0.2,
  "Diamondback: Q2 Earnings Snapshot": 0.0,
  "LINK Rebounds 4% as Chainlink Roll Outs Data Streams for U.S. Equities and ETFs": 0.8,
  "Vertex: Q2 Earnings Snapshot": 0.0,
  "These Stocks Moved the Most Today: Palantir, Tesla, Berkshire Hathaway, ON Semiconductor, Joby, D-Wave, and More": 0.5,
  "Tesla Board Approves $30 Billion Award For Elon Musk At 2018 Prices": 0.5,
  "Figma’s Pursuit of Long-Term Backers Kept IPO Price in Check": 0.5,
  "Vertex Pharmaceuticals’s (NASDAQ:VRTX) Q2 Sales Beat Estimates But Stock Drops 13.5%": -0.5,
  "Nvidia Stock: Time To Buy Or Sell? What Investors Need To Know.": 0.0,
  "Palantir Earnings Top As Nvidia, Broadcom Shake Off Trump Tariffs": 0.5,
  "Palantir (NASDAQ:PLTR) Beats Expectations in Strong Q2, Guides for Strong Full-Year Sales": 0.8,
  "US stocks rebound: Nasdaq soars, driven by Nvidia record high": 0.8,
  "Darren and Mike Host Sold-Out “iReboot” Convention with Over 2,000 Entrepreneurs in Attendance": 0.8,
  "Onco360® Has Been Selected as a Specialty Pharmacy Partner for LYNOZYFIC™ (linvoseltamab-gcpt)": 0.5,
  "Cellectis Reports Second Quarter 2025 Financial Results & Business Updates": 0.0,
  "Mercado Libre Delivers Another Strong Performance in Q2'25, Reporting $6.8 billion Revenue and $825 million Income from Operations": 0.8,
  "Ex-Trump Lawyer Says Trump Could Set Sights on Musk's Billions: 'It Bothers Him That He Is the Richest Man'": -0.6,
  "Joby Stock Jumps; These Defense Stocks Rise": 0.5,
  "ON Semiconductor Corporation (ON): A Bull Case Theory": 0.5,
  "Zeta Global Holdings Corp. (ZETA): A Bull Case Theory": 0.5,
  "Vertex Crashes After Pain Drug Flop Outweighs Second-Quarter Beat": -0.6,
  "Stock Market Today: Dow Rallies; Palantir Surges; Trump Says This On Sydney Sweeney Ad As American Eagle Soars": 0.5,
  "This Cancer Biotech Company Is Making a Big Bet on the HYPE Crypto. Should You Buy Its Stock Here?": 0.5,
  "Unity Software Inc. (U): A Bull Case Theory": 0.5,
  "Equity Markets Close Higher After June Factory Orders Decline": 0.2,
  "Palantir's 'blowout' Q2 shows path to $1T market cap: Dan Ives": 0.6,
  "SBA Communications raises annual revenue forecast on robust wireless carrier activity": 0.8,
  "Apple Posts Strongest Growth Since 2021 on iPhone Sales": 0.8,
  "Palantir Technologies Exceeds Second-Quarter Views Amid US Revenue Boost": 0.8,
  "Wall Street Rebounds After Friday's Equity Sell-Off; Traders Await More Earnings Reports": 0.5,
  "S&P 500 Gains and Losses Today: Retail Sector Stocks Rise Amid Rate Cut Hopes": 0.5,
  "Mobileye Global Inc. (MBLY): A Bull Case Theory": 0.5,
  "Broadcom Ships Jericho4, Enabling Distributed AI Computing Across Data Centers": 0.5,
  "Arteris To Provide FlexGen Smart NoC IP In Next-Generation AMD AI Chiplet Designs": 0.5,
  "Broadcom Rounds Out AI Networking Portfolio With New Jericho Chip": 0.5,
  "Broadcom launches Jericho chip to advance AI data center networks": 0.5,
  "Tesla awards CEO Musk millions of shares valued at about 29 billion dollars": 0.8,
  "Latin American e-commerce co MercadoLibre slips after Q2 profit misses": -0.5,
  "Lattice Semiconductor (LSCC) Matches Q2 Earnings Estimates": 0.5,
  "Axon Enterprise (AXON) Tops Q2 Earnings and Revenue Estimates": 0.8,
  "Coinbase, PayPal Press Forward With Stablecoin Rewards Despite GENIUS Prohibitions–Here's How": 0.5,
  "Tesla's China Sales Slide Again -- And It's Not Just About Competition": -0.5,
  "Here's What Traders Expect AMD Stock To Do After Earnings": 0.2,
  "Dow Jones Futures: Palantir Jumps On Earnings; Figma, Nvidia, Spotify, Tesla Are Big Movers": 0.5,
  "Vertex Stock Falls After Pain-Drug Setback, Despite Stronger Earnings": -0.5,
  "Diamondback Energy (FANG) Tops Q2 Earnings and Revenue Estimates": 0.8,
  "Vertex Pharmaceuticals (VRTX) Surpasses Q2 Earnings and Revenue Estimates": 0.8,
  "Axon raises annual revenue forecast on strong security demand": 0.8,
  "MercadoLibre Stock Falls After Q2 Earnings Miss Estimates Despite Strong Sales": -0.5,
  "Tesla Awards Musk $29 Billion in Shares as 2018 Pay Battle Continues": 0.2,
  "Palantir Technologies Inc. (PLTR) Q2 Earnings and Revenues Surpass Estimates": 0.8,
  "Berkshire Stock Was Hammered Monday. It’s Like 1999 Again.": -0.6,
  "MercadoLibre: Q2 Earnings Snapshot": 0.0,
  "Palantir Stock Jumps. Earnings Blew Past Wall Street’s Expectations.": 0.8,
  "Axon (AXON) Q2 Earnings: Taking a Look at Key Metrics Versus Estimates": 0.2,
  "Compared to Estimates, Vertex (VRTX) Q2 Earnings: A Look at Key Metrics": 0.5,
  "A Look at Meta’s ‘Value Rules’ for Specific Ad Targeting Approaches": 0.2,
  "Hims & Hers, ThredUp, MercadoLibre: After-hours trending stocks": 0.0,
  "Think Palantir Stock Is Too Expensive? Here Are 10 Billion Reasons to Reconsider.": 0.5,
  "Why Apple Stock Lagged the Market on Monday": -0.5,
  "Hims & Hers stock falls 10% on revenue miss - Shares of Hims & Hers Health fell 9% in extended trading on Monday after the telehealth company reported second-quarter results that missed Wall Street’s expectations for revenue. Here’s how the company did based on average analysts’ estimates compiled by LSEG: Earnings per share: 17 cents adjusted vs. 15 cents Revenue: $544.8 million vs. $552 million Revenue at Hims & Hers increased 73% in the second": -0.5,
  "PDD Holdings Inc. Sponsored ADR (PDD) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Applied Materials (AMAT) Rises Higher Than Market: Key Facts": 0.5,
  "Cisco Systems (CSCO) Outperforms Broader Market: What You Need to Know": 0.5,
  "Intuit (INTU) Ascends But Remains Behind Market: Some Facts to Note": 0.1,
  "Palo Alto Networks (PANW) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Stocks to Watch Monday: Palantir, Hims & Hers, Vertex, Tesla": 0.5,
  "Options Traders Expected Palantir Stock's Tamest Earnings Reaction in a Year. Did They Get It Right?": 0.2,
  "Nvidia Pushes Back on China AI Chip 'Backdoor' Fears": 0.1,
  "Compared to Estimates, Diamondback (FANG) Q2 Earnings: A Look at Key Metrics": 0.2,
  "Why Netflix Stock Lost 13% in July": -0.6,
  "Elon Musk retains title as the highest-paid CEO in history with $26 billion pay package—and the only thing he has to do is show up for two years": 0.2,
  "Microsoft Stock Soars on the Back of AI. Can the Momentum Continue or Is It Too Late to Buy the Stock?": 0.5,
  "Axon (NASDAQ:AXON) Reports Upbeat Q2, Full-Year Outlook Slightly Exceeds Expectations": 0.8,
  "Palantir Tops Q2, Raises Full-Year Forecast": 0.8,
  "OpenAI's User Base Soars as GPT-5 Approaches": 0.6,
  "MercadoLibre (MELI) Q2 Earnings Miss Estimates": -0.5,
  "Apple Forms In-House AI Chatbot Team to Rival ChatGPT": 0.2,
  "MercadoLibre (NASDAQ:MELI) Beats Q2 Sales Targets But Stock Drops": -0.5,
  "Palantir Reports Sales Up 48%, Cites ‘Astonishing’ AI Impact": 0.8,
  "Intel's credit rating downgraded by Fitch on demand challenges": -0.6,
  "Veteran fund manager raises eyebrows with Palantir review ahead of earnings": 0.2,
  "Podcast: U.S. Stocks Rally After Tough Week": 0.6,
  "Cloudflare Accuses Perplexity AI of Using Stealth Crawlers to Evade Website Blocks": -0.6,
  "Snap DD for Earnings - Snap will beat earnings. Google and Meta have traditionally captured share and posted 10+% and 20+% growth consistently. This often came at the expense of other players but I think the display ad market has grown quite a bit this year. Even MSFT's advertising grew 20% plus compare to ~10% for the same quarter last year. Roku and TTD posted ~20% gain as well. Unless the folks at SNAP are": 0.6,
  "Palantir Surges on First $1 Billion Revenue Quarter": 0.8,
  "Why Lululemon Stock Lost 16% in July": -0.5,
  "AMD & Pfizer earnings, ISM services data: What to Watch": 0.2,
  "MercadoLibre (MELI) Q2 Earnings: Taking a Look at Key Metrics Versus Estimates": 0.5,
  "FuriosaAI Raises $125M In Series C As LG AI Research Backs Renegade Inference Chip Breakthrough": 0.6,
  "Stock market today: Dow, S&P 500, Nasdaq futures make slight gains as Wall Street eyes earnings with trade tensions ahead": 0.5,
  "Flex Delivers Advanced Power Management for Next-Generation NVIDIA AI Infrastructure": 0.6,
  "Warren Buffett's Advice: 'If You Aren't Willing To Own A Stock For Ten Years, Don't Even Think About Owning It For Ten Minutes'": 0.5,
  "3 Popular Stocks to Consider as Earnings Approach: DIS, FTNT, SHOP": 0.5,
  "SIGGRAPH 2025 Announces Keynote Presentations Featuring Top Technological Marvels Shaping Our Trajectory Toward a Better Future": 0.8,
  "Google to Pit Top AI Models Against Each Other in Live Chess Tournament": 0.6,
  "Should You Buy Nvidia Stock Before Aug. 27? Here's What the Evidence Suggests.": 0.5,
  "Big-Box Battle: Should You Stock Up on Costco or BJ's?": 0.2,
  "Is Now the Time to Buy Alphabet?": 0.2,
  "Ambiq Micro's IPO Could Signal the Next Wave of AI-Driven Chip Stocks": 0.6,
  "No Pain, No 100,000% Gain": 0.6,
  "US Explores Better Location Trackers for AI Chips, Official Says": 0.2,
  "Kratsios: US Is Exploring Ways to Track Flow of AI Chips": 0.2,
  "Should I keep my OXY and ELI??? - My portfolio is pretty simple, its 75% VOO and the rest is individual stocks and crypto (BTC and ETH). My individuals are all doing great apart from OXY and ELI. They have been constantly in the red. Do you think its worth hanging on to these guys or cut my losses with them. I'm a long term investor btw so not looking to get rich quick. Thanks": -0.6,
  "Senate will make sure Fed remains independent(bloomberg TV), what do you think? - I have been scratching my head as to why the bond/stock market is so resilient given that Federal govt wants to monetize the debt without any regard to value of USD going down(this will lead to loss of reserve currency status). I was wondering if the elites have lost all influence, I mean, there may be around 3000 people with networth of": -0.6,
  "Amazon Founder Jeff Bezos Loses $17 Billion Following Company's Mixed Q2 Earnings": -0.7,
  "Stock Market Growth - Do we think that the Stock Market will truly continue to grow for the next 40+ years? Are we true to expect 7% rates annually (on average) from the S&P 500? I truly just wonder the true likelihood that it will simply continue to grow. Almost everything stops growing after a while, what makes we sure that the market will continue to go up?": -0.6,
  "Airbnb (ABNB) Q2 Earnings Report Preview: What To Look For": 0.2,
  "Earnings To Watch: CDW (CDW) Reports Q2 Results Tomorrow": 0.2,
  "DoorDash (DASH) Reports Q2: Everything You Need To Know Ahead Of Earnings": 0.5,
  "Shopify (SHOP) Reports Earnings Tomorrow: What To Expect": 0.5,
  "AppLovin (APP) Q2 Earnings Report Preview: What To Look For": 0.2,
  "MSI Showcases DC-MHS and MGX Server Platforms for Cloud-Scale and AI Infrastructure at OCP APAC 2025": 0.5,
  "Australia's internet network signs Amazon satellite service": 0.2,
  "Trump’s ‘big, beautiful bill’ triggers boom for defence tech start-ups": 0.6,
  "AMD Reports Earnings Today. Why an Analyst Expects Good Results.": 0.8,
  "Debashis Chatterjee Joins Ascendion Board to Shape the Future of AI-Powered Software Engineering": 0.6,
  "Snap Earnings Will Answer Big Questions About Advertising": 0.5,
  "SoftBank Stakes in Nvidia, TSMC Show Son’s Focus on AI Gear": 0.5,
  "Tesla Gives CEO Musk $30 Billion Stock Award": 0.5,
  "Executives Are in Real Danger. Companies Pony Up to Keep Them Safe.": 0.1,
  "IDEXX Laboratories Inc (IDXX) Q2 2025 Earnings Call Highlights: Strong Revenue and EPS Growth ...": 0.8,
  "Red Canary Research Reveals Sharp Rise in Cloud and Identity Threats, Exposing Critical Cybersecurity Risks": 0.5,
  "ON Semiconductor Corp (ON) Q2 2025 Earnings Call Highlights: Resilient Revenue Growth Amid ...": 0.5,
  "Vertex Pharmaceuticals Inc (VRTX) Q2 2025 Earnings Call Highlights: Strong Revenue Growth and ...": 0.8,
  "Axon Enterprise Inc (AXON) Q2 2025 Earnings Call Highlights: Record Revenue Growth and Raised ...": 0.8,
  "MercadoLibre Inc (MELI) Q2 2025 Earnings Call Highlights: Record Growth and Strategic Advancements": 0.8,
  "Palantir Technologies Inc (PLTR) Q2 2025 Earnings Call Highlights: Record Revenue and Strategic ...": 0.8,
  "Chip startup Oxmiq launches GPU tech for license": 0.2,
  "Syncron Appoints Risa Sparks as New Chief Financial Officer": 0.5
}