{
  "Is Intuit the Best FinTech Stock to Buy in 2026?": 0.2,
  "DATROWAY® Type II Variation Application Validated in the EU as First-Line Treatment for Patients with Metastatic Triple Negative Breast Cancer Who are Not Candidates for Immunotherapy": 0.6,
  "Xcel Energy (XEL) Valuation Check as Texas Wildfire Lawsuit and Bond Tender Reshape Investor Expectations": 0.2,
  "Applied Materials: Engineering the AI Backbone": 0.5,
  "How Investors May Respond To Intuit (INTU) AI Partnership Progress And Softer Margin Guidance": 0.1,
  "Will Arm (ARM) China’s New AI Hub Clarify or Complicate Its Long-Term Monetization Story?": 0.2,
  "Prediction: Wall Street's Most Unique Member of the \"Magnificent Seven\" Will Become the Hottest Stock-Split Stock of 2026": 0.8,
  "Takeda says $4B TYK2 drug succeeds in large psoriasis studies": 0.8,
  "Marriott reaches 100 signings for City Express brand in US and Canada": 0.5,
  "Alnylam plans $250m investment in Norton manufacturing facility, US": 0.5,
  "How Is CrowdStrike’s Stock Performance Compared to Other Software Stocks?": 0.1,
  "Qualcomm Completes Acquisition of Alphawave Semi": 0.5,
  "Evercore Sticks With Bullish Call on Fermi Inc. (FRMI)": 0.6,
  "Intuit CEO says Gen Z is staving off recession by putting it on plastic: ‘Credit card balances are up 36-37%, but they still have jobs’": 0.1,
  "A Billion-Dollar Question Hangs Over the New AI Search Marketing Industry": 0.5,
  "Insiders At Monster Beverage Sold US$4.3m In Stock, Alluding To Potential Weakness": -0.6,
  "Insmed’s ‘win streak’ ends as top drug fails study in chronic nasal condition": -0.8,
  "Activist investor wants Ralph Lauren veteran to lead Lululemon": 0.5,
  "Stocks Climb Before the Open on Micron Boost Ahead of U.S. Inflation Data": 0.6,
  "Hormel Foods Announces Appointment of Jason Levine to New Enterprise-wide Chief Marketing Officer Position": 0.5,
  "PepsiCo price target raised to $170 from $165 at Citi": 0.5,
  "3 Stocks Estimated To Be Up To 36.7% Below Intrinsic Value Offering Potential Opportunities": 0.6,
  "High Growth Tech Stocks To Watch In The US December 2025": 0.5,
  "Adobe price target raised to $387 from $366 at Citi": 0.5,
  "Applied Materials price target raised to $245 from $205 at Mizuho": 0.5,
  "PeptiDream and Alnylam Announce Achievement of Key Milestone in siRNA Conjugate Discovery Collaboration Demonstrating Peptide-Ligand Mediated Targeted siRNA Delivery to Specific Extrahepatic Tissues": 0.5,
  "Better Buy in 2026: Novo Nordisk or Intuitive Surgical?": 0.2,
  "Lululemon Faces Activist Pressure as Elliott Takes $1 Billion Stake": -0.5,
  "Insmed Stock Plummets 19%. This Is What Sparked the Selloff.": -0.6,
  "5 Dividends That Beat Social Security’s Unpredictable COLA Adjustments": 0.5,
  "If GTA VI Delivers, Take-Two Could Hit $300 in 2026": 0.6,
  "E-Commerce Today - Akamai and Visa Team Up for Secure AI-Driven Commerce": 0.6,
  "The Chip Equipment Maker That Quietly Turned $1,000 Into $11,280 in a Decade": 0.8,
  "INSM Stock Plummets on Sinus Study Failure, Adds New Pipeline Asset": 0.2,
  "LUMN Surges 26% in the Past Year: Can It Sustain the Momentum in 2026?": 0.6,
  "Will Direct Distribution in Southern Europe Boost ISRG's Margins?": 0.2,
  "Gilead Sciences Appoints Keeley Wettan as Executive Vice President, General Counsel, Legal & Compliance": 0.5,
  "Buy 5 Non-Tech Nasdaq Stocks for 2026 That Helped It Surge in 2025": 0.2,
  "The 4 Highest-Yielding S&P 500 Utility Stocks Are Strong 2026 Buys After Big Pullback": 0.8,
  "Hypori Launches New Global Partner Program to Help Transform Enterprise Mobility With New Next Gen BYOD Innovation": 0.8,
  "Delayed Gift? DoorDash Saves the Day with its Holiday Gift Rescue": 0.6,
  "SailPoint Announces Integrations with the CrowdStrike Falcon Platform": 0.5,
  "Amazon Business Prime Offers Small and Midsize Businesses Even More Value with New Benefits from Intuit QuickBooks, CrowdStrike, and Gusto": 0.8,
  "THE SINGLETON FOUNDATION'S 2025 CEO PRIZE GIVES DONATIONS TO NYU STERN SCHOOL OF BUSINESS AND UCSF ON BEHALF OF THIS YEAR'S AWARDEES": 0.5,
  "CoStar Ranks Top U.S. Small-Bay and Big-Box Industrial Markets": 0.0,
  "Data, Collaboration and Flexibility: Visual Lease Data Institute Uncovers the Strategic Priorities Shaping 2026 for Finance and Real Estate Leaders": 0.5,
  "Leverage Shares by Themes expands its single stock Leveraged ETF suite to include NIO, SNAP, BIDU, CNC, KLAC, PBR, and VALE": 0.2,
  "Cognizant and Microsoft Expand Partnership to Advance AI Transformation and Frontier Firm Experiences": 0.6,
  "Here is What to Know Beyond Why Booking Holdings Inc. (BKNG) is a Trending Stock": 0.2,
  "Synopsys, Inc. (SNPS) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Investors Heavily Search ASML Holding N.V. (ASML): Here is What You Need to Know": 0.5,
  "Lionsgate Partners Exclusively with FreeWheel to Give Ad Buyers Direct Access to Its Premium FAST Inventory": 0.5,
  "Micron Technology Stock Soars 9% on Q1 Earnings Beat, Strong Guidance": 0.8,
  "Will EUV Adoption in Logic and DRAM Lift ASML's Margins Over Time?": 0.2,
  "Here’s Why Parnassus Value Equity Fund Sold Airbnb (ABNB)": 0.1,
  "Intuit’s Consumer Platform Powers the Future of Tax Filing: TurboTax and Credit Karma Launch \"Now This Is Taxes\" Highlighting Trusted Tax Experts and Maximized Refunds": 0.8,
  "Should You Invest in Cadence (CDNS) Based on Bullish Wall Street Views?": 0.5,
  "Industrious Ventures Announces Appointment of Matt White, EVP & CFO of Linde, to Stoke Space's Board of Directors": 0.5,
  "Verisk Analytics (VRSK) Fell Following the Quarterly Results": -0.5,
  "Top Semiconductor Stocks for 2026 -- Nvidia and Broadcom Lead Chip Picks": 0.5,
  "DexCom (DXCM) Fell Due to Modest Guidance": -0.5,
  "Travel Demand Still Rising in 2026? 4 Stocks to Ride the Boom": 0.6,
  "Lovable valued at $6.6 billion in latest funding round as AI coding demand surges": 0.8,
  "Activist investor Elliott Management acquires $1bn Lululemon stake": 0.5,
  "Assessing ASML After 2025 Pullback and Mixed Signals from DCF and Earnings Multiples": 0.1,
  "Is Intuitive Surgical (ISRG) Still Undervalued After Its Recent 27% Three-Month Share Price Climb?": 0.2,
  "Comcast Completes Network Expansions to Unserved Residents and Businesses in Hopewell and Maurice River Townships, Cumberland County, NJ": 0.5,
  "Micron, GM, PayPal: Top Analyst Calls": 0.0,
  "What to Expect From Paychex's Q2 2026 Earnings Report": 0.1,
  "If You Own GIS Stock, You May Want to Sell and Buy This Instead": -0.6,
  "Shopify's Free Cash Flow Strength Supports Long-Term Growth, Oppenheimer Says": 0.8,
  "PayPal Slips After Morgan Stanley Downgrade on Growth, Execution Concerns": -0.6,
  "AppLovin (APP) Shares Skyrocket, What You Need To Know": 0.8,
  "Why Lam Research (LRCX) Stock Is Up Today": 0.5,
  "Why Shopify (SHOP) Stock Is Up Today": 0.5,
  "Insmed's Pipeline Can Deliver Potential Gains Despite Brensocatib Setback, RBC Says": 0.6,
  "Sea Limited's Shipping Subsidies Boost GMV: Is Growth Sustainable?": 0.2,
  "Analysts Say This 1 Lesser-Known Chip Stock Is a Top Buy for 2026. Should You Add It to Your Portfolios Here?": 0.6,
  "Cocoa Prices Slide on a Positive Cocoa Crop Outlook in West Africa": -0.7,
  "Keurig Dr Pepper (KDP): Assessing Valuation After a Year of Slower Share Price Momentum": 0.1,
  "Kraft Heinz (KHC) Valuation Check as Steve Cahillane Takes Helm to Steer Planned Corporate Split": 0.2,
  "Top 3 Dividend Stocks To Consider For Your Portfolio": 0.0,
  "PayPal Stock Slides After Third Analyst Downgrade This Month": -0.6,
  "Qualcomm Stock Rises After $2.4 Billion Alphawave Semi Deal": 0.8,
  "December 2025's Stock Selections Estimated To Be Priced Below Fair Value": 0.5,
  "AVGO Stock Drops 20% From 52-Week High: Should You Buy on the Dip?": -0.5,
  "Circle Partners Intuit to Bring Stablecoin Services to Credit Karma, Turbotax, Quickbooks": 0.5,
  "Otter Tail Corporation Appoints Chris Clark and Steve Rasche to Board of Directors": 0.5,
  "Constellation Energy Corporation (CEG): A Bull Case Theory": 0.5,
  "Assessing Cadence Design Systems After AI Design Momentum and Recent Share Price Pullback": 0.2,
  "Is Comcast Offering Long Term Value After Its Recent Share Price Rebound?": 0.2,
  "RBC Sees Near Term Pressure on U.S. Rails": -0.5,
  "Best Stock to Buy Right Now: Constellation Brands vs. PepsiCo": 0.5,
  "Intuit to Integrate USDC Stablecoin Across TurboTax, QuickBooks": 0.5,
  "Niowave Expands Global Supply Agreement with AstraZeneca to Deliver Actinium-225 for Next-Generation Cancer Therapies": 0.8,
  "Amazon Expands Business Prime With New Perks for Small Firms": 0.8,
  "Intel, Paramount are some of Wall Street's best comebacks of 2025": 0.8,
  "Autodesk (ADSK): Exploring Valuation After Recent Share Price Weakness and Ongoing Double-Digit Growth": 0.6,
  "Investors in DexCom (NASDAQ:DXCM) have unfortunately lost 43% over the last three years": -0.8,
  "Cocoa Prices Settle Lower on Expectations of Adequate Supplies": -0.5,
  "RWE and Indiana Michigan Power Company partner to support Indiana's growing electricity demand with long-term PPA for 200 MW project": 0.6,
  "Why Axon (AXON) Stock Is Up Today": 0.5,
  "Marvell Technology (MRVL) Stock Is Up, What You Need To Know": 0.5,
  "KLA Corporation (KLAC) Stock Is Up, What You Need To Know": 0.5,
  "Wall Street Loves This Software Stock for 2026. Should You Buy It Now?": 0.5,
  "Seagate Technology, onsemi, Semtech, Nova, and Teradyne Shares Are Soaring, What You Need To Know": 0.8,
  "Sector Update: Tech Stocks Gain Late Afternoon": 0.5,
  "DoorDash, Skillz, MercadoLibre, and Reddit Shares Skyrocket, What You Need To Know": 0.8,
  "Fastenal and the Belfast Giants Enter Sponsorship Agreement": 0.5,
  "Chipotle flexes its new high-protein menu": 0.6,
  "Does Deeper Thrive–Shopify Integration Change The Bull Case For Block’s Omnichannel Ambitions (SQ)?": 0.2,
  "These Stocks Moved the Most Today: Micron, DJT, Accenture, Tilray, Lululemon, Medline, Rivian, and More": 0.2,
  "The 'Worst-Case Scenario' — Why Insmed Just Reversed After A 181% Six-Month Sprint": -0.5,
  "AI Stocks Got Some Good News—And Surged. Will This Micron-Powered Momentum Last?": 0.6,
  "NYSE Owner ICE in Talks to Invest in MoonPay at Nearly $5 Billion Valuation": 0.6,
  "Accenture Earnings Beat Estimates. Why the Stock Is Dropping.": -0.5,
  "Stock Market Today: Indexes Keep Gains; Western Digital On A Streak As Carvana, Nuke Play Set Up (Live Coverage)": 0.5,
  "Charter to Hold Webcast to Discuss Fourth Quarter and Full Year 2025 Financial and Operating Results": 0.0,
  "AI trade is helping build out the 'next new economy': Strategist": 0.5,
  "Adobe and Runway Partner to Deliver the Next Generation of AI Video for Creators, Studios and Brands": 0.6,
  "Marvell Technology (MRVL): Assessing Valuation After Recent Share Price Pullback": 0.5,
  "Is It Too Late To Consider Lam Research After Its 2024 AI Fueled Surge?": 0.2,
  "Bridgeline Digital, Inc. (BLIN) Reports Q4 Loss, Lags Revenue Estimates": -0.7,
  "BofA Raises Analog Devices (ADI) Target, Sees Long AI-Driven Upgrade Cycle Ahead": 0.6,
  "Goldman, Barclays Lower Roper (ROP) Price Targets Amid Muted End-Market Expectations": -0.5,
  "Pemex Eyes New Production Chief Amid Mounting Output Challenges": -0.5,
  "Workday (WDAY) Earns Buy Rating as BTIG Calls Outlook “De-Risked”": 0.6,
  "ASML (ASML) Outperforms Broader Market: What You Need to Know": 0.5,
  "Cisco Systems (CSCO) Outperforms Broader Market: What You Need to Know": 0.6,
  "Qualcomm (QCOM) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Phillip Maintains Buy on Adobe (ADBE), Sees Steady Growth Into FY26": 0.6,
  "Is It Too Late to Consider Alnylam After a 67.8% Surge in 2025?": 0.2,
  "If AI Financial Automation Happens (It Is) Then These Four Companies Win": 0.5,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (b) On December 19, 2025, Dina Powell McCormick notified Meta Platforms, Inc. (the \"Company\") that she will resign as a member of the Board of Directors of the Company, effective immediately.": -0.5,
  "(Item 2.02) Results of Operations and Financial Condition On December 19, 2025, Paychex, Inc. (the \"Company\") issued a press release (the \"Press Release\") reporting its financial results for the three and six months ended November 30, 2025. A copy of the Press Release is attached as Exhibit 99.1 to this Current Report on Form 8-K. The information provided pursuant to this\n\n(Item 2.02) , including Exhibit 99.1, is being \"furnished\" herewith and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities under such section, nor shall the information be deemed to be incorporated by reference into any filing of the Company under the Securities Act of 1933, as amended, or the Exchange Act, except to the extent specifically provided": 0.1,
  "Syneron Bio Closes Nearly $100M in Series A and A+ Rounds": 0.8,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On December 18, 2025, the Board of Directors (\"Board\") of American Electric Power Company, Inc. (\"AEP\") granted a special equity award to William J. Fehrman, AEP’s Chair, President and Chief Executive Officer, as part of AEP's retention strategy and to promote further alignment between Mr. Fehrman’s compensation and Company performance. 1. $10,000,000 in performance shares that will": 0.2,
  "(Item 1.01) Entry into a Material Definitive Agreement Term Loan Agreement On December 18, 2025, Keurig Dr Pepper Inc. (“ KDP ” or the “ Company ”) entered into a Term Loan Agreement (the “ Term Loan Agreement ”), with the lenders party thereto and Morgan Stanley Senior Funding, Inc. (“ MSSF ”), as administrative agent, pursuant to which each lender has committed, subject to satisfaction of certain conditions set forth in the Term Loan Agreement, to\n\n(Item 1.01) regarding the Term Loan Agreement is incorporated herein by reference.": 0.1,
  "Carnival earnings, home sales, consumer sentiment: What to Watch": 0.2,
  "Milvus Surpasses 40,000 GitHub Stars, Reinforcing Leadership in Open-Source Vector Databases": 0.8,
  "Alnylam’s Manufacturing Expansion and Extra-Hepatic RNAi Delivery Could Be A Game Changer For Alnylam Pharmaceuticals (ALNY)": 0.6,
  "Is CrowdStrike (CRWD) Quietly Redefining Its AI Security Moat Through New Amazon Integrations?": 0.5,
  "Is It Too Late To Consider AstraZeneca After Its Strong 2025 Share Price Rally?": 0.2,
  "China boosts AI chip output by upgrading older ASML machines": 0.5,
  "3 Absurdly Cheap Stocks You Can Buy For Less than $100 Right Now": 0.5,
  "Wells Fargo’s Investment Bankers Are Having Their Best Year Ever": 0.8,
  "How Stronger West African Cocoa Harvest And Dividend News At Mondelez (MDLZ) Has Changed Its Investment Story": 0.5,
  "Agoda Reveals Must-Visit Cities for Dazzling New Year's Eve Fireworks": 0.8,
  "Does Diamondback Energy’s 2025 Valuation Reflect Its Cash Flow Strength After Recent Share Price Pullback?": 0.2,
  "Winners And Losers Of Q3: Charter (NASDAQ:CHTR) Vs The Rest Of The Wireless, Cable and Satellite Stocks": 0.2,
  "Seagate Technology (STX): Buy, Sell, or Hold Post Q3 Earnings?": 0.2,
  "2 Reasons to Watch EA and 1 to Stay Cautious": 0.5,
  "KLA Corporation (KLAC): 3 Reasons We Love This Stock": 0.8,
  "1 Growth Stock to Add to Your Roster and 2 We Question": 0.2,
  "3 Unpopular Stocks with Open Questions": -0.5,
  "3 Unpopular Stocks Walking a Fine Line": 0.0,
  "2 Profitable Stocks to Consider Right Now and 1 We Turn Down": 0.2,
  "1 Large-Cap Stock with Competitive Advantages and 2 Facing Headwinds": 0.2,
  "1 Cash-Producing Stock with Impressive Fundamentals and 2 We Ignore": 0.5,
  "3 of Wall Street’s Favorite Stocks with Questionable Fundamentals": -0.5,
  "1 Nasdaq 100 Stock Worth Your Attention and 2 Facing Headwinds": 0.2,
  "3 Mega-Cap Stocks with Warning Signs": -0.5,
  "1 Industrials Stock Worth Your Attention and 2 We Brush Off": 0.2,
  "1 Mooning  Stock to Own for Decades and 2 Facing Headwinds": 0.2,
  "CTAS Q4 Deep Dive: Margin Discipline and Vertical Growth Drive Steady Performance": 0.6,
  "Starbucks rival shuts key location as bankruptcy looms": -0.8,
  "Evaluating Diamondback Energy (FANG) After Its Recent Pullback: Is the Stock Undervalued?": 0.5,
  "Is Analyst Scrutiny Of Incentive Costs And Integration Challenges Altering The Investment Case For Celsius (CELH)?": 0.1,
  "Why Shopify Stock Jumped Thursday": 0.5,
  "Should You Buy the 3 Highest-Paying Dividend Stocks on the Nasdaq?": 0.2,
  "Will PayPal Bank Push Transform PayPal Holdings' (PYPL) Narrative Into Full‑Scale Digital Banking?": 0.2,
  "Here's What to Expect From Fastenal’s Next Earnings Report": 0.1,
  "Alvotech and Teva Secure U.S. Settlement Date for AVT06, a Proposed Biosimilar to Eylea®": 0.5,
  "KeyBanc Turns Bearish on Adobe (ADBE) Despite Strong Q4 Results": -0.5,
  "CrowdStrike’s (CRWD) Market Leadership Supports Premium, Citizens Says": 0.6,
  "Will Weakness in Copart, Inc.'s (NASDAQ:CPRT) Stock Prove Temporary Given Strong Fundamentals?": 0.5,
  "Heard on the Street Thursday Recap: Memory Boost": 0.0,
  "US Stock Market Today: S&P 500 Futures Rise amid Global Rate Hikes, Cooling Inflation": 0.5,
  "Cognizant, Microsoft agree multi-year partnership for AI integration": 0.6,
  "Qualcomm wraps up $2.4bn acquisition of Alphawave Semi": 0.5,
  "Zacks Investment Ideas feature highlights CAPITAL ONE, MARRIOTT INTERNATIONAL and Tesla's": 0.5,
  "Roper Technologies, Inc. (NASDAQ:ROP) Stock's Been Sliding But Fundamentals Look Decent: Will The Market Correct The Share Price In The Future?": 0.5,
  "Texas Instruments Incorporated's (NASDAQ:TXN) latest 3.0% decline adds to one-year losses, institutional investors may consider drastic measures": -0.6,
  "Weekly Recap: 10 Finance Press Releases You Need to See": 0.5,
  "Here’s Why Alnylam Pharmaceuticals (ALNY) Surged in Q3": 0.5,
  "Brown Advisors Mid-Cap Growth Strategy Exited Zscaler (ZS) on Valuation": -0.5,
  "3 Stocks Estimated To Trade At Discounts Of Up To 49.7%": 0.5,
  "The most-read industry analysis from Just Food in 2025": 0.2,
  "Are Investors Undervaluing Atlassian Corporation (NASDAQ:TEAM) By 33%?": 0.2,
  "Qualcomm’s Monster Rally Has a Catch—Can the Stock Keep Climbing?": 0.2,
  "Monster Beverage Insider Sale Leads to Investor Scrutiny": -0.5,
  "Frontier inks $44.2M deal with biowaste carbon removal company": 0.6,
  "Stocks Mostly Up Pre-Bell as Traders Digest Latest Inflation Data": 0.5,
  "Duke Energy vs. Exelon: Which Power Utility Stock Offers More Upside?": 0.5,
  "Here Are Friday’s Top Wall Street Analyst Research Calls: Birkenstock, Coreweave, Lockheed Martin, Lyft, Paccar, Stryker, Synaptics, and More": 0.2,
  "UNIVERSAL MUSIC GROUP AND ROBLOX ANNOUNCE STRATEGIC AGREEMENT TO EXPAND CREATIVE AND COMMERCIAL MUSIC EXPERIENCES ON THE PLATFORM FOR ARTISTS, LABELS AND FANS": 0.8,
  "Is NXP Semiconductors N.V. (NASDAQ:NXPI) Potentially Undervalued?": 0.2,
  "Dow Jones Futures: Tech Stocks Eye Key Level; Oracle, Nike, FedEx In Focus": 0.2,
  "The Zacks Analyst Blog Amazon, Atlassian and Cloudflare": 0.5,
  "Cintas Guidance Implies Moderating Revenue Growth in Fiscal H2 2026, RBC Says": 0.1,
  "thegeekconf 2025 Panel Puts Enterprise Focus on AI’s Practical Usage": 0.5,
  "Jabil Is Flying Under the Radar—But a 50% Surge May Be Coming": 0.5,
  "Paychex Reports Second Quarter Results": 0.0,
  "This 1 Lesser-Known Stock Is Set to Dominate with Nvidia and Broadcom in 2026": 0.5,
  "Implied Volatility Surging for Old Dominion Stock Options": 0.5,
  "Paychex: Fiscal Q2 Earnings Snapshot": 0.0,
  "Is the Options Market Predicting a Spike in TMobile US Stock?": 0.2,
  "Paychex (NASDAQ:PAYX) Reports Q4 CY2025 In Line With Expectations": 0.5,
  "Exchange-Traded Funds Higher, Equity Futures Mixed Pre-Bell Friday Amid Economic Data Releases": 0.5,
  "PayPal Holdings, Inc. (PYPL) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Constellation Energy Corporation (CEG) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "CrowdStrike (CRWD) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "We Ran A Stock Scan For Earnings Growth And Baker Hughes (NASDAQ:BKR) Passed With Ease": 0.6,
  "Stock Market News for Dec 19, 2025": 0.0,
  "Aoris International Fund Sold Copart (CPRT) in Q3": -0.2,
  "Is NXP (NXPI) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Why GE HealthCare Technologies (GEHC) is a Top Stock for the Long-Term": 0.8,
  "Lam Research (LRCX) Just Flashed Golden Cross Signal: Do You Buy?": 0.5,
  "Paychex (PAYX) Q2 Earnings and Revenues Beat Estimates": 0.8,
  "Has AXT (AXTI) Outpaced Other Computer and Technology Stocks This Year?": 0.2,
  "Circle Internet initiated, Lyft downgraded: Wall Street's top analyst calls": 0.1,
  "Linde (LIN) Isn’t Seeing US Reshoring, Says Jim Cramer": -0.5,
  "Can This $2 Billion AI Investment Help Nvidia’s Secret Portfolio From Collapsing?": 0.2,
  "Bubbles and Boring Bets: What’s Coming for Tech Stocks in 2026": 0.2,
  "Meta Joins the AI Video Race: Report. It Needs to Catch Google and OpenAI.": 0.2,
  "Dear Western Digital Stock Fans, Mark Your Calendars for Dec. 22": 0.5,
  "Paychex's higher quarterly expenses overshadow annual earnings forecast raise": -0.5,
  "Paychex Lifts Earnings Guidance Mid-Point, Sees Revenue at Low End of Outlook": 0.2,
  "Medline IPO sets surprising record": 0.6,
  "Assessing NXP Semiconductors (NXPI) Valuation After Its Recent 17% One-Month Share Price Rise": 0.2,
  "JPMorgan Highlights 11 Tech Stocks for 2026": 0.5,
  "S&P 500 Stocks Upgraded: AI Data Center Power Plays And Truck Makers": 0.5,
  "Form 8.3": 0.0,
  "Paychex Q2 Earnings & Revenues Surpass Estimates, Increase Y/Y": 0.8,
  "Lam Research (LRCX) Surges 6.27% as 3 Firms Turn Bullish": 0.8,
  "CHDN vs. TTWO: Which Stock Is the Better Value Option?": 0.0,
  "3 IT Services Stocks to Buy Right Now From a Prospering Industry": 0.6,
  "Global IoT providers focus on multi-network service management in H2 2025": 0.5,
  "Sandisk Rises 371% in Six Months: Should You Buy the Stock?": 0.8,
  "4 software stocks facing guidance risks in 2026, Morgan Stanley warns": -0.6,
  "Intuit & Circle Team Up for Smarter Money Movement With Stablecoins": 0.5,
  "Top Midday Stories: Oracle, Others Form JV to Oversee TikTok in US; More Drugmakers to Announce US Drug Price Deals": 0.5,
  "Why Jabil (JBL) Stock Is Trading Up Today": 0.5,
  "Applied Materials (AMAT) Stock Trades Up, Here Is Why": 0.5,
  "ComEd Awards $500,000 EV Charging Rebate to bp pulse": 0.5,
  "Favorable West African Weather Weighs on Cocoa Prices": -0.5,
  "Google Cloud Strikes Nearly $10 Billion AI Security Deal With Palo Alto Networks": 0.8,
  "Palo Alto, Google Cloud Strike 'Multi-Billion-Dollar' Deal to Deliver End-to-End AI Security": 0.8,
  "Xcel Energy Announces Pricing Terms of Cash Tender Offers for Certain Outstanding First Mortgage Bonds Issued by Northern States Power Company (a Minnesota corporation)": 0.0,
  "How Investors May Respond To Palo Alto Networks (PANW) Expanding AI Security Partnership With Google Cloud": 0.5,
  "Does Honeywell Offer Value After Portfolio Shift Toward Automation Aviation and Energy Transition?": 0.2,
  "Up 50% in 2025, Should You Buy ASML Stock Right Now?": 0.5,
  "3 Stocks Estimated To Be Undervalued By Up To 48.3%": 0.5,
  "Is Cognizant Still Attractive After Its 15.9% Surge and Strategic Focus on AI?": 0.5,
  "Axon vs. Woodward: Which Aerospace & Defense Stock Should You Bet On?": 0.2,
  "Cintas' Q2 Earnings Surpass Estimates, Revenues Increase Y/Y": 0.8,
  "US Oil Drillers Slow Activity In Tough Price Environment": -0.6,
  "Sector Update: Tech Stocks Gain Friday Afternoon": 0.5,
  "Jim Cramer Notes Linde “Has Tremendous Pricing Power”": 0.8,
  "As Intuit Jumps Into Stablecoin Business, Should You Buy, Sell, or Hold INTU Stock?": 0.2,
  "Starbucks taps Amazon's Anand Varadarajan as new chief technology officer": 0.5,
  "Infosys Pares Gains After Stock Spike. No One Knows What Prompted the Move.": -0.5,
  "Gilead and U.S. Government Enter Agreement to Lower Costs of Medicines for Americans": 0.8,
  "AMGEN TAKES ACTION WITH THE U.S. GOVERNMENT TO LOWER THE COST OF MEDICINES FOR AMERICAN PATIENTS": 0.8,
  "Cocoa Prices Undercut Amid the Prospects of Abundant Supplies": -0.8,
  "Honeywell to end 2025 in the red, but 2026 could be different": 0.2,
  "Nine Big Drugmakers Reach Pricing Deals With White House": 0.5,
  "UBS Believes Diamondback Energy (FANG) is Poised for a 2026 Breakout Following Period of Stagnation": 0.6,
  "Is Shopify Inc (SHOP) the Best Non-US Stock To Buy?": 0.5,
  "Wall Street Has a Positive Opinion on ASML Holding N.V. (ASML), Here’s Why": 0.8,
  "Here’s What Wall Street Thinks About Linde plc (LIN)": 0.1,
  "PDD Holdings Inc. (PDD) Down 15.5% in a Month, Here’s What You Need to Know": -0.5,
  "AstraZeneca PLC (AZN) Announces Approval of Saphnelo by the European Union": 0.5,
  "What Is Shifting the Take Two Narrative After Fresh GTA 6 and NBA 2K Optimism": 0.5,
  "Insider Buying And Hydrogen Bets Might Change The Case For Investing In Linde (LIN)": 0.5,
  "Jim Cramer on Micron: “It Is One of My Absolute Favorite Stocks”": 0.8,
  "Why Gilead Sciences (GILD) Stock Is Up Today": 0.5,
  "Why DoorDash (DASH) Stock Is Trading Up Today": 0.5,
  "Seagate Technology (STX) Stock Is Up, What You Need To Know": 0.5,
  "Why NXP Semiconductors (NXPI) Stock Is Up Today": 0.5,
  "Crude Oil Prices Settle Higher on Heightened Geopolitical Risks": 0.5,
  "Dave Ramsey Reveals 3 Ways To Fix The Housing Problem": 0.5,
  "Bay Area Council Forms Search Committee to Recruit New CEO": 0.1,
  "Sector Update: Health Care Stocks Rise Late Afternoon": 0.5,
  "Utilities Look Cheap. 2 Stocks to Consider Buying.": 0.5,
  "Paychex Inc (PAYX) Q2 2026 Earnings Call Highlights: Strong Revenue Growth Amid Integration ...": 0.8,
  "What New Catalysts Are Shaping the Evolving Narrative for Cisco?": 0.2,
  "Palo Alto Networks (PANW): Evaluating Valuation After New Multibillion-Dollar AI Security Deal With Google Cloud": 0.5,
  "Is Airbnb Still Attractively Priced After Recent Share Price Surge?": 0.2,
  "More Drugmakers Reach Deals With White House to Lower Prices": 0.5,
  "Why Is Lam Research (LRCX) Stock Soaring Today": 0.5,
  "Nine Drugmakers Strike Deals With Trump, With More to Come": 0.5,
  "Trump reaches deal with 9 drug companies to lower prices": 0.8,
  "Lam Research, IBD Stock Of The Day, Hits All-Time High On 2026 Prospects": 0.8,
  "Stock Market Today: Nasdaq Up With Nvidia Among Reinvigorated Tech Names (Live Coverage)": 0.5,
  "Is Spectrum’s Softer Quarter And Underused Network Altering The Investment Case For Charter Communications (CHTR)?": 0.1,
  "AMD, Intel, KLA Corporation, Western Digital, and Nova Stocks Trade Up, What You Need To Know": 0.5,
  "Forget Kraft Heinz: Buy This Unstoppable Consumer Staple Leader Instead": 0.8,
  "2025 retail roundup: The tug-of-war between narrative & numbers": 0.2,
  "Dow Jones' Merck, Other Drugmakers Strike Drug-Pricing Bargains With Trump": 0.5,
  "Datadog (DDOG) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Starbucks (SBUX) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "Why Shopify (SHOP) Outpaced the Stock Market Today": 0.5,
  "Applied Materials (AMAT) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Intuitive Surgical, Inc. (ISRG) Rises Higher Than Market: Key Facts": 0.5,
  "Stock Market Today, Dec. 19: NYSE Halts Infosys Trading After ADRs Spike": -0.5,
  "SoftBank races to fulfill $22.5 billion funding commitment to OpenAI by year-end": 0.5,
  "Universal Studios Looks to Saudi Arabia for New Theme Park": 0.5,
  "Basin rig count down three as prices slide": -0.6,
  "Microchip Technology (MCHP): Reassessing Valuation After Upgraded Guidance and Analyst Targets Meet Softer Chip Sentiment": 0.2,
  "Burlington Stores Offers More Than Coats to Keep Investors Warm This Winter": 0.6,
  "Should GoDaddy’s (GDDY) AI Identity Push Reshape Its Core Competitive Positioning Story?": 0.2,
  "Stock-Split Watch: Is ASML Next?": 0.2,
  "Has Amgen’s 26% Rally in 2025 Already Priced In Its Obesity and Oncology Ambitions?": -0.5,
  "How Investors May Respond To DoorDash (DASH) Embedding Grocery Ordering Into ChatGPT With OpenAI": 0.2,
  "PAYX Q4 Deep Dive: AI Investments and Paycor Integration Shape Outlook Amid Margin Pressures": 0.5,
  "Is Coca-Cola Europacific Partners PLC (AMS:CCEP) Trading At A 21% Discount?": 0.1,
  "125 Crypto Groups Tell Congress Stablecoin Yield Ban Favors Big Banks": -0.5,
  "Citizens Reaffirms Outperform Rating on Shopify (SHOP) as European Share Expands": 0.8,
  "CrowdStrike (CRWD) Price Target Reiterated After Solid Q3 Results": 0.6,
  "Cocoa prices are plunging. Why is chocolate still so expensive?": -0.6,
  "Charter Communications (CHTR): Reassessing Valuation After a Steep Share Price Decline": 0.1,
  "Biohaven (BHVN) Is Down 5.9% After New BHV-1510 Combo Data - What's Changed": -0.5,
  "Xcel Energy (XEL) Sued for ‘Blatant Negligence’ in Wildfire Incident": -0.8,
  "Why Analysts See Western Digital’s Story Shifting With Rising Targets And AI Driven Tailwinds": 0.5,
  "Constellation Energy (CEG) Price Target Raised to $420": 0.6,
  "The Former Ice-Hockey Player Who Nailed This Year’s AI Trade": 0.5,
  "MarketBeat Week in Review – 12/15 - 12/19": 0.0,
  "Is It Too Late To Consider Qualcomm After Its Strong Multi Year Share Price Rally?": 0.2,
  "What PeptiDream (TSE:4587)'s New Oral IL-17 Program and RNAi Milestone Mean For Shareholders": 0.5,
  "Old Dominion Freight Line (NASDAQ:ODFL) Is Investing Its Capital With Increasing Efficiency": 0.8,
  "AppLovin (APP) Is Up 7.6% After Analysts Spotlight AXON Ads And AI Ad Stack Momentum": 0.6,
  "Sandisk Stock Had a Strong Week. Revenue Could Grow 76% in Two Years, This Firm Says.": 0.8,
  "Is Constellation Energy’s Huge Multi Year Rally Still Supported by Its Fundamentals in 2025": 0.2,
  "Ferrovial (BME:FER): Is Nasdaq 100 Inclusion Already Priced Into the Share Price?": 0.1,
  "PDD Holdings (NasdaqGS:PDD): Reassessing Valuation After Leadership Shake-Up and Rising Regulatory Scrutiny": 0.2,
  "Does PACCAR Still Offer Value After 15.6% Monthly Gain And Strong Five Year Rally?": 0.5,
  "Why a Soaring Education Stock at All-Time Highs Drew a New $3.5 Million Investment": 0.8,
  "This Crypto Stock Fell 40% in Weeks but One Investor Has Revealed a New $4.7 Million Bet": 0.2,
  "How Recent Developments Are Reshaping The Xcel Energy Investment Story": 0.5,
  "Is Ross Stores (ROST) Fairly Priced After Its Recent 3-Month Rally? A Fresh Look at Valuation": 0.2,
  "Is Leadership Reshuffle Amid Regulatory Scrutiny Altering The Investment Case For PDD Holdings (PDD)?": 0.1,
  "How Investors May Respond To Xcel Energy (XEL) Wildfire Lawsuit, Bond Buyback and Board Expansion": 0.2,
  "Portfolio recommendations 2026-2030 - Hello! So 2024 and 2025 have been really good years for me growth wise. 100%+ growth 2 years in a row. (Thank you rklb, asts, and eose) I personally dont think my my luck will continue, but I still want to try my best to beat the indexes over the next few years of so. Im looking to shave some positions and reallocate into something new or potentially even ones in": 0.5,
  "Why The Narrative Around Kroger Is Shifting After New Digital Partnership Updates": 0.2,
  "Makers of Everyday Essentials Once Offered Investors Safety. Do They Still?": 0.1,
  "Monolithic Power Systems (NASDAQ:MPWR) Has More To Do To Multiply In Value Going Forward": 0.5,
  "Investing in Workday (NASDAQ:WDAY) three years ago would have delivered you a 33% gain": 0.6,
  "The Bull Case For Graphic Packaging (GPK) Could Change Following CEO Shake-Up And Activist Backlash – Learn Why": 0.2,
  "Jacobio Pharma Enters Global Exclusive License Agreement with AstraZeneca for Pan-KRAS Inhibitor JAB-23E73": 0.8,
  "Stocks enter final stretch of 2025 just off record highs: What to watch this week": 0.5,
  "Denver woman has roaches and bad reviews after renting Airbnb to her hoarder mom. She has 2 options to fix the mess": -0.6,
  "A Note On Exelon Corporation's (NASDAQ:EXC) ROE and Debt To Equity": 0.1,
  "Analog Devices, Inc.'s (NASDAQ:ADI) Stock On An Uptrend: Could Fundamentals Be Driving The Momentum?": 0.5,
  "Intel stock soared in 2025. But the chipmaker still has a long road ahead.": 0.5,
  "Atlassian Corporation (TEAM): BTIG Says AI Disruption Risk Overblown": 0.6,
  "3 Dividend Growth Stocks Analysts Are Upgrading for 2026": 0.5,
  "JPMorgan Maintains Overweight Rating On Constellation Energy Corporation (CEG)": 0.5,
  "Morgan Stanley Lowers Price Objective On Exelon Corporation (EXC)": -0.5,
  "Texas Attorney General Sues Xcel Energy Inc. (XEL) unit over Smokehouse Creek Wildfire": -0.6,
  "Truist and RBC Capital Raise Price Targets on Intuitive Surgical (ISRG)": 0.5,
  "Is Intuit (INTU) One of the Best Large Cap Stocks to Invest In?": 0.5,
  "Moody’s Rating Upgrades MercadoLibre, Inc. (MELI), Here’s Why": 0.6,
  "Wall Street Maintains a Positive Outlook on Marvell Technology (MRVL), Here’s Why": 0.8,
  "Microsoft Corporation (MSFT) and Cognizant Announce a Multi-Year Partnership": 0.5,
  "Where is Taiwan Semiconductor Manufacturing (TSM) Headed According to Analysts?": 0.2,
  "Jim Cramer on Take-Two Interactive: “Strauss Zelnick Will Deliver”": 0.6,
  "Jim Cramer Calls NVIDIA a “Fabulous” Company": 0.8,
  "Jim Cramer Says Applied Materials Is a “Great Long-Term Performer”": 0.8,
  "Jim Cramer on SentinelOne: “You Got to Stick With the High-Quality Ones”": 0.6,
  "Here’s How Axon Shares Can Hit $900 in 2026": 0.6,
  "DoorDash (DASH) Experiments With Standalone AI-powered App for Users to Locate New Restaurants, Reports Bloomberg": 0.5,
  "BofA Reduces PT on Marvell Technology (MRVL) Stock": -0.5,
  "​Wall Street Bullish on Innovative Solutions and Support, Inc. (ISSC) Amid Growing Avionics Opportunities": 0.8,
  "Is MercadoLibre (MELI) One of the Best Stocks to Buy for the Next 5 Years?": 0.6,
  "Cantor Fitzgerald Trims Marvell (MRVL) PT to $100, Cites Neutral Stance Amid AI Expansion": 0.1,
  "DoorDash (DASH) Outlook Tempered by Concerns Over Investment Costs and AI Disruption": -0.5,
  "Where Will Costco Stock Be in 1 Year?": 0.1,
  "What MercadoLibre (MELI)'s Investment Grade Upgrade and Humanoid Robot Deal Mean For Shareholders": 0.2,
  "Assessing Applied Materials Valuation After AI Driven Surge In 2025": 0.5,
  "CrowdStrike (CRWD) Valuation Check After Falcon AIDR Launch, New Partnerships, and Upgraded Guidance": 0.6,
  "Starbucks makes a bold move beyond coffee": 0.5,
  "Analysts Expect Outperformance As NXP Semiconductors (NXPI) Ramps Down Radio Power Line": 0.5,
  "Analysts Bullish on Qualcomm Inc. (QCOM) As It Completes Alphawave Semi Acquisition": 0.8,
  "Is Paychex Offering Value After an 18.9% Slide Amid HR Tech Competition?": -0.5,
  "Peter Thiel Reported To Me, Says Elon Musk, Calls PayPal Exit 'Palace Coup' Fueled By Board: 'There Was Nothing Anyone Could…'": 0.1,
  "Assessing PACCAR (PCAR) Valuation After Its Strong Multi‑Year Share Price Performance": 0.5,
  "Is It Too Late to Consider AppLovin After Its 111.1% 2025 Surge?": 0.2,
  "Costco adds big-name brands, shoppers won’t believe what’s new": 0.6,
  "Niskanen Center Examines American Electric Power Company, Inc. (AEP)’s Place In The US Transmission Grid": 0.0,
  "ServiceNow (NOW) in Focus as Bernstein Calls It the Cheapest Large-Cap Software Name": 0.5,
  "Atlassian (TEAM) Valuation Check After Raised Cloud Outlook and Fresh Analyst Buy Ratings": 0.5,
  "The State of Software Stocks - Software has taken a relative beating this year: while the software ETF, IGV, is up 8%, many stalwart software names like Adobe, ServiceNow, Salesforce, Asana, Workday, and Atlassian are down or treading water at best. **My take is there's opportunity here, as a bunch of these names will return to the premium valuations they used to command. NOW, CRM, INTU, VEEV, CDNS, and SNPS are some ones that look": 0.5,
  "(ITEM 5.02) . DEPARTURE OF DIRECTORS OR CERTAIN OFFICERS; ELECTION OF DIRECTORS; APPOINTMENT OF CERTAIN OFFICERS; COMPENSATORY ARRANGEMENTS OF CERTAIN OFFICERS. As previously reported on the Current Report on Form 8-K filed on July 30, 2025, the Board of Directors (the “Board”) of DexCom, Inc. (“Dexcom” or the “Company”) appointed Jacob S. Leach, President and Chief Operating Officer, as the President and Chief Executive Officer and as a director of the Company, effective January 1, 2026, following": 0.1,
  "(Item 8.01) Other Events. ATM Update On December 22, 2025, Strategy Inc (\"Strategy\") announced an update with respect to sales made under its at-the-market offering program (\"ATM\") of the following securities: During Period December 15, 2025 to December 21, 2025 As of December 21, 2025 Security Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) STRF Stock - $ - $ - $ 1,619.3 10.00% Series A": 0.1,
  "(Item 1.01) Entry into a Material Definitive Agreement. On December 19, 2025, Netflix, Inc. (“Netflix”) successfully replaced a portion of the commitments under its previously disclosed bridge commitment letter with a more permanent and cost effective funding structure, as further described below. Revolving Credit Agreement On December 19, 2025, Netflix entered into a Senior Unsecured Revolving Credit Agreement (the “Revolving Credit Agreement”) with the lenders party thereto and Wells Fargo Bank, National Association, as the administrative agent.\n\n(Item 1.01) of this Current Report on Form 8-K is incorporated by reference herein.": 0.2,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers . On December 18, 2025, Sasan Goodarzi and Richard P. Wong each notified Atlassian Corporation (the “ Company ”) of their respective decisions to retire as a director of the Company, each effective as of January 1, 2026. Neither of their decisions to retire were the result of any disagreement with the Company on any matter": -0.2,
  "(Item 2.02) Results of Operations and Financial Condition As previously announced on October 22, 2025, beginning in the first quarter of 2026, Honeywell International Inc. (the “Company”) intends to realign its business units comprising its Industrial Automation and Energy and Sustainability Solutions reportable business segments. This realignment will result in the formation of a new reportable business segment, Process Automation and Technology, and also result in a new composition of the Industrial Automation reportable business segment. Process\n\n(Item 2.02) , including Exhibit 99.1, should be read in conjunction with the Company's Annual Report on Form 10-K for the year ended December 31, 2024, and the Company's quarterly reports on Form 10-Q for the quarterly periods ended March 31, 2025, June 30, 2025, and September 30, 2025. The information furnished pursuant to this\n\n(Item 2.02) , including Exhibit 99.1 in\n\n(Item 8.01) Other Events As previously disclosed, on March 1, 2023, Flexjet, LLC (“Flexjet”) brought suit against the Company, alleging breach of the parties’ aircraft engine maintenance service agreement and seeking liquidated damages for delayed engine repairs. Flexjet provides private jet services to customers, and the Company maintains aircraft engine maintenance service contracts with Flexjet. The Company is providing an update with respect to the previously disclosed Flexjet-related litigation matters. The Company is in ongoing settlement negotiations\n\n(Item 2.02) hereof). 104 Cover Page Interactive Data File (the cover page XBRL tags are embedded within the Inline XBRL document).": 0.1,
  "(Item 8.01) . Other Events. On December 22, 2025, Cintas Corporation (the “Company” or “Cintas”) issued a press release confirming that it delivered to the Board of Directors of UniFirst Corporation (“UniFirst”) a proposal to acquire all of the outstanding common and class B shares of UniFirst for $275.00 per share (the “Proposal”) in cash. A copy of the press release, attached hereto as Exhibit 99.1, and the accompanying presentation slides, attached hereto as Exhibit 99.2, are": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Resignation of Chief Executive Officer and Director On December 19, 2025, Daniel L. Florness, the Chief Executive Officer ('CEO') of Fastenal Company ('Fastenal') and a director of Fastenal's Board of Directors (the 'Board'), submitted a letter to the Board advising them of the following: (1) Mr. Florness' decision to voluntarily step out of his role as\n\n(Item 5.02) , a copy of which is furnished with this Current Report on Form 8-K as Exhibit 99.1, which is incorporated by reference herein. The information in this": -0.2,
  "Before You Buy the Dip on Costco Stock, Here Are 3 Things to Watch in 2026": 0.1,
  "3 Reasons to Buy Luckin Coffee Stock in 2026": 0.5,
  "Is ASML (NasdaqGS:ASML) Overvalued After Its Strong Year-to-Date Rally?": -0.5,
  "Dow Jones Futures Rise; Palantir, GE Lead 12 Stocks In Buy Zones": 0.5,
  "Jacobio Strikes New Cancer Drug Deal with AstraZeneca": 0.5,
  "2 Cash-Heavy Stocks with Exciting Potential and 1 We Brush Off": 0.6,
  "2 Large-Cap Stocks Worth Investigating and 1 We Find Risky": 0.2,
  "1 Volatile Stock for Long-Term Investors and 2 Facing Headwinds": -0.5,
  "1 Cash-Producing Stock Worth Investigating and 2 Facing Headwinds": 0.2,
  "3 Volatile Stocks Walking a Fine Line": -0.5,
  "1 Safe-and-Steady Stock on Our Watchlist and 2 We Turn Down": 0.0,
  "2 Cash-Producing Stocks to Consider Right Now and 1 We Find Risky": 0.5,
  "Medtronic’s diabetes spinoff MiniMed files for IPO": 0.5,
  "Faron Announces Strategic Collaboration with The Institute for Cancer Research to Launch BLAZE Trial, Targeting Immunotherapy Resistance in Cancer": 0.8,
  "ENHERTU® Granted Breakthrough Therapy Designation in the U.S. as Post-Neoadjuvant Therapy for Patients with HER2 Positive Early Breast Cancer": 0.6,
  "AstraZeneca Drug Combination Falls Short of Goal in Lung-Cancer Trial": -0.7,
  "2 Top Stocks to Buy and Hold for the Long Term": 0.5,
  "Billionaire Stanley Druckenmiller Sells Broadcom Stock and Buys an Overlooked Stock Up 6,910% Since Its IPO": 0.8,
  "This Former Ice-Hockey Pro Nailed the AI Trade": 0.6,
  "Adobe (ADBE): Reassessing Valuation After New Runway AI Video Partnership and Creative Cloud Push": 0.5,
  "Western Digital (WDC) Soars 3.5%: Is Further Upside Left in the Stock?": 0.6,
  "Starbucks hires technology chief from Amazon": 0.5,
  "Palo Alto Networks, Google Cloud partner to enhance AI and cloud security": 0.6,
  "Prediction: These Could Be the Biggest Stock-Split Winners of 2026": 0.5,
  "Earnings Preview: What to Expect From Seagate Technology's Report": 0.5,
  "Costco vs. Walmart: Which Retail Giant Should You Buy?": 0.2,
  "Jefferies Upgrades KLA (KLAC) to Buy, Sees Run Just Beginning": 0.8,
  "Lam Research (LRCX) Surges 4.6%: Is This an Indication of Further Gains?": 0.6,
  "Cadence Design Systems (NASDAQ:CDNS) Seems To Use Debt Rather Sparingly": 0.5,
  "Does Keurig Dr Pepper Inc.'s (NASDAQ:KDP) Weak Fundamentals Mean That The Stock Could Move In The Opposite Direction?": 0.1,
  "HONEYWELL PROVIDES SUPPLEMENTAL FINANCIAL INFORMATION FOR PLANNED SEGMENT REALIGNMENT; ADJUSTS OUTLOOK TO EXCLUDE ADVANCED MATERIALS": 0.1,
  "Market Chatter: SoftBank Racing to Fulfill $22.5 Billion Funding Commitment to Microsoft-Backed OpenAI by End of Year": 0.5,
  "Li Auto And 2 More Growth Companies With Strong Insider Confidence": 0.6,
  "Undervalued Equities That May Offer Value In December 2025": 0.5,
  "US High Growth Tech: 3 Stocks to Watch": 0.5,
  "Honeywell expects $470 million charge from Flexjet settlement": -0.5,
  "SoftBank races to fulfill $22.5 billion funding deal with OpenAI, sources": 0.2,
  "ENHERTU® (fam-trastuzumab deruxtecan-nxki) granted Breakthrough Therapy Designation in the US as post-neoadjuvant therapy for patients with HER2-positive early breast cancer": 0.5,
  "Positioning for a Big Move: ABNB Long Straddle Trade Idea": 0.5,
  "Marvell Technology, Inc. (NASDAQ:MRVL) is favoured by institutional owners who hold 83% of the company": 0.6,
  "Illumina (ILMN) Surges 3.3%: Is This an Indication of Further Gains?": 0.6,
  "Warren Buffett Departs With 64% of Berkshire Hathaway in 5 Stocks to Hold Forever": 0.5,
  "“We’re Gonna See Western Digital (WDC) Go Up,” Says Jim Cramer": 0.6,
  "“We’re Gonna See Seagate (STX) Go Up,” Says Jim Cramer": 0.6,
  "Stocks Rise Pre-Bell Ahead of Holiday-Shortened Trading Week": 0.5,
  "This Year’s Best Growth Stock Isn’t What You Think It Is": 0.5,
  "Global $31.45 Billion Wireless Mesh Network Market Outlook, 2025-2032 Featuring Strategic Analysis of Cisco Systems, Hewlett Packard, Fortinet, Extreme Networks, NETGEAR and Other Key Players": 0.5,
  "This Week In Digital Payment - Euronet Wins Mastercard Award for Agile Credit Innovation": 0.6,
  "Intuit CFO: Stablecoins are the new ‘digital dollar’ rail": 0.5,
  "Cintas Proposes to Acquire UniFirst for $275.00 Per Share in Cash": 0.5,
  "ASML reports transactions under its current share buyback program": 0.0,
  "Fastenal Announces CEO Transition": 0.0,
  "Gilead Sciences Exercises Option to License Assembly Biosciences’ Helicase-Primase Inhibitor Programs for Recurrent Genital Herpes": 0.5,
  "Lam Research Hits 52-Week High: Is the Stock Still Worth Buying?": 0.5,
  "Baker Hughes to Supply Liquefaction Equipment for Commonwealth LNG Export Project": 0.5,
  "NVDA vs. AMAT: Which Semiconductor Stock Is the Better Buy Now?": 0.5,
  "Can Completion of Qualcomm's Alphawave Buyout Deal Propel Its Shares?": 0.2,
  "Tesla, UniFirst, Clearwater jump premarket; Honeywell slips": 0.2,
  "Drug Sector on a High as 9 Drugmakers Strike Drug Pricing Deals": 0.6,
  "Wall Street Firms Cut Adobe Inc. (ADBE) Price Target but Tout Revenue Growth and Long-term Outlook": 0.5,
  "England High Court  Sanctions QUALCOMM Incorporated (QCOM)’s Alphawave IP Group Acquisition": 0.5,
  "Is KLA Corporation (KLAC) One of the Best Forever Stocks to Buy According to Hedge Funds?": 0.5,
  "Morgan Stanley Upgrades DexCom (DXCM), Cites Undervalued Recovery and G7 Margin Potential": 0.8,
  "BMO Capital Sees Impressive Guidance and Construction Cloud Momentum at Autodesk (ADSK)": 0.8,
  "Xcel Energy Announces Upsizing and Results of Cash Tender Offers for Certain Outstanding First Mortgage Bonds Issued by Northern States Power Company (a Minnesota corporation)": 0.1,
  "1 Surprising Chip Stock Every Investor Should Own In 2026": 0.5,
  "Honeywell Lowers 2025 Outlook Following Advanced Materials Business Unit Spinoff": -0.5,
  "Permian Operations to Drive Resilience for These 3 Oil Stocks in 2026": 0.5,
  "CSX Corp. Announces Date for Fourth Quarter Earnings Release and Earnings Call": 0.0,
  "Unloved Energy Bet Is Set to Become Most Profitable Private-Equity Deal Ever": 0.8,
  "Investors Heavily Search Comcast Corporation (CMCSA): Here is What You Need to Know": 0.5,
  "Here is What to Know Beyond Why Cisco Systems, Inc. (CSCO) is a Trending Stock": 0.2,
  "T-Mobile US Insiders Sell US$15m Of Stock, Possibly Signalling Caution": -0.5,
  "The Real Winner From Latin America’s Retail Boom": 0.5,
  "The Global X MSCI Argentina ETF Has Had A Shockingly Good 200% Run": 0.8,
  "Buy 3 AI Semiconductor Powerhouses Poised to Dominate 2026": 0.5,
  "Renewed AI Chip Enthusiasm Boosts US Equity Futures While War Jitters Lift Oil": 0.6,
  "Zacks Industry Outlook Highlights Vertiv, Cognizant Technology Solutions and EPAM Systems": 0.5,
  "Paychex (PAYX) Reports Q2 Earnings: What Key Metrics Have to Say": 0.2,
  "ASML (ASML) Recently Broke Out Above the 50-Day Moving Average": 0.5,
  "Brokers Suggest Investing in Lam Research (LRCX): Read This Before Placing a Bet": 0.5,
  "Gilead Sciences Exercises Option With Assembly Bio to License Herpes Drugs": 0.5,
  "The Zacks Analyst Blog Highlights Constellation Energy, Talen Energy and Dominion Energy": 0.5,
  "PANW Deepens Ties With Google: Will This Enhance Prisma AIRS Adoption?": 0.5,
  "Circle CEO Jeremy Allaire shares his 10-year vision: We want to be foundational to the internet": 0.6,
  "MU hits another record high how long can this rally last? - I've held MU for nearly nine months, and it's delivered solid returns. After ORCL and AVGO released their earnings reports, MU's stock price kept falling. At that point, I debated whether to reduce my position, but since MU's earnings were coming up soon, I decided to wait it out. Fortunately, MU's earnings didn't disappoint the stock surged after the report and hit new": 0.6,
  "The Zacks Analyst Blog Highlights Kraft Heinz, Delta Air Lines, FedEx, United Natural Foods and LATAM Airlines": 0.5,
  "Baird Reaffirms Buy on Intuitive Surgical (ISRG) After New FDA Clearances": 0.8,
  "Constellation Energy (CEG): Analyst Target Cut, Major Award, and Landmark Acquisition": 0.5,
  "UBS Reaffirms Buy on Linde (LIN) at $500, Sees 10%+ EPS Growth": 0.8,
  "UBS, Citi Raise Baker Hughes (BKR) Targets Ahead of Energy Recovery": 0.6,
  "Wall Street Analysts See a 44.75% Upside in Atlassian (TEAM): Can the Stock Really Move This High?": 0.5,
  "Business lessons of 2026 from Airbnb, Meta, LinkedIn, and more": 0.5,
  "Comcast Business Caps 2025 with Unprecedented Wave of Analyst Recognition for Enterprise Managed Services and Secure Networking Leadership": 0.6,
  "Are CrowdStrike's Expanding Partnerships a Catalyst for Future Growth?": 0.5,
  "My take on TSM for the long run - Last night I was chatting with some friends about TSM and looking at it as a long term hold and I wanted to hear what everyone else thinks TSM is still the clear king of pure foundry especially in advanced nodes like 5nm and 3nm where basically no one can really touch them Demand from high performance computing and data centers is pushing it forward like": 0.6,
  "AZN, Daiichi's Enhertu Gets Breakthrough Tag for Expanded Cancer Use": 0.5,
  "Year-End Window Dressing? 3 Stocks Funds May Buy Late in 2025": 0.2,
  "UniFirst Confirms Receipt of Unsolicited, Non-Binding Proposal from Cintas Corporation": 0.2,
  "Cintas Reiterates $275-Per-Share Bid to Acquire UniFirst": 0.5,
  "Question about maxing Roth contribution before year end - If I transfer the money into my Roth but don't buy anything by the end of the year, am I still able to contribute to the limit again next year? Have like 3k left to invest from 2025, but everything is so high that I'm hesitant to jump in. If I have to buy in, any fun suggestions? Is SOFI still a good speculative bet? VOO": 0.2,
  "Microchip (MCHP) Target Up as Mizuho Turns Selective on Chips": 0.5,
  "MELI vs. JD: Which Global E-commerce Stock Has More Upside?": 0.2,
  "BMNR Stock Up 612.7% in 6 Months: Should You Still Buy It in 2026?": 0.5,
  "BofA Sees 2026 as Midpoint of AI Infrastructure Cycle, Lifts TXN Target": 0.5,
  "SoftBank Races to Finalize $22.5B OpenAI Investment by Year-End": 0.5,
  "Morgan Stanley Sees Cisco (CSCO) Benefiting From AI Infrastructure Demand": 0.6,
  "A comprehensive list of 2025 tech layoffs": -0.5,
  "Applied Materials (AMAT) Target Raised, but Mizuho Flags China and Intel Risks": -0.5,
  "Keeping Communities Connected When It Matters Most": 0.8,
  "DoorDash Is Getting into the AI Game. Should You Buy DASH Stock Here": 0.5,
  "Cintas Isn’t Taking Years of No for an Answer, Makes Fresh Bid for UniFirst": 0.2,
  "Alphabet to acquire data center and energy infrastructure company Intersect - Google parent [Alphabet](https://www.cnbc.com/quotes/GOOGL/) on Monday [announced](https://abc.xyz/investor/news/news-details/2025/Alphabet-Announces-Agreement-to-Acquire-Intersect-to-Advance-U-S--Energy-Innovation-2025-DVIuVDM9wW/default.aspx) it will acquire Intersect, a data center and energy infrastructure company, for $4.75 billion in cash in addition to the assumption of debt. Alphabet said Intersect’s operations will remain independent, but that the acquisition will help bring more data center and generation capacity online faster. “Intersect will help us expand capacity, operate more nimbly in building new power": 0.5,
  "TSLA hits new highs can it break through the $500 mark before Christmas? - Tesla hit another all time high today, briefly surpassing $498 during trading just a hair's breadth away from the $500 mark. I believe the key catalysts are:Market perception of Robotaxi road testing and autonomous driving progress as tangible long term growth potential,Alongside emotional support from the CEO's legal and incentive developments. Do you think TSLA can break through $500 before Christmas?": 0.6,
  "Monster Beverage Positioned for Sustainable High Growth Versus Peers, Morgan Stanley Says": 0.8,
  "Paychex Faces Softer Revenue Trends, Paycor Reacceleration Risk, Morgan Stanley Says": -0.5,
  "DoorDash vs. Shopify: Which E-Commerce Stock Has an Edge Now?": 0.2,
  "$MU post-ER:directional vs neutral option setups - MU just posted a strong earnings and guidance update driven by AI and data center memory demand The stock ripped after earnings and the overall story is clearly bullish but from an options standpoint I am trying to figure out the best risk reward after such a big move A few things on my mind Post earnings IV crush has probably already played out Near term upside feels": 0.6,
  "Top Midday Stories: Nvidia Said to Start H200 Shipments to China by Mid-February; Alphabet to Buy Intersect for $4.75 Billion": 0.5,
  "3 Must-Watch 5G Stocks Poised for the Next Growth Wave in 2026": 0.6,
  "Boyar Value Group Urges UniFirst Board to Immediately Initiate Strategic Review Following 60%+ Premium Offer": 0.5,
  "Technip Energies awarded a large authorization by Commonwealth LNG for key equipment purchase orders": 0.6,
  "There's a Growth Stock Trading at Value Prices": 0.5,
  "Roblox Stock Down 38% in 3 Months: Buy the Dip or Sell More?": -0.6,
  "Reasons to Hold MSTR Stock Despite a 50% Decline in 3 Months": 0.5,
  "Crude Oil Prices Higher on Venezuelan and Ukraine-Russia Risks": 0.5,
  "PayPal (PYPL)’s “Going Lower, Maybe Much Lower,” Says Jim Cramer": -0.6,
  "Is PepsiCo's Protein and Prebiotic Push a New Functional Edge?": 0.2,
  "Discover 3 Elite Growth Stocks With Significant Insider Ownership": 0.5,
  "3 Stocks Estimated To Be Trading Below Their Intrinsic Value In December 2025": 0.5,
  "Is Lam Research (LRCX) a Solid Growth Stock? 3 Reasons to Think \"Yes\"": 0.6,
  "SoftBank Races to Secure $22.5 Billion OpenAI Funding by Year-End": 0.5,
  "Microsoft, Salesforce and Oracle Named Top Software Picks for 2026": 0.8,
  "INTC: Intel Foundry Push and Nvidia Backing Could Drive 2026 Growth": 0.6,
  "Mondelez (MDLZ) Valuation Check After Recent Share Price Pullback": 0.2,
  "Sector Update: Consumer Stocks Mixed Monday Afternoon": 0.0,
  "Palo Alto Networks Stock Is Down But Not Out - Worth Buying PANW Here?": 0.5,
  "Un-carrier Unwrapped 2025": 0.0,
  "The world’s largest chain has made its U.S. debut": 0.5,
  "Sector Update: Energy Stocks Gain Monday Afternoon": 0.5,
  "Equity Markets Rise Intraday; Gold, Silver Reach New Highs": 0.5,
  "Dominion wind farm project on pause, Honeywell cuts Q4 outlook": -0.5,
  "MU hits a new all-time high .what’s driving it? - Micron MUUS is up over 4 percent in pre market hitting 27729 a fresh all time high Here’s what’s fueling the rally Huatai Securities keeps a Buy rating and raised the target to 360 FY26 Q1 revenue and profits beat expectations thanks to AI driven demand for HBM and DRAM pushing margins higher Capex bumped to 20B HBM4 yield ramping faster and SOCAMM2 advantage is": 0.8,
  "Coeur Mining - What do you guys think of CDE? So far, it has seen some unbelievable growth this past year. Here are the four main bullish points I found: **1. Improved Financials & Cash Flow** * Better cost control and stronger operating cash flow. * Ongoing debt reduction improves balance-sheet health. * Increased ability to fund growth internally. **2. Production Growth & Asset Base** * Multiple producing mines provide diversification. * Expansion projects are": 0.8,
  "Looking for feedback - DIS to NFLX - I’ve held DIS since 2019, averaged down in 2021–2022, but my thesis hasn’t played out, which put me underwater on this pick. At this point, I don’t see a clear path for Disney to outperform, especially with streaming still pressuring margins and parks carrying earnings. I’m thinking of selling out of DIS entirely and rotating the capital to NFLX, making it a larger holding. Netflix has shown": -0.6,
  "NVIDIA & 2 More Profitable S&P 500 Stocks to Buy Before 2026": 0.5,
  "UniFirst (UNF) Stock Trades Up, Here Is Why": 0.5,
  "Can Shopify (SHOP) Turn Agentic AI and Sustainability Bets Into Durable Platform Advantage?": 0.5,
  "56-year-old fast-food seafood chain closed over 800 restaurants": -0.8,
  "Crude Oil Prices Higher on Oil Tanker Disruptions": 0.5,
  "Bitcoin $200K In 2026? Maybe. Probably, According to These Analysts.": 0.5,
  "Bitcoin slips below $88,000 as traders brace for $28.5 billion Deribit options expiry": -0.5,
  "Sector Update: Consumer Stocks Mixed Late Afternoon": 0.0,
  "Stock Market Today: Dow Ends Higher; Trump Takes The Wind Out Of This Name (Live Coverage)": 0.1,
  "Sector Update: Energy Stocks Rise Late Afternoon": 0.5,
  "Vertex to Present at the 44th Annual J.P. Morgan Healthcare Conference on January 12": 0.2,
  "2026 Travel Takes Off: Falling Prices and Global Events Push New Cities Into the Spotlight, per KAYAK Data": 0.5,
  "The Biggest Bitcoin and Crypto Treasury Plays of 2025": 0.5,
  "Gilead Sciences to Present at Upcoming Investor Conference": 0.0,
  "Regeneron Announces Presentation at the 44th Annual J.P. Morgan Healthcare Conference": 0.5,
  "Western Digital (WDC): Assessing Valuation After a Powerful Rebound in Share Price": 0.5,
  "Honeywell Stock Is Down on a Litigation Charge. Why It Shouldn’t Be.": 0.5,
  "Interface Stock Is Up 14% but Here's Why This Fund Just Cut $2.4 Million": -0.5,
  "1 Stock I'd Buy Before Costco (COST) in 2026": 0.2,
  "Is It Time to Take Profits on These 2025 Winners?": 0.2,
  "Wall Street Advances as Holiday-Shortened Trading Week Begins; Gold, Silver Hit Record Highs": 0.7,
  "Stocks to Watch Monday Recap: Tesla, Rocket Lab, UniFirst, Clearwater Analytics": 0.2,
  "Stocks Advance Toward Records in Broad Rally": 0.8,
  "Saylor’s Strategy Raises Reserve, Pauses Bitcoin Purchases": 0.1,
  "Lam Research (LRCX) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Palo Alto Networks (PANW) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Airbnb, Inc. (ABNB) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "AppLovin (APP) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Fortinet (FTNT) Outperforms Broader Market: What You Need to Know": 0.6,
  "Amgen (AMGN) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Paccar (PCAR) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Kraft Heinz (KHC) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "TSM vs Broadcom stuck between these two and looking for opinions. - I’ve been diving into TSMC (Taiwan Semiconductor) and Broadcom lately, and honestly, the more I look into both, the harder it gets to choose. They each have some solid advantages. On one hand, Broadcom's recent partnership with OpenAI really stood out to me, especially with their work on custom AI chips and the potential for long-term growth. On the other hand, TSMC’s position": 0.5,
  "Arm Holdings (ARM): Revisiting Valuation After a Recent 20% Share Price Slide": 0.1,
  "Could Booking’s Cost Cuts and Connected Trip Push Outweigh Rising EU Legal Risks for BKNG?": 0.2,
  "Warner Bros. Discovery Confirms Receipt of Amended, Unsolicited Tender Offer from Paramount Skydance": 0.1,
  "Honeywell International Inc. (HON) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "ADBE pullback still needs confirmation. - The recent pullback in ADBE looks more like a normal reset in sentiment and valuation rather than any real deterioration in the underlying business. The core fundamentals remain intact, with a stable subscription model, solid cash flow, and strong product stickiness. This is not a name that suddenly became structurally broken. That said, from a trading perspective, this is also not a high conviction entry yet. The short term": 0.5,
  "Why a Uniform Maker's Stock Soared 16% Monday": 0.6,
  "Larry Ellison Provides Personal Guarantee for Paramount’s Bid for Warner": 0.5,
  "(Item 5.07) Submission of Matters to a Vote of Security Holders. On December 22, 2025, Electronic Arts Inc. (“Electronic Arts” or the “Company”) held a special meeting of stockholders (the “Special Meeting”) in connection with the proposed acquisition of the Company by an investor consortium comprised of The Public Investment Fund, private investment funds affiliated with Silver Lake Group, L.L.C. and private investment funds affiliated with Affinity Partners, as disclosed in the Company’s definitive proxy statement filed": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On December 19, 2025, Comcast Corporation (the “Company”) entered into a new employment agreement (the “Agreement”) with Michael J. Cavanagh in connection with his upcoming appointment as Co-Chief Executive Officer of the Company on January 2, 2026. The Agreement secures Mr. Cavanagh’s employment through January 1, 2029. Under the terms of the Agreement, Mr. Cavanagh will": 0.2,
  "(Item 8.01) . Other Events On December 23, 2025, Constellation Energy Generation, LLC (“Constellation”) announced that it has extended the expiration date of (A) its previously announced private offers to exchange any and all of the outstanding (i) 4.625% Senior Unsecured Notes due 2029 (“Existing Unsecured 2029 Notes”), (ii) 5.000% Senior Unsecured Notes due 2031 (“Existing Unsecured 2031 Notes”) and (iii) 3.750% Senior Secured Notes (“Existing Secured 2031 Notes” and, together with the Existing Unsecured 2029 Notes": 0.1,
  "Dow Jones Futures: Nvidia Tests Key Level; AppLovin, Apple, Palantir, Tesla In Buy Zones": 0.5,
  "MU closed strong today, rotation into memory finally starting? - MU just popped \\~4% on decent volume, and this feels more structural than your typical intra-day swing. The broader semiconductor group has been lagging AI “pure plays,” but memory names had been oversold relative to both Nvidia and the rest of the chip complex. Today’s strength suggests some rotation may finally be happening. There are a few catalysts behind this move: signs of improving memory": 0.8,
  "Review Preview: Festive Vibes": 0.5,
  "Generative Renaissance Comes Alive: SIGGRAPH Asia 2025 Closes in Hong Kong": 0.6,
  "Low cost trading platform recommendations? - I’ve been reading more about how the stock market works and I'm interested in getting started with investing. Do you have any recommendations for low cost platforms I could use to begin? Will certainly research more on the recommendations provided I’m only curious to know which are most commonly used Big thanks in advance to those who leave an insight": 0.5,
  "New LNG and Kuwait Contracts Might Change The Case For Investing In Baker Hughes (BKR)": 0.2,
  "Why Unifirst Stock Crushed the Market Today": 0.5,
  "Vertex Pharmaceuticals (VRTX): Valuation Check After Positive CASGEVY Pediatric Data and Kidney Disease Breakthrough Progress": 0.8,
  "Netflix in 2026: The Three Things Investors Should Watch Closely": 0.2,
  "Agoda Insights Reveal Business Impact of Localization Across Asia's Rapidly Growing Tourism Sector": 0.5,
  "Baker Hughes (BKR): Assessing Valuation After New LNG Contract Win and Analyst Upgrades": 0.5,
  "Is It Too Late To Consider Marriott After Its Strong Multi Year Share Price Rally?": 0.2,
  "Cognizant (CTSH) Valuation Check After New AI Partnerships and India Innovation Lab Expansion": 0.5,
  "3 Reasons We’re Fans of Datadog (DDOG)": 0.5,
  "2 Nasdaq 100 Stocks with Exciting Potential and 1 We Brush Off": 0.6,
  "2 Growth Stocks to Add to Your Roster and 1 We Ignore": 0.5,
  "3 S&P 500 Stocks We Steer Clear Of": -0.5,
  "1 of Wall Street’s Favorite Stock to Research Further and 2 We Turn Down": 0.2,
  "3 Mid-Cap Stocks We’re Skeptical Of": -0.5,
  "2 Cash-Producing Stocks with Competitive Advantages and 1 We Avoid": 0.2,
  "1 Cash-Producing Stock Worth Your Attention and 2 Facing Headwinds": 0.2,
  "3 Cash-Producing Stocks We Steer Clear Of": -0.5,
  "1 Mooning  Stock Worth Your Attention and 2 We Ignore": 0.2,
  "1 Cash-Heavy Stock for Long-Term Investors and 2 We Avoid": 0.5,
  "Backed by ‘Bank of Dad,’ Paramount Makes Another Push For Warner Bros. Discovery": 0.2,
  "‘Vortex of Volatility’ Kept 2025 Dealmaking From Breaking Records": -0.5,
  "US public companies got halved since the 90s and retail cant catch the next NVDA early anymore - Back in the late 90s we had over 8000 listed companies, now its down to around 4000. Happened cuz regulations went nuts after Sarbanes-Oxley, small companies cant afford all the compliance crap. Private money is everywhere too, VCs and PE sitting on piles of cash so good startups just stay private forever. Big corps also scoop up": -0.6,
  "Jim Cramer on Costco: “We Did Not Like the Way the Conference Call Went When They Reported Last”": -0.6,
  "Jim Cramer Says “I Own Apple, and I Say Own it, Don’t Trade It”": 0.6,
  "SailPoint, Inc (SAIL) Integrates Its Identity Security Cloud with the CrowdStrike’s Falcon": 0.5,
  "Press Release: Sanofi and Regeneron’s Dupixent approved in Japan for children aged 6 to 11 years with bronchial asthma": 0.5,
  "Dupixent® (dupilumab) Approved in Japan for Children Aged 6 to 11 Years with Bronchial Asthma": 0.5,
  "Is It Too Late To Consider Baker Hughes After Its Strong Multi Year Share Price Run?": 0.2,
  "BMO Stays Outperform on Adobe (ADBE) Despite Competitive AI Pressures": 0.5,
  "Cantor Sees Long-Term Upside for Palo Alto Networks (PANW) on AI-Era Security": 0.6,
  "Timeshares Have Made a Comeback. Can Their Stocks?": 0.1,
  "BTIG Sees Expanding TAM and Margin Upside for Autodesk (ADSK)": 0.6,
  "AZN, Daiichi's Enhertu Gets FDA Nod for First-Line Breast Cancer (Revised)": 0.5,
  "Should Solstice’s Shift Into Mid and Small‑Cap Indexes Reshape the Core Investment Case for SOLS?": 0.2,
  "Which Robotics Companies currently fly under the radar / are cheap / should be on the watchlist during a markt pullback? - AI & Space are getting a lot of hype. Although gains are still very well possible in these areas, I would also diversify a bit towards another big theme for the coming years - Robotics. There is obviously the debate with TSLA, but I prefer XPEV for that. My exposure with Chinese stocks": 0.2,
  "Retail Stocks Could Get a Tax Refund Boost in 2026": 0.5,
  "GDP, Consumer Confidence, Jobless Claims: What to Watch Through Year-End": 0.2,
  "Is Monster Beverage’s 2025 Surge Justified After Strong Cash Flows and New Product Launches?": 0.5,
  "The 3 Best Stocks to Buy With $100 Right Now. Wall Street Says They Could Soar in 2026.": 0.8,
  "Global Markets Mixed Ahead of Delayed U.S. Data Release": 0.0,
  "What to Expect From CSX’s Q4 2025 Earnings Report": 0.0,
  "Intuitive Surgical Earnings Preview: What to Expect": 0.2,
  "How Investors Are Reacting To Monster Beverage (MNST) Upbeat Sales Sentiment And Coca-Cola Expansion Partnership": 0.6,
  "DoorDash (DASH) Valuation Check After New OpenAI-Powered Grocery Ordering Launch": 0.2,
  "Is Netflix Still Attractive After Password Crackdown and Ad Tier Push in 2025?": -0.5,
  "US Stock Market Today: S&P 500 Futures Flat amid Slowing Growth, High-Rate Jitters": -0.5,
  "MSTR Stock Recovery Can Begin Anytime as Institutional Demand Jumps": 0.8,
  "Why Tom Lee just bought $421m Ethereum despite the tanking market": 0.2,
  "Strategy's increased dollar buffer covers more than 2 years of dividend obligations": 0.8,
  "Palo Alto Networks, Inc. (NASDAQ:PANW) Shares Could Be 23% Below Their Intrinsic Value Estimate": -0.7,
  "Texas Instruments (NASDAQ:TXN) Might Be Having Difficulty Using Its Capital Effectively": -0.6,
  "Bitcoin Snubbed By Santa Rally As Strategy Braces For Storm": -0.5,
  "AstraZeneca (LSE:AZN): Rethinking Valuation After a Strong Share Price Climb": 0.5,
  "What is the China upside potential for Nvidia and AMD?": 0.2,
  "S&P Futures Muted With U.S. GDP Data in Focus": 0.0,
  "TransUnion Appoints Sayan Chakraborty and Charlotte Yarkoni to its Board of Directors": 0.5,
  "TSMC Extends Foundry Lead in Q3": 0.5,
  "Netflix Tweaks $59 Billion Warner Deal Debt": 0.1,
  "Spotlighting 3 Growth Companies With Strong Insider Ownership": 0.5,
  "Exploring US High Growth Tech Stocks In December 2025": 0.5,
  "Gold Has Shone Through Tariffs, AI Fears, Global Risk. Why 2026 Looks Bright.": 0.8,
  "CrowdStrike Looks Unstoppable—But Has the Market Priced It In?": 0.2,
  "Monster Beverage (MNST) Valuation Check as Coca-Cola Partnership and Strong Western Sales Lift Optimism": 0.8,
  "Global AI Chips Market Analysis Report 2025-2035 Featuring Profiles of Key Players - Amazon, Gyrfalcon Technology, Huawei Technologies, Intel, Nvidia, NXP Semiconductors, Wave Computing and More": 0.5,
  "AI-Driven Cybersecurity Boom Makes These 4 Stocks Worth Buying": 0.6,
  "PYPL, DJT, MU And More: 5 Stocks Investors Couldn't Stop Buzzing About This Week": 0.5,
  "Market Chatter: Paramount's Latest Offer for Warner Bros. Discovery Still Insufficient for Harris Oakmark": 0.1,
  "Qolab Concludes 2025 with Key Strategic Collaborations to Advance Quantum Hardware": 0.6,
  "Constellation Announces Extension of Expiration for Private Exchange Offers and Consent Solicitations and Early Tender Results": 0.0,
  "Shareholders in Comcast (NASDAQ:CMCSA) are in the red if they invested five years ago": -0.8,
  "With 78% institutional ownership, Honeywell International Inc. (NASDAQ:HON) is a favorite amongst the big guns": 0.6,
  "Is Cisco Still Attractively Priced After Its Strong Multi Year Share Price Rally": 0.5,
  "Parnassus Core Equity Fund Sold Intuit (INTU) After Share Price Appreciation": 0.2,
  "Holiday Sales Boom: 4 Retail Stocks Ready for 2026 Gains": 0.8,
  "ADP National Employment Report Preliminary Estimate December 6, 2025": 0.0,
  "The 3 Fastest-Growing Stocks Heading Into 2026": 0.5,
  "WWD Stock Appreciates 85% in 12 Months: What's Triggering the Uptrend?": 0.8,
  "O’Reilly Automotive’s (ORLY) Professional Segment Lifted the Stock in Q3": 0.5,
  "CLS Rides on Steady Revenue Growth: Will the Uptrend Persist?": 0.6,
  "Could 2026 Be the Year Palantir Stock Hits a $1 Trillion Valuation?": 0.6,
  "Is Trending Stock Intuitive Surgical, Inc. (ISRG) a Buy Now?": 0.2,
  "Investors Heavily Search Zscaler, Inc. (ZS): Here is What You Need to Know": 0.5,
  "Palantir Technologies Inc. (PLTR) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Investors Heavily Search Micron Technology, Inc. (MU): Here is What You Need to Know": 0.5,
  "Vertex Pharmaceuticals Incorporated (VRTX) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Is Most-Watched Stock Strategy Inc (MSTR) Worth Betting on Now?": 0.2,
  "Is Most-Watched Stock Applied Materials, Inc. (AMAT) Worth Betting on Now?": 0.2,
  "Should You Be Adding Roper Technologies (NASDAQ:ROP) To Your Watchlist Today?": 0.5,
  "NXP Semiconductors' (NASDAQ:NXPI) investors will be pleased with their favorable 54% return over the last three years": 0.8,
  "Lam Research (LRCX) Is Up 7.4% After AI-Driven Equipment Demand Lifts Margins And Outlook Narrative": 0.6,
  "Can MercadoLibre's GMV Momentum Drive Further Upside in the Stock?": 0.2,
  "Is It Worth Investing in Intuit (INTU) Based on Wall Street's Bullish Views?": 0.5,
  "Naughty Ventures Acquires Claims Adjacent to Q2 Metals Cisco Lithium Discovery in Quebec": 0.5,
  "4 Memorable Ways to Play the HBM Market Boom": 0.5,
  "Here’s Why Qualivian Investment Partners Decided to Sell Copart (CPRT)": 0.1,
  "Zacks.com featured highlights include NVIDIA, Micron Technology and Seagate Technology": 0.5,
  "Why Cognizant (CTSH) is a Top Momentum Stock for the Long-Term": 0.6,
  "Zacks Industry Outlook Highlights Exxon Mobil, Halliburton, Baker Hughes and Oceaneering International": 0.5,
  "Got $5,000? 3 Tech Stocks to Buy and Hold for the Long Term": 0.5,
  "3 Cybersecurity Stocks to Protect the Digital World in 2026": 0.5,
  "Google started the year behind in the AI race. It ended 2025 on top.": 0.8,
  "Marriott (MAR) Valuation Check After Recent 3-Month Share Price Rally": 0.5,
  "Novo Nordisk vs. Amgen: Which Healthcare Stock Is the Smarter Choice?": 0.2,
  "APP vs. DUOL: Which Mobile-Tech Growth Stock Should You Consider Now?": 0.5,
  "The Zacks Analyst Blog Highlights Cardinal Health, Medtronic, Intuitive Surgical and Edwards Lifesciences": 0.5,
  "SHOP's Merchant Solutions Revenue Growth Picks Up: More Upside Ahead?": 0.6,
  "GILD Exercises Option to License Assembly Bio's Herpes Programs": 0.5,
  "Micron Target Raised to $500 After Strong Q1 Earnings Beat": 0.8,
  "Got $1,000? 2 Stocks to Buy Now While They're On Sale": 0.5,
  "ABBV vs. AZN: Which Pharma Stock is the Better Investment Now?": 0.5,
  "Can AI Data Center Partnership With Fortinet Lift Arista's Shares?": 0.2,
  "Strategy Raises Cash Reserves to $2.19 Billion, Skips Bitcoin Purchases in Latest Filing": 0.2,
  "Jim Cramer Notes “Paychex Tends to Sell off on Earnings”": 0.1,
  "Is Palo Alto Networks Stock a Buy, Sell, or Hold Following Its Major Multibillion-Dollar Google Deal?": 0.2,
  "What should Fed do after hot Q3 GDP data? Wall Street weighs in": 0.2,
  "Can Promises Alone Push Tesla to $2T in 2026? Here’s Why Bulls Say Yes": 0.6,
  "CTSH or ACN: Which Is the Better Value Stock Right Now?": 0.2,
  "Shopify (SHOP) Q2 2025 Earnings Call Transcript": 0.2,
  "Shopify (SHOP) Q3 2024 Earnings Call Transcript": 0.1,
  "What Makes Seagate (STX) a Strong Momentum Stock: Buy Now?": 0.6,
  "Have $500? 3 Absurdly Cheap Stocks Long-Term Investors Should Buy Right Now": 0.5,
  "How FDA Clearance Expanding da Vinci SP into General Surgery Will Impact Intuitive Surgical (ISRG) Investors": 0.2,
  "Why Dutch Bros is a top stock pick for 2026, while Starbucks lags": 0.5,
  "C3.ai and Palantir: Who Wins the Battle of Enterprise AI Stocks Now?": 0.2,
  "Wall Street Sees Record Investment-Grade Bond Issuance in 2026": 0.8,
  "Paramount Jumps After Ellison Backstop": 0.5,
  "3 Growth Companies With Insider Ownership Up To 37%": 0.5,
  "High Growth Tech Stocks To Watch In US December 2025": 0.5,
  "Microsoft, Salesforce Lead Evercore's 2026 Picks": 0.5,
  "Micron Just Changed the AI Cycle—and the Market Knows It": 0.5,
  "Seagate (STX) Falls 4.56% on Profit-Taking": -0.5,
  "Strategy's Bitcoin Accretion Continues: Is the Momentum Durable?": 0.5,
  "Top analyst drops eye-popping price target on Micron stock": 0.8,
  "Visa vs. PayPal: Which Fintech Stock Has More Upside Today?": 0.5,
  "Target makes customer service changes shoppers will like": 0.8,
  "4 Reasons You Should Invest in Costco Stock in 2026": 0.5,
  "Will Google Pass Nvidia in 2026 as the World’s Biggest Company?": 0.2,
  "Nvidia, AMD Could See Billions in Revenue from Soaring China AI Demand in 2026": 0.8,
  "Dan Ives says this tech stock is under the most pressure in AI era": -0.6,
  "Bitcoin slips, crypto stocks suffer steep declines, as tax-loss selling drives action, analysts say": -0.7,
  "These Consumer Stocks Are Rejuvenated. They Have to Prove the Market Right in 2026.": 0.5,
  "On Uber: AVs, Take Rates, and Fragmentation - One of the primary arguments against Uber as an investment can be summarized in two words: AV disruption. As an Uber investor, it probably goes without saying, but I disagree and I’m going to show you why. The bear case usually boils down to two hypothetical scenarios: 1. **The “In-House” Threat:** AV companies keep their trip sourcing exclusive to their own apps to maximize profits. 2. **The": 0.2,
  "Dow Jones Tech Giant Apple, AppLovin, Palantir, Tesla In Buy Zones": 0.5,
  "AppLovin Stock Today: Why This Bull Put Spread Earns $160": 0.5,
  "Baker Hughes to Supply LM9000 Turbines for Commonwealth LNG Project": 0.5,
  "What Is One of the Best Chip Stocks to Hold for the Next 10 Years?": 0.5,
  "Elon Musk's DOGE tally: The federal workforce is down while government spending is up": -0.2,
  "Meta Investors Should Be ‘Opportunistic Buyers’ in the New Year, Analyst Says": 0.5,
  "Cintas’ $5.2B UniFirst Bid Ignites the Battle for Route Dominance": 0.5,
  "Why Marvell Technology (MRVL) Stock Is Trading Up Today": 0.5,
  "Applied Digital Is Building the Compute Power That AI Needs. Could the Stock Surge Next?": 0.5,
  "Quantum Enablers Poised for 40% Plus Growth in 2026: INTC, AVGO & TER": 0.6,
  "G2 Winter 2026 Awards: ShipHero Sweeps Back-to-Back #1 in WMS": 0.6,
  "Forget NVDA: 2 AI Stocks Crushing it in 2025 With More Upside Ahead": 0.6,
  "Micron(MU) up 217% in 2025, is the rally just getting started? - MU has been insane this year, AI driven memory demand is still booming, margins are improving, and earnings keep beating expectations. But memory is cyclical, so some pullback is possible. Curious what everyone thinks. Are we looking at more upside in 2026? Or is the stock priced for perfection already? Any strategues you're using to play MU going forward? Would love to hear": 0.6,
  "What is the trend for Nbis going forward? - The upward trend from the low point is very impressive, having already completed three upward waves, and is only missing a small fifth wave, followed by a 1-2 retracement. The overall structure is still incomplete. First, it must break through the strong resistance level of 102 with high volume. Secondly, to confirm the continued upward trend, it needs to break through 116. As I've said before,": 0.8,
  "Bulky Costco Products That Are Helping The Company Soar": 0.6,
  "Analyzing M2 Liquidity Overhang and the \"Wile E. Coyote\" Risk in Current Tech Valuations. - I seriously feel like we’re dancing on the edge of a cliff right now. Prof. Steve Hanke just gave everyone a massive reality check, and it’s cold: that **$3.5 trillion** surge in the M2 money supply is basically just physics what goes up has to come crashing down eventually. The logic in this market is getting insane. We still have": -0.8,
  "Why Strategy (MSTR) Shares Are Falling Today": -0.5,
  "Michael Saylor Has a New Story to Tell. Strategy 'Goes Beyond Bitcoin Exposure'": 0.5,
  "Is ADP (ADP) Undervalued After Its Recent Pullback? A Fresh Look at the Stock’s Valuation": 0.2,
  "Paramount’s New Bid ‘Not Sufficient,’ Warner’s Fifth-Largest Shareholder Says": -0.5,
  "Alibaba Shows China May Be the Next Frontier for Nvidia and AMD": 0.6,
  "Top Research Reports for Mastercard, GE Aerospace & Micron Technology": 0.5,
  "These Stocks Moved the Most Today: Novo Nordisk, ServiceNow, Micron, DJT, Freeport-McMoRan, Zim, and More": 0.2,
  "Apple spent 2025 setting itself up for the future — and its biggest moves weren't about AI": 0.2,
  "Meta Stock Price Target Trimmed By Analyst. Can 'Wounded Sentiment' Recover In 2026?": -0.5,
  "Citi Makes Left-Field Choice For Top Pick Among Chip Stocks": 0.2,
  "How Enterprise, International Markets Boosted Shopify Stock": 0.5,
  "S&P 500 Hits New High After Strong GDP Data": 0.8,
  "2026 Strategy: Double down on AI, or is it time to move on? - 2025 was pure chaos ,half driven by AI hype, half by policy whiplash. We watched NVDA and GOOGL hold their thrones, while silver and names like SATS came out of nowhere with eye-watering 100%+ runs. Now heading into 2026, I feel like I’m at a crossroads: The AI trade: We’re clearly still in the early innings, but the focus has already": 0.2,
  "Stock Market Today: Dow Higher As S&P 500 Scores Record; Nvidia Clears Key Level (Live Coverage)": 0.5,
  "What did you SELL this year? - Thought it would be fun if we all do a little year-end recap of some stocks we *sold* this year, since so many posts are about what to buy. I don't usually sell stocks, but my holdings had become quite lengthy and not very well balanced, so I decided to do a little consolidation. NVDA, 3000 shares @ $100 NBIS, 1000 shares @ $33 AMD, 1000 shares @": 0.2,
  "Heard on the Street Recap: A Dose of Optimism": 0.8,
  "Down 81%, Is It Time to Buy PayPal Stock?": 0.1,
  "Does Regeneron Still Offer Value After Strong Five Year Share Price Gains?": 0.2,
  "Evolutionary Tree Dumps 11,000 monday.com Shares for $3.6 Million": 0.2,
  "PepsiCo (PEP) Stock Sinks As Market Gains: Here's Why": -0.5,
  "How is my portfolio? - **ETFS: 67%** **VOOG. 25%** **VOO 10%** **VBR. 12%** **VXUS. 15%** **XLV. 5%** **Crypto:10%** **BTC. 10%** **Individual picks 15%** **AMZN. 4%** **NFLX. 4%** **NVDA 4%** **JPM 3%** **Nuclear 8%** **OKLO 1%** **NXE2%** **URA 5%** Explanation: This is the third time I’ve posted on this sub, and after lots of thinking and adjustments based on your guys’ constructive criticism (which I’m grateful for), this is what I’ve landed on. This is a": 0.2,
  "Amazon Looks Stuck—So Why Do Analysts Keep Calling for $300?": 0.2,
  "UiPath Set to Join S&P MidCap 400 and Versant Media Group to Join S&P SmallCap 600": 0.5,
  "NXP Semiconductors (NXPI) Stock Dips While Market Gains: Key Facts": -0.2,
  "Warner Bros. Discovery confirms receipt of amended offer from Paramount Skydance": 0.1,
  "2 Monster Stocks to Hold for the Next 5 Years": 0.5,
  "Why Strategy (MSTR) Is Down 5.7% After Pivoting From Bitcoin Buying To Building A Cash Buffer": -0.5,
  "AVGO: High-Quality Compounder or AI Valuation Trap? Curious Where r/stocks Lands - I’ve been watching Broadcom (AVGO) closely, and it feels like the debate around this stock has quietly shifted. This isn’t really about “is Broadcom a good company?” anymore almost everyone agrees it is. The real question seems to be: Has the market already priced in too much perfection? Here’s where I see the split: Bull case: Strong AI networking + custom silicon exposure": 0.5,
  "Monster Beverage price target raised to $87 from $81 at Morgan Stanley": 0.5,
  "Surf Air Mobility (SRFM): Revisiting Valuation After Q3 Beat, Upgraded Outlook and New Palantir Partnership": 0.8,
  "Is It Too Late to Buy Alphabet Stock in 2026? The Answer May Surprise You.": 0.2,
  "Review & Preview: Next Stop? S&P 7000.": 0.5,
  "Is Amazon Stock Still a Buy After Hitting All-Time Highs?": 0.2,
  "The U.S. Offered Putin’s Closest Ally Sanctions Relief—and a Weight-Loss Drug": -0.6,
  "PepsiCo (PEP) Valuation Check After Recent Share Price Drift Lower": 0.1,
  "Bitcoin Miners Thrive Off a New Side Hustle: Retooling Their Data Centers for AI": 0.6,
  "Rocket Lab analyst rethinks stock target after hitting record high": 0.5,
  "Processors and Graphics Chips Stocks Q3 Results: Benchmarking Broadcom (NASDAQ:AVGO)": 0.2,
  "Q3 Earnings Highlights: AMD (NASDAQ:AMD) Vs The Rest Of The Processors and Graphics Chips Stocks": 0.2,
  "Palantir Technologies (PLTR): 3 Reasons We Love This Stock": 0.8,
  "Monolithic Power Systems (MPWR): 3 Reasons We Love This Stock": 0.8,
  "3 Reasons ODFL is Risky and 1 Stock to Buy Instead": -0.5,
  "1 Surging  Stock with Promising Prospects and 2 We Find Risky": 0.5,
  "2 Nasdaq 100 Stocks for Long-Term Investors and 1 We Brush Off": 0.2,
  "3 Hyped Up  Stocks That Concern Us": -0.5,
  "1 Volatile Stock to Own for Decades and 2 That Underwhelm": -0.5,
  "1 of Wall Street’s Favorite Stock to Consider Right Now and 2 Facing Challenges": 0.2,
  "2 Oversold Stocks Set for a Comeback and 1 We Brush Off": 0.2,
  "1 Large-Cap Stock with Impressive Fundamentals and 2 Facing Challenges": 0.5,
  "3 S&P 500 Stocks We Approach with Caution": -0.5,
  "Where Will Costco Stock Be in 3 Years?": 0.1,
  "Tech groups shift $120bn of AI data centre debt off balance sheets": 0.2,
  "The Top 5 Analyst Questions From Micron’s Q4 Earnings Call": 0.2,
  "Fidelity Contrafund’s Will Danoff Is Getting Closer to Handing Off the Reins": 0.2,
  "Broadcom CEO Dumps $42 Million in Stock -- Insider Sales Top $100 Million": -0.8,
  "Earnings Preview: What to Expect From PACCAR’s Report": 0.5,
  "Citi Adds Positive Catalyst Watch on Marvell (MRVL) Ahead of CES 2026": 0.8,
  "Micron (MU) in Focus as Analysts Highlight Multi-Year AI Data-Center Expansion": 0.5,
  "Wedbush Calls Microsoft (MSFT) a Core AI Winner With $625 Price Target": 0.8,
  "Reddit Stock Is Ready to Run Again": 0.6,
  "Stock Market News for Dec 24, 2025": 0.0,
  "Billionaires Buy 2 Trillion-Dollar AI Stocks Hand Over Fist Ahead of 2026": 0.5,
  "Billionaire Stanley Druckenmiller Sold Nvidia and Palantir and Piled Into One of Wall Street's Hottest Drug Stocks Ahead of 2026": 0.5,
  "Best Payroll Software UK (Jan 2026): QuickBooks Named Best Payroll Solution for UK Small Businesses by Better Business Advice": 0.8,
  "The best stocks of 2025: AI, tech, gold, and some surprises": 0.5,
  "Italy Watchdog Orders Meta to Allow Rival AI Chatbots in WhatsApp": 0.2,
  "Update: Meta Platforms Faces Interim Measures in Italy Over WhatsApp AI Practices": -0.5,
  "Why the ‘Everyone’s a Winner’ Energy Trade Can’t Last Forever": -0.5,
  "A US Postal Service plan to raise cash could cost the agency its biggest customer": -0.6,
  "Nvidia Stock Is Up 31% in 2025, But Here's Another Super Semiconductor Stock to Buy in 2026, According to Wall Street": 0.6,
  "Stock Index Futures Muted in Thin Pre-Christmas Trade, U.S. Jobless Claims Data on Tap": 0.1,
  "Should You Be Excited About Amgen Inc.'s (NASDAQ:AMGN) 73% Return On Equity?": 0.6,
  "Vanguard flips the script on 60/40 investment strategy": 0.5,
  "How a Silicon Valley dealmaker charmed Trump and gave Intel a lifeline": 0.5,
  "is this a good starting point? - First time throwing some cash into the market. I know everything is pretty much at ATH but im aiming to be invested for at least 3-5 years so im thinking time in the market is better than timing it. Been researching, adding and removing tickers from my list for over a month now. I think I’ve settled on these. Will be investing about £5,000 which I know isn’t": 0.6,
  "Nvidia and AMD Eye China AI Chip Boost": 0.5,
  "Prediction: These 3 Artificial Intelligence (AI) Stocks Will Be Big Winners Again in 2026": 0.8,
  "ByteDance plans to spend $23B on AI in 2026, FT reports": 0.5,
  "Italy Orders Meta to Halt WhatsApp Terms Blocking Rival AI Chatbots": 0.1,
  "Mining, Oil and Bank Issues Moderately Lift European Bourses Midday": 0.5,
  "3 Growth Companies With Insider Ownership Up To 27%": 0.5,
  "AI Chips Today - EdgeMode Secures Power for Major AI Data Center Expansion": 0.5,
  "3 Stocks That Investors Might Be Undervaluing By Up To 32.3%": 0.5,
  "Exploring US High Growth Tech Stocks for Potential Expansion": 0.5,
  "The 20-Year Signal: Preparing for the Predicted Reversal of AI-Fueled Stock Market Gains": 0.2,
  "S&P 500 Record Sets Up a Santa Rally. This Could Be the Stock Market’s Scrooge and 4 Other Things to Know Today.": 0.5,
  "Repare Therapeutics Announces Acquisition of Polθ ATPase Inhibitor, RP-3467, by Gilead Sciences for Up To $30 Million in Total Consideration": 0.5,
  "Intuitive Surgical vs. Stryker: Which MedTech Stock Has More Upside?": 0.5,
  "Palantir Technologies (NASDAQ: PLTR) Stock Price Prediction for 2026: Where Will It Be in 1 Year": 0.5,
  "Here’s Janus Henderson Global Technology and Innovation Fund’s Views on Amazon.com (AMZN)": 0.2,
  "Here’s How Lam Research Corporation (LRCX) is Benefitting from AI": 0.5,
  "1 Analyst Thinks Micron Stock Can Touch $500. Should You Buy It Here?": 0.5,
  "Will Palantir Continue to Skyrocket in 2026?": 0.5,
  "Dow Jones Futures: S&P 500 Hits Record Close; Nvidia, Google Flash Buy Signals": 0.8,
  "Exchange-Traded Funds Higher, Equity Futures Mixed Pre-Bell Wednesday Ahead of Shortened Trading Week": 0.5,
  "Salesforce Is Ready to Emerge an AI Winner. Buy the Stock.": 0.8,
  "These 6 stocks will lead the $1 trillion chip surge in 2026, BofA says": 0.5,
  "Snowflake In Talks To Buy Observe Amid AI Acquisition Spree": 0.5,
  "Nvidia (NASDAQ: NVDA) Stock Price Prediction for 2026: Where Will It Be in 1 Year (Dec 24)": 0.2,
  "This one Costco item has skyrocketed 108% in price over just 2 years. Now the retail giant is restricting purchases": -0.7,
  "Nvidia and Bath & Body Works have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "ByteDance Plans $23 Billion AI Spending Spree": 0.8,
  "Nadella Takes Direct Control of Microsoft AI": 0.5,
  "Equity Futures Hold Steady Pre-Bell as US Initial Jobless Claims Beat Analyst Range": 0.5,
  "Buy 3 Tech Stocks as Santa Rally Begins With a Record High S&P 500": 0.8,
  "Tesla Stock set a new $498 ATH, Is this a pattern? - I was scrolling the internet yesterday when i came across a trading campaign for $TSLA on Bitget (Crypto exchange that offer stock trading) so i wonder if such campaigns was responsible for the recent price trend but i notice this is a yearly price trend for TSLA as i can remember last year Christmas price trend with a closing price around the end-of-2024": 0.2,
  "Texas Instruments Incorporated (TXN) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Netflix, Inc. (NFLX) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Costco Wholesale Corporation (NASDAQ:COST) is largely controlled by institutional shareholders who own 69% of the company": 0.1,
  "Utility CEO on the data center crunch: America’s ‘check engine light’ is on and ‘no one’s going to pay attention until it breaks down’": -0.6,
  "Tesla Faces U.S. Probe Over Model 3 Emergency Door Release Design": -0.5,
  "Tribesigns Wins \"2025 Amazon Business Brand of the Year\" Award": 0.8,
  "BYD’s European Sales Soar 235%": 0.8,
  "Tesla’s European Sales Plunge": -0.8,
  "Why Disney Stock Is the Real Winner from the Warner Takeover Battle": 0.5,
  "12 Stocks That Dropped After Tax-Loss Selling—and Can Bounce Back": 0.5,
  "A $61 Billion Reason to Buy Amazon Stock for 2026": 0.5,
  "Is It Worth Investing in Intuitive Surgical (ISRG) Based on Wall Street's Bullish Views?": 0.5,
  "MercadoLibre (MELI) Is Considered a Good Investment by Brokers: Is That True?": 0.5,
  "INTC: Intel Stock Falls After Nvidia Backs Out of 18A Chip Deal": -0.6,
  "European Union Rolls Back 2035 ICE Ban as EV Demand Softens": -0.5,
  "ChargePoint CEO: We expect a 'pullback' this quarter after EV tax credit expiry": -0.5,
  "KB Home downgraded, Costco upgraded: Wall Street's top analyst calls": 0.2,
  "KB Home downgrade, Costco upgraded: Wall Street's top analyst calls": 0.2,
  "The Zacks Analyst Blog Highlights Mastercard, GE Aerospace, Micron Technology and Value Line": 0.5,
  "Will DRAM Strength Drive Applied Materials' Next Growth Phase?": 0.5,
  "Intel Shares Fall on Report Nvidia Halts Production Test": -0.5,
  "Mergers & Acquisitions Soared This Year. Stocks That Could Make 2026 Even Bigger.": 0.5,
  "The Zacks Analyst Blog Highlights NVIDIA, Advanced Micro Devices, Intel, Micron Technology and BigBear.ai": 0.5,
  "TSX futures edge lower as liquidity thins ahead of Christmas break": -0.5,
  "Walmart vs. Costco: Which Retail Giant Wins Today's Consumer Race?": 0.5,
  "Armandino Batali, Seattle Chef Who Turned to Salami After Working at Boeing, Dies at 88": -0.5,
  "Update: Gilead Sciences to Acquire Repare Therapeutics' Investigational Cancer Treatment; Repare Shares Rise": 0.5,
  "2 AI surprises for investors in 2025": 0.1,
  "Intel Lands $5.7B U.S. Investment Following CEO Tan's White House Meeting": 0.8,
  "UiPath Stock Is Surging. Why the AI Winner Is Getting a Big Boost.": 0.8,
  "MU surged nearly 230% this year and continues to hit new highs today. Will it break through $300 before the New Year? - As AI large models exhibit exponential growth in data generation and processing speeds, memory chips face shortages and product prices continue to rise, ushering in a supercycle for the industry. MU, a memory chip giant, has surged nearly 230% this year. Today, it continues its strong momentum with a 3.6% gain, breaking": 0.8,
  "Score A $4,000 Payday — Why The 2026 World Cup Is A Gold Mine For Homeowners": 0.5,
  "This Medical Robotics Name Wins FDA Greenlight; Its Stock Nears A Buy Point": 0.6,
  "Crypto Community Turning on Michael Saylor's Strategy: Volatility's Cruel Twist or Overleveraged Overreach?": 0.2,
  "Intel Stock Drops. Blame Nvidia.": -0.5,
  "Tesla Stock Drops as U.S. Auto Regulator Probes Alleged Model 3 Door Defects": -0.6,
  "Tesla EV Sales Collapse Nearly 40% in Europe Amid Rising Competition": -0.8,
  "MRVL's Data Center Revenues Hit $1.5B: Can the Momentum Continue?": 0.5,
  "2025 Changed the Media Business. Next Year Could Be Even More Turbulent.": 0.5,
  "The Tech Stock Warren Buffett Wishes He'd Bought": 0.5,
  "Apple CEO Tim Cook Buys $3 Million of Nike Shares. The Stock Is Rising.": 0.8,
  "How Mill closed the deal with Amazon and Whole Foods": 0.5,
  "BC-Most Active Stocks": 0.0,
  "Amgen Strikes Drug Pricing Deal With Trump: What Investors Should Know": 0.5,
  "Micron surge is bullish for these other stocks, says Bank of America": 0.6,
  "Xmas Eve Jobless Claims: Still Accommodating": 0.5,
  "Is Tesla Stock a Buy Under $500?": 0.2,
  "AI & Security Push Aids Google Cloud: What's Ahead for GOOGL Stock?": 0.5,
  "4 Drug, Biotech Stocks Rising More Than 50% in 2025 With Room to Grow": 0.8,
  "3 Artificial Intelligence Stocks You Can Buy and Hold for the Next Decade": 0.5,
  "The 3 consumer internet stocks best positioned for 2026": 0.5,
  "Broadcom's Semiconductor Growth Picks Up: A Sign of More Upside?": 0.6,
  "Quantum computing is the stock market’s next big tech play — and these stocks are still cheap": 0.6,
  "Cisco's AI-Push Aids Networking Revenue: Is There More Upside Ahead?": 0.5,
  "Disney Seen as Potential Winner as Warner Bidding Battle Plays Out": 0.8,
  "Alphabet-Backed Motive Technologies Files for IPO": 0.5,
  "Soft Weekly Jobless Claims Data": 0.5,
  "Costco makes shopping smoother for members": 0.8,
  "Intel Rides on Strong Gross Margin Expansion: Will it Sustain?": 0.6,
  "Nvidia Stops Test Using Intel's Chip Production Process": -0.5,
  "Palantir Stock Jumped on Wedbush Call, AI Platform Seen as Game-Changer": 0.8,
  "Lam Research Is at All-Time Highs. Its CEO Just Sold $27 Million Worth of Stock.": -0.5,
  "Cathie Wood Reduced Her Stake in Tesla: Is TSLA Stock a Buy, Hold, or Sell Now?": 0.2,
  "Waymo to Update Software After San Francisco Power Outage": 0.1,
  "Weak Macro Can't Stop E-commerce Stocks Expedia and Amazon": 0.2,
  "Nike stock is getting a lift today. The reason? Apple CEO Tim Cook": 0.5,
  "This Top Nasdaq-100 Stock Has Nothing to Do With AI. How Should You Play It for 2026?": 0.2,
  "AXON's Dedrone Expands in CUAS Capability: Can It Deliver Growth?": 0.5,
  "Top Midday Stories: Apple's Cook Buys $3 Million in Nike Stock; OpenAI Explores Ads in ChatGPT; Sanofi-Dynavax $2.2 Billion Deal": 0.5,
  "Tesla Under Investigation by U.S. Regulator for Model 3 Door Release Defects": -0.7,
  "Uh-Oh! Did Nvidia Just Signal Problems with Intel’s Comeback?": -0.5,
  "1 Broadcom Insider Just Dumped $12 Million in AVGO Stock. Should You Sell Too?": -0.8,
  "Should You Sell Netflix Stock Before It Wins the Warner Bros Takeover?": -0.5,
  "Tesla Faces NHTSA Probe Over Model 3 Emergency Door Handles": -0.5,
  "Sector Update: Health Care Stocks Rise Wednesday Afternoon": 0.5,
  "Dan Ives Is Betting That Apple and Google Will Partner in 2026. Should You Buy AAPL Stock First?": 0.5,
  "Sector Update: Consumer Stocks Rise in Afternoon Trading": 0.5,
  "Crude Oil Prices Continue Higher on Recent Oil Tanker Disruptions": 0.5,
  "US Equity Indexes Rise After Upbeat Jobless Claims Data": 0.8,
  "Sector Update: Tech Stocks Advance Wednesday Afternoon": 0.5,
  "Tesla faces NHTSA investigation into Model 3 emergency door releases - The NHTSA confirmed on Wednesday that it will conduct an investigation into complaints about the mechanical door releases of 2022 Tesla （TSLA） Model 3 vehicles. The investigation will cover 179,071 vehicles. Investigate defects in the mechanical door release mechanism. Tesla (TSLA) shares fell 1.0% in early trading on Wednesday.": -0.6,
  "As Markets Rise, Risk-Taking Takes a Back Seat": -0.5,
  "S&P 493 likely to see 'outsized returns' in 2026, outside Mag 7": 0.6,
  "Tesla faces probe, Intel slides on Nvidia reports, bitcoin falls": -0.5,
  "Apple Agrees to Open iOS App Stores in Brazil After Antitrust Case": 0.5,
  "3 High Growth Companies Insiders Are Eager To Own": 0.5,
  "Waymo Plans Fleetwide Software Update After San Francisco Power Outage": 0.1,
  "Raymond James Sees Potential China Upside for Nvidia and AMD": 0.5,
  "These Stocks Are Moving the Most Today: Intel, Nike, UiPath, Tesla, Micron, Disney, Lam Research, AMC, Strategy, Dynavax, and More": 0.2,
  "PepsiCo vs. Coca-Cola: Which Stock Dominates Global Beverage Space?": 0.5,
  "Leak Hints at First Intel Nvidia Chip After $5 Billion Partnership": 0.5,
  "This Is 1 of the Best AI Stocks to Hold for the Next 10 Years": 1.0,
  "AppLovin's Strategic Reset: Going All-In on AI-Driven Advertising": 0.6,
  "Apple CEO Tim Cook Discloses $3 Million Nike Buy With Dow Giant At 7-Month Low": 0.2,
  "Stock market today: Dow, S&P 500 notch records, Nasdaq gains as Wall Street flies high into Christmas holiday": 0.8,
  "Options trading: This analyst's calls on Palo Alto, TJX, SoFi": 0.2,
  "Global semiconductor sales will reach $1 trillion by 2026, with these six companies set to be the biggest beneficiaries. - Various signs indicate that the artificial intelligence boom is not only showing no signs of cooling but is accelerating. Six stocks will lead the global $1 trillion chip surge in 2026, even as some AI skeptics remain on the sidelines due to perceived overvaluation. However, this industry is currently only in the middle phase of": 0.8,
  "Meta Ordered By Italian Regulators To Keep WhatsApp Open For Rival AI Chatbots": 0.1,
  "Why Apple's Tim Cook Drove Nike Stock Higher Today": 0.5,
  "AI trade: Broadcom has 'one of the great' recurring revenues in tech": 0.6,
  "Consumer Staples, Real Estate Push US Equity Indexes Higher": 0.5,
  "A Google-Backed Software Company Could Join Next Year's AI-Powered IPO Rush": 0.6,
  "Dow, S&P 500 Close at New Highs in Holiday-Shortened Session": 0.8,
  "AMC Stock Snaps 11-Day Losing Streak as Box Office Concerns Loom": 0.1,
  "Nike shares jump after Apple CEO Cook doubles stake to $6 million": 0.8,
  "An AI bubble may be here, but the bubble is bigger for 'fad trades'": 0.1,
  "Mondelēz Global LLC Conducts Voluntary Recall of 2 SKUs of CHIPS AHOY! Baked Bites Brookie in the US": -0.5,
  "Starbucks Stock Today: Trade This Bear Call Spread, Earn $55 Right Away": 0.2,
  "Microsoft Will 'Prove Doubters Wrong' In 2026 With AI-Fueled Growth": 0.6,
  "Oracle’s Topsy-Turvy Year Won’t Get Any Easier in 2026": -0.6,
  "This Tech Investor Likes Broadcom, Bloom Energy, and Other AI Bargains": 0.6,
  "A Big China Catalyst Could Be Coming for AMD Stock in 2026. Should You Buy Shares Now?": 0.5,
  "Crude Oil Prices End Little Changed But See Continued Support From Recent Oil Tanker Disruptions": 0.5,
  "Nvidia Hits Key Level With No AI Bubble Yet, Fund Manager Says; Is Nvidia Stock A Buy Now?": 0.5,
  "Review & Preview: All Was Quiet": 0.0,
  "Nvidia, joining Big Tech deal spree, to license Groq technology, hire executives": 0.5,
  "1 Top Stock to Buy Hand Over Fist Before the Nasdaq Soars Higher in 2026": 0.6,
  "Stock Market Today: 'Santa Rally' Brings New Records for Dow and S&P 500 On Christmas Eve": 0.8,
  "Stock Market Predictions For 2026? Worthless. This Approach? Priceless.": 0.5,
  "Elon Musk Backs Demis Hassabis In Dispute With Meta's Yann LeCun Over 'General Intelligence,' Says Google DeepMind CEO Is 'Right'": 0.5,
  "Nvidia to acquire Groq for $20 billion in its largest deal ever, CNBC reports": 0.5,
  "Nvidia to license AI chip challenger Groq’s tech and hire its CEO": 0.5,
  "Ranking the Best \"Magnificent Seven\" Stocks to Buy for 2026. Here's My No. 5": 0.5,
  "Is Applied Materials (AMAT) Still Fairly Priced After Its Recent Strong Share Price Run?": 0.2,
  "Nvidia, Groq Strike AI Tech Licensing Deal": 0.5,
  "Nvidia Licenses Groq’s AI Technology as Demand for Cutting-Edge Chips Grows": 0.6,
  "Ranking the Best \"Magnificent Seven\" Stocks to Buy for 2026. Here's My No. 4": 0.5,
  "Paypal (PYPL) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "Comcast (CMCSA) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Nvidia Licenses Groq's AI Chip Tech, Grabs Top Execs, But Not A Takeover": 0.2,
  "Dow Jones, S&P 500 Hit Record Highs Heading Into Christmas Holiday": 0.8,
  "Nvidia’s $4 trillion moment came with a quiet warning sign": 0.1,
  "If you had to pick one long-term AI winner: Google or Nvidia and why? - I’m looking to add one individual stock as a small satellite position (5–10%) alongside a diversified core ETF. Horizon is 5–10 years, not trading, not options. Nvidia clearly dominates AI hardware today and has incredible momentum, but expectations are already extremely high. Google, on the other hand, feels more controversial: massive cash flow, distribution, data, TPUs, and vertical integration, but": 0.2,
  "Is Marvell Technology Attractively Priced After Recent AI Driven Share Price Rebound?": 0.5,
  "Nike Climb Boosts Dow, S&P 500": 0.5,
  "Amazon.com (AMZN) Is Up 5.0% After Expanding AI Infrastructure, AWS Backlog and Strategic Partnerships – What's Changed": 0.5,
  "Is Synopsys Still Attractively Priced After Recent AI Enthusiasm and Share Price Rebound?": 0.2,
  "This Dividend-Yielding Tech Stock Looks a ‘Compelling Buy’ for 2026 After 2 Years of Underperformance": 0.8,
  "EXCLUSIVE: Jay Woods Picks His Favorite And Least Favorite Magnificent 7 Stocks For 2026 – 'A Story To Watch'": 0.5,
  "Nvidia Absorbs Another Rival for $20B, Boosting Decentralized AI": 0.8,
  "These grocery stores are open on Christmas": 0.0,
  "Will Apple’s (AAPL) Global iOS Openings and AI Push Reshape Its Services-First Narrative?": 0.5,
  "Is Starbucks Stock Attractive After 2025 Slump And Premium Valuation Metrics?": 0.2,
  "Synopsys (SNPS): Has the Recent 18% Share Price Rebound Left the Stock Undervalued?": 0.5,
  "How The Evolving AI Storage Story Is Reshaping Seagate Technology Holdings Valuation": 0.5,
  "3 Reasons to Buy Uber Stock Like There's No Tomorrow": 0.6,
  "Tesla's Austin Robotaxi Project Is Smaller Than Elon Musk's Claims: Report": -0.5,
  "If You'd Invested $10,000 in Verizon Communications 10 Years Ago, Here's How Much You'd Have Today": 0.5,
  "Is It Too Late To Consider KLA After Its 100% Surge In 2025?": -0.5,
  "What’s your thoughts on NFLX? - The stock took a pretty decent hit in the past few weeks. What I’d mainly assume is due to the WBD drama, stock split and the tax dispute in Brazil. It honestly just seems oversold though. Do you guys think it’s starting to bottom off or does it have more to bleed? $93 seems really attractive for a stock like this. There’s two things I’m looking at for the": 0.2,
  "New CEO and Breakup Plan Could Be A Game Changer For Kraft Heinz (KHC)": 0.8,
  "MercadoLibre (NasdaqGS:MELI): Assessing Valuation After Recent Share Price Volatility": 0.1,
  "Nebius Group (NBIS) Is Up 20.8% After Blackwell AI Cloud Deal Wins With Microsoft And Meta – Has The Bull Case Changed?": 0.5,
  "Nvidia makes its biggest purchase ever": 0.5,
  "Revisiting Fastenal (FAST) Valuation After a Strong Multi‑Year Shareholder Return Run": 0.5,
  "Is AMD’s Soaring AI Fueled Share Price Still Justified in 2025?": 0.2
}