{
  "Is Comcast (CMCSA) Pricing Offer A Genuine Opportunity After Multi Year Share Price Weakness": 0.2,
  "2 Undervalued AI Stocks to Buy Before They Soar 105% and 130% in 2026, According to Wall Street Analysts": 0.8,
  "Trending tickers: TSMC, Google, Airbnb, Schroders, BP": 0.0,
  "Intuit \"could bounce from here\" after early year slump - Jefferies": 0.5,
  "Intuit TurboTax Opens NYC Flagship, Uniting AI and Human Expertise to Reinvent In-Person Tax Filing Nationwide": 0.8,
  "Should You Be Adding Monster Beverage (NASDAQ:MNST) To Your Watchlist Today?": 0.5,
  "Axon Enterprise's (NASDAQ:AXON) investors will be pleased with their strong 282% return over the last five years": 0.8,
  "GE HealthCare’s Q4 2025 Earnings: What to Expect": 0.0,
  "Palantir and CrowdStrike: Daniel Ives Reveals His Top AI Stocks for 2026": 0.6,
  "High Growth Tech Stocks In The US For January 2026": 0.5,
  "IDEXX Advances the Future of Veterinary Cancer Care with Comprehensive Mast Cell Tumor Testing for Dogs": 0.8,
  "EMERALD PACKAGING JOINS THE U.S. FLEXIBLE FILM INITIATIVE TO HELP SCALE RECYCLING OF FLEXIBLE PLASTICS": 0.6,
  "Lowest-Dose Radiography Meets Next-Level Imaging: IDEXX Launches ImageVue DR50 Plus": 0.5,
  "Broadcom Shares Plunge After Report on China Software Curbs": -0.7,
  "DexCom's Q4 2025 Earnings: What to Expect": 0.0,
  "China Pressure Weighs on Palo Alto, Fortinet": -0.5,
  "Wells Fargo upgrades key chip names; AMD a top pick": 0.6,
  "SST and UMC Announce Immediate Availability of 28nm SuperFlash® Gen 4 Automotive Grade 1 Platform": 0.5,
  "NXP Semiconductors Announces Conference Call to Review its Fourth Quarter and Full Year 2025 Financial Results": 0.1,
  "Wireless Network Quality Continues to Drive Competition as Customer Demands Grow, J.D. Power Finds": 0.6,
  "Dow Jones Futures: Nvidia Chipmaker Taiwan Semiconductor Jumps, Lifting Sector; Goldman Earnings Mixed": 0.5,
  "Are Investors Panicking, Or Spot On, Over AI Threat To Software Makers?": 0.5,
  "CoStar Group, Inc. (CSGP) Price Target Slashed, But Analysts Still See Upside": 0.5,
  "Why Analysts Are Closely Watching Datadog, Inc. (DDOG)": 0.0,
  "Why BofA Just Turned Neutral on Arm Holdings plc (ARM)": 0.1,
  "Here Are Thursday’s Top Wall Street Analyst Research Calls: Applied Materials, BankUnited, Broadcom, Dell Technologies, DraftKings, Lam Research, NVIDIA, and More": 0.2,
  "Got $3,000? 3 Artificial Intelligence (AI) Stocks to Buy and Hold for the Long Term": 0.5,
  "Automatic Data Processing, Inc. (ADP): A Bull Case Theory": 0.5,
  "GlobalFoundries Appoints Ganesh Moorthy to Board of Directors": 0.5,
  "American Electric Power Earnings Preview: What to Expect": 0.2,
  "Airbnb's Q4 2025 Earnings: What to Expect": 0.0,
  "Strength Seen in Array Digital (AD): Can Its 6.6% Jump Turn into More Strength?": 0.6,
  "Leverage Shares by Themes now offers XPEV and ORLY as part of its single stock Leveraged ETF suite.": 0.5,
  "Cisco Announces its Second Annual AI Summit Featuring the Builders of the AI Economy": 0.6,
  "Luxury Group, Marriott International Named Official Hotel Partner of the United States SailGP Team": 0.6,
  "EA SPORTS FC Team of the Year Revealed – Fans Crown Football’s Elite in the TOTYs": 0.5,
  "KAYAK Predicts: Well-th trips, next gen destinations, and small-town escapes to define travel this year": 0.6,
  "Investors Heavily Search Booking Holdings Inc. (BKNG): Here is What You Need to Know": 0.5,
  "How to Find Strong Computer and Technology Stocks Slated for Positive Earnings Surprises": 0.8,
  "How to Boost Your Portfolio with Top Computer and Technology Stocks Set to Beat Earnings": 0.5,
  "SiFive to adopt Nvidia technology for speedy links between chips": 0.5,
  "Association for Financial Professionals Welcomed 178 New Certified Corporate FP&A Professionals in 2025": 0.5,
  "Customers Rate T-Mobile as the Network Quality Leader in the Most U.S. Regions": 0.8,
  "Why Salesforce stock is already down 10% this year": -0.5,
  "THE RITZ-CARLTON, AMELIA ISLAND INTRODUCES NEW SIGNATURE EXPERIENCES": 0.5,
  "Sector Update: Consumer Stocks Mixed Premarket Thursday": 0.0,
  "Chip stocks jump as Nvidia supplier TSMC dismisses bubble fears: 'AI is real'": 0.8,
  "5 Amazing Dividend-Paying Artificial Intelligence (AI) Stocks With Huge Growth Potential": 0.8,
  "T vs CHTR: Which Telecom Stock Has More Upside Right Now?": 0.5,
  "Bernstein names winners and losers in the AI driven data explosion": 0.5,
  "After Plunging 6.2% in 4 Weeks, Here's Why the Trend Might Reverse for Roper Technologies (ROP)": 0.2,
  "3 Medical Device Companies in Focus for Monetizing Data and Analytics": 0.2,
  "Company News for Jan 15, 2026": 0.0,
  "Shopify Trades 14% Below 52-Week High: Buy, Sell or Hold the Shares?": 0.2,
  "Cisco Stock Rises 8% in 3 Months: Will the Rally Continue in 2026?": 0.6,
  "Nvidia initiated, DraftKings upgraded: Wall Street's top analyst calls": 0.5,
  "Diosdado Banatao, Chip Designer, Investor and Entrepreneur, Dies at 79": -0.5,
  "Analysts Estimate CSX (CSX) to Report a Decline in Earnings: What to Look Out for": -0.5,
  "CRWD to Acquire Seraphic: Is Browser Security the Next Growth Engine?": 0.5,
  "Salesforce lags in 2026 as software stocks react to AI concerns": -0.5,
  "Verizon Issues $20 Credits to Customers Affected by Outage": 0.5,
  "JPM26: Intellia Therapeutics hopeful on CRISPR safety despite patient death": 0.5,
  "PDD stock is no longer a Top Pick at Morgan Stanley. Here’s why": -0.5,
  "Oil cools on Iran de-escalations, Talen's $3.45B gas acquisitions": 0.2,
  "GE Healthcare Faces Earnings Downside Risks, UBS Says": -0.6,
  "3 Technology Stocks to Sell in 2026": -0.8,
  "Here’s What Analysts Think About Fortinet (FTNT)": 0.0,
  "Chehalis Welcomes First Xfinity Store": 0.5,
  "Airbnb story is ’firming up’. Analyst explains why": 0.5,
  "Why Is Monolithic Power Systems (MPWR) Stock Rocketing Higher Today": 0.6,
  "MercadoLibre vs Shopify: Which Digital Commerce Stock Holds an Edge?": 0.2,
  "Is It Too Late To Consider Ross Stores (ROST) After A Strong Multi‑Year Share Price Run?": 0.2,
  "AI Stocks Gain as TSMC Posts Another Strong Quarter (LRCX, ASML)": 0.8,
  "Unusual Options Activity: 3 Multi-Leg Trades to Watch — SHOP, SBUX, and PINS": 0.2,
  "Weekly Option Windfall: Leading Medical Imaging Giant Offers Attractive Entry": 0.8,
  "CrowdStrike: A Major Bear Throws in the Towel—Upside Ahead": 0.8,
  "Amgen Inc. (AMGN): A Bull Case Theory": 0.5,
  "Goldman, Morgan Stanley top profit estimates, shares climb": 0.8,
  "Charter Communications, Inc. (CHTR): A Bull Case Theory": 0.5,
  "Astera Labs, Inc. (ALAB): A Bull Case Theory": 0.5,
  "Genmab A/S (GMAB): A Bull Case Theory": 0.5,
  "Dynatrace, Inc. (DT): A Bull Case Theory": 0.5,
  "Microchip, Analog Devices target raised ahead of semiconductor earnings": 0.5,
  "Datadog (DDOG) Faces Competitive Pressures in 2026, Goldman Says in Sell Call": -0.6,
  "Sector Update: Health Care Stocks Softer Late Afternoon": -0.5,
  "Linde plc (LIN): A Bull Case Theory": 0.5,
  "Why Bloom Energy (BE) Stock Is Trading Up Today": 0.5,
  "Why Charter (CHTR) Stock Is Falling Today": -0.5,
  "Sector Update: Tech Stocks Gain Late Afternoon": 0.5,
  "Intuit Announces Annual Stockholder Meeting": 0.0,
  "Atlassian Appoints Anil Sabharwal to Board of Directors": 0.5,
  "Texas Instruments board declares first quarter 2026 quarterly dividend": 0.5,
  "Sell GE HealthCare Stock, UBS Says. The Risks Aren’t Known.": -0.6,
  "These Stocks Are Today’s Movers: TSMC, ASML, Goldman, Morgan Stanley, BlackRock, Coinbase, Sandisk, and More": 0.2,
  "Top Stock Reports for American Express, Intuitive Surgical & Booking": 0.5,
  "Wall Street Snaps 2-Day Losing Streak as Semiconductors Shine, Bank Stocks Rise": 0.6,
  "Amgen’s Weight-Loss Drug Shows Promise With Less Frequent Dosing": 0.6,
  "5 AI Chip Stocks Most Exposed to Trump’s New 25% Tariff": -0.6,
  "US Equity Markets Rise on Bank Earnings, AI-Driven Chip Optimism": 0.8,
  "Small-cap records, chip stock gains, silver: Market Takeaways": 0.5,
  "KLA, ASML, Lam Research, Applied Materials Surge. Why Chip Stocks Are Getting a Boost.": 0.8,
  "Nova, Seagate Technology, Kulicke and Soffa, MACOM, and Vishay Intertechnology Shares Are Soaring, What You Need To Know": 0.5,
  "Starbucks (SBUX) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Intuit (INTU) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Marvell Technology (MRVL) Stock Dips While Market Gains: Key Facts": 0.1,
  "Stock Market Today, Jan. 15: ImmunityBio Surges After Anktiva Revenue Jumps 700%": 0.8,
  "Cadence Design Systems (CDNS) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Stock Market Today, Jan. 15: Nokia Rises After Morgan Stanley Upgrade on AI and Cloud Growth Potential": 0.6,
  "Analog Devices (ADI) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Why Paccar (PCAR) Outpaced the Stock Market Today": 0.5,
  "Vertex Pharmaceuticals (VRTX) Stock Sinks As Market Gains: Here's Why": -0.5,
  "How Beth Wozniak Powered The Transformation Of nVent Electric": 0.5,
  "Is It Time To Reassess Atlassian (TEAM) After A 49% One-Year Share Price Fall?": -0.5,
  "Ross Stores (ROST) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Verizon Offers $20 Credits After Resolving Outage Affecting Millions": 0.8,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (b) On January 13, 2026, Christopher D. Young, a member of the Board of Directors (the “Board”) of QUALCOMM Incorporated (the “Company”), informed the Board that due to the significant time commitment required in his new role as Chief Executive Officer and a member of the board of directors of Vertex, Inc., he will be stepping": -0.2,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (b) On January 14, 2026, C. Michael Dozier, Executive Vice President, announced his retirement from PACCAR after 37 years of service. Mr. Dozier’s retirement is effective April 1, 2026.\n\n(Item 8.01) . Other Events W. Lance Walters, Assistant Vice President, will be promoted to Vice President and will assume responsibilities for the Company’s operations in Australia, Mexico and South America effective April 1, 2026. Raja Shembekar, Vice President, will assume responsibilities for international business development effective April 1, 2026.": 0.2,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (c) The Board of Directors (the \"Board\") of Meta Platforms, Inc. (the \"Company\") appointed Dina Powell McCormick, age 52, to serve as President and Vice Chairman of the Company, effective January 12, 2026 (the \"Start Date\"). Previously, Ms. Powell McCormick served as Vice Chair, President and Head of Global Client Services at BDT & MSD Partners, an": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Walmart U.S. On January 16, 2026, David Guggina, age 40, was appointed Executive Vice President, President and Chief Executive Officer, Walmart U.S. , effective February 1, 2026 (the “Effective Date”). Mr. Guggina will succeed John Furner in this role, whose promotion to President and Chief Executive Officer of Walmart Inc. (the “Company”) as of the Effective": 0.1,
  "Is It Too Late To Consider Monolithic Power Systems (MPWR) After Its 71% One-Year Rally?": 0.2,
  "A Look At Monolithic Power Systems (MPWR) Valuation After Its Strong Recent Share Price Performance": 0.5,
  "Agoda Shares Where to Travel Each Month in 2026 Across Asia": 0.2,
  "Is GE HealthCare Technologies (GEHC) Attractive After Recent Spin Off And Price Weakness": 0.2,
  "Q3 Earnings Highlights: Autodesk (NASDAQ:ADSK) Vs The Rest Of The Design Software Stocks": 0.2,
  "Reflecting On Semiconductor Manufacturing Stocks’ Q3 Earnings: Marvell Technology (NASDAQ:MRVL)": 0.5,
  "The Best Stocks to Invest $10,000 in Right Now": 0.5,
  "1 High-Flying Stock to Own for Decades and 2 We Ignore": 0.2,
  "1 Stock Under $50 with Impressive Fundamentals and 2 We Question": 0.2,
  "1 Mooning  Stock to Keep an Eye On and 2 We Ignore": 0.2,
  "3 Profitable Stocks with Open Questions": 0.0,
  "2 Semiconductor Stocks with Competitive Advantages and 1 We Avoid": 0.5,
  "1 Surging  Stock with Impressive Fundamentals and 2 We Find Risky": 0.5,
  "3 Market-Beating Stocks to Target This Week": 0.5,
  "Does PDD Holdings (PDD) Still Offer Value After Recent Share Price Pullback?": 0.2,
  "Assessing PDD Holdings (PDD) Valuation After Recent Share Price Weakness": 0.2,
  "Monolithic Power (MPWR) Faces a Key Test: How Durable Is Its AI Power-Management Edge?": 0.2,
  "Hilton, Marriott, and Hyatt Are Near Record Highs. These 2 Hotel Stocks Are Better Buys.": 0.8,
  "2 Dirt Cheap Stocks to Buy With $1,000 Right Now": 0.5,
  "Intuitive says general surgery, acute care fuel US robot momentum": 0.2,
  "US Stock Market Today: S&P 500 Futures Edge Higher On Strong Jobs Data And Tariff Jitters": 0.5,
  "Al Qimmah and Marriott to develop five new hotels in Saudi Arabia": 0.5,
  "Disney Picks a New Star Wars Chief. Big News for the Stock It Is.": 0.8,
  "Cell and Gene Therapy Investment Trends Strategic Intelligence Report 2025-2031: Yescarta from Gilead Sciences and Zolgensma from Novartis Generated $1.5 Billion and $1.2 Billion in 2024 Sales": 0.5,
  "Halliburton and Its Rivals Can’t Wait to Get Back Into Venezuela": 0.2,
  "Cadence Design Systems, Inc. (NASDAQ:CDNS) is favoured by institutional owners who hold 89% of the company": 0.5,
  "Zacks Investment Ideas feature highlights: Taiwan Semiconductor Manufacturing, ASML and Lam Research": 0.5,
  "A $450 Billion Opportunity: Is Serve Robotics Stock a Buy in 2026?": 0.5,
  "Exploring High Growth Tech Stocks In The US January 2026": 0.5,
  "GoodDay Software Raises $7M to Build an AI-Native ERP Alternative for Shopify Brands": 0.8,
  "Cadence Design Systems' Q4 2025 Earnings: What to Expect": 0.0,
  "Can PDD (PDD) Turn Its Billion-Dollar Supermarket Bet Into Lasting Competitive Advantage?": 0.2,
  "Zacks Industry Outlook Highlights Micron Technology, Advanced Micro Devices, International Business Machines and Seagate Technology": 0.5,
  "The Zacks Analyst Blog Highlights American Express, Intuitive Surgical, Booking Holdings, Daily Journal and Star Group": 0.5,
  "What You Need to Know Ahead of CoStar Group's Earnings Release": 0.0,
  "Synopsys to sell processor IP solutions business to GlobalFoundries": 0.5,
  "NXP Semiconductors price target raised to $285 from $275 at Citi": 0.5,
  "Here Are Friday’s Top Wall Street Analyst Research Calls: ConocoPhillips, Devon Energy, Garmin, Honeywell, HP, PepsiCo, Rocket Labs, Seagate, and More": 0.5,
  "Here's What to Expect From Applied Materials' Next Earnings Report": 0.2,
  "SST, UMC announce availability of 28nm SuperFlash Gen 4 platform": 0.5,
  "AI dash cam aims to reduce fleet collisions: Motive": 0.5,
  "Here's How Much You'd Have If You Invested $1000 in Lam Research a Decade Ago": 0.5,
  "4 Women-Run Company Stocks Building Durable Growth Stories": 0.5,
  "Implied Volatility Surging for Vertex Pharmaceuticals Stock Options": 0.5,
  "The Cross-Border Specialist Posts 25% Growth but Its Platform Rival Delivers Better Returns": 0.2,
  "Qualcomm Announces Quarterly Cash Dividend": 0.5,
  "Comcast Corporation (CMCSA) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Zscaler, Inc. (ZS) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "These 2 Oils-Energy Stocks Could Beat Earnings: Why They Should Be on Your Radar": 0.5,
  "Here is What to Know Beyond Why Applied Materials, Inc. (AMAT) is a Trending Stock": 0.2,
  "Is It Too Late To Consider Buying Applied Materials, Inc. (NASDAQ:AMAT)?": 0.1,
  "MRVL's Data Center Switching Business Expands: New Growth Engine?": 0.6,
  "8 Things About Getting Rich You Aren’t Aware Of, According to Chelsea Fagan": 0.1,
  "ASML Pushes High-NA EUV Forward: How Big is the Manufacturing Leap?": 0.5,
  "Here’s What Lifts Ross Stores (ROST)": 0.2,
  "Tech rally, US-Taiwan chip deal, power grid auction: 3 Things": 0.5,
  "Paychex Announces $1 Billion Stock Repurchase Authorization and Declares Quarterly Dividend": 0.8,
  "CSX (CSX) Q4 Earnings on the Horizon: Analysts' Insights on Key Performance Measures": 0.2,
  "Intuitive Surgical (ISRG) Q4 Earnings on the Horizon: Analysts' Insights on Key Performance Measures": 0.2,
  "Is CDNS Worth Adding Despite Breakeven Returns in the Past Six Months?": 0.1,
  "What You Need To Know Ahead of Palo Alto Networks' Earnings Release": 0.2,
  "Paychex (PAYX) Sold Off 10% Despite Strong Earnings": 0.2,
  "Brokers Suggest Investing in Intuitive Surgical (ISRG): Read This Before Placing a Bet": 0.5,
  "Is It Worth Investing in Marvell (MRVL) Based on Wall Street's Bullish Views?": 0.5,
  "Brokers Suggest Investing in Workday (WDAY): Read This Before Placing a Bet": 0.5,
  "Surging Intel Stock, 2 Other Nasdaq 100 Giants Headline Earnings Calendar": 0.5,
  "Seagate upgraded, Tractor Supply downgraded: Wall Street's top analyst calls": 0.2,
  "Here's Why You Should Hold DexCom Stock in Your Portfolio for Now": 0.6,
  "3 Brilliant Dividend Stocks to Buy Now and Hold for the Long Term": 0.8,
  "Honeywell upgraded at JPM as breakup nears and aerospace momentum builds": 0.8,
  "Company News for Jan 16, 2026": 0.0,
  "Buy 4 Discretionary Stocks as Rate Cut Hopes Rise on Easing Inflation": 0.6,
  "Micron and Sandisk Stocks Are on a Roll. This Is the Latest Memory-Chip Catalyst.": 0.8,
  "TSMC Stock Rises as It Plans $56 Billion Splurge on AI Chip Making. What Really Matters.": 0.6,
  "Datadog's Q4 2025 Earnings: What to Expect": 0.0,
  "Is GE HealthCare (GEHC) Using Edge AI Partnerships To Redefine Its Long-Term Competitive Moat?": 0.5,
  "DELL vs. CSCO: Which AI Infrastructure Stock Is the Better Buy Now?": 0.5,
  "At 15.93 P/S, Broadcom Is Overvalued: Buy, Sell or Hold the Stock?": -0.5,
  "Automatic Data Processing Poised to Gain From AI Product Launches, RBC Says": 0.8,
  "TSMC’s $56B AI Bet Just Made These 3 Stocks Millionaire Makers": 0.5,
  "3 Chip Stocks to Buy for 2026, According to an Analyst": 0.5,
  "Online Grocery Market Projected to Reach US$ 2,237.1 Billion by 2035, Supported by Rising Digital Transaction Volumes Says Astute Analytica": 0.6,
  "Are You Looking for a Top Momentum Pick? Why KLA (KLAC) is a Great Choice": 0.8,
  "Don’t Go Chasing Semis (Yet). What the Charts Say About Entry Points for 3 Chip Stocks.": 0.2,
  "Ciena Stock Gains 43% in 3 Months: Should Investors Buy or Hold Now?": 0.5,
  "AppLovin's Scalable Ad Engine Emerges as the Real Growth Catalyst": 0.8,
  "Will Baker Hughes (BKR) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Jim Cramer on Texas Instruments: “It’ll Come Around”": 0.5,
  "Jim Cramer Calls Crane Company a “Good Company”": 0.6,
  "30 Stocks to Buy in 2026, According to Our Roundtable Pros": 0.5,
  "3 Low P/E Stocks: Separating Multibaggers From a Value Trap": 0.5,
  "DexCom Stock Declines Following Strong Preliminary Q4 Results": -0.5,
  "Intuitive Surgical Stock Dips on Q4 Preliminary Revenue Results": -0.5,
  "Paramount Skydance (PSKY)’s Warner Bros. Lawsuit is a Waste of Time, Says Jim Cramer": -0.6,
  "Warner Bros. (WBD) Getting Sued is a Waste of Time, Says Jim Cramer": 0.2,
  "US Oil Drillers Add To Active Rigs": 0.2,
  "KLA (KLAC) is “Terrific,” Says Jim Cramer": 0.8,
  "Intel Stock Fall Despite Citi Upgrade Amid Foundry Hopes": 0.1,
  "Fund manager pulls plug on popular semiconductor stock": -0.5,
  "Applied Materials Stock Just Hit a New All-Time High. Should You Buy AMAT Here?": 0.5,
  "Sector Update: Consumer Stocks Decline in Afternoon Trading": -0.5,
  "DataDog Inc (DDOG) Set To Be a Beneficiary of Vendor Consolidation": 0.6,
  "2026’s Biggest AI Trends: The Memory Explosion | MU Stock, SNDK Stock, SK Hynix, CAMT Stock": 0.2,
  "Emersoft Launches First Complete Commerce Solution for Online and Brick-and-Mortar Bookstores": 0.8,
  "Seagate Stock Continues to Rally. The Stock’s Last Doubter Waved the White Flag.": 0.8,
  "Barclays Lowers Firm’s PT on Workday, Inc. (WDAY) Stock": -0.5,
  "Piper Sandler Reduces the Firm’s PT on Roper Technologies (ROP) Stock": -0.5,
  "Why CrowdStrike’s SGNL Acquisition Matters for CRWD Stock": 0.5,
  "Sector Update: Consumer Stocks Decline Late Afternoon": -0.5,
  "Wells Fargo Can’t Get Enough of These 2 Semiconductor Stocks": 0.6,
  "Honeywell upgraded by JPMorgan, OpenAI to begin testing ads": 0.5,
  "Ahead of the Quantinuum IPO, Should You Buy Honeywell Stock?": 0.2,
  "Why Atlassian (TEAM) Stock Is Nosediving": -0.8,
  "Today’s Stock Movers: GE Vernova, Constellation Energy, Micron, AST SpaceMobile, Novo Nordisk, and More": 0.0,
  "Trump To Propose Tech Giants Fund Power Grid Buildouts, Energy Stocks Swing": 0.2,
  "The $56 Billion Draft: Follow TSMC’s CapEx Stream": 0.1,
  "US Equity Markets Fall as Treasury Yields Rise on Fed Chair Speculation": -0.7,
  "US Equity Indexes Muted, Treasury Yields Rise After Trump Appears to Rule Out Hassett as Next Fed Chair": 0.1,
  "Trump Has a New Plan to Power AI. GE Vernova Stock and Others Should Benefit.": 0.5,
  "Fastenal Company Announces Cash Dividend": 0.0,
  "Equities Little Changed as Fed Chair Race Keeps Markets Guessing": 0.0,
  "Stocks to Watch Friday Recap: J.B. Hunt, Salesforce, PNC": 0.0,
  "Zscaler investors fire warning shot at management with board declassification vote": -0.6,
  "Xcel Energy 2025 Year End Earnings Conference Call": 0.0,
  "Why a New Trump Plan Sparked Huge Moves for Power Stocks on Friday": 0.5,
  "Synopsys (SNPS) Ascends While Market Falls: Some Facts to Note": 0.5,
  "Constellation Energy Corporation (CEG) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Applied Materials (AMAT) Advances While Market Declines: Some Information for Investors": 0.5,
  "Why the Market Dipped But ASML (ASML) Gained Today": 0.2,
  "Take-Two Interactive (TTWO) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "Texas Instruments (TXN) Advances While Market Declines: Some Information for Investors": 0.5,
  "Autodesk (ADSK) Advances While Market Declines: Some Information for Investors": 0.5,
  "Trump at Davos, Netflix earnings, SCOTUS hearing: What to Watch": 0.0,
  "How Aflac’s Workday Wellness Integration Could Reshape Benefits Engagement for Aflac (AFL) Investors": 0.5,
  "US rig count down one as prices increase": 0.2,
  "Affirm Will Take Share From Revolving Credit, Analyst Says. Plus, Palo Alto, SharkNinja, and More Stocks.": 0.2,
  "ComEd Files Four-Year Grid Plan to Sustain Reliability, Maintain Affordability and Adapt to Rising Energy Demands": 0.5,
  "Is There Still Value In Booking Holdings (BKNG) After The Recent Share Price Pullback": 0.2,
  "What's Behind This Fund's $19 Million Bet on MercadoLibre Stock?": 0.1,
  "Bloom Energy (BE) Soars Following Deal with American Electric Power Company": 0.8,
  "Best Consumer Growth Stock to Buy Right Now: Dutch Bros or Chipotle?​": 0.5,
  "Starbucks (NASDAQ:SBUX) Is Experiencing Growth In Returns On Capital": 0.6,
  "Morgan Stanley Lifts AppLovin Corporation (APP) Target on AI-Led Growth Thesis": 0.6,
  "MarketBeat Week in Review – 01/12 - 01/16": 0.0,
  "A Look At The Intrinsic Value Of NXP Semiconductors N.V. (NASDAQ:NXPI)": 0.2,
  "Do Automatic Data Processing's (NASDAQ:ADP) Earnings Warrant Your Attention?": 0.2,
  "Like DoorDash and Google’s CEOs, $7.6 billion Informatica boss is a McKinsey alum—he says being ‘pushed around’ by smart consultants helped him grow": 0.2,
  "Are Investors Undervaluing PepsiCo, Inc. (NASDAQ:PEP) By 41%?": 0.2,
  "T-Mobile US (NASDAQ:TMUS) sheds 7.1% this week, as yearly returns fall more in line with earnings growth": -0.2,
  "MCHI Soars 45% as Chinese Equities Break Multi-Year Slump": 0.8,
  "The solar panel contracts that can kill home sales": -0.6,
  "My 3 Favorite Stocks to Buy Right Now": 0.0,
  "These 7 Stocks Are Analyst Favorites For Magnificent Earnings Growth; Google Stock Trades Near Buy Point": 0.8,
  "3 Stocks to Avoid as Software Sector Stumbles": -0.7,
  "The Saturday Spread: Using the Markov Property to Find Mispriced Opportunities (PANW, NTES, DKS)": 0.2,
  "3 Top Bargain Stocks Ready for a Bull Run": 0.8,
  "Rothschild Redburn Stays Bullish on ASML on Strong Order Intake": 0.8,
  "Autodesk (ADSK) Earns Top Pick Status at Piper Sandler on AI Progress": 0.8,
  "Arm (ARM) Downgraded by BofA on Smartphone and Royalty Headwinds": -0.7,
  "KLA (KLAC) Gets Upgrade as Foundry-Led WFE Demand Accelerates": 0.6,
  "Costco Switches Food Court Back to Coke After Decade With Pepsi": 0.5,
  "How Strong AI‑Driven Quarter and Upbeat Guidance At Autodesk (ADSK) Has Changed Its Investment Story": 0.6,
  "Is SoftBank (TSE:9984) Quietly Pivoting Into an AI and Energy Infrastructure Powerhouse?": 0.5,
  "The US \"Safety Premium\" is dying. You are paying for stability that isn't there anymore. - Everyone knows US stocks trade at higher valuations than the rest of the world. The S&P 500 is historically expensive (Shiller PE near 40x). The usual argument is that the US deserves a \"Trust Premium.\" We have the stable government, the reserve currency, and the predictable policy. You pay a luxury tax for US stocks because it's the safe": -0.7,
  "Analysts Bullish on Lam Research Corporation (LRCX) as Semiconductor Capex and Memory Investments Rise": 0.8,
  "Street Calls of the Week": 0.0,
  "5 big analyst AI moves: Nvidia top 2026 pick, ASML gets big price target hike": 0.5,
  "Calculating The Intrinsic Value Of Marvell Technology, Inc. (NASDAQ:MRVL)": 0.1,
  "Is Analog Devices, Inc. (NASDAQ:ADI) Potentially Undervalued?": 0.2,
  "Palo Alto Networks Insiders Sold US$5.0m Of Shares Suggesting Hesitancy": -0.5,
  "BNP Paribas Assumes Coverage of DoorDash (DASH), Assigns ‘Outperform’ Rating with $280 PT": 0.6,
  "Broader Anlayst Sentiment Positive on MercadoLibre (MELI) As AI Tailwinds Offset Rising Capital Expenditure": 0.6,
  "2 Consumer Stocks Set for a Comeback in 2026": 0.5,
  "Why The 26% Return On Capital At MercadoLibre (NASDAQ:MELI) Should Have Your Attention": 0.6,
  "Amgen Inc. (NASDAQ:AMGN) is largely controlled by institutional shareholders who own 80% of the company": 0.1,
  "Dave Ramsey: 7 Brutally Honest Money Tips To Follow": 0.5,
  "The Cloud Computing ETF Every Growth Investor Should Consider": 0.5,
  "Trump in Davos, Netflix and Intel results on deck as earnings season ramps up: What to watch this week": 0.2,
  "Is It Time To Reassess Xcel Energy (XEL) After Its Recent Share Price Strength": 0.2,
  "Bank stock picks, crypto trajectory, dealmaking appetite, and more takes from top execs this past week": 0.2,
  "‘No Reasons to Own’: Software Stocks Sink on Fear of New AI Tool": -0.7,
  "A Look At The Intrinsic Value Of Honeywell International Inc. (NASDAQ:HON)": 0.2,
  "With 87% institutional ownership, Texas Instruments Incorporated (NASDAQ:TXN) is a favorite amongst the big guns": 0.6,
  "3 No-Brainer Dividend Stocks to Buy Right Now": 0.5,
  "A bear case for Mag7: US is burning its \"Trust Capital\" - Looking at the actual revenue split of the biggest US companies, such as the Mag 7. You can argue that they aren't really American companies anymore. They are global utilities that just happen to pay taxes in California. \\- Meta: \\~64% revenue from outside US \\- Apple: \\~64% revenue from outside US \\- Google: \\~56% revenue from outside US The only reason the": -0.6,
  "Big Risk, Potentially Bigger Return For These 3 Leveraged ETF's": 0.5,
  "'A broadening playbook': Wall Street sees stock market gains beyond tech": 0.5,
  "Anyone else catching the falling knife in SaaS lately? - AI fears have crushed software stocks while the rest of tech is near highs. Valuations looks attractive though, with many names at multi-year lows despite wide moats and strong margins. I started buying last week (ADBE and WDAY) and think pessimism may be overdone. Curious if others are buying here or waiting for a clearer catalyst.": 0.6,
  "Is Evotec SE (EVO) One of the Best Debt-Free Penny Stocks to Buy Right Now?": 0.5,
  "Jim Cramer Says “Lately, Though, Cisco’s Gotten Its Act Together”": 0.5,
  "Jim Cramer Says “I Am Not Going to Call Bottom in ServiceNow”": 0.1,
  "KLA Corp. Stock Just Got a New Street-High Price Target. Should You Buy KLAC Shares Now?": 0.5,
  "How much to invest in Pepsi for $1,000 in annual dividends (2026)": 0.0,
  "Constellation Energy: Current Price Levels Leave No Room for Error": -0.8,
  "Monolithic Power Systems (MPWR) Emerges as High-Conviction AI Data Center Power Play": 0.8,
  "BTIG Sees Strategic Value in CrowdStrike’s (CRWD) SGNL, Seraphic Acquisitions": 0.5,
  "Chick-Fil-A's Bold Move Shows How Far Restaurants Will Go To Protect Sales": 0.6,
  "Software Stocks Are in Turmoil. Here Are 5 to Buy Right Now.": 0.2,
  "The Bull Case For Fastenal (FAST) Could Change Following Dividend Hike And CEO Transition Timing": 0.5,
  "Assessing Qualcomm (QCOM) Valuation After New Robotics And AI Announcements": 0.2,
  "Agoda reveals: Sapa, Vietnam is Asia's top emerging destination": 0.8,
  "DD on $CDE silver/gold miner - Here is DD on an undervalued silver and gold mining stock, CDE: Couer Mining (CDE) is currently trading at 22.6, and is valued at 32.2. I have shares at 18.5 and have been playing calls. I am expecting a BIG gap up on Tuesday so hopefully you guys bought in last week, but it may not be too late! Here is why I like CDE: They have an upcoming": 0.6,
  "Does Constellation Energy’s (CEG) Massive Shelf and NRC Win Reframe Its Data Center Nuclear Thesis?": 0.2,
  "Did Exelon's (EXC) New Grid Plan and Tech Leadership Shift Its Regulated Growth Narrative?": 0.2,
  "Fastenal (FAST) Q4 Earnings: What To Expect": 0.0,
  "Does Seagate (STX) Leaning Into AI Edge Storage Reframe Its Core Competitive Moat?": 0.2,
  "Diamondback (FANG) Says Realized Oil Prices Fell in Q4 as Crude Market Weakened": -0.5,
  "Fastenal (FAST) Valuation Check After Dividend Increase CEO Change And Upcoming Earnings": 0.2,
  "3 Consumer Stocks We’re Skeptical Of": -0.5,
  "2 of Wall Street’s Favorite Stocks with Solid Fundamentals and 1 Facing Challenges": 0.5,
  "1 Value Stock with Competitive Advantages and 2 We Avoid": 0.0,
  "Evercore ISI Raises Old Dominion (ODFL) Target but Warns Transport Optimism is Priced In": 0.1,
  "2 Internet Stocks with Competitive Advantages and 1 We Turn Down": 0.5,
  "2 Cash-Producing Stocks for Long-Term Investors and 1 That Underwhelm": 0.2,
  "1 Large-Cap Stock with Exciting Potential and 2 That Underwhelm": 0.5,
  "2 Large-Cap Stocks with Promising Prospects and 1 We Avoid": 0.5,
  "3 Profitable Stocks We Think Twice About": -0.5,
  "3 Large-Cap Stocks We Find Risky": -0.7,
  "Assessing Exelon (EXC) Valuation After New Grid Plan Customer Relief Fund And Transmission Agreements": 0.5,
  "Analyst Weighs Patent Cliff Risks Against Insmed’s (INSM) Growth Story": 0.2,
  "Analysts Remain Cautious on Palo Alto (PANW) Amid Growth Challenges": -0.5,
  "Amazon: European Sovereign Cloud Launch - ​Amazon Web Services (AWS) has officially launched the AWS European Sovereign Cloud, beginning with its first region in Brandenburg, Germany with €7.8 billion investment through 2040. **AWS European Sovereign Cloud** * Set up as a distinct corporate entity under EU law. * Physically and logically independent cloud environment designed to ensure compliance to EU digital sovereignty laws. * Will be operated and maintained by EU citizens (after transition). *": 0.8,
  "Water.org Partners with Gap Inc., Amazon, Starbucks, and Ecolab to Launch Get Blue™, Advancing Water.org's Goal of Reaching 200 Million People by 2030": 0.8,
  "A Look At Microchip Technology (MCHP) Valuation After Positive Analyst Support And New Automotive And Aerospace Products": 0.6,
  "This Dirt Cheap Stock Could Make You Filthy Rich": 0.8,
  "Hotels, Resorts, & Cruise Lines Market Forecast Report, 2026-2032: Accor, Hilton, Marriott, Carnival, and Royal Caribbean Ramp Up Tech Investments": 0.5,
  "US Stock Market Today: S&P 500 Futures Fall On Tariff And Rate Jitters": -0.7,
  "Analysts See Over 30% Upside in DoorDash Inc. (DASH) Despite Margin Uncertainty": 0.5,
  "Institutional owners may consider drastic measures as Adobe Inc.'s (NASDAQ:ADBE) recent US$13b drop adds to long-term losses": -0.8,
  "Should Weakness in Roper Technologies, Inc.'s (NASDAQ:ROP) Stock Be Seen As A Sign That Market Will Correct The Share Price Given Decent Financials?": 0.2,
  "Assessing CSX (CSX) Valuation After Recent Share Price Stability And Mixed Short Term Returns": 0.2,
  "CrowdStrike (CRWD) Valuation Check As Short Term Returns Cool And Long Term Gains Remain Strong": 0.6,
  "Analog Devices' Quarterly Earnings Preview: What You Need to Know": 0.5,
  "Black Swan | The Greenland Gambit: Why Novo Nordisk (NVO) is the Ultimate Geopolitical Pawn | Denmark's Crown Jewel on US Entity Black List - # Section 1: The Arctic Standoff and the \"Novo Nordisk Risk\" In the early weeks of 2026, the frozen landscape of the Arctic has transformed into the most volatile theater in global geopolitics. What began as the \"Greenland Crisis\" has rapidly escalated from a diplomatic curiosity into a full-blown transatlantic": 0.1,
  "Microchip Expands PolarFire® FPGA Smart Embedded Video Ecosystem with New SDI IP Cores and Quad CoaXPress™ Bridge Kit": 0.5,
  "Insiders At Monster Beverage Sold US$4.3m In Stock, Alluding To Potential Weakness": -0.6,
  "Here's Why Baker Hughes (NASDAQ:BKR) Has Caught The Eye Of Investors": 0.5,
  "Axon Enterprise Insiders Sell US$43m Of Stock, Possibly Signalling Caution": -0.5,
  "What to Expect From Marriott International’s Next Quarterly Earnings Report": 0.2,
  "Philadelphia dad wants to ditch steady salary to finance new car and drive Uber. Ramsey hosts beg for him to rethink it": -0.6,
  "Northcoast Upgrades Axon (AXON) to Buy With $742 Price Target": 0.8,
  "Bernstein Names Vertex (VRTX) a “Top Biotech Pick” for 2026 Following Upgrade to Outperform": 0.8,
  "Goldman Sachs Initiates Workday (WDAY) at Neutral as Challenging Market Share Gains Temper AI Optimism": -0.5,
  "Wells Fargo Downgrades Intuit (INTU) as “Impossible” 2025 Comparisons Cloud 2026 Growth Outlook": -0.6,
  "Sharon AI Accelerates Enterprise AI & High-Performance Compute Expansion with an Investment from Digital Alpha of up to US$200M and Strategic Technology Partnership with Cisco": 0.5,
  "More AI means a higher need for cybersecurity: CrowdStrike CEO": 0.5,
  "Beat the Market the Zacks Way: Amicus, Micron, Amgen in Focus": 0.5,
  "Makes a sense to wait and see when evidence is there? Anktiva from IBRX, question. - FDA approved.SFDA approved.EMA fast track approved. Phase 3 for lung cancer. Phase 1/2 for pancreatic cancer, lymphoma. All the behind the scenes tech involved,the supporting science ebidence and pathways,all the possible pipelines as combo treatment improving survival rates...this looks very very promising.": 0.8,
  "Assessing Paychex (PAYX) Valuation After Earnings Beat And New US$1b Buyback In A Soft Employment Backdrop": 0.5,
  "ASML Holding (ENXTAM:ASML) Is Up 7.4% After TSMC Unveils Higher AI-Focused Capex Plans": 0.8,
  "Gilead Sciences Earnings Preview: What to Expect": 0.0,
  "PANW vs. ALLT: Which Network Security Stock is the Better Buy?": 0.2,
  "Jim Cramer Says Texas Roadhouse Is “Breaking Out to the Upside”": 0.6,
  "Jim Cramer on Arm Holdings: “I Would Hold It”": 0.6,
  "Jim Cramer Datadog: “We’re Going to Stay Away From These Enterprise Software Companies”": -0.5,
  "Jim Cramer on Autodesk: “We’re Going to Stay Away From the Love Canal That is Enterprise Software”": -0.6,
  "Jim Cramer on Starbucks: “I Think That Brian Niccol Is Going to Pull Off This Turnaround”": 0.6,
  "Payoneer vs PayPal: Which Payment Processor Wins the Stablecoin War?": 0.5,
  "AI, Digital Tools and Hub Data: Could ISRG Evolve Beyond Robotics?": 0.2,
  "Lumen Stock Up 18% in the Past 3 Months: Stay Invested or Exit?": 0.2,
  "ASML Stock Drops Due to Trade War Worries. These Chip Companies Are Suffering Too.": -0.7,
  "Sweet Meets Salty: RITZ™ Drizzled Minis Arrive in Canada": 0.6,
  "OREO Cakesters Expands Lineup with New Double Chocolate Flavour and Limited-Time Soft Factory Experience": 0.5,
  "Want to Invest in Nvidia’s Futuristic Rubin Chips? Consider This 1 ‘Picks-and-Shovels’ Stock Instead.": 0.5,
  "Ignore the China Drama and Buy Applied Materials Stock": 0.5,
  "Earnings Preview: What To Expect From Exelon’s Report": 0.5,
  "CytomX Stock Rises 31% in a Month: Here's What You Should Know": 0.6,
  "Wedgewood Partners’ Trimmed Its Holdings in PayPal Holdings (PYPL)": 0.1,
  "Old Dominion Freight Line (ODFL) Benefited From Investors’ Shift to Cyclical Sectors": 0.5,
  "Thomson Reuters introduces AI-based sales and use software tool": 0.5,
  "ASML Stock Can Hit $1,500, According to Pro": 0.5,
  "ADI's Consumer Revenues Rise 19% Y/Y in FY25: More Growth Ahead?": 0.6,
  "Is Constellation Energy Stock a Buy Now?": 0.2,
  "Earnings Preview: What To Expect From Booking Holdings' Report": 0.5,
  "KLA (KLAC) Is Up 9.8% After Analyst Upgrades On AI Chip Demand Narrative Shift?": 0.6,
  "The Best Healthcare Stocks to Buy With $5,000 in 2026 and Hold Forever": 0.5,
  "Top AI Stocks to Boost Returns and Reignite Portfolio Growth": 0.6,
  "Costco Stock Rallies on December Sales: Buy, Hold or Take Profits?": 0.5,
  "Are Sovereign AI Deals Innodata's Next Billion-Dollar Opportunity?": 0.5,
  "Assessing KLA (KLAC) Valuation After Broker Upgrades On AI Chip Equipment Demand": 0.5,
  "APP Stock Declines 22.5% in a Month: Should You Buy the Dip?": 0.2,
  "Pepsi killed a popular cola flavor, Coca-Cola does not offer": -0.5,
  "Snacking Headwinds Persist: Can PepsiCo's Beverages Carry the Load?": -0.5,
  "2 Dividend Stocks to Buy and Hold For 10 Years": 0.5,
  "Ozempic, Mounjaro, Wegovy, or Zepbound? This ETF Holds Them All": 0.1,
  "BTIG Stays Bullish on Atlassian (TEAM) After Data Center Pricing Update": 0.8,
  "Uranium and Rare Earth bottlenecks - Curious about your opinion on these allocations, I’ve put about 40k between these picks given the current geopolitics between China’s rare earth dominance and U.S. bolstering domestic nuclear and rare earths. I’m holding long on these let me know what you think: CCJ 22% LEU 18% BWXT 16% UUUU 14% MP 15% CEG 15%": 0.5,
  "Top Research Reports for GE Aerospace, KLA & Parker-Hannifin": 0.0,
  "Arm Holdings plc (ARM): A Bull Case Theory": 0.5,
  "AppLovin Corporation (APP): A Bull Case Theory": 0.5,
  "Davos CEO Brief for Monday, January 19, 2026": 0.0,
  "Assessing DexCom (DXCM) Valuation After Recent Share Price Momentum And Conflicting Fair Value Signals": 0.2,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Director Appointment On January 16, 2026, the Board of Directors (the “ Board ”) of DoorDash, Inc. (the “ Company ”), upon the recommendation of its Nominating and Corporate Governance Committee, approved an increase in the size of the Board to eleven (11) members and elected Milan Kovac as a member of the Board. Mr. Kovac will": 0.1,
  "(Item 1.01) Entry into a Material Definitive Agreement. Amended and Restated Agreement and Plan of Merger On January 19, 2026, Netflix, Inc., a Delaware corporation (“Netflix”), Nightingale Sub, Inc., a Delaware corporation and wholly owned subsidiary of Netflix (“Merger Sub”), Warner Bros. Discovery, Inc., a Delaware corporation (“WBD”), and New Topco 25, Inc., a newly formed Delaware corporation and wholly owned subsidiary of WBD (“Newco”), entered into an Amended and Restated Agreement and Plan of Merger (the": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On January 20, 2026, Netflix, Inc. (the “Company”) announced its financial results for the quarter ended December 31, 2025. The Letter to Shareholders, which is attached hereto as Exhibit 99.1 and is incorporated herein by reference, includes reference to the non-GAAP financial information. A reconciliation to the GAAP equivalent of non-GAAP measures is contained in tabular form in Exhibit 99.1. We are not able to reconcile forward-looking non-GAAP financial\n\n(Item 2.02) and the accompanying Exhibit 99.1 are “furnished” and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that section, and shall not be incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act regardless of any general incorporation language in such filing, unless expressly incorporated by specific": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On January 20, 2026, the Registrant issued a press release announcing the results of its most recently ended fiscal quarter, a copy of which is attached hereto as Exhibit 99.1 and is incorporated herein by reference.": 0.0,
  "(Item 1.01) Entry into a Material Definitive Agreement. On January 19, 2026, Warner Bros. Discovery, Inc., a Delaware corporation (“WBD”), Netflix, Inc., a Delaware corporation (“Netflix”), Nightingale Sub, Inc., a Delaware corporation and wholly owned subsidiary of Netflix (“Merger Sub”), and New Topco 25, Inc., a newly formed Delaware corporation and wholly owned subsidiary of WBD (“NewCo”), entered into an Amended and Restated Agreement and Plan of Merger (the “Amended and Restated Merger Agreement”), which amends and": 0.1,
  "(Item 8.01) Other Events. Pursuant to the terms of the Amended and Restated Registration Rights Agreement, dated as of July 2, 2015, by and among The Kraft Heinz Company (the “Company”), 3G Global Food Holdings LP and Berkshire Hathaway Inc. (the “Selling Stockholder”), the Company filed a prospectus supplement on January 20, 2026 (the “Resale Prospectus Supplement”) with the Securities and Exchange Commission (the “SEC”) solely to register the potential resale by the Selling Stockholder of up": 0.1,
  "(Item 8.01) Other Events. ATM Update On January 20, 2026, Strategy Inc (\"Strategy\") announced an update with respect to sales made under its at-the-market offering program (\"ATM\") of the following securities: During Period January 12, 2026 to January 19, 2026 As of January 19, 2026 Security Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) STRF Stock - $ - $ - $ 1,619.3 10.00% Series A": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On January 20, 2026, Paychex, Inc. (the \"Company\") announced that the Board of Directors (the \"Board\") has voted to expand to eleven members and has appointed J. Michael Hansen, to fill the newly created position as an independent director. Mr. Hansen will participate in the Company's compensation arrangement generally applicable to all of the Company's non-employee directors.\n\n(Item 8.01) Other Events. On January 16, 2026, the Company announced that the Board approved a program to repurchase up to $1 billion of the Company's common stock. This authorization replaces the Company's existing 2024 authorization to repurchase $400 million of the Company's common stock. The Company's press release dated January 16, 2026, announcing the stock repurchase authorization and quarterly dividend is furnished as Exhibit 99.2 to this Current Report on Form 8-K.": 0.5,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Appointment of Director On January 16, 2026, the Board of Directors (the “Board”) of Advanced Micro Devices, Inc. (the \"Company\") approved the increase in the size of the Board from eight directors to nine directors and appointed Ms. KC McClure as a director to the Board to fill the resulting vacancy. In addition, Ms. McClure was appointed": 0.1,
  "Is It Too Late To Consider Baker Hughes (BKR) After Its Strong Multi‑Year Share Price Run?": -0.5,
  "Will TMUS keep dropping? - Hello, I'm currently losing a shit load of money on TMUS as I bought it at $230 like an idiot. Will this nightmare ever end? Isn't the downside already priced in and the only logical way to go is up? That's what I figured at $195 and now its $185. I don't think I have the tolerance to watch it drop any lower but at the same time I don't": -0.8,
  "A Look At Amgen (AMGN) Valuation After Strong Q3 Results And Pipeline Momentum": 0.6,
  "Qualcomm CEO Cristiano Amon on AI’s Next Big Thing": 0.5,
  "Is It Too Late To Consider Costco Wholesale (COST) After Strong Multi Year Share Gains": 0.5,
  "Is It Too Late To Consider Applied Materials (AMAT) After A 72% One Year Surge?": 0.1,
  "Constellation Energy (CEG) Completes Acquisition of Calpine Corporation": 0.5,
  "American Electric Power (AEP) Downgraded to ‘Neutral’, Price Target Trimmed": -0.5,
  "Sudden -20% DNUT swing, stay classy Krispy - Krispy Kreme clearly had a wildly bad 2025. Finishing the year -60% or so, and at one point down 75-80% Balance sheet issues, secular GLP trend, poor management and zero cost disciplines led to about $850M in debt, flat revenues YOY, and bleak outlook. There is a short interest of about 13%, or 27% of total float … and occasionally gets tested in this day & age.": -0.8,
  "Unpacking Q3 Earnings: Vertex Pharmaceuticals (NASDAQ:VRTX) In The Context Of Other Therapeutics Stocks": 0.2,
  "Q3 Rundown: Applied Materials (NASDAQ:AMAT) Vs Other Semiconductor Manufacturing Stocks": 0.0,
  "2 Reasons to Avoid NXPI and 1 Stock to Buy Instead": -0.5,
  "Ross Stores (ROST): Buy, Sell, or Hold Post Q3 Earnings?": 0.2,
  "Is Intuit (INTU) Turning Physical TurboTax Stores Into a New Competitive Moat?": 0.2,
  "Is Cluster of Bullish Analyst Notes on Service Quality Altering The Investment Case For Old Dominion Freight Line (ODFL)?": 0.2,
  "3 Software Stocks with Promising Prospects": 0.5,
  "1 Safe-and-Steady Stock to Target This Week and 2 That Underwhelm": 0.2,
  "2 Cash-Producing Stocks to Keep an Eye On and 1 Facing Headwinds": 0.2,
  "3 Profitable Stocks with Warning Signs": -0.5,
  "2 Cash-Heavy Stocks Worth Your Attention and 1 We Ignore": 0.2,
  "1 Cash-Producing Stock to Research Further and 2 We Find Risky": 0.2,
  "1 Semiconductor Stock to Consider Right Now and 2 We Ignore": 0.2,
  "Did Weaker Q4 Realized Prices Just Shift Diamondback Energy's (FANG) Investment Narrative?": 0.1,
  "Looking At The Narrative For Shopify SHOP As Growth And AI Recast The Story": 0.5,
  "What Catalysts Are Rewriting The Old Dominion Freight Line (ODFL) Story For 2026 And Beyond": 0.5,
  "Amazon vs. MercadoLibre: Which Stock Will Make You Richer?": 0.5,
  "Is It Too Late To Reconsider Old Dominion Freight Line (ODFL) After Mixed Share Price Performance": -0.5,
  "Old Dominion Freight Line (ODFL) Valuation Revisited As Analyst Optimism And Sector Rotation Gain Pace": 0.5,
  "[Latest] Global Thin-film Electrode Market Size/Share Worth USD 1,595.3 Million by 2035 at a 11.8% CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trends, Forecast, Segmentation, Growth Rate, Value, SWOT Analysis)": 0.5,
  "The Zacks Analyst Blog Highlights GE Aerospace, KLA, Parker-Hannifin and Affinity Bancshares": 0.5,
  "Grey Swan: Why the Rise in Japan 30 and 40 Year Bond Yield Will Cause Yen Carry Trade Unwind and Fuel a Global Financial Meltdown - # # Part I: The Political Detonator: The Takaichi Gambit and the 4% Barrier Since our last assessment, the \"Great Liquidity Era\" has entered a chaotic terminal phase. On January 19, 2026, Prime Minister Sanae Takaichi, Japan’s first female premier, shattered the remaining market calm by calling a snap": -0.6,
  "US Stock Market Today: S&P 500 Futures Drop As Growth Jitters And Yields Bite": -0.6,
  "2 Fintech Stocks to Buy Hand Over Fist in 2026 and Hold for 10 Years": 0.8,
  "Sweetgreen development chief to depart amid slower expansion plans": -0.5,
  "If You'd Invested $1,000 in Costco Stock 20 Years Ago, Here's How Much You'd Have Today": 0.5,
  "Grubhub parent acquires restaurant rewards app Claim": 0.2,
  "Here's What to Expect From Copart’s Next Earnings Report": 0.2,
  "$744.4 Bn Unified Communications Market, 2033| Astute Analytica": 0.0,
  "Who Are the Biggest Winners from Taiwan Semiconductor Manufacturing's Blowout Quarterly Report?": 0.5,
  "Crestline Adds Two Marriott Branded Orlando Hotels to its Growing Portfolio": 0.5,
  "It’s Funny SML Holding (ASML) Moved Faster Than TSMC, Says Jim Cramer": 0.5,
  "At US$317, Is It Time To Put Cadence Design Systems, Inc. (NASDAQ:CDNS) On Your Watch List?": 0.2,
  "Jim Cramer Discusses Adobe (ADBE) & Apple Suite": 0.2,
  "A Look At Regeneron Pharmaceuticals (REGN) Valuation After Recent Share Price Momentum": 0.5,
  "Kronos Advanced Technologies, Inc. (OTC: KNOS) Reports Fiscal 2025 Revenue of Controlled Subsidiary Zyppah, Inc": 0.5,
  "After a Lousy 2025, Can Theme Park Stocks Bounce Back in 2026?": 0.1,
  "US High Growth Tech Stocks to Watch": 0.0,
  "Fastenal Company Reports 2025 Annual and Fourth Quarter Earnings": 0.2,
  "What to Expect From Keurig Dr Pepper's Q4 2025 Earnings Report": 0.2,
  "TeleMate Announces General Availability of Next-Generation UC&C Observability Platform": 0.5,
  "LoyaltyLion launches AI Campaigns to help Shopify brands drive more loyalty revenue": 0.5,
  "PayPal Introduces Free DIY Tax Filing for PayPal Debit Card Customers": 0.6,
  "Fastenal: Q4 Earnings Snapshot": 0.0,
  "Diamondback Energy Earnings Preview: What to Expect": 0.5,
  "A Look At Take Two Interactive Software (TTWO) Valuation After Recent Share Price Weakness": 0.2,
  "Bear Of The Day: Charter Communications (CHTR)": 0.0,
  "Fastenal (NASDAQ:FAST) Posts Q4 CY2025 Sales In Line With Estimates": 0.5,
  "Baker Hughes CEO Lorenzo Simonelli Outlines the Energy Reality of 2026": 0.2,
  "ASML stock target lifted at UBS on ’too strong’ momentum": 0.6,
  "Europe Buy Now Pay Later Business Databook Report 2026-2031: Klarna Maintains Significant Reach Across the Nordics, Germany and the UK, PayPal's Instalment Product is Present Across Most of Europe": 0.6,
  "10 Stocks Dominate The S&P 500 Under Trump's Reign": -0.5,
  "Legal AI startup Ivo raises $55 million in latest funding round": 0.8,
  "Stocks Fall as Investors Assess Trump's Tariff Announcement, Await Earnings": -0.5,
  "Gap CEO Richard Dickson on Partnering With Matt Damon on Water": 0.2,
  "Giftcards.com Expands Access to Digital Gift Cards Across PayPal": 0.5,
  "Workday to Invest CAD $1 Billion in Canada Over Five Years": 0.8,
  "Assessing Whether PayPal Holdings (PYPL) Looks Undervalued After Recent Share Price Weakness": 0.5,
  "Can Data Center SSD Demand Reignite Micron's NAND Revenue Growth?": 0.2,
  "ADP National Employment Report Preliminary Estimate December 27, 2025": 0.0,
  "Should You Be Excited for Regeneron (REGN)?": 0.5,
  "Paychex Expands Board of Directors, Appoints New Member": 0.5,
  "BrightInsight Announces Multi-Million Dollar Strategic Investment to Advance its AI-Enabled Medication Persistence and Adherence Solutions": 0.8,
  "Are Options Traders Betting on a Big Move in Verisk Analytics Stock?": 0.2,
  "BrightInsight Strengthens Executive Leadership Team with Three Key Hires to Accelerate Global Growth and Innovation": 0.8,
  "What Offers PayPal (PYPL) a Meaningful Long-Term Optionality?": 0.2,
  "Is This Stock The Hidden AI Opportunity You’re Missing?": 0.5,
  "ServiceNow shares rise after WSJ reports three-year AI deal with OpenAI": 0.8,
  "Exchange-Traded Funds, Equity Futures Lower Pre-Bell Tuesday Amid Renewed Tariff Threats": -0.5,
  "Gauge Capital Announces Strategic Growth Investment in Ecosystems": 0.5,
  "Tapatio hot sauce acquired by private equity firm": 0.2,
  "Georgetown University Selects Cisco to Transform Campus Connectivity": 0.5,
  "Dolphin Subsidiary 42West Brings Exciting and Diverse Projects to the 2026 Sundance Film Festival": 0.8,
  "Morgan Stanley Real Estate Investing Acquires San Francisco Bay Area Advanced Manufacturing Facility for $110 Million": 0.5,
  "Traders Digest Trump's Greenland Demands, US Equity Futures Down Pre-Bell": -0.2,
  "Assessing ASML (ENXTAM:ASML) Valuation After Recent Share Price Volatility": 0.2,
  "Worried About the Economy? Invest In These Quality Stocks": 0.5,
  "Is It Too Late To Consider Lam Research (LRCX) After A 176% One Year Surge?": 0.2,
  "Morgan Stanley upgrades EU chip sector to overweight and highlights top-rated stocks": 0.6,
  "Is This Dividend Stalwart Signaling a Tough Economy in 2026?": -0.5,
  "SPECTRUM TO AWARD $1 MILLION IN 2026 SPECTRUM DIGITAL EDUCATION GRANTS": 0.5,
  "Buy the pullback in this chip stock: Mizuho": 0.5,
  "CRWD vs. CSCO: Which Cybersecurity Stock Has an Edge Right Now?": 0.2,
  "AppLovin shares slide as short-seller alleges global money laundering ties": -0.8,
  "Costco's Warehouse Expansion Strategy Fuels Long-Term Growth": 0.8,
  "AI Darling to Crime World Laundromat? AppLovin Tanks on Short-Seller’s Bombshell Report": -0.5,
  "Comcast’s Universal Ads Appoints David Shaw as Head of Global Expansion to Oversee Platform's International Rollout": 0.5,
  "Bloom Energy (BE) Valuation Check After US$2.65b AEP Fuel Cell Deal And Growth Partnerships": 0.5,
  "Cintas Corporation (CTAS): A Bull Case Theory": 0.5,
  "Fastenal Fourth-Quarter Sales Miss Street Views Amid Sluggish Industrial Production": -0.6,
  "AMAT vs. ASML: Which Semiconductor Equipment Stock is a Better Buy?": 0.5,
  "Supreme Court Tariff Ruling Stakes Rise On Greenland Gambit": 0.1,
  "Workday, Inc. (WDAY): A Bull Case Theory": 0.5,
  "Axon Enterprise Earnings Preview: What to Expect": 0.0,
  "Arm Holdings Stock is Down 43%. It’s an Underrated Play on Physical AI": 0.2,
  "4 Top-Ranked Technology Stocks Set to Beat Q4 Earnings Expectations": 0.8,
  "Robotic surgery fuels Johnson & Johnson dividend growth outlook": 0.6,
  "Western Digital's Strong Pricing and Mix Should Push Fiscal Q2 Results to High End, BofA Says": 0.8,
  "SanDisk leads storage stock surge; Shares jump 8% on data center grow": 0.8,
  "SPECTRUM LAUNCHES WIFI 7 EXTENDERS FOR WHOLE-HOME CONNECTIVITY": 0.5,
  "Jim Cramer on Intuitive Surgical: “One day, These Upside Surprises Will Come to an End”": -0.5,
  "Jim Cramer Says the “Big Five Travel” Including United Airlines “Are All Terrific”": 0.8,
  "2 Healthcare Names That Could Get a Big Boost From Earnings": 0.5,
  "Shopify Poised to Have 'Solid' Q4 on Strong Growth Momentum, RBC Says": 0.8,
  "Has AI Killed Adobe For Good?": -0.5,
  "Nonprofit Health Services Organization Files Lawsuit Against Fortune 500 Pharmaceutical Company Over Prescription Drug Access": -0.5,
  "AppLovin Stock Falls After Negative CapitalWatch Report": -0.7,
  "BofA sees strong demand and pricing momentum for Seagate and Western Digital": 0.8,
  "If You'd Invested $100 in Sandisk 11 Months Ago, Here's How Much You'd Have Today": 0.5,
  "Fastenal Q4 Earnings & Sales Meet Expectations, Stock Down": -0.5,
  "DJM Announces Sale of Gateway Center in Orange County": 0.0,
  "CrowdStrike Announces New Regional Clouds to Expand Secure Data Sovereignty": 0.6,
  "Costco quietly makes a major credit card change members love": 0.8,
  "Fastenal Q4 Earnings Call Highlights": 0.5,
  "Why Is AppLovin Down Today? CapitalWatch Short Report Hits Stock": -0.5,
  "Teradyne vs. KLAC: Which AI Infrastructure Stock Is the Better Buy?": 0.5,
  "AI Needs Power Now—Bloom Energy and American Electric Power Deliver": 0.5,
  "Where Will Constellation Energy Be in 3 Years?": 0.1,
  "Have $300k in uncovered stocks. How to best utilize? - My wife and I have $300k in stocks that we were given as kids, but we have lost track of the cost basis for them. I make in the middle bracket earnings for the IRS with regard to capital gains, so we'd be paying 15% tax on the full value of anything we sell out of this package. We also have $35k in high interest": -0.2,
  "Workday pledges CAD $1 billion expansion in Canadian tech sector": 0.8,
  "Why Shopify (SHOP) Stock Is Down Today": -0.5,
  "Pegasystems and Cadence Design Systems Shares Are Falling, What You Need To Know": -0.5,
  "AI & Business Newsletter | Will AI Really Kill Software?": 0.2,
  "Why CrowdStrike (CRWD) Stock Is Down Today": -0.5,
  "Adobe Stock Looks Like a Huge AI Bargain After a Nosedive. Should You Buy?": 0.5,
  "Unity Software Is Falling—So Why Are Pros Getting More Bullish?": 0.5,
  "Can an Expanding Portfolio Help Microchip Stock to Rise in 2026?": 0.2,
  "ServiceNow Teams Up With OpenAI in Three Year AI Integration Deal": 0.6,
  "CrowdStrike Expands Regional Cloud Footprint": 0.5,
  "Intuitive Surgical Pre-Q4 Analysis: Buy, Hold or Sell ISRG Stock Now?": 0.2,
  "Nuclear Power Is Back on the Radar. NuScale and 3 More Stocks That Could Surge.": 0.6,
  "Are These 2 Dividend Stocks Bargains Yet?": 0.2,
  "Starbucks assistant managers are now ‘coffeehouse coaches’": 0.5,
  "The Best Stocks to Buy With $500 Right Now": 0.5,
  "Hospitality group with 260 hotels files for Chapter 11 bankruptcy": -0.8,
  "Goldman Sachs Raising Price Targets 10%+ on Tech and Financial Blue Chip Giants": 0.8,
  "TSLA has been falling for several consecutive days, dropping over 3% today. Is this macroeconomic panic or a shakeout ahead of earnings? - I believe today's TSLA decline stems fundamentally from macro level risk aversion triggered by Trump's Greenland tariff proposal, colliding with valuation adjustments ahead of the January 28 earnings report; While the 2025 delivery slowdown is a clear downside risk, we're betting on the odds of Musk's AI5 chip and Cybercab materializing after": -0.2,
  "3 Software Stocks to Sell Before AI Replaces Them Entirely": -0.8,
  "Autodesk (ADSK) Seen Outgrowing Its End Markets, Rothschild Rates Buy": 0.6,
  "PepsiCo (PEP) Upgraded to Overweight by JPMorgan After Initiatives to Boost Shareholder Returns": 0.8,
  "Sandisk Continues Its Meteoric Rise. It’s the Top Stock in the S&P 500 Today.": 0.8,
  "Cintas Corporation Announces Quarterly Cash Dividend": 0.0,
  "How AI turns your home into a hotel-like experience": 0.6,
  "Assessing Electronic Arts (EA) Valuation As Shares Trade Slightly Above Narrative Fair Value": 0.2,
  "How Adobe’s Firefly Integration into ITG’s Storyteq Platform Could Shape ADBE’s Enterprise Moat": 0.5,
  "Why The Narrative Around Costco Wholesale (COST) Is Shifting After New Fair Value And 2026 Updates": 0.5,
  "Exxon Mobil, Altria, and Other Defensive Dividend Stocks for a Rocky Market": 0.2,
  "MicroStrategy’s Largest Bitcoin Purchase in a Year Shakes Stock Market Confidence": -0.6,
  "1 Top Cryptocurrency to Buy Before It Soars 1,000%, According to Michael Saylor": 0.8,
  "After Crashing 48% in 2025, Can Strategy Turn Things Around This Year?": 0.2,
  "AEP Declares Quarterly Dividend on Common Stock": 0.0,
  "PayPal Casinos USA 2026 | LoneStar's PayPal Payment Options": 0.2,
  "Himax, Broadcom, KLA Corporation, Impinj, and Qualcomm Stocks Trade Down, What You Need To Know": -0.5,
  "Ag container shipments power South Carolina inland port gains": 0.5,
  "Insiders Are Buying Thousands of These Shares": 0.5,
  "A Wall Street Analyst Just Revealed Her Top Artificial Intelligence (AI) Chip Stock for 2026 -- and It's Not Nvidia. Here's Why I Think She Could Be Right.": 0.5,
  "Could Buying Tesla Stock Today Set You Up for Life?": 0.5,
  "RBC Sees Multiple Secular and Cyclical Drivers Supporting ASML Upside": 0.6,
  "Vertex to Announce Fourth Quarter and Full Year 2025 Financial Results on February 12th": 0.0,
  "Fastenal Co (FAST) Q4 2025 Earnings Call Highlights: Strong Growth and Strategic Advancements ...": 0.8,
  "Stock market today: Dow plummets 800 points, S&P 500, Nasdaq sink over 2% as Trump's Greenland threats clobber stocks": -0.8,
  "RBC Initiates Coverage on Marvell (MRVL), Cites 25% Valuation Discount to Peers": 0.5,
  "Datadog Announces Date of Fourth Quarter and Fiscal Year 2025 Earnings Call": 0.1,
  "Milan Kovac Joins DoorDash Board of Directors": 0.5,
  "Datadog Announces Upcoming Investor Day": 0.5,
  "Piper Sandler Raises Microchip (MCHP) Target to $85, Calls It Top Mid-Cap Pick": 0.8,
  "These AI Stocks Could Lead the Next Bull Market, and They Are Still Cheap": 0.8,
  "Western Digital to Host Innovation Day 2026 in New York City": 0.5,
  "NFLX earnings results, profit up forecast down, stock down 4% - Netflix delivered fourth-quarter results that largely beat Wall Street estimates but issued a cautious forecast for the months ahead, citing higher program spending and the cost of closing its deal with Warner Bros. Discovery Inc. The company plans to increase spending on films and TV shows by 10% in 2026 and forecasts earnings of 76 cents a share for the current quarter, below Wall": -0.5,
  "Netflix stock falls after fourth quarter results top forecasts, Warner Bros. deal hangs in the balance": 0.2,
  "Synopsys Announces New Converge Conference, March 11-12, to Drive Intelligent Systems Innovation": 0.5,
  "Fastenal Stock Dives. What Earnings Say About U.S. Manufacturing.": -0.5,
  "Will Palantir Stock Crash in 2026?": -0.5,
  "Nvidia Stock Falls. ‘The Honeymoon Is Over for AI.’": -0.6,
  "Bitcoin, U.S. Dollar Skid, Gold Rallies On 'Sell America' Trade": 0.2,
  "These Stocks Are Today’s Movers: Nvidia, Netflix, Intel, Sandisk, 3M, Coinbase, Newmont, RAPT, Fastenal, and More": 0.5,
  "3 Growth Stocks Wall Street Might Be Sleeping On, but I'm Not": 0.5,
  "Palantir CEO says AI ‘will destroy’ humanities jobs but there will be ‘more than enough jobs’ for people with vocational training": 0.2,
  "Why Constellation Energy Stock Tumbled on Tuesday": -0.5,
  "Palo Alto Networks (PANW) Stock Moves -1.92%: What You Should Know": -0.5,
  "Shopify (SHOP) Falls More Steeply Than Broader Market: What Investors Need to Know": -0.5,
  "Why CrowdStrike Holdings (CRWD) Dipped More Than Broader Market Today": -0.5,
  "Why the Market Dipped But Comcast (CMCSA) Gained Today": 0.2,
  "MercadoLibre (MELI) Stock Moves -1.94%: What You Should Know": -0.5,
  "Is Costco Stock a Long-Term Buy for Everyday Investors?​": 0.5,
  "Is Qualcomm (QCOM) Now Attractive After Recent Share Price Pullback?": 0.5,
  "Booking Holdings (BKNG) Stock Moves -1.74%: What You Should Know": -0.5,
  "Assessing AppLovin (APP) Valuation After Strong Annual Return And Recent Momentum Cooldown": 0.5,
  "Controversial opinion - Figma will destroy Adobe - This isn't just about Figma being a nicer tool its about how design actually works now. Teams are remote devs, designers, PMs all in the same file at the same time and that alone breaks the old Adobe model. Adobe is still basically selling fancy single player software with files you pass around The real threat is that Figma becomes the default layer where product decisions happen": 0.6,
  "Fastenal (FAST) Q4 Earnings: How Key Metrics Compare to Wall Street Estimates": 0.5,
  "Do I sell my silver at some point? - I need some inspirational advice from the hivemind. I bought silver just a couple months ago (the physical kind that's pretty heavy if I'm being honest) just for fun cause I was laid off and got a tasty severance pay. Bought it at about 48$. I have no clue how any of this works. Is it to be expected to stay at this price now? How": -0.5,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders On January 15, 2026, Costco Wholesale Corporation (the \"Company\") held its Annual Meeting of Shareholders. There were 443,957,682 shares of common stock entitled to be voted; 352,303,581 shares were voted in person or by proxy. Shareholders voted on the following matters: 1. The election of each of the directors nominated by the Board of Directors to hold office until the 2027 Annual Meeting of Shareholders\n\n(Item 8.01) . Other Events The Board of Directors declared a quarterly cash dividend on the Company's common stock of $1.30 per share. The dividend was declared on January 15, 2026, and is payable February 13, 2026, to shareholders of record at the close of business on January 30, 2026.": 0.2,
  "(Item 5.07) below, Company stockholders approved an amendment to the Company’s Restated Certificate of Incorporation (the “Company Charter”) to provide for the elimination of certain officers’ personal liability for monetary damages stemming from breaches of the duty of care as permitted by Section 102(b)(7) of the General Corporation Law of the State of Delaware (the “Exculpation Amendment”). A Certificate of Amendment to the Company Charter (the “Certificate of Amendment”) effecting the Exculpation Amendment was filed with the\n\n(Item 5.07) . Submission of Matters to a Vote of Security Holders. At the Annual Meeting held on January 15, 2026, the following proposals were submitted to a vote of Company stockholders: Proposal 1 Each of the following nominees for Director were elected to serve on the Board of Directors of the Company. Each person elected as a Director will serve until the next annual meeting of stockholders or until such person’s successor is elected and qualified.": 0.1,
  "HD Hyundai Chairman Chung Kisun Discusses Future of AI and Energy at Davos Forum": 0.5,
  "35% Stock Sell-Off: Should You Buy the Dip?": 0.5,
  "Should You Buy Palantir Technologies Stock Before Feb. 2?": 0.2,
  "Could a Basket of Coca-Cola, Costco, and Walmart Support Decades of Passive Income?​": 0.2,
  "Agoda and Mastercard Collaborate to Modernize Loyalty Programs with Flexible Travel Rewards": 0.6,
  "Is American Electric Power (AEP) Fairly Priced After Recent Share Price Strength?": 0.2,
  "Bitcoin Dips Back Below $90,000 as Global Selloff Deepens": -0.8,
  "A Once-in-a-Decade Investment Opportunity: 1 Artificial Intelligence (AI) Semiconductor Stock to Buy Hand Over Fist Before It Soars Up to 32%, According to a Wall Street Analyst": 0.8,
  "AI Partnerships Across Healthcare and Retail Could Be A Game Changer For Microsoft (MSFT)": 0.5,
  "Assessing Shopify (SHOP) Valuation After Recent Share Price Weakness And Rich Earnings Multiple": 0.2,
  "Did O'Reilly's (ORLY) 401(k) Forfeiture Lawsuit Just Reframe Its Corporate Governance Investment Narrative?": 0.2,
  "Is Axon Enterprise (AXON) Still Attractive After Surging On Public Safety Tech Adoption?": 0.5,
  "2 Popular AI Stocks to Sell Before They Drop 70% and 60% in 2026, According to Wall Street Analysts": -0.8,
  "Amazon Joins the Big-Box League With Its Largest-Ever Store": 0.5,
  "Intuitive Surgical (ISRG) Q4 Earnings Report Preview: What To Look For": 0.5,
  "Earnings To Watch: CSX (CSX) Reports Q4 Results Tomorrow": 0.2,
  "Reassessing DoorDash (DASH) After Recent Share Price Pullback And Strong Multi Year Gains": 0.6,
  "Is Broadcom (AVGO) Still Reasonably Priced After A 7x Run In Five Years": 0.2,
  "Western Digital (WDC) Valuation Check As Analyst Upgrades And AI Storage Optimism Drive Earnings Expectations": 0.6,
  "Spotting Winners: Applied Materials (NASDAQ:AMAT) And Semiconductor Manufacturing Stocks In Q3": 0.5,
  "2 Reasons to Watch ROST and 1 to Stay Cautious": 0.5,
  "Bank of America resets WDC stock price target before earnings": 0.2,
  "Why Is The Crypto Market Down Today?": -0.5,
  "1 Consumer Stock on Our Watchlist and 2 We Question": -0.5,
  "3 Mid-Cap Stocks We Find Risky": -0.7,
  "1 Safe-and-Steady Stock with Impressive Fundamentals and 2 We Find Risky": 0.5,
  "3 Low-Volatility Stocks We Find Risky": -0.7,
  "A Look At Mondelez International (MDLZ) Valuation As Mixed Returns Contrast With DCF Upside": 0.2,
  "Assessing Whether Intuitive Surgical (ISRG) Shares Look Overvalued After Recent Weak Price Performance": -0.5,
  "FAST Q4 Deep Dive: Digital Expansion and Key Account Growth Shape Outlook": 0.6,
  "Is Mondelez (MDLZ) Pricing Reflect Its Mixed Returns And Strong Cash Flow Outlook": 0.2,
  "Assessing O'Reilly Automotive (ORLY) Valuation After Recent Share Price Moves And Growth Signals": 0.5,
  "Is It Time To Reassess Cintas (CTAS) After Its Strong Multi Year Share Price Run?": 0.5,
  "My Top 5 Predictions for Palantir in 2026": 0.2,
  "Sovereign AI Selects Accenture and Palantir to Help Build Next Generation AI Infrastructure Across EMEA": 0.6,
  "OpenAI: $20B Revenue in 2025 and Estimated $334B Revenue in 2030 (CAGR 66%) - ​**Historical Compute Capacity and Revenue Trend (2023–2025)** OpenAI has established a consistent correlation between compute capcity and revenue generation: 1GW compute capacity yields $10B annualised revenue. * ​2023: 0.2 GW capacity and $2B revenue * 2024: 0.6GW capacity and $6B revenue * 2025: $1.9GW capacity and $20B revenue ​CAGR (2023-25): 216% * This expansion was constrained by chip supply and power": 0.5,
  "Is Arm Holdings (ARM) Pricing Reflect Future Growth After Recent Share Price Weakness": 0.2,
  "Here’s What to Expect From Intuit’s Next Earnings Report": 0.2,
  "Assessing Arm Holdings (NasdaqGS:ARM) Valuation After Recent Share Price Weakness": 0.2,
  "Assessing Workday (WDAY) Valuation As High P/E Contrasts With DCF Suggesting Upside Potential": 0.5,
  "Is Airbnb (ABNB) At An Attractive Price After Recent Share Price Weakness": 0.5,
  "Strategy (MSTR) Is Down 7.4% After Leveraged $2.13 Billion Bitcoin Buy - Has The Bull Case Changed?": -0.5,
  "AI Storage Optimism and Innovation Day Buzz Could Be A Game Changer For Western Digital (WDC)": 0.6,
  "Zacks Investment Ideas feature highlights: Micron, MicroStrategy and APi Group": 0.2,
  "Zacks.com featured highlights include Micron, Hilltop Holdings, Casey's, Agnico Eagle Mines and Dollar General": 0.2,
  "Comcast (CMCSA) Valuation Check As Universal Ads Taps David Shaw For Global Expansion": 0.2,
  "Has Western Digital (WDC) Run Too Far After Its 339% One Year Surge?": -0.5,
  "How Arm’s AI-Focused Reorganization Amid Valuation Questions At Arm Holdings (ARM) Has Changed Its Investment Story": 0.2,
  "Jim Cramer Says AI Stocks Micron and Sandisk (Up Over 600% Since January 2023) Can Go Even Higher": 0.8,
  "DoorDash Could Be One of the Best Stocks for a K-Shaped Economy": 0.8,
  "The Zacks Analyst Blog Highlights Sandisk, Amphenol, ASML Holding and Corning": 0.5,
  "The Zacks Analyst Blog Highlights Apple, Walmart, JPMorgan Chase, Park Aerospace and Motorsport Games": 0.0,
  "Lutnick in the FT: \"We’re not going to Davos to uphold the status quo. We’re going to confront it head-on.\" - [Another delusional and unhinged op-ed in the FT from the Trump admin, this time from Secretary of Commerce Howard Lutnick](https://www.ft.com/content/a675b8af-46b7-4f93-a616-41f0a002c22e) >Every year in January, leaders gather in Davos, Switzerland, for the World Economic Forum to discuss the global economy. This year, some people have asked a great question: Why is the Trump administration going": -0.6,
  "Amgen (NASDAQ:AMGN) Has Announced That It Will Be Increasing Its Dividend To $2.52": 0.8,
  "Best Momentum Stock to Buy for January 21st": 0.6,
  "US Stock Market Today S&P 500 Futures Rise As Rate Jitters Meet Soft Jobs": 0.2,
  "Is Datadog (DDOG) Pricing Look Interesting After Recent Share Price Weakness": 0.5,
  "What To Expect From CSX’s (CSX) Q4 Earnings": 0.0,
  "What You Need To Know Ahead of Workday’s Earnings Release": 0.0,
  "AT&T Unleashes Turbo Live: The First and Only VIP Connection Specifically for Live Events": 0.6,
  "Shawmut Design and Construction Announces Bold Growth Strategy Including New Leadership Roles and Entry into Mission Critical": 0.5,
  "Is There Now An Opportunity In Starbucks Corporation (NASDAQ:SBUX)?": 0.2,
  "Fortune and Korn Ferry Reveal the Fortune World's Most Admired Companies™ 2026 List": 0.5,
  "Netflix CEO Ted Sarandos reveals where he sees the biggest value in monster Warner Bros. deal": 0.5,
  "Is It Time To Reassess Workday (WDAY) After Recent Share Price Weakness?": 0.2,
  "Truck Wars King Crowned: General Motors or Ford Motor Company?": 0.2,
  "S&P Futures Muted With Focus on Trump’s Davos Address and Corporate Earnings": 0.2,
  "Bernstein Remains Bullish on T-Mobile US (TMUS) Amid Changing Competitive Dynamics Across U.S. Telecom": 0.6,
  "Nvidia and Broadcom Look Attractive Again. Citi Names Top Chip Picks": 0.8,
  "Klarna to offer after-purchase BNPL": 0.2,
  "AI will create jobs, Nvidia CEO Jensen Huang argues": 0.5,
  "Managed Services Market to Grow from $430 Billion in 2026 to $704 Billion by 2031: Strategic Analysis of IBM, Cisco Systems, Fujitsu, AT&T, HPE and Other Key Players": 0.6,
  "Senate leaves CLARITY Act in limbo: What to know ahead of midterms": 0.0,
  "Cathie Wood Opens New Stakes in VELO, SNPS": 0.5,
  "Strength Seen in Amtech (ASYS): Can Its 8.1% Jump Turn into More Strength?": 0.6,
  "This Week In AI Chips - Innovative Cooling Solutions Fuel Next-Gen AI Data Centers": 0.8,
  "High Growth US Tech Stocks To Watch In January 2026": 0.5,
  "Corvus shares nearly triple on positive data for eczema pill": 0.8,
  "Synopsys' Q1 2026 Earnings: What to Expect": 0.0,
  "Michael Saylor Teases 'Bigger Orange' — And Strategy Buys $2.1B In Bitcoin": 0.5,
  "India’s PhonePe secures regulatory nod for IPO- report": 0.5,
  "Verisk Analytics' Q4 2025 Earnings: What to Expect": 0.0,
  "Ocular Therapeutix™ Appoints David W. Robinson as Global Chief Commercial Officer": 0.5,
  "Keurig Dr Pepper Inc.'s (NASDAQ:KDP) Stock Been Rising But Financials Look Weak: Should Shareholders Be Worried?": -0.5,
  "Morgan Stanley confident this software stock could double in value": 0.8,
  "As risk skyrockets, current and former CFOs are in demand for audit committees": 0.5,
  "Assessing Starbucks (SBUX) Valuation As Its Back To Starbucks Turnaround Gains Investor Attention": 0.5,
  "Barclays Remains Bullish on Micron Technology (MU) Amid Continued AI Momentum": 0.8,
  "Broader Analyst Sentiment Bullish on Adobe (ADBE) Amid Longer-Term Franchise Strength": 0.8,
  "Cautious Analyst Sentiment on Adobe (ADBE) Amid Intensifying Competition Across Core Creative Markets": -0.5,
  "Amgen (AMGN) Expands Obesity Strategy With Ro Collaboration on GLP-1 Therapies": 0.5,
  "Assessing Airbnb (ABNB) Valuation As P/E And DCF Send Mixed Signals": 0.1,
  "Palantir Technologies (NASDAQ: PLTR) Stock Price Prediction for 2026: Where Will It Be in 1 Year": 0.2,
  "Micron to purchase PSMC fabrication site in Taiwan for $1.8B": 0.5,
  "PepsiCo CEO says sustainability debate needs a ‘reframe’ at Davos": 0.5,
  "Stocks Down Pre-Bell After Recording Biggest Drop Since October": -0.8,
  "Daily Profit Alert: Netflix Business Model Under Fire, NVIDIA Lock-in Accelerates": -0.5,
  "Is IDEXX Laboratories Stock the Right Pick for Your Portfolio Now?": 0.2,
  "ISRG vs. MDT: Which MedTech Stock Is a Better Bet Now?": 0.2,
  "Microchip Introduces 600V Gate Driver Family for High-Voltage Power Management Applications": 0.5,
  "Stellar Cyber Appoints Eric van Sommeren as Vice President of EMEA to Accelerate Regional Expansion": 0.8,
  "Ember LifeSciences appoints Ann Hyllengren as Chief Financial Officer": 0.5,
  "Vortex Energy Highlights 2025 Technical Milestones Across Project Portfolio and Announces Adjournment of AGM to February 13, 2026": 0.5,
  "Here's Why We Think T-Mobile US (NASDAQ:TMUS) Is Well Worth Watching": 0.6,
  "CrowdStrike Endpoint Security Delivered Customers a 273% Return on Investment Over Three Years, with a Payback Period of Under Six Months": 0.8,
  "Wall Street's Wild Week": 0.5,
  "Is ASML Holding (ENXTAM:ASML) Losing Its Appeal After Strong Share Price Momentum?": -0.5,
  "Here Are Wednesday’s Top Wall Street Analyst Research Calls: Alibaba, Applied Digital, ARM Holdings, FedEx, Flutter Entertainment, Ulta Beauty, and More": 0.2,
  "Walmart's Marketplace Taps Premium Categories to Enhance Online Mix": 0.5,
  "Adobe vs. Intuit: Which 52-Week Low Is a Buy?": 0.2,
  "Netflix Q4 Earnings: Will It Win the Battle but Lose the War?": -0.5,
  "Almost half of the time saved using AI is spent correcting outputs": -0.6,
  "Plume Appoints Rebecca Stone as Chief Marketing Officer": 0.5,
  "Verisk to Announce Fiscal Fourth-Quarter 2025 and Full-Year 2025 Results on February 18, 2026": 0.0,
  "3 Stocks That Could Double In 2026": 0.5,
  "Fortinet price target lowered to $88 from $95 at Truist": -0.5,
  "AppLovin shares drop 5% premarket after cautious CapitalWatch report": -0.6,
  "Top 3 Cheap Stocks With Massive Upside Potential, According to WarrenAI": 0.8,
  "NLR ETF Climbs 75% in One Year as Uranium Miners Ride $100 Per Pound Breakout": 0.8,
  "Fiber/Small Cell Business Sale Sparks Confidence for Crown Castle (CCI)": 0.6,
  "BigBear.ai vs. Palantir: Which Defense AI Stock Is the Smarter Investment?": 0.5,
  "Furl Raises $10M Seed Round to Bring Agentic AI to Security Remediation": 0.5,
  "New Xfinity Store Opens in South DeKalb": 0.5,
  "Versa Named Global SD-WAN Leader by Frost & Sullivan": 0.5,
  "Qualcomm Schedules First Quarter Fiscal 2026 Earnings Release and Conference Call": 0.0,
  "Cadence Unveils Tensilica HiFi iQ DSP Purpose-Built for Next-Generation Voice AI and Audio Applications": 0.6,
  "Is Most-Watched Stock Texas Instruments Incorporated (TXN) Worth Betting on Now?": 0.2,
  "Is Trending Stock Palantir Technologies Inc. (PLTR) a Buy Now?": 0.2,
  "Adobe Inc. (ADBE) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Is Now The Time To Look At Buying NXP Semiconductors N.V. (NASDAQ:NXPI)?": 0.5,
  "Biocom Announces Powerhouse Keynote Panel Featuring Heads of Discovery and Research & Development from AbbVie, Amgen and Eli Lilly at 2026 Global Partnering & Investor Conference": 0.8,
  "SoundHound AI Partners With Leading Technology Advisory Firm, Bridgepointe Technologies to Expand Enterprise AI Adoption": 0.6,
  "Komodor Appoints Ziv Harfenist as Chief Financial Officer": 0.5,
  "Is Sandisk the Smartest Investment You Can Make Today?": 0.5,
  "Top 5 Stocks to Avoid Despite the AI Hype": -0.8,
  "ONDS vs. RCAT: Which Drone Tech Stock Is the Better Pick Now?": 0.2,
  "Gilead Sciences (GILD) Valuation Check After Recent Share Price Softness": 0.2,
  "ADP Named One of Fortune's Most Admired Companies™ for 20th Straight Year": 0.8,
  "How Evolving Analyst Targets Are Reshaping The Story For Axon Enterprise (AXON)": 0.2,
  "Market Minute 1-21-26- Stocks Still Unsettled, While Gold Jumps Again": -0.5,
  "New Research Exposes Critical Gap: 64% of Third-Party Applications Access Sensitive Data Without Authorization": -0.8,
  "PDD Stock Pops After Smaller-Than-Expected China Tax Fine": 0.6,
  "Marvel and OREO Unite for a First-of-Its-Kind Collaboration: The MARVEL OREO Stuf of Legends Cookies": 0.6,
  "Wall Street analyst defends Michael Saylor's Strategy after stock trades 64% below his lofty price target": -0.5,
  "Up 12% So Far in 2026, Should You Buy Honeywell Stock?": 0.5,
  "Broadcom Inc. (AVGO) Is Considered a Good Investment by Brokers: Is That True?": 0.5,
  "Brokers Suggest Investing in AppLovin (APP): Read This Before Placing a Bet": 0.5,
  "Netflix Earnings Shed Light on Why It Needs Warner": 0.1,
  "Arm upgraded, Flutter downgraded: Wall Street's top analyst calls": 0.1,
  "No One’s Talking About This AI Chip Stock That Can Easily 5X": 0.8,
  "Kraft Heinz Spills Beans on Berkshire's Possible Share Sale; Stock Drops": -0.5,
  "Is Greg Abel Making His First Move to Redefine Berkshire Hathaway?": 0.2,
  "Nvidia CEO Jensen Huang: 'Trillions of dollars of AI infrastructure needs to be built'": 0.5,
  "Consumer Staples Are Exploding Higher in 2026: Buy 5 High-Yielding Dividend Kings Now": 0.8,
  "Best Stock to Buy Right Now: Walmart vs. Costco": 0.5,
  "Atlassian ($TEAM) stock - trading at the same price as in 2019... - So I've been watching Atlassian (**$TEAM**) stock for a while now and have personally decided to pull the trigger. If you don't know Atlassian, they're a software company who create productivity software and are massively used in the tech industry and in most companies that use Agile processes. Put it this way, I work in tech and the majority of companies I": 0.2,
  "Booking Holdings to Webcast Fourth Quarter and Full Year 2025 Financial Results on February 18": 0.1,
  "Analysts Estimate Starbucks (SBUX) to Report a Decline in Earnings: What to Look Out for": -0.5,
  "Earnings Preview: Tesla (TSLA) Q4 Earnings Expected to Decline": -0.5,
  "Amazon Investors Bet on AWS to Pull the Stock Out of Its Malaise": 0.5,
  "Berkshire Hathaway May Sell Stock in Kraft Heinz, Filing States": -0.5,
  "Amazon plans biggest retail store yet near Chicago": 0.5,
  "The Bull Case For PepsiCo (PEP) Could Change Following JPMorgan Upgrade And Global Restructuring Push": 0.5,
  "Can PANW's Secure Browser Adoption Support Long-Term SASE Growth?": 0.2,
  "What to Expect From Monster Beverage's Next Quarterly Earnings Report": 0.2,
  "NWN Expands Intelligent Connectivity: A Multi-OEM, AI-Powered Network-as-a-Service Platform for the Modern Enterprise": 0.6,
  "Energy costs will decide which countries win the AI race, Microsoft’s Nadella says - Davos 2026 - Energy costs for AI data centers are projected to rise to 10-12% of \\*total\\* US electricity by 2030. That’s a massive jump. MSFT CEO said it really comes down to which country can reduce the cost of energy production. But, as a scarce resource, what’s the outlook on this. Companies are investing \\*\\*billions\\*\\* to build these infrastructures. I": 0.2,
  "What You Need to Know Ahead of Warner Bros. Discovery's Earnings Release": 0.0,
  "Investment Manager Doubles Down on MercadoLibre With $51 Million Purchase": 0.8,
  "AI is 'massive': Trump discusses energy expansions at Davos": 0.5,
  "Kraft Heinz, Abercrombie & Fitch, Oklo: Top Analyst Calls": 0.0,
  "Tesla Positioned to be a Market Leader in Autonomous Mobility, Robotics, Morgan Stanley Says": 0.8,
  "NVTS vs. ADI: Which Semiconductor Stock Should You Buy Right Now?": 0.2,
  "Netflix Just Upped Its Bid for Warner Bros. to All Cash. What Does That Mean for NFLX Stock?": 0.2,
  "Netflix Seen Delivering Double-Digit Growth, Margin Expansion, Morgan Stanley Says": 0.8,
  "AMZN vs. GOOGL vs. MSFT vs. NVDA - Hi everyone. If you had to rank these four from best to worst holds for 2026, what would that look like and why? My current allocation is 90% VT, 10% GOVT. I’m thinking about maybe doing 80% VT, 10% GOVT, and 10% towards a tilt on couple of these. Leaning MSFT and GOOGL but want to hear everyone’s genuine thoughts on the four. Thanks!": 0.2,
  "Market Chatter: Royal Bank of Canada, Others Set $1.8 Billion Debt Package for Investindustrial's Acquisition of TreeHouse Foods": 0.5,
  "As Micron Spends $1.8 Billion on a New Chip Fab Site, Should You Buy MU Stock?": 0.5,
  "Cisco Systems (CSCO) Valuation Check After New Wi Fi 7 And AI Infrastructure Partnerships": 0.5,
  "MRVL vs. LITE: Which AI Connectivity Stock is a Safer Bet?": 0.2,
  "Adobe nabs CIO from Airbnb": 0.2,
  "Kraft Heinz Stock Falls as Berkshire Hathaway's Stake Exit Looms": -0.5,
  "Netflix Stock Hasn't Impressed Investors Lately. Its Deal for Warner Bros. Isn’t Helping.": -0.6,
  "Top Midday Stories: Trump Says US Doesn't Want to Use Force to Acquire Greenland; Netflix Shares Fall on Low Q1 Guidance": 0.2,
  "Xcel Energy a \"World's Most Admired Company\" for Twelfth Year": 0.8,
  "Elon Musk Takes Another Dig At Michael O'Leary Over Buying Ryanair, Says He'll Put A 'Ryan' In Charge: 'It Is Your Destiny'": 0.2,
  "Trump & Venezuela: New Foreign Policy, New Changes for Your 401(k)": 0.2,
  "PLTR's Valuation is High: Not a Red Flag, if Execution Stays": 0.2,
  "2 Dividend Stocks to Hold for the Next 20 Years": 0.5,
  "Could This Artificial Intelligence (AI) Stock Be a Hidden Gem for Patient Investors?": 0.5,
  "MSFT advice: Get out when you can - If MSFT ever makes it back to its +500 mark (peak was 540) I'm getting out. This is no longer fun. MSFT is failing with everything they have except Azure. OpenAI down the drain, copilot is a disaster, and Azure is not enough to beat S&P.": -0.8,
  "Berkshire Hathaway Looks Poised to Break a Buffett Rule With Kraft-Heinz Sale": 0.2,
  "Apple vs HP: Who Gains as AI PCs Rise and Memory Costs Surge?": 0.2,
  "Marvell (MRVL) Upgraded to Buy: Here's What You Should Know": 0.6,
  "Nation’s Top 40 High School Scientists to Compete for $1.8 Million in Awards at the Prestigious Regeneron Science Talent Search": 0.8,
  "ServiceNow vs. Adobe: Which Cloud Software Stock Has an Edge Now?": 0.2,
  "European Stocks Close Mixed in Wednesday Trading; UK Inflation Rises More Than Expected": 0.2,
  "Looking At The Texas Instruments (TXN) Narrative After The Latest Price Target Reset": 0.2,
  "Tesla Just Revived Its Dojo3 Supercomputer. Does That Make TSLA Stock a Buy Here?": 0.2,
  "Is CrowdStrike (CRWD) Fairly Priced After Recent Pullback And Cybersecurity Spotlight": 0.5,
  "Assessing Datadog (DDOG) Valuation After Recent Share Price Weakness": 0.2,
  "Why Did Intel Stock Pop on Wednesday?": 0.2,
  "Market Chatter: Musk Pushes SpaceX Toward IPO as xAI Races OpenAI, Anthropic": 0.2,
  "Why Microchip Tech (MCHP) Might be Well Poised for a Surge": 0.6,
  "Netflix EPS to Come Under Pressure Due to Share Buyback Halt, Oppenheimer Says": -0.5,
  "PayPal vs. Upstart: Which Fintech Stock is the Better Buy Now?": 0.2,
  "Accenture (ACN) Stock Trades Up, Here Is Why": 0.5,
  "Why Is Micron (MU) Stock Soaring Today": 0.5,
  "Why AppLovin (APP) Stock Is Nosediving": -0.8,
  "Big Tech earnings put spotlight on AI and memory shortage as Trump tariff threats loom": 0.1,
  "Western Digital Stock Surges Again As Analysts Hike Price Targets": 0.8,
  "Better Growth Stock: Visa vs. Costco": 0.5,
  "Berkshire Registers Stake for Possible Sale After Kraft Heinz Breakup Plan": 0.1,
  "Why Is Intel (INTC) Stock Rocketing Higher Today": 0.6,
  "Why Netflix (NFLX) Stock Is Falling Today": -0.5,
  "T-Mobile quietly makes cold move as loyal customers leave": -0.6,
  "This Super Semiconductor Stock Crushed Nvidia in 2025, and Jan. 28 Could Be a Very Big Day for Its Investors": 0.8,
  "US High Growth Tech Stocks To Watch In January 2026": 0.5,
  "Khc price target - What price do you think KHC trades at if Berkshire actually offloads its stake? With the recent news around Berkshire Hathaway potentially selling its \\~27% stake in Kraft Heinz, I’m curious what everyone thinks the realistic downside looks like if the shares are actually offloaded (under $20)?": 0.2,
  "Here is Why Growth Investors Should Buy Broadcom Inc. (AVGO) Now": 0.6,
  "Did Nvidia’s CEO Just Deliver the Ultimate Buy Signal for Nebius?": 0.6,
  "UPS to build massive $6.1M cooler in Louisville. Here's what we know": 0.5,
  "3 Red-Hot Growth Stocks to Buy in 2026": 0.8,
  "Micron knows something the market is only starting to see": 0.6,
  "A Look At Seagate Technology (STX) Valuation After Analyst Upgrades And AI Storage Progress": 0.5,
  "CEO Sanjay Mehrotra Says Demand for Memory Will Keep Lifting Micron Stock for Years to Come": 0.8,
  "Xfinity Unveils New Membership Experience Packed With Exclusive Perks and Surprises": 0.8,
  "Adobe (ADBE) Valuation Check After Recent Share Price Weakness": 0.2,
  "AI company Eightfold sued for helping companies secretly score job seekers": -0.8,
  "Nebius Just Scored a Major Supercomputer Win. Should You Buy NBIS Stock Here?": 0.5,
  "Is Dave (DAVE) Quietly Recasting Its Board for an AI-Centric Fintech Strategy?": 0.2,
  "Warren Buffett’s Successor Weighs Sale of Kraft Heinz Stake, Dealing a Blow to Ketchup Maker’s Stock": -0.7,
  "Netflix Is Below 1-Year Lows With Heavy Call and Put Option Activity - Bullish Signals for NFLX": 0.8,
  "Tom Nash Says This Energy Stock Could Solve AI's Power Crisis: Sees 7x Upside And 1,400% Revenue Growth In 5 years 'If They Execute'": 0.8,
  "A Financial Advisor Told Him To Move $50K Out Of His 401(k) Into A Traditional IRA In 2021. Five Years Later, He's Only Up $2K": -0.8,
  "Zipline charts drone delivery expansion with $600M in new funding": 0.5,
  "Top Stock Picks for Week of January 19, 2026": 0.0,
  "Sector Update: Consumer Stocks Mixed Wednesday Afternoon": 0.0,
  "Bitcoin hovers near $88,000 as Wall Street urges caution in 'chasing rallies'": -0.5,
  "News: DB CEO reportedly clarified stance after research note circulated widely - According to a news report, Treasury Secretary Scott Bessent said Deutsche Bank CEO Christian Sewing reached out to him to clarify that a recent Deutsche Bank research note was being interpreted more broadly than intended as a “sell US assets” message. Bessent said Sewing told him the idea was **not Deutsche Bank’s official view**, but **the opinion of a single analyst**, and that": 0.2,
  "Netflix-Warner Bros deal could offer viewers relief from subscription fatigue": 0.6,
  "Costco reveals major investment to enhance member experience": 0.8,
  "Kraft Heinz Shares Slide on Berkshire's Possible Stake Sale": -0.7,
  "Intel Results in Focus as Investors Bet on AI Fueled Comeback": 0.6,
  "Palantir, Nvidia, and Dell Climb on Sovereign AI Data Center Deal": 0.6,
  "Sector Update: Tech Stocks Higher Wednesday Afternoon": 0.5,
  "GlobalFoundries Pushes Deeper Into AI Chipmaking, Hits 80-Plus RS Rating": 0.6,
  "Intel Stock Is Climbing -- Foundry Customer Optimism Sparks Rally": 0.8,
  "Dow, S&P 500, Nasdaq Climb as Trump Seeks Negotiations on Greenland": 0.5,
  "Sandisk Rips Higher, Tops S&P 500": 0.8,
  "Musk and Altman Trade Blows on X": 0.0,
  "Lemonade Stock Jumps on Plans to Insure Tesla’s Self-Driving Cars": 0.6,
  "2026’s Biggest AI Trends: The Rise of AI Factories | VRT Stock, NVT Stock, MOD Stock": 0.5,
  "Should You Buy Apple Stock Before Earnings on January 29? This Analyst Says ‘Yes.’": 0.6,
  "Netflix's Warner Bros bid is 'both' an offensive & defensive move": 0.2,
  "Elon Musk Confirms AI4-Powered Cars Can Achieve Unsupervised Self-Driving Without Additional Upgrades": 0.8,
  "Veteran analyst revisits key semiconductor stock amid tech earnings season": 0.5,
  "US Equity Indexes Rebound, Long-Dated Treasury Yields Drop After Trump Eases Tone Over Greenland": 0.6,
  "/C O R R E C T I O N -- Mondelēz International/": 0.0,
  "Bezos’s Space Company to Deploy Sprawling Satellite Network": 0.5,
  "Equities Rise Intraday as Trump Rules Out Military Action in Greenland": 0.6,
  "How President Trump and Nvidia CEO Jensen Huang's Davos moves helped dip-buying investors": 0.2,
  "Did AI-Fueled Earnings Beats Just Shift Applied Materials' (AMAT) Semiconductor Toolchain Investment Narrative?": 0.1,
  "Assessing Whether Costco Wholesale (COST) Deserves Its Rich P/E After Strong Multi‑Year Returns": 0.5,
  "In Davos, Tech Execs Sound More Bullish Than Ever. Four Things We Learned About AI.": 0.8,
  "Oklo Stock Upgraded to Buy. Meta Nuclear Deal Is a ‘Meaningful Step Forward.’": 0.8,
  "PDD Shares Rise After Shanghai Tax Authority Issues Small Fine": 0.5,
  "Nvidia, Broadcom, Micron Stocks Jump -- JPMorgan Flags as Top Chip Picks": 0.8,
  "Has Netflix Stock Fallen Far Enough to Be Attractive?": 0.2,
  "Why Netflix Stock May Be a Buy Right Now": 0.5,
  "The Netflix Sell-Off Just Accelerated. Here's Why I Think It's Overdone.": 0.5,
  "Microsoft, Other Software Stocks Report Earnings Soon. Here’s How to Trade It.": 0.5,
  "Apple to Revamp Siri as a Built-In iPhone, Mac Chatbot to Fend Off OpenAI": 0.5,
  "The US markets where Airbnb listings are surging, and where they’re collapsing": 0.1,
  "1 Top Artificial Intelligence (AI) Stock That's Ready for a Bull Run in 2026": 0.8,
  "The Walmart C-suite reshuffle shows how the retailer sees itself now: As a tech company": 0.5,
  "Intel Poised for 'Slight' Quarterly Beat, In-Line Outlook, RBC Says": 0.2,
  "Apple’s new Siri runs on Gemini, and there’s an invisible catch": -0.2,
  "CLA Earns Microsoft Solution Partner Designation for Data & AI and Digital & App Innovation (Azure)": 0.5,
  "Anthropic Preps Major NYC Office Push": 0.2,
  "Seagate Rises After Upgrade, Higher Target": 0.6,
  "Alibaba Sets Up Nuclear-Linked Power Venture to Support AI Data Centers": 0.5,
  "Arm Stock Jumps After Top Analyst Upgrade Price Target to $150": 0.8,
  "Apple stock spikes after report of Siri revamp into chatbot": 0.8,
  "Apple to revamp Siri as a built-in chatbot, Bloomberg News reports": 0.5,
  "Impinj (PI) Shares Skyrocket, What You Need To Know": 0.8,
  "Tesla Says Free FSD Transfer Will End On March 31: Here's How You Can Qualify": 0.2,
  "Western Digital (WDC) Shares Skyrocket, What You Need To Know": 0.8,
  "2 Bargain Stocks You Can Buy for Less Than $100 Right Now": 0.5,
  "Carvana, Revolve, Bumble, Shutterstock, and LendingTree Shares Are Soaring, What You Need To Know": 0.5,
  "Etsy, Upwork, Wayfair, and Remitly Stocks Trade Up, What You Need To Know": 0.5,
  "AppLovin denies money laundering claims following short seller report - Statement": -0.5,
  "Dear Apple Stock Fans, Mark Your Calendars for January 29": 0.5,
  "Sector Update: Tech Stocks Climb Late Afternoon": 0.5,
  "US Equity Indexes Rebound After Trump Calls Off Tariffs on European Allies": 0.8,
  "Microsoft CEO Satya Nadella Warns AI Could Lose 'Social Permission' If It Burns Energy Without Real-World Benefits In Health And Education": 0.1,
  "Datadog, Wix, 8x8, Akamai Technologies, and Asure Software Stocks Trade Up, What You Need To Know": 0.5,
  "Atlassian, The Trade Desk, and Bandwidth Shares Skyrocket, What You Need To Know": 0.5,
  "Sector Update: Consumer Stocks Rise in Late Afternoon Trading": 0.5,
  "ScanSource, Robert Half, ManpowerGroup, Fair Isaac Corporation, and Driven Brands Shares Skyrocket, What You Need To Know": 0.8,
  "CRA, Flex, ePlus, and TD SYNNEX Stocks Trade Up, What You Need To Know": 0.5,
  "Crane NXT, DXC, Gartner, Kforce, and NetApp Shares Are Soaring, What You Need To Know": 0.5,
  "Dell (DELL) Stock Trades Up, Here Is Why": 0.5,
  "MillerKnoll, Super Micro, Cogent, Avnet, and Cognex Stocks Trade Up, What You Need To Know": 0.5,
  "Insperity, Pure Storage, CTS, Lumen, and Plexus Shares Skyrocket, What You Need To Know": 0.8,
  "Coherent, Iridium, Array, EPAM, and Concentrix Shares Are Soaring, What You Need To Know": 0.8,
  "Stride, Jabil, Benchmark, Knowles, and Connection Shares Are Soaring, What You Need To Know": 0.8,
  "Why Alphabet Rallied Today": 0.5,
  "Tesla’s Self-Driving Mode Gets Drivers an Insurance Break. What It Means for the Stock.": 0.5,
  "Healthpeak Advances AI-Enabled Operating Platform, Naming Omkar Joshi Head of Enterprise Innovation": 0.5,
  "CECP Welcomed 20 Leading Companies to Coalition in 2025, Expanding Network of Corporate Purpose-Driven Leaders": 0.8,
  "HONEYWELL AND FLEXJET FINALIZE SETTLEMENT, RENEW LONG-TERM CONTRACT THROUGH 2035": 0.6,
  "US Equity Markets Rise After Trump Rules Out Using Force in Greenland Bid": 0.6,
  "How The New Price Target Is Rewriting Broadcom’s Story For Investors": 0.5,
  "What Costco Needs to Prove in 2026": 0.0,
  "Rail networks brace for severe weather": -0.6,
  "Netflix Guidance Disappoints. Executives Defend Warner Bros. Deal.": -0.5,
  "3 Top Tech Stocks That Could Make You a Millionaire": 0.5,
  "Homes.com Report: 2025 Showed Continued National Home Price Appreciation But the First Year-Over-Year Improvement in Affordability Since 2020": 0.5,
  "Amazon Hits Back at Walmart With a New Megastore. It Won’t Be Easy.": 0.2,
  "Honeywell CEO: Why “Physical AI” Won’t Replace All Industrial Jobs—and What It Will Change": 0.5,
  "Tesla Stock In Focus as Musk and Ryanair Chief Trade Insults. Should Investors Worry?": -0.5,
  "1 Growth Stock Down 19% to Buy Right Now": 0.5,
  "Nvidia CEO urges continued spending into AI: Top takeaways": 0.5,
  "Honeywell Settles Litigation With Flexjet. What It Means for the Stock.": 0.2,
  "Anthropic’s Revenue Run Rate Tops $9 Billion as VCs Pile In": 0.8,
  "These Stocks Are Today’s Movers: Intel, Netflix J&J, GameStop, Kraft Heinz, Schwab, and More": 0.5,
  "My Top 2 Stocks to Buy in Early 2026": 0.0,
  "AI: China moves faster than US, but penetration not as sophisticated": 0.1,
  "Apple Just Claimed the Top Spot in the Chinese Smartphone Market. What Does That Mean for AAPL Stock in 2026?": 0.5,
  "Wall Street Rebounds as Trump Calls Off Greenland-Related Tariffs": 0.8,
  "Stock Market Today: Dow, S&P Surge As Trump Sees Framework For Greenland Deal; Nvidia Rises (Live Coverage)": 0.6,
  "Cathie Wood’s ARK Invest Makes Bold Bitcoin and Nvidia Prediction": 0.6,
  "New England Journal of Medicine Publishes Phase 3 ASCENT-04/KEYNOTE-D19 Results Supporting Trodelvy® Plus Keytruda® as a Potential New Standard of Care in First-line PD-L1+ Metastatic Triple-negative Breast Cancer": 0.8,
  "Stocks to Watch Wednesday Recap: Netflix, Schwab, J&J, United Airlines": 0.5,
  "Elon Musk: Tesla's Cybercab, Optimus production will be 'slow'": -0.5,
  "Trading Day: Relief on Greenland deal hopes": 0.5,
  "3 of My Top 4 AI Stock Picks for 2025 Rose At Least 38%. Are They Still Best Buys for 2026?": 0.5,
  "US Equity Indexes Rebound, Trump Calls Off Tariffs on European Allies After Meeting With NATO Chief": 0.8,
  "Honeywell, Flexjet settle litigation, extend engine maintenance deal": 0.5,
  "How Changing Analyst Stories Shape Starbucks (SBUX) Price Targets And Fair Value": 0.2,
  "Assessing Warner Bros. Discovery (WBD) Valuation After A Strong Yearly Run And High P/E Multiple": 0.5,
  "Why AppLovin Stock Was Falling Today": -0.5,
  "The Best Dividend Stocks to Buy and Hold Forever": 0.5,
  "Dozens of Florida GameStop stores closing. But what about Polk County?": -0.2,
  "How Lemonade & Tesla are Disrupting the Insurance Business": 0.5,
  "Oklo Upgraded Days After This Cathie Wood Buy Amid Meta Deal Excitement": 0.5,
  "This Analyst Calls Tesla 7 Times More 'Capital Efficient' Than Rivals: Here's Why": 0.6,
  "Is Elon Musk Lowering Q4 Conference Call Expectations With This Cybercab Comment?": -0.5,
  "Stock Market Today, Jan. 21: Netflix Falls After Fourth-Quarter Earnings and New All-Cash WBD Deal": -0.5,
  "Paypal (PYPL) Laps the Stock Market: Here's Why": 0.5,
  "Costco (COST) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Zscaler (ZS) Increases Yet Falls Behind Market: What Investors Need to Know": -0.2,
  "Broadcom Inc. (AVGO) Stock Dips While Market Gains: Key Facts": 0.1,
  "Why Qualcomm (QCOM) Outpaced the Stock Market Today": 0.5,
  "AppLovin (APP) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "A timeline of the US semiconductor market in 2025": 0.0,
  "Why Airbnb, Inc. (ABNB) Outpaced the Stock Market Today": 0.5,
  "Lam Research (LRCX) Outperforms Broader Market: What You Need to Know": 0.5,
  "What Bubble? Nvidia CEO Says AI Needs Trillions More in Investments": 0.5,
  "Cadence Design Systems (CDNS) Outperforms Broader Market: What You Need to Know": 0.5,
  "Strategy (MSTR) Rises Higher Than Market: Key Facts": 0.5,
  "Booking Holdings (BKNG) Outperforms Broader Market: What You Need to Know": 0.5,
  "Axon Enterprise (AXON) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Intel Rallies Ahead of Earnings. Here's What Analysts Are Saying That's Boosting the Stock.": 0.5,
  "Berkshire to offload Kraft Heinz: What it means in post-Buffett era": 0.1,
  "Where Will Intuitive Surgical Be in 5 Years?": 0.2,
  "GBank Appoints Jason Amos as Executive Vice President and Chief Technology Officer": 0.5,
  "Netflix grows subscribers by making changes viewers hate": -0.7,
  "MercadoLibre’s Expanding Fintech and Rising Credit Portfolio Might Change The Case For Investing In MELI": 0.5,
  "How Apple’s Gemini-Powered Siri Deal Will Impact Alphabet (GOOGL) Investors": 0.2,
  "Why Ross Stores (ROST) Outpaced the Stock Market Today": 0.5,
  "KLA (KLAC) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Top Analyst Reports for Agnico Eagle, Monster & General Motors": 0.5,
  "TD Cowen Names NXP (NXPI) a Top Pick, Raises Price Target to $285": 0.8,
  "Citizens Reiterates Bullish View on CrowdStrike (CRWD) With $550 Price Target": 0.8,
  "1 Stock I'd Buy Before Vitesse Energy in 2026": 0.2,
  "Jefferies Raises Intel (INTC) Price Target to $45 but Cites Structural Constraints": 0.2,
  "Why Credit Card Users At Walmart And Target Could Start Paying More": -0.5,
  "KeyBanc Raises Applied Materials (AMAT) Target to $380, Keeps Overweight Rating": 0.8,
  "Altman pursues Middle East capital as OpenAI seeks $800 billion valuation - Report": 0.1,
  "Popular health company rebrands after Nasdaq delisting threat": 0.2,
  "Stock market today: Dow, S&P 500, Nasdaq futures climb after Trump's Greenland whiplash": 0.5,
  "Stifel Raises Micron Technology (MU) Price Target to $360, Keeps Buy Rating": 0.8,
  "Truist Reiterates Buy on Meta Platforms (META), Says AI Fears Are Priced In": 0.6,
  "TD Cowen Sees Microsoft (MSFT) Shares Range-Bound Ahead of Earnings": 0.0,
  "Trump EU meeting, Intel earnings, December PCE: What to Watch": 0.2,
  "Surging memory chip prices dim outlook for consumer electronics makers": -0.7,
  "Is It Time To Reconsider PayPal (PYPL) After A 75% Five Year Share Price Fall?": -0.5,
  "Does Tesla (TSLA) Still Justify Its Price After Recent Valuation Checks?": -0.5,
  "Intel Stock Surges to 4-Year High Ahead of Earnings. Why Optimism Is Growing.": 0.8,
  "Sovereign AI Data Center Role Could Be A Game Changer For Accenture (ACN)": 0.5,
  "Is Bullish CF Analyst Sentiment Reframing the Pipeline Risk Narrative for Vertex Pharmaceuticals (VRTX)?": 0.5,
  "Constellation Energy (CEG) Valuation Check As PJM Policy Shifts Raise Regulatory Risk Concerns": -0.5,
  "Netflix Earnings Were a Flop. Why the Warner Bros. Bidding War Is Spooking Wall Street.": -0.6,
  "As Taiwan Semi Hikes Its Dividend 20%, Should You Buy TSM Stock?": 0.5,
  "Disco Shares Soar Most Since April on Booming AI Chip Demand": 0.8,
  "Artificial Intelligence (AI) Spending Is Exploding. This Stock Stands to Benefit Most": 0.6,
  "Nvidia Invests in AI Start-up Baseten. It Shows a Shift in the Market.": 0.5,
  "Review & Preview: A Greenland Rally": 0.0,
  "Ignore the S&P 500: These 3 Kings Could Mint Thousands of Millionaires": 0.5,
  "Is GE Vernova the Smartest Investment You Can Make Today?": 0.5,
  "This AI Cloud Specialist Is Poised for a Decade of Explosive Growth": 0.8,
  "Meta's Recent Stock Decline Is 'Self-Inflicted,' Says Analyst, Predicts Rally If Mark Zuckerberg Does This": 0.2,
  "1 Semiconductor Stock Trading at a Discount to Start the New Year": 0.5,
  "3 Reasons to Buy Costco Stock Like There's No Tomorrow": 0.6,
  "Anthropic CEO goes nuclear on Nvidia": -0.6,
  "A Look At Ross Stores (ROST) Valuation After Strong Results And Renewed Investor Interest": 0.6,
  "This Is One of the Best Nuclear Stocks to Hold for the Next 10 Years": 0.8,
  "Netflix Switches To All-Cash Offer For Warner Bros Discovery Amid Board Support": 0.5,
  "Stocks track Wall St rally as Trump cools tariff threats in Davos": 0.5,
  "3 Artificial Intelligence Stocks You Can Buy and Hold for the Next Decade": 0.5,
  "Bernstein Cuts Comcast (CMCSA) Target to $32, Keeps Market Perform Amid Rising Competition": -0.5,
  "You Need To Watch Microsoft and Amazon Before Investing in PBW ETF": 0.1,
  "Why AMD Stock Jumped Today": 0.5,
  "Has Walmart (WMT) Run Too Far After Its Strong Three Year Share Price Gain": -0.5,
  "Cathie Wood's Ark Unleashes Cryptic ARKmoji Teasers To Showcase Its 'Big Ideas' For 2026: Can You Take A Guess At The Hidden Meaning?": 0.2,
  "House Seeks Say Over AI Chip Sales After Nvidia’s China Win": 0.1,
  "Dow Jones Futures Rise After Trump Greenland Shift Fuels Stocks; Google, Eli Lilly Lead 8 New Buys": 0.6,
  "Costco makes an investment members will love": 0.8,
  "Is It Time To Reassess Palo Alto Networks (PANW) After Recent Share Price Weakness": 0.1,
  "Did New AI Data Center Chip Deals Just Shift Marvell Technology's (MRVL) Investment Narrative?": 0.2,
  "ICON PLC (ICLR) Trades Below Normal Earnings Despite Strong Fundamentals": 0.5,
  "New Bitcoin Whales Outpace Old Guard in $6B Supply Tug-of-War": 0.5,
  "How A New Price Target Is Shaping The Story For CSX (CSX)": 0.2,
  "Did Board Exit and Dividend Move Just Shift QUALCOMM's (QCOM) Investment Narrative?": 0.1,
  "I lost 500k since March 2020 and nearly bricked my brain - I have lost over five hundred thousand American dollars in the stock market. I want you to sit with that number. Let it wash over you. Let it enter your body. That's a house. That's several houses in Ohio. I have donated multiple homes to the market makers. They have not sent a thank you card. This is fine. I was losing money": -0.8,
  "Prediction: This Monster Growth Stock Will Soar to $10 Trillion by 2030": 0.8,
  "Genmab (GMAB)’s Future Potential Underappreciated by Market": 0.5,
  "Only 3 of My Top 10 Stocks for 2025 Lost to the Market. Here Are the Ones I Think Are Still Buys for 2026.": 0.6,
  "Indian startups call for tax certainty after court ruling spooks investors": -0.6,
  "Is Intel (INTC) Getting Ahead Of Itself After A 148% One Year Share Price Surge?": -0.5
}