{
  "2 Soaring Stocks to Hold for the Next 20 Years": 0.5,
  "Is It Too Late To Consider Axon Enterprise (AXON) After A 3-Year 229% Surge?": 0.2,
  "The Zacks Analyst Blog Eli Lilly, Medtronic, Intuitive Surgical, Regeneron Pharmaceuticals and Johnson & Johnson": 0.0,
  "The Zacks Analyst Blog Chevron, Lockheed, Northrop, CrowdStrike and Palo Alto": 0.0,
  "Is It Too Late To Consider DoorDash (DASH) After Its Strong 1 Year Share Price Run?": 0.2,
  "Big Pharma Has More Going for It Than Obesity Drugs": 0.5,
  "Mondelēz lifts sales as Albertsons tackles in-store retail media measurement": 0.5,
  "Monolithic Power Systems Insiders Sold US$236m Of Shares Suggesting Hesitancy": -0.5,
  "Here's What Cadence Design Systems' (NASDAQ:CDNS) Strong Returns On Capital Mean": 0.5,
  "Roper Technologies, Inc.'s (NASDAQ:ROP) Intrinsic Value Is Potentially 67% Above Its Share Price": 0.8,
  "A Look At Take-Two Interactive Software (TTWO) Valuation After A Strong 1 Year Shareholder Return": 0.6,
  "The CEO trying to revive some of what made GE so special": 0.5,
  "Assessing Texas Instruments (TXN) Valuation After Recent Short Term Share Price Weakness": 0.2,
  "3 Warren Buffett Stocks to Buy Hand Over Fist in January 2026": 0.5,
  "DoorDash’s CEO blasts ‘appalling’ claim that a major delivery app gives drivers a desperation score: ‘I would fire anyone who tolerated this’": 0.5,
  "Prediction: Synopsys Stock Will Soar Over the Next Decade. Here's 1 Nvidia-Related Reason Why.": 0.8,
  "What You Need to Know Ahead of Mondelez International’s Earnings Release": 0.1,
  "OncoNano Medicine Announces Research Collaboration with Gilead to Apply ON-BOARD™ Delivery Technology to Gilead’s Drug Candidate": 0.6,
  "Comscore Completes Recapitalization Transaction with Preferred Stockholders Following Approval from Common Stockholders": 0.5,
  "What to Expect From Amgen's Q4 2025 Earnings Report": 0.0,
  "5 Stocks Wall Street Repriced Higher Heading Into 2026": 0.5,
  "Regeneron Pharmaceuticals' Quarterly Earnings Preview: What You Need to Know": 0.5,
  "Keysight Technologies Appoints Liz Morali as Head of Investor Relations": 0.5,
  "SiMa.ai Announces First Integrated Capability with Synopsys to Accelerate Automotive Physical AI Development": 0.5,
  "Kahuna Labs Appoints Atul Nanda as Executive Advisor to Guide Product Strategy and Support Industry Engagement": 0.5,
  "Roper Technologies schedules fourth quarter 2025 financial results conference call": 0.0,
  "Take-Two Interactive Software, Inc. to Report Third Quarter Fiscal Year 2026 Results on Tuesday, February 3, 2026": 0.0,
  "An Intrinsic Calculation For Workday, Inc. (NASDAQ:WDAY) Suggests It's 40% Undervalued": 0.8,
  "Why Weebit Nano (ASX:WBT) Is Down 15.9% After Licensing ReRAM To Texas Instruments And Setting 2026 Revenue Target": -0.5,
  "Charter Offers Senior Unsecured Notes": 0.0,
  "U.S. Small Business Employment Remains Consistent Throughout 2025": 0.5,
  "Here's How Much You'd Have If You Invested $1000 in Marriott International a Decade Ago": 0.5,
  "Cactus (WHD) Soars 5.7%: Is Further Upside Left in the Stock?": 0.5,
  "Is Beyond Meat Stock a Long-Term Buy?": 0.5,
  "Index Exchange Launches Gracenote-Powered Show-Level Reporting with Spectrum Reach": 0.5,
  "Hubble Network Announces Collaboration with Texas Instruments to Expand Global Bluetooth® Connectivity": 0.5,
  "AMGEN ACQUIRES DARK BLUE THERAPEUTICS, BOLSTERING ONCOLOGY PIPELINE": 0.6,
  "Marvell to Acquire XConn Technologies, Expanding Leadership in AI Data Center Connectivity": 0.6,
  "Cadence Launches Partner Ecosystem to Accelerate Chiplet Time to Market": 0.5,
  "With 86% ownership of the shares, Fastenal Company (NASDAQ:FAST) is heavily dominated by institutional owners": 0.2,
  "T-Mobile US (NASDAQ:TMUS) Is Looking To Continue Growing Its Returns On Capital": 0.6,
  "Synopsys Showcases Vision For AI-Driven, Software-Defined Automotive Engineering at CES 2026": 0.6,
  "American Airlines to roll out free Wi-Fi for loyalty program members": 0.8,
  "Electronic Arts Earnings Preview: What to Expect": 0.0,
  "Is Baker Hughes (BKR) Quietly Redefining Its Core Through These Latest Portfolio Moves?": 0.5,
  "TIGIT Inhibitors Drugs Clinical Trials & Global Market Opportunity Report 2026-2030: Roche, Gilead Sciences, Merck, Arcus Biosciences, Compugen, and Vir Biotechnology Advance Deep Oncology Pipelines": 0.5,
  "How Power Integrations’ (POWI) New Marketing Chief from Micron and ADI Has Changed Its Investment Story": 0.5,
  "Truist says these are the best 7 GenAI stocks to own in 2026": 0.5,
  "Dark Blue Therapeutics acquired by Amgen for up to $840 million": 0.8,
  "PANW Plunges 14% in 3 Months: Should You Hold or Fold the Stock?": -0.6,
  "CoreWeave initiated, Shopify downgraded: Wall Street's top analyst calls": -0.5,
  "AMAT Stock Rises 114% From Its 52-Week Low: Time to Hold or Fold?": 0.5,
  "Marvell Stock Pops as It Gears Up for the Next Generation of AI With XConn Acquisition": 0.8,
  "Top Robotics Stocks That Could Drive Impressive Returns in 2026": 0.8,
  "Has Arm Holdings (ARM) Run Too Far After Recent Volatile Price Swings?": -0.5,
  "UnitedHealth, Chipotle, Starbucks, Mobileye: Top Analyst Calls": 0.0,
  "NXP and GE HealthCare Accelerate AI Innovation in Acute Care": 0.5,
  "Cactus Secures 65% Stake in BKR's Surface Pressure Control Business": 0.5,
  "AI Is ‘Transformative’ for Economy. Duolingo and 5 Other Stocks to Play the Shift.": 0.8,
  "Honeywell Aerospace's Growth Picks Up: Can the Momentum Sustain?": 0.5,
  "REGN vs. ILMN: Which Stock Should Value Investors Buy Now?": 0.2,
  "BYD vs. TTWO: Which Stock Is the Better Value Option?": 0.5,
  "KLA Jumps 96% in a Year: Is There More Room for the Stock to Grow?": 0.6,
  "Texas Instruments to webcast Q4 2025 and 2025 earnings conference call": 0.0,
  "Siemens Unveils Technologies to Accelerate the Industrial AI Revolution at CES 2026": 0.5,
  "NXP Advances Edge AI Leadership with New eIQ Agentic AI Framework": 0.6,
  "NBCUniversal, RPA, FreeWheel, and Newton Research Introduce Agentic AI Buying Across Linear and Digital for Premium Video": 0.5,
  "Amgen Agrees to Buy Dark Blue Therapeutics in Up to $840 Million Deal": 0.5,
  "Will Take-Two (TTWO) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Kraft Heinz (KHC) Valuation Check As Expanded Kraft Hockeyville Program Draws Fresh Attention": 0.2,
  "How Rising Agoda Demand in Malaysia and Strong Cash Returns Could Shape Booking Holdings (BKNG)": 0.5,
  "The Best Stocks to Invest $1,000 in Right Now": 0.5,
  "Lisbon ends ban on new holiday lets after crackdown backfires": 0.1,
  "ARM Stock Down 20% in a Year vs Industry Gains: Buy Signal or Caution?": -0.5,
  "ComEd Announces New Agreements Signed to Ensure Large Load Customers Pay their Fair Share to Connect with and Use the Grid": 0.2,
  "Paychex (PAYX) Q1 2025 Earnings Call Transcript": 0.1,
  "Evaluating Electronic Arts (EA) Valuation After Strong Multi Year Shareholder Returns": 0.5,
  "Investors in US drillers go all in on the ‘Donroe doctrine’": 0.2,
  "Equities Rise Intraday as Markets Weigh Services Sector Data": 0.5,
  "Sector Update: Consumer Stocks Higher in Afternoon Trading": 0.5,
  "How Rising AI Chip Rivalry And Institutional Flows At Arm Holdings (ARM) Have Changed Its Investment Story": 0.5,
  "Why Microchip Technology Rallied Double-Digits Today": 0.5,
  "Marriott Bonvoy To Provide Unmatched Fan Access to FIFA World Cup 2026™": 0.6,
  "US Restaurant 2026 Same-Store Sales Seen Improving 'Modestly' as Macro Risks Persist, UBS Says": 0.2,
  "Is Airbnb (ABNB) Priced Right After Mixed Returns And DCF Valuation Gap?": 0.1,
  "Why Is Photronics (PLAB) Stock Rocketing Higher Today": 0.6,
  "Vertex Pharmaceuticals (VRTX) Stock Trades Up, Here Is Why": 0.5,
  "Should PepsiCo’s (PEP) Industrial Metaverse Bet with Siemens and NVIDIA Require Action From Investors?": 0.1,
  "Beloved theme park hotel closes its doors forever": -0.8,
  "Is This Robotic Surgery Titan the Secret to 100% Gains by 2030?": 0.5,
  "Axon (AXON) Shares Skyrocket, What You Need To Know": 0.8,
  "Jack in the Box, Kura Sushi, Starbucks, Wendy's, and The Cheesecake Factory Stocks Trade Up, What You Need To Know": 0.5,
  "Zeta Global, Cadence Design Systems, Atlassian, DigitalOcean, and Bentley Systems Stocks Trade Up, What You Need To Know": 0.5,
  "Microchip Technology, NXP Semiconductors, Texas Instruments, Western Digital, and Allegro MicroSystems Stocks Trade Up, What You Need To Know": 0.5,
  "Analog Devices, Applied Materials, KLA Corporation, Monolithic Power Systems, and onsemi Shares Are Soaring, What You Need To Know": 0.8,
  "Sector Update: Tech Stocks Climb Late Afternoon": 0.5,
  "Stocks to Watch Tuesday: AIG, Vistra, Microchip, Under Armour": 0.0,
  "A Consumer-Spending Shift Is Coming. 11 Stocks to Benefit.": 0.5,
  "Fastenal Company Announces Conference Call to Review 2025 Annual and Fourth Quarter Earnings": 0.2,
  "Dow, S&P 500 Hit New Peaks as Investors Look Past Geopolitical Risks": 0.8,
  "Top Research Reports for JPMorgan Chase, RTX & Applied Materials": 0.5,
  "GE HealthCare Recommends Shareholders Reject \"Mini-Tender\" Offer by Potemkin Limited": -0.8,
  "Canal Capital Management adds Akre Focus ETF": 0.2,
  "Is Charter Communications (CHTR) Pricing Reflect Its Cash Flow And Earnings Valuation Gap": 0.1,
  "A Look At Mondelez International (MDLZ) Valuation After Recent Share Price Weakness": 0.1,
  "Stock Market Today, Jan. 6: Alumis Shares Surge on Positive Phase 3 Psoriasis Data for Envudeucitinib": 0.8,
  "Palo Alto Networks (PANW) Rises Higher Than Market: Key Facts": 0.5,
  "Datadog (DDOG) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "Intuit (INTU) Laps the Stock Market: Here's Why": 0.5,
  "A Fresh Look At Starbucks (SBUX) Valuation As Shares Rebound And Earnings Expectations Diverge": 0.5,
  "Autodesk (ADSK) Outperforms Broader Market: What You Need to Know": 0.5,
  "What Catalysts Are Quietly Shifting The Narrative For Insmed (INSM)?": 0.2,
  "Datadog’s Sticky AI Platform And R&D Spend Might Change The Case For Investing In DDOG": 0.5,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On January 7, 2026, CoStar Realty Information, Inc., a subsidiary of CoStar Group, Inc. (“CoStar” or the “Company”), entered into a second amendment (the “Amendment”) to its employment agreement with Andrew C. Florance, Founder and Chief Executive Officer (“CEO”) of the Company (the “Employment Agreement”). The Amendment, which became effective as of January 1, 2026, deletes": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. As previously disclosed on a Current Report on Form 8-K filed with the Securities and Exchange Commission (the “SEC”) on June 16, 2025, as amended on June 17, 2025, Warner Bros. Discovery, Inc. (“we,” “us,” “our” or the “Company”) and our wholly-owned subsidiary, Discovery Communications, LLC, entered into an employment agreement with David Zaslav, our Chief": 0.1,
  "(Item 1.01) . Entry into a Material Definitive Agreement Registration Rights Agreement On January 7, 2026, in connection with the closing of the Mergers (as defined below), CEG Parent entered into a registration rights agreement (the “Registration Rights Agreement”) with certain of the former stockholders of Calpine who received shares of Stock Consideration (as defined below) in the Mergers, each of whom is listed on the": 0.0,
  "2025 International Travel Overview: Agoda Unveils the Ranking of Top Overseas Destinations Among South Korean Travelers": 0.5,
  "Is Mondelez International (MDLZ) Pricing Look Attractive After Recent Share Price Weakness": 0.5,
  "Does Datadog (DDOG) Offer Value After Recent Share Price Weakness?": 0.2,
  "Microchip Technology (MCHP) Surges 11.6% on Net Sales Beat, Bright Outlook": 0.8,
  "Taking A Fresh Look At Intuitive Surgical (ISRG) Valuation After A Strong Recent Share Price Run": 0.5,
  "Datadog (DDOG) Valuation Check After Recent Share Price Pullback And Long Term Return Strength": 0.5,
  "Charter Prices $3.0 Billion Senior Unsecured Notes": 0.0,
  "Assessing Keurig Dr Pepper (KDP) Valuation After Mixed Short And Long Term Share Returns": 0.1,
  "Assessing Airbnb (ABNB) Valuation After Recent Share Price Momentum": 0.5,
  "Palo Alto Networks (PANW) Valuation Check After Recent Share Price Pullback": 0.2,
  "Guggenheim Lifts Palo Alto Networks (PANW) Rating Following Deal Activity and AI Tailwinds": 0.6,
  "3 Reasons We Love DoorDash (DASH)": 0.6,
  "Did Strong Quarterly Beat and Efficiency Gains Just Shift Cintas' (CTAS) Investment Narrative?": 0.2,
  "1 Momentum  Stock with Promising Prospects and 2 We Question": 0.5,
  "2 Cash-Producing Stocks with Impressive Fundamentals and 1 We Brush Off": 0.5,
  "2 Software Stocks for Long-Term Investors and 1 We Brush Off": 0.2,
  "Arm Holdings (ARM) Valuation Check After Rival Chip Design Deal And AI Royalty Optimism": 0.2,
  "A Look At Charter Communications (CHTR) Valuation After Recent Senior Unsecured Notes Issuance": 0.1,
  "Comcast (CMCSA) Valuation Check After Recent Share Price Weakness": 0.1,
  "What MercadoLibre Needs to Prove in 2026": 0.1,
  "How Shopify’s AI‑Native “Agentic Commerce” Push Could Impact Shopify (SHOP) Investors": 0.1,
  "Assessing Gilead Sciences (GILD) Valuation After Recent Share Price Momentum": 0.2,
  "Vertex’s Upgraded IgA Nephropathy Outlook Might Change The Case For Investing In Vertex (VRTX)": 0.5,
  "Bear of the Day: Starbucks (SBUX)": -0.5,
  "Scenic Biotech Enters License and Research Agreement with Ono Pharmaceutical": 0.5,
  "DISCO Pharmaceuticals Enters License Agreement to Advance Novel Cancer Surfaceome Targeted Therapies": 0.8,
  "Mondelēz plans US creative review following new marketing exec hire": 0.2,
  "AI ‘Fatigue’ Leaves Investors Focused on S&P’s Other 493 Stocks": -0.2,
  "2 Unstoppable Growth Stocks to Buy and Hold Through 2035": 0.8,
  "Bank of America Says These 2 Healthcare Stocks Are Top Ideas for 1Q26": 0.5,
  "Investors in Monster Beverage (NASDAQ:MNST) have seen respectable returns of 61% over the past five years": 0.8,
  "US High Growth Tech Stocks to Watch in January 2026": 0.5,
  "OneSource Virtual Announces Strategic, Majority Growth Investment from TA": 0.5,
  "What Is Honeywell International Inc.'s (NASDAQ:HON) Share Price Doing?": 0.0,
  "Cisco’s Long Road Back Shows How Tech Manias Can Bury Even the Best Companies": -0.6,
  "Palantir Tops 2025 List of Stocks With Biggest Fund Inflows": 0.5,
  "Strength Seen in Paccar (PCAR): Can Its 3.7% Jump Turn into More Strength?": 0.6,
  "IDEXX Stock Up 64.7% in a Year: What's Driving the Growth?": 0.6,
  "CoStar Group Provides Full Year 2026 and Medium-Term Outlook with Significant Adjusted EBITDA Expansion": 0.8,
  "BofA double-upgrades Regeneron, citing stronger Eylea outlook and 2026 catalysts": 0.8,
  "Cybersecurity Stocks: More Acquisitions Expected In 2026 Amid AI Boom": 0.5,
  "Amgen buys Dark Blue Therapeutics in $840m oncology deal": 0.5,
  "Cognizant Schedules Fourth Quarter 2025 Earnings Release and Conference Call": 0.0,
  "Alnylam Pharmaceuticals (NASDAQ:ALNY) Seems To Use Debt Quite Sensibly": 0.5,
  "Stocks making big moves yesterday: Herbalife, Vertex Pharmaceuticals, Micron, Amkor, and Palantir Technologies": 0.0,
  "Here Are Wednesday’s Top Wall Street Analyst Research Calls: Applied Digital, BigBear.ai, Block, Deckers Outdoors, GitLab, Hershey, McDonald’s, Moderna, and More": 0.5,
  "Dow Jones Futures Rise After S&P 500 Hits High; Amazon Leads New Buys": 0.6,
  "Comcast price target lowered to $44 from $46 at Benchmark": -0.5,
  "T-Mobile Announces Proposed Public Offering of Senior Notes": 0.1,
  "BrightInsight’s Patient App, developed with Sanofi, shows positive impact in patient treatment adherence and persistence": 0.8,
  "If You Invested $1000 in Analog Devices a Decade Ago, This is How Much It'd Be Worth Now": 0.5,
  "Here's How Much You'd Have If You Invested $1000 in Paccar a Decade Ago": 0.5,
  "Laser Photonics Announces Appointment of Respected Marketing Executive Nicole Joyce": 0.5,
  "Dan Ives Sees 25% Tech Stock Breakout — Micron And Three Bargain Stocks Stand Out": 0.6,
  "O'Reilly Automotive's Quarterly Earnings Preview: What You Need to Know": 0.0,
  "ISRG Trading 4% Below All-Time High: Should You Buy the Stock Now?": 0.5,
  "Cadence Announces Fourth Quarter and Fiscal Year 2025 Financial Results Webcast": 0.0,
  "T-Mobile Introduces Its Most Value-Packed Plan Ever": 0.8,
  "Old Dominion Freight Line to Webcast Fourth Quarter and Year-End 2025 Conference Call": 0.0,
  "Dexcom Enters Next Era of Continued Innovation With Jake Leach as President and Chief Executive Officer": 0.8,
  "Arm Announces Earnings Release Date for Third Quarter Fiscal Year Ended 2026": 0.2,
  "Marshall Mohr Joins Capstan Medical Board of Directors": 0.5,
  "1 Analyst Just Doubled His Price Target on ASML Stock. Should You Buy Shares Now?": 0.5,
  "Here is What to Know Beyond Why Intuitive Surgical, Inc. (ISRG) is a Trending Stock": 0.1,
  "Vertex Pharmaceuticals Incorporated (VRTX) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Investors Heavily Search Cisco Systems, Inc. (CSCO): Here is What You Need to Know": 0.5,
  "Robinhood Markets and Starbucks have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "These 5 Software Stocks Prove Profitability Beats Growth in 2026": 0.5,
  "Venezuela-driven pop in oil stocks may fade, but some gains to hold: Citi": 0.2,
  "Thomson Reuters Fourth-Quarter and Full-Year 2025 Earnings Announcement and Webcast Scheduled for February 5, 2026": 0.0,
  "NVTS Surges 54% in 6 Months: Should You Hold or Fold the Stock?": 0.5,
  "CDNS Boosts Physical AI With Spec-to-Packaged Chiplet Ecosystem": 0.5,
  "Wayfair upgraded, Instacart initiated: Wall Street's top analyst calls": 0.5,
  "Microchip Tech (MCHP) Surges 11.7%: Is This an Indication of Further Gains?": 0.6,
  "Here's Why Take-Two Interactive (TTWO) is a Strong Growth Stock": 0.8,
  "NXP Semiconductors (NXPI) Recently Broke Out Above the 20-Day Moving Average": 0.5,
  "Reliable, High-Speed Internet from Xfinity Coming to Centreville, MD": 0.8,
  "ASML Stock Rises 58.2% in 6 Months: Should You Buy, Sell or Hold?": 0.5,
  "Why Applied Materials (AMAT) Is Up 13.9% After Renewed AI-Focused Factory Spending Expectations And What's Next": 0.6,
  "4 Fascinating Things About DoorDash That Investors Should Know": 0.5,
  "UniFirst Maintains Outlook; Fiscal First-Quarter Earnings Decline": -0.5,
  "Unifirst Q1 Earnings Call Highlights": 0.5,
  "Resort from 'Biggest Loser' show files for Chapter 11 bankruptcy": -0.8,
  "Regeneron Pharmaceuticals to Have Multiple Pipeline Updates in 2026, BofA Says": 0.5,
  "3 Reasons Why Investors Should Stay Away From MELI Stock Right Now": -0.8,
  "Intuit (INTU) Valuation Check As New Buy Ratings And Dividend Increase Highlight AI Growth Story": 0.6,
  "The Protocol: Ledger customer data breached from Global-e platform": -0.8,
  "Why Regeneron (REGN) Stock Is Trading Up Today": 0.5,
  "4 Diversified Operations Stocks to Watch Despite Industry Headwinds": 0.5,
  "Add These 4 GARP Stocks to Your Portfolio to Receive Handsome Returns": 0.8,
  "New Wi-Fi 8 Expands AVGO's Connectivity Portfolio: What's Ahead?": 0.5,
  "RBC Says \"2026 May Bring a Rebound for Canadian Software Stocks\"": 0.6,
  "Starbucks’ Turnaround Makes a Strong Case for Long-Term Hold": 0.8,
  "REGN vs. ILMN: Which Stock Is the Better Value Option?": 0.0,
  "ALMS Surges as Envudeucitinib Meets Goals in Plaque Psoriasis Studies": 0.8,
  "Reasons Why You Should Retain Paychex Stock in Your Portfolio": 0.5,
  "Will Regeneron (REGN) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "A Look At Seagate Technology (STX) Valuation As AI Data Center And HAMR Demand Builds": 0.5,
  "ALAB Stock Rallies 20% in One Year: Should You Buy, Hold, or Sell?": 0.5,
  "The Prospects of a Bumper West African Cocoa Crop Weighs on Prices": -0.5,
  "Homes.com Will Be Profitable in 2030, CoStar Says. Investors Aren’t Thrilled.": -0.5,
  "Exelon's Regulatory Strength Offset by Affordability Pressures, RBC Says": 0.1,
  "xAI Raises $20 Billion In Mega Round": 0.8,
  "Siemens, Nvidia Deepen Industrial AI Push": 0.5,
  "Intel stock rallies as CES debut of Panther Lake chip marks make-or-break moment": 0.6,
  "Google has overtaken Apple's market cap, becoming the second most valuable company in the world - Google (NASDAQ:GOOG) climbed 2.3% today to hit a new all-time high of $325.02, with its market capitalization now $3.92 trillion. This move surpassed Apple's (NASDAQ:AAPL) market capitalization of $3.86 trillion making Google's parent Alphabet the world's second-largest company by market value. Sources: - https://www.benzinga.com/markets/equities/26/01/49763932/stock-market-news-wednesday-wall-street-today-sp500-record-highs-alphabet-intel-apple - https://companiesmarketcap.com/": 0.8,
  "Shopify competitor Swap raises $100M six months after raising $40M": 0.8,
  "Ross Stores' Q3 Comps Surge: Can Momentum Carry Into FY26?": 0.6,
  "Why Arm Holdings Plunged Nearly 20% in December": -0.8,
  "Exclusive-Arm launches 'Physical AI' unit, joining rush to robotics by tech and automakers": 0.5,
  "The 3 Best Cybersecurity Stocks to Buy for 2026": 0.5,
  "Brady Stock Is up 13% This Past Year, but Here's Why One Fund Cashed Out Completely": 0.2,
  "The Dow and S&P 500 Are in the Red": -0.5,
  "Cisco: Closing the Gap: bitsIO Wins Splunkie Award for Data and AI-Powered Nonprofit Solutions": 0.6,
  "40 stocks likely to outperform in 2026: Boyar pres. explains": 0.2,
  "How Investors May Respond To Intuitive Surgical (ISRG) Surging da Vinci Usage and New FDA Approvals": 0.5,
  "Jay Stein, Who Turned Universal’s Studio Tour Into a Theme-Park Empire, Dies at 88": 0.5,
  "Freight Railroad CSX Lays Off 166 Management Workers": -0.8,
  "Is Chipotle Stock Serving Up a 'Spicy Revival Story' in 2026?": 0.5,
  "Stock market today: Dow, S&P 500 slide from records as rally loses steam amid growing risks": -0.5,
  "Diamondback Energy, Inc. Schedules Fourth Quarter 2025 Conference Call for February 24, 2026": 0.0,
  "Viper Energy, Inc., a Subsidiary of Diamondback Energy, Inc., Schedules Fourth Quarter 2025 Conference Call for February 24, 2026": 0.0,
  "AMGEN TO PRESENT AT THE 44TH ANNUAL J.P. MORGAN HEALTHCARE CONFERENCE": 0.0,
  "US Equity Markets End Mixed Wednesday as Investors Assess Recent Labor, Services Data": 0.1,
  "Citi Raises Cintas (CTAS) Target but Keeps Sell Rating": -0.5,
  "Regeneron Stock Lagged Behind the S&P 500 Last Year. Why This Firm Moved Off the Sidelines.": 0.2,
  "DoorDash to Announce Fourth Quarter and Full Year 2025 Financial Results on February 18, 2026": 0.0,
  "AppLovin to Announce Fourth Quarter and Full Year 2025 Results": 0.0,
  "Lam Research Corporation Announces December Quarter Financial Conference Call": 0.0,
  "Troubled coffee shop chain files Chapter 11 bankruptcy, seeks sale": -0.8,
  "Constellation Completes Calpine Transaction, Powering America’s Clean Energy Future": 0.8,
  "Dollar steady, range-bound as investors assess US labor data": 0.2,
  "3 Red-Hot Growth Stocks to Buy in 2026": 0.8,
  "Dow, S&P 500 Fall From Records as Traders Assess Trump's Move to Ban Institutional Home Buying": -0.5,
  "These Stocks Moved the Most Today: Strategy, Sandisk, Alphabet, First Solar, GameStop, Cal-Maine, and More": 0.2,
  "Constellation Sales Fall as Hispanic Pullback Continues": -0.6,
  "How NXP Semiconductors Stock Gained 11.4% Last Month": 0.6,
  "Transource and BHE Transmission to Build Nearly 200-Mile 765-kV Transmission Line in Wisconsin": 0.5,
  "Constellation Energy Completes Calpine Deal": 0.5,
  "S&P 500, Dow Jones Slid From Peaks Amid Sell-Off in Old Economy Sectors, Mounting Geopolitical Crisis": -0.7,
  "Stock Market Today: Dow Slips Back Below 49K; Trump Takes On Defense Firms (Live Coverage)": 0.1,
  "Analyst Upgrades And Short-Interest Drop Might Change The Case For Investing In Regeneron (REGN)": 0.5,
  "Weighing Weebit Nano’s Valuation After The Texas Instruments Deal And New 2026 Revenue Guidance": 0.2,
  "Top analyst drops eye-popping price target on ASML stock": 0.8,
  "Applied Materials (AMAT) Falls More Steeply Than Broader Market: What Investors Need to Know": -0.6,
  "Why ASML (ASML) Dipped More Than Broader Market Today": -0.5,
  "Constellation Energy Corporation (CEG) Dips More Than Broader Market: What You Should Know": 0.1,
  "Starbucks (SBUX) Falls More Steeply Than Broader Market: What Investors Need to Know": -0.5,
  "Fortinet (FTNT) Rises As Market Takes a Dip: Key Facts": 0.5,
  "Why Lam Research (LRCX) Dipped More Than Broader Market Today": -0.5,
  "Why the Market Dipped But Booking Holdings (BKNG) Gained Today": 0.2,
  "Why Texas Instruments (TXN) Dipped More Than Broader Market Today": -0.5,
  "Western Digital (WDC) Dips More Than Broader Market: What You Should Know": -0.2,
  "Paccar (PCAR) Falls More Steeply Than Broader Market: What Investors Need to Know": -0.5,
  "Here's Why KLA (KLAC) Fell More Than Broader Market": -0.6,
  "Exec Edge NYSE Firesides Scheduled Feb 3, 2026": 0.0,
  "Stock Market Today, Jan. 7: Banks Slide as Stock Rally Slows": -0.5,
  "Constellation Closes Deal for Calpine, Creating Biggest Electricity Generator": 0.5,
  "T-Mobile Agrees to Sell $2.0 Billion of Senior Notes": 0.5,
  "(Item 8.01) .Other Events As previously disclosed, in November 2024 a subsidiary of AEP executed a purchase agreement to acquire 100 MWs of solid oxide fuel cells with an option to purchase an additional 900 MWs. On January 4, 2026, an unregulated subsidiary of AEP executed (i) an unconditional purchase agreement to acquire a substantial portion of its option for solid oxide fuel cells for the development and construction of a fuel cell generation facility for approximately": 0.1,
  "Cisco’s 25-Year Journey Back to Its Dot-Com Peak Offers a Cautionary Tech Lesson": 0.1,
  "Is It Too Late To Consider Synopsys (SNPS) After Strong Multi‑Year Share Price Gains": 0.2,
  "T-Mobile makes key claim AT&T and Verizon dispute": 0.2,
  "CSX lays off 5% of management staff, furloughs conductors": -0.5,
  "PACCAR (PCAR) Is Up 5.3% After Surging Class 8 Orders And Insider Buying - Has The Bull Case Changed?": 0.6,
  "Is It Too Late To Consider AstraZeneca (LSE:AZN) After A 35% One-Year Rally?": 0.2,
  "A Look At Cognizant Technology Solutions (CTSH) Valuation After Closing The 3Cloud Acquisition": 0.2,
  "3 Reasons We Love Cintas (CTAS)": 0.5,
  "A Look At AstraZeneca (LSE:AZN) Valuation After Strong Recent Share Price Returns": 0.5,
  "Is It Too Late To Consider Seagate Technology Holdings (STX) After Its 254% One-Year Surge": 0.2,
  "2 Consumer Stocks for Long-Term Investors and 1 We Brush Off": 0.2,
  "Assessing NXP Semiconductors (NXPI) After Recent Share Price Strength And Mixed Valuation Signals": 0.2,
  "1 Unprofitable Stock with Impressive Fundamentals and 2 We Find Risky": 0.2,
  "2 Cash-Heavy Stocks Worth Your Attention and 1 We Question": 0.2,
  "3 Cash-Producing Stocks We’re Skeptical Of": -0.5,
  "1 Nasdaq 100 Stock to Keep an Eye On and 2 We Brush Off": 0.2,
  "2 Volatile Stocks to Research Further and 1 We Brush Off": 0.2,
  "3 Nasdaq 100 Stocks Worth Your Attention": 0.0,
  "Microchip Technology (MCHP) Is Up 16.0% After Raising Q4 Sales Guidance On Broader Demand Recovery": 0.8,
  "Is Marvell Technology (MRVL) Attractively Priced After Recent Share Price Weakness": 0.5,
  "Is Axon (AXON) Stock a Buy in 2026?": 0.2,
  "BLUETTI Brings Together Texas Instruments, Covestro, Leave No Trace at CES 2026 to Explore the Future of Clean Energy": 0.5,
  "Assessing NXP Semiconductors (NXPI) Valuation After Recent Share Price Pullback": 0.2,
  "Datadog (DDOG) Stock Pullback Seen as Buying Opportunity for 2026": 0.6,
  "AppLovin (APP) Is Down 6.1% After Selling Gaming Unit To Double Down On AI Ads": -0.5,
  "Is It Time To Reassess Cisco Systems (CSCO) After Its Recent Share Price Pullback": 0.2,
  "Heard on the Street Wednesday Recap: Trump’s Housing Salvo": 0.1,
  "Assessing PACCAR (PCAR) Valuation After Class 8 Order Surge Tariff Tailwinds And Insider Buying": 0.5,
  "MISO selects AEP-Berkshire JV to build $1.2B, 765-kV transmission project": 0.5,
  "US Stock Market Today S&P 500 Futures Ease As Rate Cut Hopes Hinge On Jobs": 0.5,
  "4 medtech topics to watch in 2026": 0.0,
  "Got $1,000? 3 Stocks to Buy While They're on Sale.": 0.5,
  "Exelon Corporation (NASDAQ:EXC) is favoured by institutional owners who hold 87% of the company": 0.5,
  "What You Need to Know Ahead of Automatic Data Processing’s Earnings Release": 0.1,
  "Is CoStar (CSGP) Using Its New $1.5 Billion Buyback To Redefine Its Growth Story?": 0.2,
  "See How ASML Thrives on Rare Bullish Inflows": 0.6,
  "Market Chatter: Arm Holdings Forms Physical AI Unit Following Reorganization": 0.5,
  "What to Expect From Old Dominion’s Q4 2025 Earnings Report": 0.2,
  "Asia Has Become ‘Epicenter’ of Prescription Drug Innovation: McKinsey": 0.5,
  "January 2026 Top Growth Stocks With Insider Influence": 0.0,
  "3 Stocks That Might Be Priced Below Their True Value": 0.5,
  "Corero Network Security Appoints Michelle Ragusa-McBain as Vice President of Channel Sales": 0.5,
  "Rick R. Suarez appointed US President and Head of US BioPharmaceuticals Business Unit": 0.5,
  "Atlassian (NASDAQ:TEAM) shareholders have endured a 34% loss from investing in the stock a year ago": -0.8,
  "Microchip Releases Custom Firmware For NVIDIA DGX Spark For Its MEC1723 Embedded Controllers": 0.5,
  "Is Fortinet (FTNT) Offering Value After Recent Share Price Weakness And DCF Upside Estimate": 0.5,
  "Jim Cramer Calls Micron a “Favorite of the Show”": 0.6,
  "Jim Cramer Notes That Lam Research Is One of the Stocks He Likes “So Much”": 0.8,
  "Jim Cramer on Insmed: “This One Is Worth Keeping an Eye On”": 0.6,
  "Jim Cramer Says He “Can’t Name a Single Competitor to AppLovin”": 0.6,
  "Jim Cramer Says “You Have to Expect Companies Like KLA to Keep Racking Up Big Orders” At This Point": 0.6,
  "Jim Cramer on Charter Communications: “Tough to Be a Cable Company in These Days”": -0.5,
  "Jim Cramer on Copart: “Too Soon to Stick Your Neck Out”": 0.1,
  "Anavex Life Sciences Appoints Senior Vice President Global Head of Neurology": 0.5,
  "E-Commerce Update - India's Digital Marketplace Evolution: Growth Beyond Tier-1 Cities": 0.5,
  "Stocks Fall Pre-Bell as Investors Assess Trump's Defense Budget Plans": -0.5,
  "GE HealthCare price target raised to $95 from $90 at Stifel": 0.5,
  "Western Digital Earnings Preview: What to Expect": 0.0,
  "Jim Cramer Says “Atlassian’s Really in the Crosshairs”": 0.2,
  "How is Rising AEC Adoption Transforming Credo's Growth Trajectory?": 0.5,
  "Dow Jones Futures Fall; Lockheed, Defense Giants Bounce On $1.5 Trillion Trump 'Dream Military'": 0.2,
  "Former Bolt CEO Maju Kuruvilla’s startup triples to $100M valuation": 0.8,
  "Lambda Appoints Leonard Speiser as Chief Operating Officer": 0.5,
  "Should Weakness in Diamondback Energy, Inc.'s (NASDAQ:FANG) Stock Be Seen As A Sign That Market Will Correct The Share Price Given Decent Financials?": 0.2,
  "Insiders were the biggest winners as PDD Holdings Inc.'s (NASDAQ:PDD) market cap grew by US$11b last week": 0.6,
  "Biotech Stocks' Dark Winter Is Over. What That Means For Investors.": 0.5,
  "Here Are Thursday’s Top Wall Street Analyst Research Calls: Alphabet, Coinbase Global, Digital Realty Trust, Intuit, Reddit, Roku, Tyler Technologies, and More": 0.5,
  "Fewer layoffs don't mean a healthier job market. Here's why": -0.5,
  "LRCX vs. TSM: Which Semiconductor Powerhouse Is the Better Buy?": 0.5,
  "Everyone's Watching Stocks. The Real Bubble Is AI Debt - >The investment requirements are so large that equity financing alone won’t do. The balance sheets of many of the major players have been altered significantly. Looking at Meta’s annual statement before ChatGPT was released to the public in November 2022, it had over three times as much cash as debt on its balance sheet. Last quarter it had 15% more debt. Microsoft had 30% more": -0.5,
  "Forbes Names Cintas to 2026 America’s Best-in-State Companies List": 0.8,
  "Xilio Therapeutics Highlights Upcoming Milestones and Recent Corporate Updates": 0.5,
  "Internet stocks seen outperforming in 2026 as AI enters ‘Synergy’ phase: Cantor": 0.6,
  "Can These Dividend Stocks Beat the Market Again in 2026?": 0.2,
  "Paradox Conversational Applicant Tracking System (ATS) Now Available Through Workday, Helping Organizations Hire Frontline Workers Faster": 0.6,
  "Paychex and PayPal Team Up to Bring Direct Deposit Alternatives Into Paychex Flex® Perks": 0.5,
  "BCM One Announces Strategic Rebrand and Major Platform Investment": 0.8,
  "Texas Instruments Incorporated (TXN) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Workday Accelerates Retail and Hospitality Momentum with New Customer Wins and AI Innovations for the Frontline": 0.5,
  "AI stock battle: Buy, sell or hold Nvidia, Intel, and AMD": 0.2,
  "3 of the Best Stocks Under $100 to Buy in 2026": 0.5,
  "Company News for Jan 8, 2026": 0.0,
  "CrowdStrike Trades at Premium Valuation: Buy, Sell or Hold the Stock?": 0.2,
  "Is It Worth Investing in Intuit (INTU) Based on Wall Street's Bullish Views?": 0.5,
  "Memory Chip Stocks are Red-Hot. Is it Too Late to Buy?": 0.5,
  "Alphabet upgraded, Nike downgraded: Wall Street's top analyst calls": 0.2,
  "What Makes NXP Semiconductors NV (NXPI) an Attractive Investment?": 0.5,
  "Zacks Industry Outlook Highlights Honeywell International, 3M, Grupo, Cibest and ITT": 0.5,
  "Best Stock Trade of 2025 Keeps Running, Question Is for How Long": 0.2,
  "Should You Invest in Verisk Analytics (VRSK)?": 0.0,
  "Why this VC thinks 2026 will be ‘the year of the consumer’": 0.5,
  "Costco's December Sales Stay Strong: What Is Driving COST's Momentum?": 0.6,
  "Why Utilities Stocks Are Your Best Friend in 2026": 0.6,
  "Verndale Acquires Vaan Group to Establish Best-In-Class D2C Commerce Practice and Expand Shopify Expertise": 0.8,
  "Adobe (ADBE) Partners With Runway to Expand Firefly AI Video Tools": 0.6,
  "Exelon Names Tim Peterson Chief Customer and Technology Officer": 0.5,
  "T-Mobile US' Quarterly Earnings Preview: What You Need to Know": 0.0,
  "MercadoLibre (NasdaqGS:MELI) Valuation Checked As Venezuela Growth Hopes Lift Investor Expectations": 0.5,
  "A Look At GE HealthCare Technologies (GEHC) Valuation After New Edge AI Partnership With NXP": 0.5,
  "Wells favours Oracle, SAP and Figma, says AI still core software driver in 2026": 0.5,
  "Paramount Defends Its Hostile Bid for Warner": -0.5,
  "Layoffs, bankruptcies batter U.S. logistics and manufacturing at start of 2026": -0.8,
  "Trump tariffs live updates: Trump says 'we're screwed' if Supreme Court rules against his tariffs": -0.8,
  "National Advertising Division Finds Certain T-Mobile Claims Supported, Recommends Modifications to Others; T-Mobile to Appeal": 0.2,
  "1 Consumer Goods Stock I'd Buy Before CTAS in 2026": 0.2,
  "Deutsche Bank sees ‘risk-on’ setup for retail in 2026, favors AS and ROST": 0.5,
  "MRVL Expands AI Connectivity Through Acquisitions: What's Next?": 0.5,
  "Verifone Enters 2026 with Expanded Victa Line and Broadened Partner Ecosystem": 0.6,
  "Assessing Xcel Energy (XEL) Valuation After Recent Share Price Weakness And Clean Energy Growth Plans": 0.5,
  "Should Amgen’s (AMGN) Exclusive DISCO Oncology Deal Require Action From Investors?": 0.1,
  "Bloom Energy Stock Jumps on $2.7 Billion Fuel Cell Deal. Why It Matters.": 0.8,
  "EA SPORTS™ Presents Madden Bowl to Headline Super Bowl LX Week With Luke Combs, Teddy Swims and More": 0.5,
  "Jensen Huang Says Tesla FSD Is 'State-Of-The-Art,' Explains How Nvidia's Alpamayo Is Different": 0.5,
  "Skillsoft Slips 72% in a Year: How Should Investors Play the Stock?": -0.6,
  "DexCom (DXCM) Stock Trades Down, Here Is Why": -0.5,
  "Bloom Energy Jumps 15.7% After AEP Discloses $2.65B Fuel Cell Deal": 0.8,
  "EXPE vs. MELI: Which Stock Is the Better Value Option?": 0.0,
  "Elastic, Atlassian, Autodesk, Commerce, and Domo Shares Are Falling, What You Need To Know": -0.5,
  "Why Zscaler (ZS) Shares Are Trading Lower Today": -0.5,
  "Why Datadog (DDOG) Shares Are Falling Today": -0.5,
  "Applied Materials, KLA Corporation, Lam Research, Seagate Technology, and Western Digital Stocks Trade Down, What You Need To Know": -0.5,
  "Veterinary Infectious Disease Diagnostics Market Forecast, 2025-2035, Featuring IDEXX Labs, Zoetis, Thermo Fisher Scientific, Virbac, bioMerieux and More": 0.2,
  "Arm Stock In Spotlight -- A New Push Into Robotics Is Driving the Move": 0.5,
  "2 E-Commerce Stocks With More Growth Than Amazon": 0.5,
  "Domaine Acquires Pattern to Transform Experience-First Digital Commerce": 0.5,
  "Why Monster Beverage Stock Is Worth Holding in Your Portfolio Now": 0.6,
  "BLUETTI, Texas Instruments, Covestro, and Leave No Trace Join Forces at CES 2026 to Advance Inclusive, Sustainable Energy Solutions": 0.6,
  "Alveus launches with $160M to advance MariTide-like obesity drug": 0.5,
  "Tidal Cyber Appoints Jessica Hall as Vice President of Product": 0.5,
  "Baker Hughes Completes Divestiture of Its PCI Unit to Crane": 0.2,
  "Does T-Mobile US (TMUS) Now Look Attractive After Recent Share Price Weakness?": 0.5,
  "Is Starbucks (SBUX) Pricing Reflecting Recent Mixed Returns And Brand Strength Debates": 0.1,
  "Trump calls for $1.5 trillion military budget in 2027, up from $901 bln in 2026 - Source - https://www.reuters.com/world/us/trump-says-us-military-budget-2027-should-be-15-trillion-2026-01-07/ President Donald Trump said on Wednesday the 2027 U.S. military budget should be $1.5 trillion, significantly higher than the $901 billion approved by Congress for 2026, boosting defense stocks, but sparking skepticism among budget experts. Any such increase in the military budget would require congressional authorization, which could pose a challenge, although Trump's Republicans, who hold": -0.6,
  "Why Shares of Bloom Energy Are Rocketing Higher Today": 0.8,
  "Meet the Dividend King Down 28% in 2025 That Has a Lower Payout Ratio and a Higher Yield Than Coca-Cola and PepsiCo": 0.2,
  "3 Stocks That May Be Trading At An Estimated Discount Of Up To 21.8%": 0.5,
  "Assessing Whether Lam Research (LRCX) Is Overvalued After Its Strong Recent Share Price Momentum": 0.2,
  "TASTE OF THE NFL BRINGS SUPER BOWL LX'S ULTIMATE CULINARY EXPERIENCE TO SAN FRANCISCO TO RALLY SUPPORT TO END STUDENT HUNGER": 0.8,
  "Is Intuit (INTU) Offering A Fair Entry After Softer Returns And AI Partnership Buzz": 0.2,
  "Trump wants oil prices to hit $50 a barrel. The math doesn't work for the US oil industry.": -0.5,
  "US Equity Indexes Mixed as Technology Restrains Nasdaq Composite, S&P 500": 0.0,
  "Sector Update: Energy Stocks Climb in Afternoon Trading": 0.6,
  "CrowdStrike to buy identity security startup SGNL for $740 million to tackle AI threats": 0.6,
  "Assessing Fortinet (FTNT) Valuation After Mixed Returns And A Highlighted Profitability Narrative": 0.5,
  "Analysis- Drugmakers brace for Europe pricing fight after Trump's US price-cut deals": -0.5,
  "As a Concerned Warren Buffett Exits, His 4 Safest Dividend Stocks Are 2026 Gems": 0.5,
  "December US Nonfarm Payrolls Expected to Rise by 70,000, Unemployment Rate Seen Falling to 4.5%": 0.5,
  "Assessing PepsiCo (PEP) Valuation After CES 2026 AI Partnership With Siemens And NVIDIA": 0.2,
  "Assessing Atlassian (NasdaqGS:TEAM) Valuation After New Dashmoto And Williams F1 Collaboration": 0.2,
  "The Dividend Aristocrats No One’s Talking About (And Their 30+ Year Track Records)": 0.5,
  "Technology Sell-Off Leaves US Equity Indexes Trading Mixed": -0.5,
  "Sector Update: Tech Stocks Fall Late Afternoon": -0.5,
  "Sector Update: Energy Stocks Gain Late Afternoon": 0.5,
  "US Equity Markets End Mixed Thursday as Risk-Off Sentiment Weighs on Tech Stocks": -0.5,
  "Data Center Demand Points This Stock Toward A Buy Point After Major Project Approval": 0.6,
  "CrowdStrike To Acquire Identity Security Firm Amid Cybersecurity Platform Race": 0.5,
  "Telecom Stocks 2026: As Wireless Price War Fears Grow, Is AT&T, T-Mobile Or Verizon The Best Buy?": 0.2,
  "2 Beaten Down Tech Stocks Primed for a 2026 Rebound": 0.5,
  "Samsung Guides to Record Profit. That’s Good News for Micron Stock.": 0.8,
  "Verisk Announces Sale of its Marketing Solutions Business to ActiveProspect": 0.2,
  "Cellectis Announces 2026 Strategy and Catalysts": 0.5,
  "GOOGL, META, MSFT, AMZN and NFLX: Big Tech win as EU backs off heavy handed digital regulations - The European Union's Digital Networks Act will spare the US tech giants from binding new obligations. **Winners**: Big US Tech - GOOGL, META, MSFT, AMZN and NFLX **Losers**: European Telcos - ​Deutsche Telekom (Germany), ​Orange (France), ​Telefónica (Spain), ​TIM (Italy) and others ------- **​No Fair Share Fees**: There will be no legal mandate forcing platforms to pay": 0.8,
  "Equities End Mixed Ahead of Friday's Nonfarm Payrolls Report; Defense Stocks Rise": 0.2,
  "Top Analyst Reports for Johnson & Johnson, Caterpillar and Qualcomm": 0.0,
  "Why Bernstein Sees 2026–27 as “Big Years” for ASML": 0.5,
  "Trump's defense spending plans send 'strong' demand signal": 0.6,
  "Microsoft’s (MSFT) AI Strategy Reinforces Its Position as a Long-Term Winner, Analyst Says": 0.8,
  "Cadence Design Systems (CDNS) Valuation Check After New Chiplet Ecosystem And AI Partnerships Announcement": 0.5,
  "Assessing Applied Materials (AMAT) Valuation After Tech Rotation On Trump’s Proposed Military Budget Shift": 0.1,
  "US Equity Indexes Close Mixed as Technology Sell-Off Precedes Friday's Nonfarm Payrolls": 0.0,
  "Stock Market Today, Jan. 8: Defense Stocks Rally and Tech Retreats": 0.2,
  "Cisco Systems (CSCO) Stock Dips While Market Gains: Key Facts": 0.1,
  "CrowdStrike Holdings (CRWD) Stock Declines While Market Improves: Some Information for Investors": -0.2,
  "Zscaler (ZS) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "Airbnb, Inc. (ABNB) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Amgen (AMGN) Stock Falls Amid Market Uptick: What Investors Need to Know": 0.1,
  "Marvell Technology (MRVL) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "Synopsys (SNPS) Stock Declines While Market Improves: Some Information for Investors": -0.5,
  "Take-Two Interactive (TTWO) Stock Falls Amid Market Uptick: What Investors Need to Know": -0.2,
  "Why Analog Devices (ADI) Outpaced the Stock Market Today": 0.5,
  "Comcast (CMCSA) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Why Kraft Heinz (KHC) Outpaced the Stock Market Today": 0.5,
  "Intuitive Surgical, Inc. (ISRG) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Why Paccar (PCAR) Outpaced the Stock Market Today": 0.5,
  "Axon Enterprise (AXON) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Vertex Pharmaceuticals (VRTX) Stock Falls Amid Market Uptick: What Investors Need to Know": -0.2,
  "This Cybersecurity Leader Is Poised to Capture a $300 Billion Market by 2030": 0.8,
  "Is It Too Late To Consider Constellation Energy (CEG) After The Recent Share Price Pullback": 0.1,
  "Apartments.com Releases Multifamily Rent Growth Report for December 2025": 0.0,
  "Is Atlassian (TEAM) Using F1 Electric Scooters To Reframe Its Brand And Product Narrative?": 0.2,
  "Cisco (CSCO) Unlikely to Pursue Axonius Acquisition, Says TD Cowen Analyst": -0.5,
  "Ross Stores (ROST) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Astrazeneca (AZN) Stock Falls Amid Market Uptick: What Investors Need to Know": 0.1,
  "Honeywell (HON) Target Trimmed as Mizuho Warns of Uneven Industry Backdrop": -0.5,
  "Mizuho Raises Walmart (WMT) Target as Consumer Spending Shows Mixed Signals": 0.2,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On January 6, 2026, William P. Brown, Group President, United States and Canada, of Marriott International, Inc. (“Marriott” or “the company”), notified Marriott of his intent to step down from his role effective March 28, 2026 and retire from the company effective June 30, 2026.": -0.5,
  "ChatGPT Thinks Arm Holdings Stock Will Close At This Price In The Next 60 Days": 0.2,
  "This Is My Absolute Best Dividend Stock Idea Right Now": 0.8,
  "Dave Ramsey Slams Grandma's 'Unethical' $1M IRS Plan To Put House in Grandson's Name —'Using You Guys To Deceive the People That She Owes'": -0.8,
  "How The Xcel Energy XEL Narrative Is Shifting With Data Center Hopes And Sector Caution": 0.2,
  "Darjeeling Tops Agoda's List of Most Searched Domestic Destinations in North-East for Oct-Dec 2025": 0.6,
  "Bloom Energy (BE) Rockets 12.8% After Bagging New Billion-Dollar Deal": 0.8,
  "Shopify Stock Soared Last Year. Can It Do It Again?": 0.5,
  "Analyst Trims Diamondback Energy (FANG) Price Target by $2, Keeps ‘Buy’ Rating": 0.2,
  "Reflecting On Analog Semiconductors Stocks’ Q3 Earnings: Texas Instruments (NASDAQ:TXN)": 0.2,
  "Disney Dining Return and Gamer Tie-Ins Could Be A Game Changer For Starbucks (SBUX)": 0.2,
  "1 Growth Stock to Stash and 2 We Ignore": 0.2,
  "2 Growth Stocks to Add to Your Roster and 1 We Find Risky": 0.2,
  "1 High-Flying Stock on Our Buy List and 2 We Ignore": 0.2,
  "3 S&P 500 Stocks We Approach with Caution": -0.5,
  "3 Small-Cap Stocks We Approach with Caution": -0.5,
  "1 S&P 500 Stock to Own for Decades and 2 We Ignore": 0.2,
  "3 Profitable Stocks with Questionable Fundamentals": -0.5,
  "2 Unpopular Stocks That Deserve a Second Chance and 1 Facing Headwinds": 0.2,
  "1 Large-Cap Stock to Keep an Eye On and 2 We Turn Down": 0.2,
  "11 S&P 500 Stocks Doubled in 2025. This Is the Best Bet To Do It Again This Year": 0.8,
  "How Recent Analyst Shifts Are Rewriting The Story For ASML Holding (ENXTAM:ASML)": 0.2,
  "HKC Corporation Draws Strong Media Attention at CES 2026": 0.8,
  "Is Texas Instruments (TXN) Pricing Reflect Recent Semiconductor Sentiment Correctly?": 0.1,
  "Jim Cramer Highlights The Change of Management in Kraft Heinz": 0.2,
  "Microsoft Corporation (MSFT) Announces the Acquisition of Osmos": 0.5,
  "Seagate Technology (STX) Has Risen Around 5% Since the Start of 2026": 0.5,
  "Nonfarm Payrolls Set to Grow Moderately in December as Markets Assess Fed Rate Cut Bets": 0.5,
  "Down 28% in 2025 With a 4.5% Yield, Is This High-Yield Dividend Stock Too Cheap to Ignore, and Worth Buying in 2026?": 0.2,
  "Zacks Investment Ideas feature highlights: Adobe and Salesforce": 0.5,
  "The Zacks Analyst Blog Highlights Johnson & Johnson, Caterpillar, Qualcomm, Fossil and Jones Soda": 0.2,
  "r/Stocks Daily Discussion & Fundamentals Friday Jan 09, 2026 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is": 0.2,
  "The \"Amazon of Latin America\" Stock Could Triple Over the Next 10 Years": 0.8,
  "CrowdStrike to enhance AI-era identity security with SGNL acquisition": 0.5,
  "Linde Announces Fourth Quarter 2025 Earnings and Conference Call Schedule": 0.0,
  "Should You Think About Buying CSX Corporation (NASDAQ:CSX) Now?": 0.2,
  "How The Palo Alto Deal Is Rewriting The Story For CyberArk Software (CYBR) Investors": 0.5,
  "UniFirst (UNF) Valuation Check After Q1 Earnings Miss Guidance Reaffirmation And Ongoing Share Buybacks": 0.2,
  "Cognizant Technology's Q4 2025 Earnings: What to Expect": 0.0,
  "Insmed’s ‘ginormous’ lung drug sales; J&J’s US pricing deal": 0.5,
  "High Growth Tech Stocks In The US For January 2026": 0.5,
  "U.S. AI Stocks Edge Up Premarket After Thursday Losses": 0.5,
  "Meta strikes nuclear power agreements with three companies - Source: [https://finance.yahoo.com/news/meta-strikes-nuclear-power-agreements-110314869.html](https://finance.yahoo.com/news/meta-strikes-nuclear-power-agreements-110314869.html) WASHINGTON, Jan 9 (Reuters) - Meta Platforms said on Friday it struck 20-year agreements to buy power from three Vistra nuclear plants in the U.S. heartland and ​develop projects with two companies hoping to build small modular reactors. Shares of Oklo surged nearly 20%, ‌whereas Vistra rose about 8% in premarket trade. Meta and other Big Tech companies want to secure long-term electricity supplies": 0.6,
  "Tech Stocks Lift European Bourses Midday": 0.5,
  "Qualcomm downgraded as handset headwinds grow: Mizuho": -0.5,
  "Insmed Provides Business Update at 44th Annual J.P. Morgan Healthcare Conference": 0.0,
  "’No clear catalyst:’ BMO downgrades Adobe stock": -0.5,
  "Looking At The Cisco Systems (CSCO) Narrative As Networking And AI Redefine The Story": 0.5,
  "CoStar Group price target lowered to $72 from $77 at BMO Capital": -0.2,
  "Meta inks trio of nuclear deals to support AI ambitions": 0.5,
  "Nvidia’s Go-To Chipmaker TSMC Sees Revenue Top Estimates": 0.5,
  "J&J cuts MFN deal with the Trump administration, bolsters US onshoring efforts": 0.6,
  "RADAR Names Former PVH/Lululemon Executive Jonathan Aitken to Lead RFID Center of Excellence": 0.5,
  "The Oncology Institute Announces Leadership Promotions": 0.5,
  "Following a 4.1% decline over last year, recent gains may please Old Dominion Freight Line, Inc. (NASDAQ:ODFL) institutional owners": 0.6,
  "Here Are Friday’s Top Wall Street Analyst Research Calls: Adobe, Airbnb, Altria, CrowdStrike, GE Vernova, Flutter Entertainment, Robinhood, Southwest Airlines, and More": 0.2,
  "Is Honeywell International (HON) Pricing Reflect Long Term Value After Recent Share Price Gains": 0.2,
  "How Transformative Is DoorDash's Partnership for SERV's Growth?": 0.5,
  "What You Need To Know Ahead of QUALCOMM's Earnings Release": 0.2,
  "Prediction: SPDR’s Euro ETF Is Just Heating Up": 0.5,
  "MercadoLibre's Shipping Subsidies Boost GMV: Is Growth Sustainable?": 0.2,
  "Tapasya Fund Sold Airbnb (ABNB) in 2024": 0.0,
  "Marriott International Announces Changes to its Continent Leadership and a Strategic Realignment Across Key Regions": 0.5,
  "Jobs report: US economy adds 50,000 jobs in December to cap worst year of hiring since 2020": 0.1,
  "Higher Capacity HDDs Drive Western Digital's Revenue Growth": 0.5,
  "Verizon Outpaces Its Industry in a Year: How to Play the Stock?": 0.5,
  "CoStar data shows office leasing activity rose 5% in 2025; Boston ranked as top growth market": 0.8,
  "This Blue-Chip Stock Is Betting That Nvidia Can Give It a Pop. Should You Buy Shares Now?": 0.5,
  "Cadence Design Systems, Inc. (CDNS) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Is Trending Stock Axon Enterprise, Inc (AXON) a Buy Now?": 0.2,
  "QUALCOMM Incorporated (QCOM) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Is Trending Stock Datadog, Inc. (DDOG) a Buy Now?": 0.2,
  "PDD Holdings Inc. Sponsored ADR (PDD) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Betting on More Rate Cuts, Boomers Are Buying the 2026 Small Dogs of the Dow": 0.2,
  "Can da Vinci 5 Expand Intuitive Surgical's TAM Beyond Core Surgeries?": 0.2,
  "Why Constellation Energy Rallied Nearly 60% in 2025": 0.5,
  "ADI Climbs 35.7% in a Year: Should You Buy, Sell or Hold the Stock?": 0.5,
  "Missed the AI Rally? Jefferies Says CrowdStrike and These 3 Other Cybersecurity Stocks Could Be Next": 0.5,
  "Is Take-Two (TTWO) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Wall Street Analysts Think MercadoLibre (MELI) Is a Good Investment: Is It?": 0.5,
  "Mizuho names 3 core chip stocks and 2 outperformers for 2026": 0.5,
  "Airbnb upgraded, Zillow downgraded: Wall Street's top analyst calls": 0.2,
  "Prediction: 2 Healthcare Stocks That Will Be Worth More Than Pfizer by the End of 2026": 0.5,
  "Are You a Momentum Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "2 Stocks That Don’t Have Enough AI Priced in": 0.1,
  "TSMC Stock Rises After Bumper Sales. What That Says About a Potential AI Bubble.": 0.5,
  "Supreme Court's Trump Tariffs Ruling May Roil Big Spending Plans": -0.5,
  "Assessing Vertex Pharmaceuticals (VRTX) Valuation After Wolfe Research Upgrade And Growing Pipeline Optimism": 0.6,
  "CEG Stock Is Trading Above 200-Day SMA: Time to Buy, Hold or Sell?": 0.2,
  "Qualcomm Stock Falls After Mizuho Downgrade Flags Apple Risk": -0.5,
  "December Nonfarm Payrolls Miss Estimates; Unemployment Rate Declines": 0.2,
  "2 Top-Ranked AI-Powered Tech Giants to Enhance Your Portfolio Returns": 0.6,
  "Betting Markets Say Supreme Court Will Scrap Trump Tariffs. How to Play It.": 0.2,
  "Reasons Why You Should Hold Verisk Analytics Stock in Your Portfolio": 0.5,
  "1 Dividend King Stock I'd Buy Before Illinois Tool Works in 2026": 0.2,
  "Delta, Southwest, FedEx, Marriott: Top Analyst Calls": 0.0,
  "4 Stocks to Boost Your Portfolio on Steady Jump in Semiconductor Sales": 0.8,
  "J&J Strikes Drug Pricing Deal With Trump, Gets Tariff Reprieve": 0.5,
  "Western Digital Corporation (WDC) Has Risen More Than 9% Since the Start of 2026": 0.6,
  "Benchmark Co Reiterates a Buy Rating on AppLovin Corporation (APP)": 0.6,
  "3 Strong Dividend Growers for Income Without Rate Risk": 0.5,
  "How to Trade the Next Earnings Season? Goldman Says Try Options": 0.5,
  "Celsius Holdings (CELH) Is Up 12.1% After Pepsi Distribution Gains Spotlight Operational Shift": 0.6,
  "Looking At The Narrative For Booking Holdings BKNG As AI Concerns Meet Higher Targets": 0.2,
  "Meta Signs Multi-Gigawatt Nuclear Deals for AI Data Centers": 0.5,
  "European Equities Traded in the US as American Depositary Receipts Rise in Friday Trading": 0.2,
  "Healthcare dealmakers head to San Francisco hoping for megamergers in 2026": 0.5,
  "JPMorgan Stock, This AI Chip Leader Kick Off Earnings Season": 0.5,
  "Can Qualcomm's Snapdragon Ride Flex for Hyundai Work Wonders?": 0.5,
  "Why Constellation Energy Stock Popped Today": 0.5,
  "Why Is Adobe (ADBE) Down 3.3% Since Last Earnings Report?": -0.5,
  "Synopsys (SNPS) Up 7.8% Since Last Earnings Report: Can It Continue?": 0.5,
  "KLA Corporation (KLAC) Shares Skyrocket, What You Need To Know": 0.5,
  "Why Is Lam Research (LRCX) Stock Soaring Today": 0.5,
  "Costco's International Markets Drive the Next Phase of Growth": 0.6,
  "SKIL or APP: Which Is the Better Value Stock Right Now?": 0.2,
  "Walmart’s CEO Doug McMillon out-earns the average American’s salary in less than 20 hours—during a typical 30-minute commute, he’s already made $1,563": -0.8,
  "Adobe's Competitive Moat Looks Less Secure": -0.6,
  "Marriott Bonvoy Forges Global Partnership with International Cricket Council, Offering Members Unparalleled Access to Global Cricket Events": 0.8,
  "Regeneron (REGN) Upgraded to Strong Buy: What Does It Mean for the Stock?": 0.6,
  "CLOV: Keeping Patients Out of Hospital, S&P 500 Path or Competitor Crush? - Bottom Line Up Front: Counterpart AI doesn’t replace doctors, it helps Medical Doctors, Registered Nurses, and pharmacists act earlier so patients stay home and hospitals stay emty. Disclaimer: This post was written with the assistance of ChatGPT for general discussion only and is not medical, financial, or professional advice. \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ How Counterpart AI (Clover AI) is supposed to work. Example patient: 72-year-old": 0.2,
  "Costco (COST) “Should be Repudiated This Quarter,” Says Jim Cramer": -0.6,
  "Jim Cramer Says Insider Buying in Nike Signals “That the Business Is Indeed Turning”": 0.6,
  "Jim Cramer on Starbucks: “I Think This Is the Year It Comes Back”": 0.6,
  "Jim Cramer Says Honeywell Has Been One of the “Hapless Performers”": -0.6,
  "PepsiCo's Stock Valuation Looks Attractive: Buy or Wait for Now?": 0.5,
  "Adobe Stock Falls. Shares ‘Will Remain Range-Bound’ As Competition Heats Up, Analyst Says.": -0.6,
  "Meta Nuclear Deal Sends Vistra and Oklo Stocks Soaring": 0.8,
  "Is Starbucks' Store Portfolio Reset Enhancing Unit Economics?": 0.2,
  "Intel Rises After Trump Meeting as Markets Await Jobs Data": 0.5,
  "Copart: The Economics Behind a Quietly Dominant Marketplace": 0.5,
  "New Year Starts With Fewer U.S. Oil and Gas Rigs": -0.5,
  "Mizuho Picks Nvidia, Broadcom, Lumentum as Top AI Chip Stocks for 2026": 0.8,
  "IDEXX Laboratories to Release 2025 Fourth Quarter and Full Year Financial Results": 0.0,
  "Why Analysts Are Rethinking The Story Behind Qualcomm (QCOM) After New AI And Android Developments": 0.5,
  "Autodesk (ADSK) Valuation Check After Recent Share Price Weakness": 0.2,
  "3 Stocks That Benefit if Companies Cut Costs in 2026": 0.2,
  "Qualcomm Stock Falls After Downgrade. The Apple Supplier Has an iPhone Problem.": -0.6,
  "Chip Stocks Rise in Afternoon Trading": 0.5,
  "Nvidia and 13 More Tech Stocks to Buy on the Dip": 0.6,
  "Kayak CEO Tried to Take the Company Private: Scoop": -0.5,
  "Why Costco's gold bars are 'positive' for the precious metal ecosystem": 0.6,
  "Does Vertex Pharmaceuticals (VRTX) Share Price Reflect Its Long Term Growth Potential?": 0.2,
  "How Cantor Fitzgerald’s Rating Shift Reshapes the Airbnb (ABNB) Investment Narrative": 0.2,
  "Diversification - I'm an Egyptian in Egypt (so non resident for uncle sam). Currently, I have all my money in VOO and cash in IBKR (around 60k USD in total), I'm moving it to either SPYL or VUAA I also want to diversify, I'm worried about how heavy nvidia is, about USA current geopolitical actions, also I don't really like how heavy financial sector is in all ETFs. this is what I'm thinking I ***MIGHT***": 0.1,
  "Demand For Google, Palantir Is Mere Peanuts Next To These 3 Stocks": 0.2,
  "Meta Sends These Nuclear Stocks Higher After Inking New Round Of Data Center Deals": 0.6,
  "Is It Too Late To Consider Shopify (SHOP) After Strong 56% One Year Rally?": 0.2,
  "CES 2026 was dominated by these 3 tech themes": 0.2,
  "Si2’s OpenAccess Coalition Announces 2026 Board of Directors": 0.2,
  "Tech, Media & Telecom Roundup: Market Talk": 0.0,
  "Does ASML even have a bear case - ASML is arguably one of the most important companies in the world, with little to no competition, producing the machines required to produce the chips for companies such TSMC, Apple, etc. The main bear case a few years ago could’ve been reaching a wall after the development of their High-NA EUV manufacturing technique, but they are actively in development of Hyper-NA which is supposed to be able": 0.8,
  "Is It Too Late To Consider KLA (KLAC) After Its Strong Multi Year Share Price Run": 0.2,
  "How Recent Deals And Analyst Revisions Are Rewriting The Comcast CMCSA Investment Story": 0.5,
  "IBD Stock Of The Day: Pet-Health Firm Idexx Laboratories Looks To Build On 2025 Rally": 0.6,
  "2 Key Costco Sales Metrics Just Accelerated, and Investors Love It. Time to Buy Shares?": 0.8,
  "Costco (COST) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "Synopsys (SNPS) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Vertex Pharmaceuticals (VRTX) Stock Dips While Market Gains: Key Facts": -0.5,
  "Cadence Design Systems (CDNS) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Ross Stores (ROST) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Why a $13 Million MercadoLibre Exit Means for Investors After a 25% Run": 0.2,
  "S&P 500 notches record high close driven by Broadcom, other chipmakers": 0.8,
  "Will AEP’s (AEP) US$1.20 Billion MISO Transmission Win Reshape Its Long-Term Grid Investment Narrative?": 0.2,
  "NXP Semiconductors (NXPI) Rises Higher Than Market: Key Facts": 0.5,
  "3 Growth Stocks to Invest $1,000 in Right Now": 0.5,
  "OKLO just received 'official validation' from Meta. Are we witnessing the rise of the next energy tech giant? - Meta Platforms announced a major deal to support Oklo and TerraPower, providing power for their AI data centers. We’re talking about a 1.2 GW nuclear park in Ohio. OKLO gapped up at the open, rising nearly 15% to 20% pre-market, though it pulled back during the session. As someone who successfully locked in profits pre-market today,": 0.8,
  "Palantir Billionaire Peter Thiel Bought 2 Stocks Warren Buffett and Bill Gates Sold. Who's Right?": 0.2,
  "Assessing Analog Devices (ADI) Valuation After AI-Fueled Semiconductor Rally And CES Optimism": 0.5,
  "Lumos CEO to retire": 0.0,
  "How Broadcom’s AI‑Ready Wi‑Fi 8 Launch And $6.75 Billion Debt Raise At Broadcom (AVGO) Has Changed Its Investment Story": 0.2,
  "Bessent says US Treasury can easily cover any tariff refunds": 0.6,
  "Walmart Inc. to Join the Nasdaq-100 Index® Beginning January 20th, 2026": 0.5,
  "Basin rig count down three as prices rise": 0.5,
  "Assessing Baker Hughes (BKR) Valuation After Recent Pullback And 12‑Month 17.98% Total Return": 0.5,
  "From SpaceX to Anthropic, 2026 Looks Like a Big Year for IPOs": 0.8,
  "Thoughts on MU, AMD, ALL, INCY, and B? - I lean towards value investing, and prefer to hold stocks for at least 3 years, but not necessarily. MU - Fantastic revenue, margins, and growth. First in class HBM dominance and NAND. I know its trading near 52 week highs, but I think forward PEG of 0.20x compared to sector median of 1.66x makes it compelling, even as I am trying to diversify away from AI": 0.8,
  "Walmart To Join Nasdaq 100 on Jan. 20 as AstraZeneca Exits": 0.2,
  "Is It Too Late To Reassess MercadoLibre (MELI) After Its Strong Recent Share Price Run": 0.2,
  "Is It Time To Reassess Amgen (AMGN) After Its 28% One Year Share Price Gain?": 0.2,
  "How The Vertex Pharmaceuticals (VRTX) Story Is Shifting With New Analyst Targets And CF Outlook": 0.2,
  "Is It Too Late To Consider AppLovin (APP) After Its 103% One-Year Surge?": 0.2,
  "Is It Too Late To Consider Analog Devices (ADI) After A 44% One Year Rally?": 0.2,
  "Online Casinos That Accept PayPal 2026: High 5 Casino's PayPal Casino Solutions": 0.5,
  "Coeur Mining $CDE calls and DD - Hey guys, I posted about my SOFI calls earlier this week, and they printed. This morning I bought $CDE 1/23 $22 calls, and will be buying some longer-term calls next week. CDE made explosive moves today, crushing resistance. I can easily see this hitting $23 within the next couple of weeks, especially if silver holds strong. Here is a DD on the company: Coeur Mining (CDE) closed the": 0.6,
  "Is Autodesk (ADSK) Pricing Look Attractive After Recent Share Price Weakness?": 0.2,
  "Crypto DATs are literally legal ponzi machine (BMNR / SBET / MSTR) - Don't get me wrong, I'm not against any digital asset treasuries (DATs), it just amazed me that this is a thing in stock market and it's legal. (Disclosure: I even have some position in some DATs) The first time I heard about MSTR was a few years ago, I looked into the NAV and find it puzzling why are people paying 2\\~3": -0.6,
  "Could Investing $10,000 in ASML Make You a Millionaire?": 0.5,
  "Is It Too Late To Consider Take Two Interactive (TTWO) After 40% One Year Rally?": 0.1,
  "Axon Enterprise (AXON) Valuation Check After Northcoast Buy Upgrade And Ongoing Revenue Momentum": 0.5,
  "Is Honeywell (HON) Quietly Redefining Its Industrial Mix With LNG Moves Beside Aerospace Strength?": 0.5,
  "Marvell (MRVL) Gets Strong Buy as Raymond James Backs XConn Acquisition": 0.8,
  "Analysts Say Adobe’s (ADBE) AI Tools Are Popular, but Competition Is Intensifying": 0.2,
  "Is Coca-Cola Europacific Partners PLC's (AMS:CCEP) 18% ROE Better Than Average?": 0.2,
  "Benchmark Names AppLovin (APP) a 2026 Top Idea, Reiterates Buy": 0.6,
  "Assessing Honeywell International (HON) Valuation After New LNG Partnership And Mixed Analyst Views": 0.2,
  "Investing.com’s stocks of the week": 0.0,
  "Does Monolithic Power Systems (NASDAQ:MPWR) Deserve A Spot On Your Watchlist?": 0.2,
  "Is It Time To Reassess Verisk Analytics (VRSK) After Mixed Returns And DCF Upside Indication": 0.1,
  "Is It Too Late To Consider Buying IDEXX Laboratories (IDXX) After A 71% One Year Rally": 0.2,
  "Gen Z is rebelling against the economy with ‘disillusionomics,’ tackling near 6-figure debt by turning life into a giant list of income streams": 0.5,
  "Cintas-UniFirst Proposed Merger Update: Uniform Bright Launches Independent Expert Review of Antitrust Review Considerations": 0.1,
  "MarketBeat Week in Review – 01/05 - 01/09": 0.0,
  "The past year for Roper Technologies (NASDAQ:ROP) investors has not been profitable": -0.6,
  "How The Narrative Around CoStar Group (CSGP) Is Shifting After Guidance Reset And Buybacks": 0.5,
  "AppLovin (APP) to Benefit from Sustainable Margins & User Acquisition Trends": 0.5,
  "Upcoming Q4 Results Could Trigger a Rally in T-Mobile US (TMUS)": 0.5,
  "DC judge delivers smackdown to Airbnb squatter after ruling she has no tenancy. Homeowner rights finally defended?": 0.6,
  "Google, Shopify Lead Big 2025 Winners Near New Buy Points": 0.5,
  "Did GTA VI Jitters and Short-Interest Shifts Just Reframe Take-Two Interactive's (TTWO) Risk Narrative?": 0.2,
  "The new food pyramid and brands like Starbucks and Chipotle want us to eat more protein. We’re already getting plenty.": -0.5,
  "Micron (MU) Price Target Raised on Tight Memory Supply Through 2026": 0.6,
  "NVIDIA’s Next Leg Higher May Have Started at CES": 0.6,
  "The Best Trillion-Dollar Stock to Buy for 2026, According to Wall Street": 0.5,
  "Fastenal's (NASDAQ:FAST) three-year earnings growth trails the decent shareholder returns": -0.5,
  "Under The Bonnet, Ross Stores' (NASDAQ:ROST) Returns Look Impressive": 0.8,
  "Synopsys (SNPS) Valuation Check After CES 2026 AI Automotive Announcements": 0.2,
  "Gilead price target raised to $154 from $144 at BofA": 0.5,
  "JPMorgan ups Ross Stores target, adds to Analyst Focus List": 0.6,
  "AI is no ‘business killer’: Why Wall Street is buying software stocks in 2026": 0.6,
  "A Look At American Electric Power (AEP) Valuation After Its Expanded Bloom Energy Fuel Cell Rollout": 0.5,
  "Why Bloom Energy (BE) Is Up 35.8% After Landing a 900 MW AI Power Fuel‑Cell Deal": 0.8,
  "The Saturday Spread: Reading the Market’s Signals to Jump Ahead of the Crowd (HPE, SNOW, CRWD)": 0.5,
  "5 Energy Stocks That Could Double in 2026": 0.5,
  "Costco quietly added a major credit card perk": 0.5,
  "Micron Technology Stock Can Do No Wrong Right Now | MU Stock": 0.6,
  "PayPal Is The Most Hated Stock We Track Today": -0.8,
  "This Tiny ETF Is One Of The Best Ways To Bet On AI Stocks Right Now": 0.8,
  "Palantir Billionaire Peter Thiel Dumped Nvidia and Bought This Other Magnificent Stock Instead -- Even as Warren Buffett Was Selling It Before Retiring": 0.5,
  "r/Stocks Weekly Thread on Meme Stocks Saturday - Jan 10, 2026 - The meme stock scheduled posts will now run weekly and post Saturday afternoon and won't be a sticky; you're probably seeing this because automod sent you here! [Full list of meme stocks here.](https://www.reddit.com/r/stocks/wiki/meme-stocks) This will be updated every once in a while. ------ Welcome traders who just can't help them selves discuss the same exact stock that's been discussed 100s of times a": 0.1,
  "Amazon quietly fixes problems 49% of customers hate": 0.5,
  "T-Mobile makes bold phone plan change after customer losses": 0.5,
  "3 Top Artificial Intelligence Stocks to Buy in January": 0.5,
  "President Trump’s Stock Bets Have Crushed the Market. Should You Buy Them Now?": 0.5,
  "Paychex–PayPal Early Pay Partnership Might Change The Case For Investing In Paychex (PAYX)": 0.5,
  "Baltimore Daughter Says Squatters Took Over Her Sick Dad's Home, Ripped Out The Toilet, Set It On Fire, Got It Condemned — And Now They're Back Again": -0.8,
  "4 restaurant chains shuttering hundreds of locations in 2026": -0.8,
  "Jim Cramer on Palo Alto: “I Think It Is a Buy”": 0.6,
  "Jim Cramer Discusses CrowdStrike After Jensen Huang’s Endorsement": 0.5,
  "Jim Cramer on Procter & Gamble: “It Has the Opportunity to Shake Things Up”": 0.6,
  "Berenberg Bank Remains Bullish on AstraZeneca PLC (AZN) – Here’s Why": 0.8,
  "More Bonds Are Teetering on the Brink of Junk: Credit Weekly": -0.5,
  "Is It Too Late To Consider ASML Holding (NasdaqGS:ASML) After Its Strong Share Price Run?": 0.2,
  "Cathie Wood Invest Dumps Over $10 Million Of Palantir Stock Amid Talk Of 'Cramer Curse' — Buys This Hot AI Stock Instead": -0.5,
  "Assessing Copart (CPRT) Valuation As Competition Rises And Growth Concerns Drive Investor Exits": -0.5,
  "Assessing Marvell Technology (MRVL) Valuation After Recent Share Price Weakness": 0.2,
  "Philip Erdoes, Entrepreneur and Venture Capitalist, Dies at 62": -0.5,
  "Alaska Air Group: The Glue is Coming Unstuck - Disclosure: I am short ALK via put options. This is not investment advice. # Why Loyalty Programmes Matter Airlines only fly planes to get to those air mile profits. It's ungodly. Alaska Airlines proudly boasted their loyalty programme is worth $12BN when their market cap was $7BN. These cash machines are also the stabilisers that volatile airlines need. ALK has $2BN of debt secured against theirs.": -0.6,
  "How T-Mobile’s New “Better Value” Plan and Funding Moves Will Impact T-Mobile US (TMUS) Investors": 0.2,
  "Is Synopsys (SNPS) Quietly Redefining Its Moat With Automotive Virtual Prototyping Partnerships?": 0.5,
  "The Bull Case For Insmed (INSM) Could Change Following Bold 2025 Revenue Guidance Hike - Learn Why": 0.5,
  "Is It Too Late To Consider Microchip Technology (MCHP) After A 40% One-Year Rally?": 0.1,
  "Is Adobe (ADBE) Pricing Look Attractive After A 17.7% One Year Share Price Decline": 0.2,
  "Cathie Wood’s ARK Takes a New Stake in Broadcom—and Sold Another Hot Stock": 0.2,
  "The \"Safest\" Trillion-Dollar Artificial Intelligence (AI) Stock to Invest $50,000 In Right Now": 0.5,
  "GOOGL vs AMZN: Best pick for a 5-7 year horizon? - Hi everyone, I’m currently looking to strengthen my portfolio with a long-term position (5 to 7 years) and I’m torn between Google (GOOGL) and Amazon (AMZN). I already have a solid foundation in my portfolio (about 88- 90% in VEQT ETF), and I want to use my remaining weight to pick one of these two tech giants. I’m an investor who values stability but": 0.2,
  "Trump Says Federal Intel Stake Has Made 'Tens Of Billions': Stock Climbs": 0.5,
  "Is It Time To Revisit Copart (CPRT) After Its 28% One Year Share Price Decline?": 0.1,
  "Is It Too Late To Reassess Insmed (INSM) After Its Huge Share Price Surge?": -0.5,
  "How Recent AI And Business Shifts Are Rewriting The Story For Arm Holdings (ARM)": 0.2,
  "Is Broadcom Stock a Buy for 2026?": 0.2,
  "Deutsche Bank Maintains a Buy Rating on EchoStar Corporation (SATS)": 0.6,
  "Job market in relation to the stock market and economy - Okay, so I graduated with a comp sci degree about a year ago and have not gotten a job. My sister is a data analyst who makes about $120k. Her whole team is getting fired (yahoo) and she has been saying how much trouble she's having in trying to get a senior data analyst job. She is super into her career and even hires": -0.5,
  "UBS Maintains a Buy Rating on Micron Technology, Inc. (MU)": 0.6,
  "Why AppLovin Stock Jumped 108% in 2025": 0.5,
  "Is Paychex (PAYX) Pricing Reflect Its Mixed Recent Returns And Cash Flow Outlook?": 0.1,
  "Prediction: These 2 Unstoppable Stocks Will Join Nvidia, Alphabet, Apple, and Microsoft in the $3 Trillion Club by 2027": 0.8,
  "Is MSTR Trading Like a Bargain RN... $60B BTC for $45-48B Market Cap? - As of the latest update (Jan 5, 2026), Strategy holds 673,783 BTC. With Bitcoin sitting around $90,600 today, that's roughly $61 BILLION in Bitcoin treasury value alone (closed Jan 9 at $157.33/share, market cap around $45.5B on most trackers). the math: We're getting $61B worth of Bitcoin for a $45-48B valuation. That's a 20-25%+ discount to fair NAV, something that almost": 0.8,
  "Why Wall Street Thinks Palantir Stock Will Stall in 2026 but That This AI Stock Will Soar 40%": 0.5,
  "Is ADP’s (ADP) 51-Year Dividend Streak Still Justified by Its Evolving Labor-Market Insights?": 0.1,
  "5 big analyst AI moves: ASML top semis pick for 2026, Adobe downgraded": 0.2,
  "AI Is Causing a Memory Shortage. Why Producers Aren’t Rushing to Make a Lot More.": -0.3,
  "2 AI Stocks That Could Help Make You a Fortune": 0.5,
  "The Best Stocks to Invest $50,000 in Right Now": 0.5,
  "What Analysts Think Gives Datadog (DDOG) An Edge As The Story Starts To Shift": 0.5,
  "Is It Too Late To Consider Marriott International (MAR) After A 22% One-Year Rally?": 0.2,
  "Monster Beverage (NASDAQ:MNST) Knows How To Allocate Capital": 0.6,
  "A Look At Marriott International (MAR) Valuation After Strong Recent Share Price Momentum": 0.5,
  "These Were the S&P 500's Top Performers in 2025. Are They Still Good Buys in 2026?": 0.2,
  "Netflix is it a buy or hold? - I’ve just started buying NFLX bit by bit by the sudden decrease in stock price. I’m just curious to why is the stock keep on going down even though it is buying WB? Also, it seems like NFLX has the monopoly now for movies, series and even anime. Thank you.": 0.2,
  "How do you feel about AEVA? - Title, they recently got a deal with NVDA that nearly double their stock in a week. According to some its greatly undervalued and to others it's high risk due to cash burning among other things. I feel like NVDA just pulled this company off the ground assuming they don't mess it up. I just haven't seen anyone talk about it or maybe I haven't looked hard enough. Thoughts?": 0.2,
  "Keurig Dr Pepper (NASDAQ:KDP) shareholders have endured a 15% loss from investing in the stock three years ago": -0.6,
  "Top AI stock picks: Is it Nvidia or bust?": 0.2,
  "Will Marriott’s New Regional Leadership Structure Subtly Reframe Its Asset-Light Strategy Narrative for MAR?": 0.2,
  "Reassessing Versant Media Group (VSNT) After 26.2% Pullback And DCF Valuation Gap": 0.2,
  "Is Alnylam Pharmaceuticals, Inc.'s (NASDAQ:ALNY) 19% ROE Better Than Average?": 0.2,
  "Workday, Inc.'s (NASDAQ:WDAY) Fundamentals Look Pretty Strong: Could The Market Be Wrong About The Stock?": 0.6,
  "Investors Shouldn't Overlook O'Reilly Automotive's (NASDAQ:ORLY) Impressive Returns On Capital": 0.8,
  "KLA Corporation - Sticky MOAT Is The Best Type": 0.6,
  "Assessing ASML Holding (NasdaqGS:ASML) Valuation After Its Strong Recent Share Price Momentum": 0.5,
  "5 AI Stocks That Could Replicate NVIDIA’s Decade of Dominance": 0.5,
  "Why are Q4 2025 estimates so low for $NFLX? - I saw that the EPS is estimated to be 0.545. This is a significant decrease from the past 2 quarters, which were around 0.7 EPS. Q3 they missed earnings because of the Brazil tax, and EPS was still close to 0.7… So, what’s the deal? Thank you!": -0.5,
  "Google unveils new agentic commerce protocol for retailers": 0.5,
  "Honeywell Unveils AI-Enabled Technology to Personalize In-store Shopping with Google Cloud": 0.6,
  "Peter Thiel’s Incredible Advice for Anyone Looking to Grow Their Retirement Portfolio": 0.8,
  "Shopify Stock Rallied on AI Shopping. Now It’s Doubling Down With Gemini and Copilot.": 0.5,
  "Micron makes massive move as supercycle ramps": 0.8,
  "This ETF Is Proof That the Healthcare Rebound Is Real": 0.6,
  "Is Gilead Sciences (GILD) Pricing Reflecting Recent 38.5% One Year Share Return?": 0.2,
  "3 Absurdly Cheap Stocks That Could Double in 2026": 0.8,
  "5 Companies Racing to Dethrone Tesla—And the One Already Winning": 0.5,
  "A 2025 security breach exposed over 184 million private passwords. How to stay safe while you browse": -0.7,
  "Over 47% of Costco members use this genius savings hack": 0.6,
  "3 AI Stocks Poised for Explosive Growth as Enterprise Spending Accelerates in 2026": 0.8,
  "Dutch Bros: Could This Fast-Growing Coffee Chain Be a Long-Term Winner?​": 0.5,
  "Susquehanna Lowers PT on PayPal Holdings (PYPL) Stock": -0.5,
  "Piper Sandler Raises PT on Fortinet (FTNT) Stock": 0.5,
  "Israeli cyber startup Torq raises $140 million at $1.2 billion valuation": 0.8,
  "How Elon Musk Turned $2,000 at 17 Into One of the World's Biggest Fortunes": 0.8,
  "'Look Out Palantir Shorts'—Did Cramer Curse Just Hit The Stock?": -0.5,
  "Should You Forget Nvidia and Buy These 2 Artificial Intelligence (AI) Stocks Right Now?": 0.5,
  "Thesis on Petco(WOOF) - My two cents on Petco. Petco’s equity is priced for bankruptcy, while its cash flow, liquidity, and credit markets price it as a surviving, self-funding business, creating massive upside if operations merely stabilize. The company is trading at \\~5.5x EBITDA and a \\~11-13% FCF yield on normalized numbers. The balance sheet, while levered, is structured with a long runway (2028) and flexible covenants. The operational pivot under Joel Anderson is already": 0.8,
  "Artificial Intelligence (AI) Is Driving a New Wave of Infrastructure Spending. This Stock Is Key.": 0.5,
  "Mondelez (MDLZ) Target Lowered at TD Cowen as 2026 Staples Outlook Turns Cautious": -0.5,
  "Vertex Provides Pipeline and Business Updates in Advance of Upcoming Investor Meetings": 0.5,
  "Alnylam Launches \"Alnylam 2030\" Strategy to Drive Next Era of Growth and Patient Impact": 0.6,
  "PepsiCo (PEP) Partners with Siemens and NVIDIA to Modernize Plants Using Digital Twins": 0.6,
  "Costco (COST) Added to Mizuho Top Picks After Pullback": 0.5,
  "Tempus Achieves Record Total Contract Value Exceeding $1.1 Billion": 0.8,
  "(Item 8.01) Other Events. ATM Update On January 12, 2026, Strategy Inc (\"Strategy\") announced an update with respect to sales made under its at-the-market offering program (\"ATM\") of the following securities: During Period January 5, 2026 to January 11, 2026 As of January 11, 2026 Security Shares Sold (1) Notional Value (in millions) (2) Net Proceeds (in millions) (3) Available for Issuance and Sale (in millions) STRF Stock - $ - $ - $ 1,619.3 10.00% Series": 0.1,
  "(ITEM 1.01) ENTRY INTO A MATERIAL DEFINITIVE AGREEMENT. On January 9, 2026, Intuit Inc., a Delaware corporation (the “Company”), entered into a Credit Agreement (the “Credit Agreement”) with the lenders parties thereto (collectively, the “Lenders”), JPMorgan Chase Bank, N.A., as administrative agent (“Agent”). The Credit Agreement replaces the Company’s credit agreement dated as of February 5, 2024. The Credit Agreement is available in addition to the Company’s commercial paper program, which the Company may increase during certain\n\n(Item 1.01) of this Current Report on Form 8-K is incorporated by reference into this": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On January 11, 2026, Alnylam Pharmaceuticals, Inc. (the “Company”) announced its new five-year strategy, “ Alnylam 2030, ” as well as its preliminary fourth quarter and full year 2025 global net product revenues of approximately $995 million and $2,987 million, respectively, for AMVUTTRA® (vutrisiran), ONPATTRO® (patisiran), GIVLAARI® (givosiran) and OXLUMO® (lumasiran), and provided the Company’s 2026 product and pipeline goals. The Company also announced full year 2026 combined\n\n(Item 2.02) and Exhibit 99.1 attached hereto is intended to be furnished and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as expressly set forth by specific reference in such\n\n(Item 2.02) shall be deemed to be furnished, and not filed: 99.1 Press Release dated January 11, 2026 . 104 Cover Page Interactive Data File (embedded within the Inline XBRL document).": 0.5,
  "(Item 2.02) . Results of Operations and Financial Condition. Diamondback Energy, Inc. (“Diamondback”) presents in this\n\n(Item 2.02) certain information for the quarter ended December 31, 2025 regarding its realized prices, derivative activity and weighted average basic and diluted shares outstanding. Realized Prices Fourth quarter 2025 average unhedged realized prices were $58.00 per barrel of oil, $0.03 per Mcf of natural gas and $13.51 per barrel of natural gas liquids (“NGLs”). Fourth quarter 2025 average realized hedged prices were $57.07 per barrel of oil, $1.03 per Mcf of natural gas and $13.51 per": 0.1,
  "(Item 8.01) . Other Events. On January 12, 2026, T-Mobile USA, Inc. (“ T-Mobile USA ”), a direct, wholly-owned subsidiary of T-Mobile US, Inc. (the “ Company ”), closed an underwritten public offering of $1.15 billion in aggregate principal amount of its 5.000% Senior Notes due 2036 (the “ 2036 Notes ”) and $850 million in aggregate principal amount of its 5.850% Senior Notes due 2056 (the “ 2056 Notes ” and, together with the 2036 Notes,": 0.1,
  "(ITEM 2.02) . RESULTS OF OPERATIONS AND FINANCIAL CONDITION. In connection with remarks to be made at the J.P. Morgan 44th Annual Healthcare Conference on Monday, January 12, 2026, beginning at 10:30 a.m. (Eastern Time), DexCom, Inc. (“Dexcom”) President and Chief Executive Officer, Jake Leach, will report preliminary, unaudited financial results for the fourth quarter of 2025 and fiscal year 2025, initial financial outlook for fiscal year 2026, and certain other information. The fourth quarter and fiscal\n\n(Item 2.02) , including Exhibits 99.1 and 99.2 hereto, is furnished shall not be deemed to be “filed” for purposes of Section 18 of the Securities Exchange Act of 1934 (the “Exchange Act”) or otherwise subject to the liabilities of that section. The information contained herein and in the accompanying exhibit is not incorporated by reference in any filing of Dexcom under the Securities Act of 1933 or the Exchange Act, whether made before or after the": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On January 12, 2026, at the 44th Annual J.P. Morgan Healthcare Conference, Leonard S. Schleifer, M.D., Ph.D., Board Co-Chair, President and Chief Executive Officer of Regeneron Pharmaceuticals, Inc. (“ Regeneron ” or the “ Company ”), and George D. Yancopoulos, M.D., Ph.D., Board Co-Chair, President and Chief Scientific Officer of Regeneron, are providing a corporate update. The presentation contains certain preliminary (unaudited) financial information for the fourth quarter\n\n(Item 2.02) . Q4 2025 IPR&D Charge . The Company currently expects that its financial results calculated in accordance with U.S. generally accepted accounting principles (“ GAAP ”) and its non-GAAP financial results for the fourth quarter 2025 will include an acquired in-process research and development (“ IPR&D ”) charge of approximately $19 million on a pre-tax basis. This acquired IPR&D charge is expected to negatively impact each of GAAP and non-GAAP net income per diluted share\n\n(Item 2.02) of this Current Report on Form 8-K is incorporated by reference herein. A copy of the presentation referenced in\n\n(Item 2.02) is furnished as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated by reference in this\n\n(Item 2.02) and the information included or incorporated in": 0.1,
  "Thoughts on OZEM ETF long term potential versus individual GLP-1 pharmaceutical stocks? - I’m looking into exposure to the GLP-1 / weight-loss drug sector and came across the OZEM ETF. I already hold major tech (NVDA) and want some healthcare diversification, but I’m debating between: • Buying OZEM for broad exposure • Or picking individual stocks like LLY / NVO For those who’ve researched this space: – Does OZEM provide meaningful diversification? – Are the": 0.2,
  "Is PepsiCo (PEP) Offering Long-Term Value After Recent Share Price Weakness?": 0.2,
  "A big Wall Street flip just changed the Regeneron narrative": 0.5,
  "Agoda Data Shows Vietnam Rising as a Favorite End-of-Year Destination for Families Across Asia and Beyond": 0.6,
  "Apple CEO Tim Cook Could Buy 92,984 iPhone 17s With His 2025 Compensation": 0.2,
  "Q3 Advertising Software Earnings Review: First Prize Goes to AppLovin (NASDAQ:APP)": 0.6,
  "Q3 Rundown: Lam Research (NASDAQ:LRCX) Vs Other Semiconductor Manufacturing Stocks": 0.0,
  "3 Reasons SBUX is Risky and 1 Stock to Buy Instead": -0.5,
  "Airbnb (ABNB): 3 Reasons We Love This Stock": 0.6,
  "Deploying $130k now - seeking thoughts on 3 scenarios - I've got $130k to deploy. The companies I'd like to hold are all pretty AI stack related (with some exceptions), and they're all basically at all time highs. Is a basket of basically Mag7 stocks - with some data center and defense additions - a solid portfolio for next 5-10 years or is concentration risk too much? (also got another 100-120k coming to deploy in": 0.2,
  "The Bull Case For Gilead Sciences (GILD) Could Change Following New OncoNano Drug-Delivery Collaboration": 0.5,
  "Agoda Launches AI-Powered Booking Bot to Help Travelers Book with Confidence": 0.6,
  "1 Cash-Producing Stock to Keep an Eye On and 2 We Turn Down": 0.2,
  "2 Growth Stocks with All-Star Potential and 1 We Question": 0.5,
  "3 Consumer Stocks We Keep Off Our Radar": -0.5,
  "2 Momentum  Stocks with Exciting Potential and 1 That Underwhelm": 0.5,
  "3 Services Stocks We Think Twice About": -0.5,
  "1 S&P 500 Stock on Our Buy List and 2 Facing Challenges": 0.2,
  "3 Market-Beating Stocks for Long-Term Investors": 0.0,
  "3 Large-Cap Stocks Worth Investigating": 0.0,
  "3 Large-Cap Stocks That Fall Short": -0.5,
  "2 Mooning  Stocks to Consider Right Now and 1 We Ignore": 0.2,
  "The $5 Trillion Question: Can Humanoid Robots Handle Jobs as Well as People?": 0.2,
  "Here’s What to Expect From PayPal Holdings’ Next Earnings Report": 0.5,
  "Nvidia and Palantir Stocks: Wall Street Says to Buy 1 and Avoid the Other for 2026": 0.5,
  "Besi tops market view for preliminary Q4 orders, shares jump": 0.8,
  "“Micron (MU) Will Put Up Plants,” Says Jim Cramer": 0.5,
  "Lam Research (LRCX) Needs to “Put Up Plants,” Says Jim Cramer": 0.2,
  "Advanced Micro Devices (AMD)’s Got Great Performing AI Chips, Says Jim Cramer": 0.8,
  "Prediction Markets Face a New Test This Earnings Season": 0.2,
  "Best Stock to Buy Right Now: Costco vs. Home Depot": 0.5,
  "Co-Packaged Optics Market Report 2026-2036: NVIDIA vs. Broadcom Ecosystem Strategies, CPO Platforms, and Foundry Roadmaps": 0.5,
  "Jefferies Cautious on Adobe (ADBE) As It Updates Outlook on Software Sector": -0.5,
  "Scotiabank Reduces PT on AT&T (T) to $29.50, Reiterates ‘Sector Perform’ Rating": 0.2,
  "Freedom Finance Raises PT on PDD Holdings (PDD) to $170, Reiterates ‘Buy’ Rating": 0.8,
  "Analysts Positive on PepsiCo (PEP) Amid Multi-Year, Industry-First Collaboration with NVIDIA and Siemens": 0.8,
  "UBS and Citi Go Bullish on Gilead Sciences (GILD)": 0.8,
  "China and EU agree on steps to resolve EV imports dispute": 0.5,
  "Bond Traders’ Big Bet for 2026 Vindicated by Soft US Job Growth": 0.5,
  "Trending tickers: Walmart, Alibaba, Novo Nordisk, BE Semiconductor and British Land": 0.0,
  "Marriott appoints new executives as leadership shuffle continues": 0.2,
  "US Stock Market Today Stock Futures Fall As Jobs Cool And Rates Stay Firm": -0.5,
  "Latest News In Electric Vehicles - Curbside Charging Bollards Revolutionize Urban Transport Infrastructure": 0.8,
  "What to Expect From Lam Research’s Q2 2025 Earnings Report": 0.2,
  "5 takeaways from Xcel CEO Bob Frenzel’s talk at the Minneapolis Fed": 0.2,
  "KBR Awarded FEED for Coastal Bend LNG Project": 0.5,
  "Institutional investors control 80% of Palo Alto Networks, Inc. (NASDAQ:PANW) and were rewarded last week after stock increased 3.8%": 0.6,
  "Are Strong Financial Prospects The Force That Is Driving The Momentum In Cadence Design Systems, Inc.'s NASDAQ:CDNS) Stock?": 0.5,
  "Seagate 32TB Capacities Now Shipping to Channel and Retail Partners Globally": 0.5,
  "The Top \"Magnificent Seven\" Stocks to Buy in 2026, According to Wall Street": 0.5,
  "AbbVie buys into PD-1/VEGF sweepstakes; Alnylam and Vertex set expectations": 0.2,
  "If You'd Invested $100 in Micron Stock 10 Years Ago, Here's How Much You'd Have Today": 0.5,
  "Trump Flags Netflix--Warner Bros. Deal as Antitrust Risk": -0.5,
  "Where Will Costco Be in 5 Years?": 0.0,
  "AI Chips Today - Kyro Revolutionizes Robotics With Physical AI Breakthrough": 0.8,
  "3 Stocks Estimated To Be Undervalued By Up To 36.9%": 0.5,
  "High Growth US Tech Stocks To Watch In January 2026": 0.5,
  "Standard AI acquires Pathr.ai to strengthen in-store spatial analytics": 0.5,
  "AI Demand Is Tightening Memory Supply. What It Means for Nvidia, Intel, and AMD": 0.1,
  "BrainCo Files Confidentially for Hong Kong IPO, Targeting Several Hundred Million Dollars": 0.5,
  "The One Person Standing Between the Trump and the Fed": 0.1,
  "Loop Capital Remains Bullish on Synopsys Inc. (SNPS) on AI and EDA Tailwinds": 0.8,
  "Analysts Applaud CrowdStrike Holdings’ (CRWD) SGNL Deal, Reiterate Buy Ratings": 0.8,
  "Activist investor Ancora carves out niche in transportation sector": 0.5,
  "Trump Administration Takes Stake in Critical Mineral Firm ATALCO": 0.2,
  "Diamondback Energy's (NASDAQ:FANG) investors will be pleased with their stellar 207% return over the last five years": 0.8,
  "NXP Semiconductors Insiders Sell US$4.0m Of Stock, Possibly Signalling Caution": -0.5,
  "Tesla (NASDAQ: TSLA) Bull, Base and Bear Price Prediction and Forecast": 0.0,
  "What You Need to Know Ahead of Honeywell International's Earnings Release": 0.1,
  "Intel Rally Builds Momentum After 18A Chip Launch and Policy Support": 0.8,
  "How Google, Shopify Partnership Could Spur Agentic Commerce Boom": 0.5,
  "Dexcom Reports Preliminary, Unaudited Results for the Fourth Quarter and Fiscal Year 2025 and Initial 2026 Outlook": 0.2,
  "My 5 Favorite Stocks to Buy Right Now": 0.5,
  "Latest News In Digital Payment - Euronet Expands Through Strategic CrediaBank Partnership": 0.5,
  "Intel (INTC) Soars 10.8%: Is Further Upside Left in the Stock?": 0.6,
  "Tempus AI Stock Rallies 105% in a Year: Should Investors Still Hold?": 0.5,
  "This Artificial Intelligence (AI) Stock Quietly Outperformed Nvidia in 2025. It Can Continue Soaring in 2026.": 0.8,
  "What Makes AppLovin (APP) an AI Winner?": 0.5,
  "Bristlemoon Global Fund’s Thesis on ASML (ASML) is Paying Off": 0.8,
  "Insiders At Western Digital Sold US$6.8m In Stock, Alluding To Potential Weakness": -0.7,
  "Institutional investors have a lot riding on Applied Materials, Inc. (NASDAQ:AMAT) with 82% ownership": 0.5,
  "What Makes Adobe (ADBE) an Attractive Opportunity?": 0.5,
  "Here Are Monday’s Top Wall Street Analyst Research Calls: Airbnb, Akamai, Applied Materials, CoreWeave, CrowdStrike, Datadog, NetFlix, Snowflake, and More": 0.5,
  "What to Expect From Xcel Energy's Q4 2025 Earnings Report": 0.2,
  "Global Digital Surgery Technologies Market Set for US$ 6,477.91 Million Surge by 2033 | Astute Analytica": 0.5,
  "5 Once-Sleepy Dividend Utility Companies Are Striking Massive Deals With Big Tech": 0.5,
  "EVs for All America Releases New Report Showing Republican Resistance to EVs Easing Amid Job and China Concerns": 0.2,
  "MACOM Appoints Bryan Ingram to its Board of Directors": 0.5,
  "Here’s Why Shopify (SHOP) Rose in Q4": 0.5,
  "Top Electric & Autonomous Driving Stocks to Invest in Now": 0.5,
  "What's Next for Seagate Stock After a 241.8% Stellar Run in a Year?": 0.6,
  "TE Connectivity plc (TEL) Benefitted from Secular Trends in Its Automotive and Industrial Sectors": 0.5,
  "Doximity (DOCS) Slid on Renewed Volatility": -0.5,
  "Solid Results Lifted TJX Companies (TJX) in Q4": 0.8,
  "ODFL Stock Down 4.2% Y/Y: Will the Plunge Continue Throughout 2026?": -0.6,
  "Quantum Computing Stocks: 'Winner-Take-All Scenario' Possible, Says JPMorgan": 0.5,
  "Buy Struggling Netflix Stock, Says Analyst. Why Warner Takeover Fears Are Overblown.": 0.5,
  "Upgrades: Analysts are Still Bullish on Nvidia (NVDA), Crowdstrike (CRWD) and Oracle (ORCL) Upside": 0.8,
  "Estore Factory Uncovers Key Online Selling Trends Every Global E-commerce Seller Must Know": 0.5,
  "Here’s Why e.l.f. Beauty (ELF) Declined in Q4": -0.5,
  "Does XPO (XPO) Have an Idiosyncratic Growth Potential?": 0.2,
  "Palona AI Appoints Alison Templin as Vice President of Sales to Accelerate Enterprise Growth": 0.6,
  "Ampersand Unveils TrueStream Political: The Modern, Premium Streaming Solution for Deterministic Voter Reach": 0.5,
  "PayPal Holdings, Inc. (PYPL) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Amgen Inc. (AMGN) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Palo Alto Networks, Inc. (PANW) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Investors Heavily Search CrowdStrike (CRWD): Here is What You Need to Know": 0.5,
  "Constellation Energy Corporation (CEG) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Linde (NASDAQ:LIN) Is Doing The Right Things To Multiply Its Share Price": 0.8,
  "2 Tech Stocks That Beat the Mag Seven By a Mile in 2025—Can They Repeat?": 0.5,
  "On Holding AG (ONON) Soared Following Growth in International Markets": 0.8,
  "Here’s What Lifted Vertex Pharmaceuticals (VRTX) in Q4": 0.2,
  "PARAMOUNT PROVIDES UPDATE TO WARNER BROS. DISCOVERY SHAREHOLDERS ON ACTIONS IT IS TAKING TO ADVANCE  ITS SUPERIOR $30 PER SHARE ALL-CASH OFFER": 0.5,
  "Here’s What Lifted Freeport McMoRan (FCX)": 0.2,
  "Jeff Bezos tells Gen Z entrepreneurs to gain work experience before launching new companies: ‘I started Amazon when I was 30’": 0.5,
  "Nvidia Stock Could Drop 50% and Still Be Worth More Than Meta": -0.7,
  "Volkswagen-Qualcomm Deal Strengthens SDV and Autonomous Push": 0.6,
  "Citi Upgrades Palantir Stock To Buy On Bullish 2026 Views": 0.8,
  "Here’s Why Fundsmith Equity Fund Reestablished Its Stake in Intuit (INTU)": 0.2,
  "Company News for Jan 12, 2026": 0.0,
  "Constellation Energy Corporation (CEG) Soars 6.2%: Is Further Upside Left in the Stock?": 0.6,
  "Data Center Momentum Accelerates Seagate's Revenue Growth": 0.8,
  "1 Reason Amazon Stock Could Outperform in 2026": 0.6,
  "Array Technologies and TAT Technologies have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Here's What to Expect From Microchip Technology's Next Earnings Report": 0.2,
  "Automatic Data Processing (ADP) Fell Due to Weakness in the US Job Market": -0.6,
  "Monolithic Power Systems' Q4 2025 Earnings: What to Expect": 0.0,
  "Why This 1 Medical Stock Could Be a Great Addition to Your Portfolio": 0.8,
  "Paramount Skydance steps up hostile bid for Warner Bros Discovery with law suit": -0.6,
  "Why the nickel may vanish just like the penny": -0.5,
  "INSM Stock Jumps on 2025 Preliminary Sales, 2026 Goals Announced": 0.8,
  "Could This New Partnership Help DoorDash Stave Off Concerns About Affordability?": 0.2,
  "Paramount Files Suit for Info Related to Warner Bros. Acquisition Bid": -0.2,
  "How Home Depot, Wayfair executives are preparing for an agentic AI future": 0.2,
  "Lands' End ICR Conference: TikTok Shop surge, Amazon wins, Delta uniform relaunch and margin gains": 0.5,
  "Earnings Preview: What to Expect From Fortinet's Report": 0.5,
  "Netflix initiated, Palantir upgraded: Wall Street's top analyst calls": 0.5,
  "Netflix gets HSBC Buy rating as analyst highlights ’sturdy’ earnings outlook": 0.6,
  "CRWD to Acquire SGNL: Is Identity Security the Next Growth Pillar?": 0.5,
  "Palantir Stock Climbs on Citi Upgrade. Sees AI Supercycle in 2026": 0.6,
  "Birches Health Appoints Cigna-Evernorth Veteran Andrew DiGiacomo as SVP of Strategy": 0.5,
  "BDO Canada and Intuit QuickBooks Partner to Redefine How BDO Serves Small and Mid-sized Businesses with New Integrated Service": 0.6,
  "Ignite Next Welcomes Synopsys to its Scale-up Program for Deep Tech Innovation": 0.5,
  "CrowdStrike and Nord Security Announce Strategic Partnership to Redefine SMB Cybersecurity": 0.8,
  "Paramount's next target in hostile takeover bid of Warner Bros. is a board of its own making": -0.6,
  "Mizuho Hikes Micron (MU) PT to $390 on Strong 2026 AI Memory Outlook": 0.8,
  "META: Cathie Wood Dumps $12.7 Million in Meta Stock": -0.5,
  "Strategy acquires $1.2 billion in bitcoin, increases treasury to 687,410 BTC": 0.8,
  "Palantir Upgraded to Buy at Citi on Anticipated Government and Commercial 'Supercycle'": 0.8,
  "Why Paramount Is Suing Warner Bros.": 0.0,
  "The Zacks Analyst Blog Highlights NVIDIA, Micron Technology, Credo Technology and Amtech Systems": 0.5,
  "Global $7 Billion Connected Car Security Market Outlook, 2032: Major Players Expand Portfolios": 0.5,
  "D&H Distributing Unveils Major Expansion of Cybersecurity Portfolio with Strategic U.S. Fortinet Partnership": 0.8,
  "The Zacks Analyst Blog Highlights NVIDIA, Alphabet, Amazon.com and CBL & Associates Properties": 0.5,
  "1 Artificial Intelligence (AI) Stock to Buy Before It Doubles and Joins Tesla and Meta Platforms in the $1 Trillion Club, According to Multiple Wall Street Analysts": 0.8,
  "BC-Most Active Stocks": 0.0,
  "5 U.S. chip stocks to buy in 2026: Bernstein": 0.5,
  "Allegiant Travel to Buy Sun Country in $1.5B Deal, Offering 19.8% Premium and $140M Synergies": 0.6,
  "Strategy Spends $1.2 Billion on Bitcoin, Its Biggest BTC Buy Since July": 0.5,
  "Is This Artificial Intelligence (AI) Stock Finally Entering Its Breakout Phase?": 0.5,
  "Paramount launches WBD proxy battle, Meta appoints new president": 0.2,
  "Google's market cap hits $4 trillion, cementing its status as an AI trade champion": 0.8,
  "Strategy Buys 13,627 Bitcoin for $1.25B, Total Holdings Now Top 687,000 BTC": 0.8,
  "This memory stock rose 240% last year. Analyst sees 60% upside in 2026": 0.8,
  "Alphabet briefly surpassed $4T on news of Apple AI partnership": 0.5,
  "SPECTRUM OPENS APPLICATIONS FOR SIXTH CLASS OF SPECTRUM SCHOLARS": 0.5,
  "Samsung looks to make AI unobtrusive as part 'ambient AI' push": 0.5,
  "From Training AI to Designing Chips: Nvidia's Next Platform Play": 0.5,
  "Paramount sues Warner Bros, launches proxy war to scupper Netflix deal": -0.7,
  "If You'd Invested $100 in Palantir Stock 1 Year Ago, Here's How Much You'd Have Today": 0.5,
  "Why Bitmine Immersion Technologies Stock Rocketed 248% Higher In 2025": 0.6,
  "AI Memory Shortage Reshapes 2026 Outlook for Chipmakers": -0.5,
  "Top Stocks From the Staffing Services Industry to Buy Now": 0.5,
  "PayPal's Agentic Commerce Expansion: Will it Boost Top-Line Growth?": 0.5,
  "The Best Dividend Stocks to Buy and Hold Forever": 0.5,
  "HSTM vs. SHOP: Which Stock Is the Better Value Option?": 0.0,
  "DG or ROST: Which Is the Better Value Stock Right Now?": 0.2,
  "Wells Fargo Maintains Outperform on Microsoft (MSFT) Despite Lowered Target": 0.5,
  "Netflix vs. Disney: Which Streaming Giant Has an Edge Right Now?": 0.5,
  "PepsiCo's PFNA Struggles: Can Permissible Snacks Revive Volumes?": 0.2,
  "Datadog's Core Growth Backed by Digital Transformation, Cloud Migration Projects, Morgan Stanley Says": 0.6,
  "Tom Lee's BitMine Buys $76 Million in Ethereum as Analysts Predict ETH Outperforming Bitcoin": 0.8,
  "As Netflix Drops 33%, Is NFLX Stock Buy Ahead of Q4 Earnings?": 0.2,
  "3 U.S. software stocks to buy, 2 to avoid: Goldman Sachs": 0.2,
  "Billionaire Michael Saylor’s Strategy Scoops 13,627 Bitcoin for $1.25B": 0.8,
  "Analyst lowers MicroStrategy stock price target by 40%": -0.7,
  "TSMC’s Revenue Outlook ‘May Disappoint,’ Says Analyst. There’s a Silver Lining.": 0.2,
  "Top Midday Stories: DOJ Opens Criminal Probe Into Fed Chair Powell; Trump Calls for 10% Credit-Card Rate Cap, Bank Shares Tumble": -0.5,
  "Jefferies Sees Amazon (AMZN) Well-Positioned for AI Inference and Production Workloads": 0.8,
  "AI Bond Sales Could Hit $300 Billion a Year, Bank of America Says": 0.6,
  "Samsung’s profit blueprint resets Micron stock bets": 0.2,
  "Nvidia Push Into NAND Fuels Global Memory Crunch": -0.5,
  "Paramount files lawsuit against Warner Bros. amidst controversial Netflix merger": -0.7,
  "Google’s Sergey Brin admits he’s hiring ‘tons’ of workers without degrees: ‘They just figure things out on their own in some weird corner’": 0.5,
  "Will AAPL Stock Rally Again in 2026 to Help Apple Regain the Throne as the Biggest Company?": 0.5,
  "What DoorDash (DASH)'s Family Dollar Delivery Expansion Means For Shareholders": 0.5,
  "Will AppLovin (APP) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Will Vertex (VRTX) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Paramount sues Warner Bros in attempt to revive hostile takeover": -0.7,
  "Google parent Alphabet hits $4tn valuation after AI deal with Apple": 0.8,
  "Some Credit Card Issuers' Revenue May Halve Due to Trump's Rate Cap Proposal, RBC Says": -0.6,
  "$DTREF - anyone else is loading? - Hey everyone, I’ve been digging into Dateline Resources lately, and man, I’m seriously bullish on this one. Ticker is DTR on the ASX, or DTREF over the counter. It’s a gold and rare earths play out in California, right next to that big MP Materials operation, which gives it some real strategic edge in the US market. Their recent drilling at the Colosseum project has been killer, hitting": 0.8,
  "3 Stocks Estimated To Be Trading At A Discount In January 2026": 0.2,
  "Broadcom Inc. (AVGO) Launches new Wi-Fi Products at CES 2026": 0.5,
  "Netflix’s (NFLX) Deal with Warner Bros Remains on Track": 0.5,
  "Advanced Micro Devices (AMD) Launches a New Family of x86 Chips": 0.5,
  "Here’s What the Wall Street Thinks About Marvell Technology (MRVL)": 0.2,
  "Arm Holdings (ARM) Expands in the Robotics Industry With Physical AI Unit": 0.5,
  "Jim Cramer Says International Business Machines “Is Still Very Inexpensive”": 0.8,
  "Jim Cramer on Paychex: “People Didn’t Like the Last Quarter, I Thought It Was Okay”": 0.2,
  "Jim Cramer Calls Ralph Lauren a “Terrifically Well-Run” Company": 0.8,
  "Jim Cramer Says Dollar Stores Like Dollar General Are “Wall Street Faves”": 0.6,
  "How Much Monthly Income Does a $2 Million Portfolio Produce at Age 60?": 0.0,
  "Amazon Stock And Meta Lagged In 2025. Here's Why They Are This Analyst's Top 2026 Picks.": 0.5,
  "Tempus AI's Pharma Momentum Accelerates": 0.8,
  "Paramount Launches Warner Bros. Proxy Fight, Files Suit": -0.5,
  "TSMC rises on reported US–Taiwan deal, Nvidia & Eli Lilly team up": 0.5,
  "Microsoft Stock Can Rise 37%, Goldman Says. It Has Lots of Ways to Gain From AI.": 0.8,
  "Paramount Plans Proxy Fight to Push Hostile Warner Bid": -0.8,
  "Palantir Stock Upgraded to Buy.  Its Shares Have ‘Broken’ All the Rules.": 0.6,
  "Is Walmart a Tech Stock? Its Planned Move to the Nasdaq 100 Is a Vote for 'Yes'": 0.5,
  "$GOOG Just Hit $4 Trillion... 4th Company ever to cross that! - The milestone was reached in early trading on Jan. 12 as GOOGL stock rose $1.93 to trade at $333.50 per share. That gave Alphabet an official market capitalization of just over $4 trillion. However, trading in GOOGL stock was choppy along with the rest of the market, with all the major U.S. indices in the red to start the week. The stock of": 0.6,
  "Qualcomm (QCOM) Stock Trades Down, Here Is Why": -0.5,
  "Paramount Skydance sues Warner Bros for details on Netflix deal": -0.5,
  "Meta Hires Former Trump Adviser Dina Powell McCormick as President": 0.1,
  "Tempus Shares Jump After Strong Preliminary 2025 Results": 0.8,
  "Strategy (MSTR) Stock in 2026: Crypto Kick-Start or Another Gut Punch?": -0.6,
  "Meta names former Trump adviser Dina Powell McCormick as president and vice chairman - Facebook owner Meta has named Dina Powell McCormick, a former Trump administration adviser and longtime finance executive, as president and vice chairman of the tech giant. Powell McCormick previously served on Meta's board of directors - where, the company notes, she was “deeply engaged” in accelerating its artificial intelligence push across platforms. In her new management role, Meta says Powell McCormick": 0.5,
  "Sizing Up Whether The Global Select Equity ETF Is A Buy Right Now": 0.2,
  "ComEd Offering $515,000 in Grants to Support Community Programs Across Northern Illinois": 0.8,
  "Comcast Assets Are ‘Significantly Undervalued.’ Buy the Stock, Analyst Says.": 0.6,
  "Paramount fires back at Warner Bros. bid, launching proxy fight for board seats at annual meeting": -0.6,
  "Apple calls on Google to help smarten up Siri and bring other AI features to the iPhone": 0.5,
  "Paramount sues in hostile bid to buy Warner Bros Discover": -0.6,
  "Trump turning US into ‘banana republic’ with criminal probe against Fed chief": -0.8,
  "Should You Buy VST Stock in January 2026 as Vistra Strikes a Major Nuclear Deal with Meta Platforms?": 0.5,
  "Up 38% From Its Lows in November, is it Too Late to Buy Shares of This Rebounding Stock?": 0.2,
  "As Trump Says He Is ‘Proud’ of Intel, Should You Buy INTC Stock?": 0.5,
  "Mark Zuckerberg announces new 'Meta Compute' initiative for its data center and AI projects": 0.5,
  "Why Did Oklo Stock Drop Today?": -0.5,
  "Equities Rise Intraday Amid Probe Into Fed Chair Powell": 0.2,
  "Meta Platforms Just Gave Oklo a Nuclear Boost. Should You Buy OKLO Stock Here?": 0.5,
  "Alnylam Pharmaceuticals Unveils “Alnylam 2030” as Amvuttra Drives Breakout Growth at JPMorgan Conf.": 0.5,
  "Meta Needs So Much Capital It Hired Its Own Banker": -0.5,
  "Allegiant to absorb Sun Country’s Amazon cargo business": 0.2,
  "Adimab Reports Strong Partnering Year for 2025": 0.8,
  "Why This Medical Device Company Is the Top Stock in the S&P 500 Today": 0.6,
  "Palantir Rallied 100%+ in 2025 - This AI Defense Stock Could Be Next": 0.8,
  "Meta Creates High-Powered Team to Oversee AI Infrastructure Buildout": 0.6,
  "How Steve Cahillane’s Arrival and Planned Breakup At Kraft Heinz (KHC) Has Changed Its Investment Story": 0.2,
  "Meta unveils 'Meta Compute' initiative to build AI infrastructure": 0.5,
  "Apple and Google Strike AI Deal. It’s Just One Way Apple Can Spur Smartphone Growth.": 0.6,
  "The 3 Best Quantum Computing Stocks to Buy for 2026": 0.5,
  "Apple teams up with Google Gemini for AI-powered Siri": 0.5,
  "Prediction: Nvidia Will Be Worth $7 Trillion by the End of 2026": 0.5,
  "Big Oil and More Surprising AI Winners for 2026": 0.2,
  "Meta Names Former Trump Appointee Its President as It Continues Big AI Spending": 0.1,
  "2 Stocks That Will Benefit From Trump’s Call to Cap Credit-Card Interest Rates": 0.5,
  "T-Mobile, Samsung Collaborate to Deliver Immersive In-Store Customer Experiences": 0.6,
  "Apple Poised for First-Quarter Beat Amid Robust iPhone Sales, BofA Says": 0.8,
  "Sector Update: Consumer Stocks Rise Late Afternoon": 0.5,
  "These Experts Like a Pair of Stocks With AI-Driven Shopping a 'Major 2026 Theme'": 0.6,
  "Sector Update: Tech Stocks Gain Late Afternoon": 0.5,
  "Gap, Fortinet, and More Stocks That Usually Outperform After Earnings": 0.5,
  "JPMorgan to Kick Off Earnings. Credit Cards Are In Focus.": 0.2,
  "PagerDuty Appoints Chris Ferro as Chief Legal Officer": 0.5,
  "Zscaler Appoints Dr. Swamy Kocherlakota as Executive Vice President of Agentic AI Security Engineering": 0.5,
  "Why This S&P 500 Nuclear Giant Continues To Advance After Meta Deal": 0.5,
  "Sector Update: Energy Stocks Decline Late Afternoon": -0.5,
  "Alphabet Closes Above $4 Trillion Market Cap for the First Time": 0.8,
  "Top Stock Reports for Microsoft, Eli Lilly & Lam Research": 0.0,
  "US Equity Markets Up Amid Rise in Precious Metals": 0.5,
  "Meta plans to cut around 10% of employees in Reality Labs division, NYT reports": -0.7,
  "JPM Preannouncements: Why Alnylam And Sarepta Lost, But Day One Won": 0.2,
  "Apple Confirms Use Of Google Gemini For AI Upgrades": 0.5,
  "Apple & Google: A New AI Superteam?": 0.5,
  "Intel Stock Gets a Higher Price Target. Why Wall Street Doesn’t Trust the Gains.": -0.5,
  "How Tesla Stock Could Become a ‘DREAM’ Come True": 0.8,
  "Nvidia Stock Closes Flat. The Chip Maker Is Launching an AI Lab with Eli Lilly.": 0.5,
  "Thermo Fisher Scientific Announces Strategic Collaboration With NVIDIA Leveraging AI to Advance Scientific Instrumentation and Accelerate Laboratory Performance": 0.8,
  "Marriott International Announces Release Date For Fourth Quarter 2025 Earnings": 0.0,
  "Can We Retire at 62 With $690K In A Roth IRA, $1,800 In Social Security, And No Mortgage — But $500 A Month In Out-of-Pocket Medical Costs?": -0.2,
  "Nvidia Partners With Biotech Firms On AI Drug Discovery": 0.8,
  "Sell Rivian Stock. It Needs More AI, Analyst Says.": -0.6,
  "Walmart Stock Is Rising. It’s Not Just a Google AI Deal Giving It a Boost.": 0.5,
  "Western Digital to Announce Second Quarter Fiscal Year 2026 Financial Results on January 29, 2026": 0.0,
  "S&P 500, Dow Clinch New Peaks as Traders Shrug Off Fed Independence Concerns": 0.6,
  "Mark Zuckerberg says Meta is launching its own AI infrastructure initiative": 0.5,
  "Google's corporate parent joins $4 trillion club as investors continue to bet on AI breakthroughs": 0.8,
  "MicroStrategy’s Near-Term Outlook Depends on This Bitcoin Price Level": 0.1,
  "Paramount files lawsuit in pursuit of Warner Bros. Discovery and threatens proxy fight": -0.7,
  "Exascale Labs Inc. to Combine with D. Boral ARC Acquisition I Corp. to Become Publicly Listed Company": 0.5,
  "Is Intuitive Surgical (ISRG) Still Priced Fairly After Its Strong Multi‑Year Share Price Run?": 0.1,
  "A Look At DoorDash (DASH) Valuation After New Family Dollar Partnership Expansion": 0.5,
  "Acer Takes Legal Action Against AT&T, Verizon, and T-Mobile Over Patents": -0.5,
  "More money, fewer winners: Inside venture capital’s uneven comeback": -0.5,
  "These Stocks Are Today’s Movers: Capital One, Amex, Citigroup, JPMorgan, Walmart, Moderna, Affirm, and More": 0.5,
  "Elon Musk says saving for retirement is irrelevant because AI is going to create a world of abundance: ‘It won’t matter’": 0.5,
  "Jamf names David Helfer as Chief Revenue Officer": 0.5,
  "Stock Market Today: Dow, S&P 500 Close At Highs; Alphabet Hits $4 Trillion Mark (Live Coverage)": 0.8,
  "Why Google's co-founders and Peter Thiel are exiting California": -0.5,
  "Stock Market Today, Jan. 12: Walmart Jumps on Nasdaq 100 Inclusion": 0.6,
  "Broadcom: A high-conviction dividend stock I'd own in 2026": 0.8,
  "Alphabet Becomes Newest $4 Trillion Company, Joining Nvidia": 0.5,
  "Stock Market Today, Jan. 12: Iren Jumps on Bernstein Naming It Top AI Pick After Microsoft Contract Win": 0.6,
  "Intel (INTC) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Shopify (SHOP) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "AppLovin (APP) Rises Higher Than Market: Key Facts": 0.5,
  "Broadcom Inc. (AVGO) Rises Higher Than Market: Key Facts": 0.5,
  "Advanced Micro Devices (AMD) Outperforms Broader Market: What You Need to Know": 0.6,
  "Meta Platforms (META) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Forget LLMs: Buy these 3 AI \"Pick and Shovel\" Plays Instead": 0.2,
  "Intuitive Surgical, Inc. (ISRG) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Intuit (INTU) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "PepsiCo (PEP) Outperforms Broader Market: What You Need to Know": 0.5,
  "MercadoLibre (MELI) Stock Sinks As Market Gains: Here's Why": -0.5,
  "Comcast (CMCSA) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Apple Investors Are Still Waiting for an AI Siri. A New Deal With Google Could Help It Deliver": 0.5,
  "The Ultimate Growth Stock to Buy With $1,000 Right Now": 0.5,
  "Gilead Sciences (GILD) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "KLA (KLAC) Exceeds Market Returns: Some Facts to Consider": 0.2,
  "Stock Market Today, Jan. 12: Markets Dip on DOJ Powell Probe, Rebound With Alphabet": 0.2,
  "GM Vs Ford: Which Automaker is the Better Investment for 2026?": 0.2,
  "Paramount Sues Warner Bros., Plans Proxy Fight. The Ellisons Aren’t Giving Up.": -0.5,
  "Heard on the Street Recap: Central Bank Shot": 0.0,
  "What I learned from Tracking My Investment Calls in 2025 - As a long time investor, I realized this year that I often had tens if not hundreds of strong calls or at least \"hunches\" throughout a year. I also realized that I tended to only strongly remember the biggest winners and the occasional loser that I would tend to \"rationalize\" away. So this year, I decided to record and publish every \"buy\" in my": 0.2,
  "Dow Jones Futures: Nvidia, Tesla, Walmart Are Key Movers; CPI Inflation Report Next": 0.2,
  "Alnylam Pharmaceuticals CEO on Development Goals, Profitability": 0.5,
  "Did Toast’s New AI-Powered Retail Upgrades Just Shift Toast's (TOST) Investment Narrative?": 0.2,
  "Why Serve Robotics (SERV) Is Up 13.1% After NVIDIA CEO Jensen Huang’s “Physical AI” Endorsement": 0.6,
  "Strategy Director Purchases Common Stock in First Insider Buy Since 2022": 0.6,
  "Trump Touts New Microsoft Data-Center Pledges After Local Backlash": 0.2,
  "VOO to SPYM? - SPYM has a lower expense ration and it's trading volume is lower despite having identical holdings. Ive held some shares in VOO but given its cost, I haven't been able to hold much. What do you think about SPYM? Should I switch to that or sell VOO or VOO reigns supreme for long term investment?": 0.2,
  "SK Hynix to invest nearly $13 billion in chip packaging plant in South Korea": 0.8,
  "Why I’m pivoting to TechBio $RXRX while everyone is distracted by the Powell investigation and $4600 Gold. - Everyone is worried that the Powell investigation will pose an unprecedented challenge to the Fed's independence, and that a credibility crisis could trigger a systemic downgrade in the United States assets , I wanna say, trading stocks from a macro perspective is no different from throwing darts to pick stocks. This shit didn’t prevent $GOOG from breaking": 0.2,
  "Amgen Calls 2026 a “Springboard Year” as CEO Flags Major Data, MariTide Phase 3 Push at JPM Event": 0.5,
  "How BofA’s Upgrade and New Tech Initiatives Will Impact Comcast (CMCSA) Investors": 0.2,
  "Investors Are Panicking, But Is This Stock Actually a Screaming Buy?": 0.5,
  "T-Mobile makes harsh change customers will see on their bills": -0.6,
  "Why Alibaba Stock Soared Today": 0.5,
  "Behind the Unraveling of Apple’s Credit-Card Partnership With Goldman Sachs": -0.5,
  "Ford's 4.2% dividend yield masks a hidden risk": -0.6,
  "SK Hynix to Build $13 Billion AI Memory Chip Packaging Plant": 0.5,
  "Nvidia says no upfront payment needed for its H200 chips": 0.2,
  "5 Unstoppable Stocks to Buy With $5,000 for 2026": 0.5,
  "How Investors May Respond To Cisco (CSCO) Supreme Court Appeal On Alleged Human Rights Abuses": 0.1,
  "Aurigo Accelerates Growth Strategy with Appointment of Veteran HR Executive Divya Kiran": 0.5,
  "How Investors Are Reacting To Charter Communications (CHTR) $3 Billion High-Coupon Bond Issuance": 0.2,
  "Meta makes major bet on AI secret weapon": 0.6,
  "Want to Invest in AI Stocks in 2026? Here's Why This Popular Tech ETF Might Not Be a Good Choice": -0.6,
  "The UK areas tipped for strongest house price growth": 0.5,
  "It's Official: Apple and Alphabet Are Teaming Up for an AI-Powered Siri. Why This Is a Win for Both Companies.": 0.8,
  "Not Playing Long Ruined My College Hopes - I burned my graduation money for college and my career. I started trading October of 2023, probably the best time to get in the market before our huge rally’s. I was 18, and had the typical “i can beat the market” mindset. My friend helped me get into it, he only had about a year of experience but was a much safer investor. We both started with": -0.6
}