{
  "BMO Stays Outperform on Adobe (ADBE) Despite Competitive AI Pressures": 0.5,
  "Cantor Sees Long-Term Upside for Palo Alto Networks (PANW) on AI-Era Security": 0.6,
  "Timeshares Have Made a Comeback. Can Their Stocks?": 0.2,
  "BTIG Sees Expanding TAM and Margin Upside for Autodesk (ADSK)": 0.6,
  "AZN, Daiichi's Enhertu Gets FDA Nod for First-Line Breast Cancer (Revised)": 0.5,
  "Should Solstice’s Shift Into Mid and Small‑Cap Indexes Reshape the Core Investment Case for SOLS?": 0.2,
  "Retail Stocks Could Get a Tax Refund Boost in 2026": 0.6,
  "Is Monster Beverage’s 2025 Surge Justified After Strong Cash Flows and New Product Launches?": 0.5,
  "What to Expect From CSX’s Q4 2025 Earnings Report": 0.2,
  "Intuitive Surgical Earnings Preview: What to Expect": 0.2,
  "How Investors Are Reacting To Monster Beverage (MNST) Upbeat Sales Sentiment And Coca-Cola Expansion Partnership": 0.6,
  "DoorDash (DASH) Valuation Check After New OpenAI-Powered Grocery Ordering Launch": 0.2,
  "US Stock Market Today: S&P 500 Futures Flat amid Slowing Growth, High-Rate Jitters": -0.5,
  "Palo Alto Networks, Inc. (NASDAQ:PANW) Shares Could Be 23% Below Their Intrinsic Value Estimate": -0.7,
  "Texas Instruments (NASDAQ:TXN) Might Be Having Difficulty Using Its Capital Effectively": -0.6,
  "AstraZeneca (LSE:AZN): Rethinking Valuation After a Strong Share Price Climb": 0.5,
  "S&P Futures Muted With U.S. GDP Data in Focus": 0.0,
  "TransUnion Appoints Sayan Chakraborty and Charlotte Yarkoni to its Board of Directors": 0.5,
  "CrowdStrike Looks Unstoppable—But Has the Market Priced It In?": 0.2,
  "Monster Beverage (MNST) Valuation Check as Coca-Cola Partnership and Strong Western Sales Lift Optimism": 0.8,
  "Global AI Chips Market Analysis Report 2025-2035 Featuring Profiles of Key Players - Amazon, Gyrfalcon Technology, Huawei Technologies, Intel, Nvidia, NXP Semiconductors, Wave Computing and More": 0.5,
  "AI-Driven Cybersecurity Boom Makes These 4 Stocks Worth Buying": 0.6,
  "PYPL, DJT, MU And More: 5 Stocks Investors Couldn't Stop Buzzing About This Week": 0.5,
  "Qolab Concludes 2025 with Key Strategic Collaborations to Advance Quantum Hardware": 0.6,
  "Constellation Announces Extension of Expiration for Private Exchange Offers and Consent Solicitations and Early Tender Results": 0.2,
  "Shareholders in Comcast (NASDAQ:CMCSA) are in the red if they invested five years ago": -0.6,
  "With 78% institutional ownership, Honeywell International Inc. (NASDAQ:HON) is a favorite amongst the big guns": 0.6,
  "Is Cisco Still Attractively Priced After Its Strong Multi Year Share Price Rally": 0.5,
  "Parnassus Core Equity Fund Sold Intuit (INTU) After Share Price Appreciation": 0.2,
  "Holiday Sales Boom: 4 Retail Stocks Ready for 2026 Gains": 0.8,
  "ADP National Employment Report Preliminary Estimate December 6, 2025": 0.0,
  "The 3 Fastest-Growing Stocks Heading Into 2026": 0.5,
  "WWD Stock Appreciates 85% in 12 Months: What's Triggering the Uptrend?": 0.8,
  "O’Reilly Automotive’s (ORLY) Professional Segment Lifted the Stock in Q3": 0.5,
  "Is Trending Stock Intuitive Surgical, Inc. (ISRG) a Buy Now?": 0.2,
  "Investors Heavily Search Zscaler, Inc. (ZS): Here is What You Need to Know": 0.5,
  "Vertex Pharmaceuticals Incorporated (VRTX) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Is Most-Watched Stock Applied Materials, Inc. (AMAT) Worth Betting on Now?": 0.2,
  "Should You Be Adding Roper Technologies (NASDAQ:ROP) To Your Watchlist Today?": 0.5,
  "NXP Semiconductors' (NASDAQ:NXPI) investors will be pleased with their favorable 54% return over the last three years": 0.8,
  "Lam Research (LRCX) Is Up 7.4% After AI-Driven Equipment Demand Lifts Margins And Outlook Narrative": 0.8,
  "Can MercadoLibre's GMV Momentum Drive Further Upside in the Stock?": 0.2,
  "Is It Worth Investing in Intuit (INTU) Based on Wall Street's Bullish Views?": 0.5,
  "Naughty Ventures Acquires Claims Adjacent to Q2 Metals Cisco Lithium Discovery in Quebec": 0.5,
  "4 Memorable Ways to Play the HBM Market Boom": 0.5,
  "Here’s Why Qualivian Investment Partners Decided to Sell Copart (CPRT)": 0.1,
  "Zacks.com featured highlights include NVIDIA, Micron Technology and Seagate Technology": 0.2,
  "Why Cognizant (CTSH) is a Top Momentum Stock for the Long-Term": 0.6,
  "Zacks Industry Outlook Highlights Exxon Mobil, Halliburton, Baker Hughes and Oceaneering International": 0.5,
  "3 Cybersecurity Stocks to Protect the Digital World in 2026": 0.5,
  "Marriott (MAR) Valuation Check After Recent 3-Month Share Price Rally": 0.5,
  "Novo Nordisk vs. Amgen: Which Healthcare Stock Is the Smarter Choice?": 0.2,
  "The Zacks Analyst Blog Highlights Cardinal Health, Medtronic, Intuitive Surgical and Edwards Lifesciences": 0.5,
  "SHOP's Merchant Solutions Revenue Growth Picks Up: More Upside Ahead?": 0.6,
  "GILD Exercises Option to License Assembly Bio's Herpes Programs": 0.5,
  "ABBV vs. AZN: Which Pharma Stock is the Better Investment Now?": 0.5,
  "Can AI Data Center Partnership With Fortinet Lift Arista's Shares?": 0.2,
  "Jim Cramer Notes “Paychex Tends to Sell off on Earnings”": 0.1,
  "Is Palo Alto Networks Stock a Buy, Sell, or Hold Following Its Major Multibillion-Dollar Google Deal?": 0.2,
  "What should Fed do after hot Q3 GDP data? Wall Street weighs in": 0.2,
  "CTSH or ACN: Which Is the Better Value Stock Right Now?": 0.2,
  "Shopify (SHOP) Q2 2025 Earnings Call Transcript": 0.2,
  "Shopify (SHOP) Q3 2024 Earnings Call Transcript": 0.2,
  "What Makes Seagate (STX) a Strong Momentum Stock: Buy Now?": 0.6,
  "Have $500? 3 Absurdly Cheap Stocks Long-Term Investors Should Buy Right Now": 0.5,
  "How FDA Clearance Expanding da Vinci SP into General Surgery Will Impact Intuitive Surgical (ISRG) Investors": 0.2,
  "Why Dutch Bros is a top stock pick for 2026, while Starbucks lags": 0.5,
  "High Growth Tech Stocks To Watch In US December 2025": 0.5,
  "Seagate (STX) Falls 4.56% on Profit-Taking": -0.5,
  "Visa vs. PayPal: Which Fintech Stock Has More Upside Today?": 0.5,
  "Dan Ives says this tech stock is under the most pressure in AI era": -0.5,
  "These Consumer Stocks Are Rejuvenated. They Have to Prove the Market Right in 2026.": 0.5,
  "Dow Jones Tech Giant Apple, AppLovin, Palantir, Tesla In Buy Zones": 0.5,
  "AppLovin Stock Today: Why This Bull Put Spread Earns $160": 0.5,
  "Baker Hughes to Supply LM9000 Turbines for Commonwealth LNG Project": 0.5,
  "Cintas’ $5.2B UniFirst Bid Ignites the Battle for Route Dominance": 0.5,
  "Why Marvell Technology (MRVL) Stock Is Trading Up Today": 0.5,
  "G2 Winter 2026 Awards: ShipHero Sweeps Back-to-Back #1 in WMS": 0.6,
  "Is ADP (ADP) Undervalued After Its Recent Pullback? A Fresh Look at the Stock’s Valuation": 0.5,
  "Citi Makes Left-Field Choice For Top Pick Among Chip Stocks": 0.2,
  "How Enterprise, International Markets Boosted Shopify Stock": 0.5,
  "Heard on the Street Recap: A Dose of Optimism": 0.8,
  "Down 81%, Is It Time to Buy PayPal Stock?": 0.2,
  "Does Regeneron Still Offer Value After Strong Five Year Share Price Gains?": 0.2,
  "PepsiCo (PEP) Stock Sinks As Market Gains: Here's Why": -0.5,
  "UiPath Set to Join S&P MidCap 400 and Versant Media Group to Join S&P SmallCap 600": 0.5,
  "NXP Semiconductors (NXPI) Stock Dips While Market Gains: Key Facts": -0.2,
  "Monster Beverage price target raised to $87 from $81 at Morgan Stanley": 0.5,
  "PepsiCo (PEP) Valuation Check After Recent Share Price Drift Lower": 0.1,
  "Monolithic Power Systems (MPWR): 3 Reasons We Love This Stock": 0.8,
  "3 Reasons ODFL is Risky and 1 Stock to Buy Instead": -0.6,
  "2 Nasdaq 100 Stocks for Long-Term Investors and 1 We Brush Off": 0.2,
  "3 Hyped Up  Stocks That Concern Us": -0.5,
  "1 Volatile Stock to Own for Decades and 2 That Underwhelm": -0.5,
  "1 of Wall Street’s Favorite Stock to Consider Right Now and 2 Facing Challenges": 0.2,
  "2 Oversold Stocks Set for a Comeback and 1 We Brush Off": 0.5,
  "1 Large-Cap Stock with Impressive Fundamentals and 2 Facing Challenges": 0.5,
  "3 S&P 500 Stocks We Approach with Caution": -0.5,
  "Basin rig count up one as prices hold": 0.5,
  "Earnings Preview: What to Expect From PACCAR’s Report": 0.5,
  "Citi Adds Positive Catalyst Watch on Marvell (MRVL) Ahead of CES 2026": 0.8,
  "Stock Market News for Dec 24, 2025": 0.0,
  "Best Payroll Software UK (Jan 2026): QuickBooks Named Best Payroll Solution for UK Small Businesses by Better Business Advice": 0.8,
  "The best stocks of 2025: AI, tech, gold, and some surprises": 0.5,
  "Why the ‘Everyone’s a Winner’ Energy Trade Can’t Last Forever": -0.5,
  "Should You Be Excited About Amgen Inc.'s (NASDAQ:AMGN) 73% Return On Equity?": 0.6,
  "No Deposit Bonus Casinos 2026: BitStarz Introduces Fresh 50 Free Spins Bonus With Ultra-Fast 10-Minute Payouts": 0.8,
  "3 Growth Companies With Insider Ownership Up To 27%": 0.5,
  "3 Stocks That Investors Might Be Undervaluing By Up To 32.3%": 0.5,
  "Exploring US High Growth Tech Stocks for Potential Expansion": 0.5,
  "S&P 500 Record Sets Up a Santa Rally. This Could Be the Stock Market’s Scrooge and 4 Other Things to Know Today.": 0.5,
  "Repare Therapeutics Announces Acquisition of Polθ ATPase Inhibitor, RP-3467, by Gilead Sciences for Up To $30 Million in Total Consideration": 0.5,
  "Intuitive Surgical vs. Stryker: Which MedTech Stock Has More Upside?": 0.5,
  "Alphabet’s Pullback After a Big Year—Is This the Dip to Buy?": 0.5,
  "Here’s How Lam Research Corporation (LRCX) is Benefitting from AI": 0.5,
  "Dow Jones Futures: S&P 500 Hits Record Close; Nvidia, Google Flash Buy Signals": 0.8,
  "Exchange-Traded Funds Higher, Equity Futures Mixed Pre-Bell Wednesday Ahead of Shortened Trading Week": 0.5,
  "These 6 stocks will lead the $1 trillion chip surge in 2026, BofA says": 0.5,
  "Snowflake In Talks To Buy Observe Amid AI Acquisition Spree": 0.5,
  "Buy 3 Tech Stocks as Santa Rally Begins With a Record High S&P 500": 0.8,
  "3 Top Fidelity Mutual Funds to Buy Ahead of 2026": 0.5,
  "Texas Instruments Incorporated (TXN) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Utility CEO on the data center crunch: America’s ‘check engine light’ is on and ‘no one’s going to pay attention until it breaks down’": -0.6,
  "Why Disney Stock Is the Real Winner from the Warner Takeover Battle": 0.6,
  "12 Stocks That Dropped After Tax-Loss Selling—and Can Bounce Back": 0.5,
  "Is It Worth Investing in Intuitive Surgical (ISRG) Based on Wall Street's Bullish Views?": 0.5,
  "MercadoLibre (MELI) Is Considered a Good Investment by Brokers: Is That True?": 0.5,
  "ChargePoint CEO: We expect a 'pullback' this quarter after EV tax credit expiry": -0.5,
  "Will DRAM Strength Drive Applied Materials' Next Growth Phase?": 0.5,
  "Mergers & Acquisitions Soared This Year. Stocks That Could Make 2026 Even Bigger.": 0.5,
  "Armandino Batali, Seattle Chef Who Turned to Salami After Working at Boeing, Dies at 88": -0.5,
  "Update: Gilead Sciences to Acquire Repare Therapeutics' Investigational Cancer Treatment; Repare Shares Rise": 0.5,
  "UiPath Stock Is Surging. Why the AI Winner Is Getting a Big Boost.": 0.8,
  "MU surged nearly 230% this year and continues to hit new highs today. Will it break through $300 before the New Year? - As AI large models exhibit exponential growth in data generation and processing speeds, memory chips face shortages and product prices continue to rise, ushering in a supercycle for the industry. MU, a memory chip giant, has surged nearly 230% this year. Today, it continues its strong momentum with a 3.6% gain, breaking": 0.8,
  "Score A $4,000 Payday — Why The 2026 World Cup Is A Gold Mine For Homeowners": 0.5,
  "This Medical Robotics Name Wins FDA Greenlight; Its Stock Nears A Buy Point": 0.8,
  "MRVL's Data Center Revenues Hit $1.5B: Can the Momentum Continue?": 0.5,
  "2025 Changed the Media Business. Next Year Could Be Even More Turbulent.": 0.5,
  "Amgen Strikes Drug Pricing Deal With Trump: What Investors Should Know": 0.5,
  "Xmas Eve Jobless Claims: Still Accommodating": 0.2,
  "3 Artificial Intelligence Stocks You Can Buy and Hold for the Next Decade": 0.5,
  "4 Drug, Biotech Stocks Rising More Than 50% in 2025 With Room to Grow": 0.8,
  "The 3 consumer internet stocks best positioned for 2026": 0.5,
  "Broadcom's Semiconductor Growth Picks Up: A Sign of More Upside?": 0.6,
  "Cisco's AI-Push Aids Networking Revenue: Is There More Upside Ahead?": 0.5,
  "Disney Seen as Potential Winner as Warner Bidding Battle Plays Out": 0.8,
  "Soft Weekly Jobless Claims Data": 0.5,
  "Lam Research Is at All-Time Highs. Its CEO Just Sold $27 Million Worth of Stock.": -0.5,
  "This Top Nasdaq-100 Stock Has Nothing to Do With AI. How Should You Play It for 2026?": 0.2,
  "AXON's Dedrone Expands in CUAS Capability: Can It Deliver Growth?": 0.2,
  "Should You Sell Netflix Stock Before It Wins the Warner Bros Takeover?": -0.5,
  "Sector Update: Health Care Stocks Rise Wednesday Afternoon": 0.5,
  "Crude Oil Prices Continue Higher on Recent Oil Tanker Disruptions": 0.5,
  "Tesla faces NHTSA investigation into Model 3 emergency door releases - The NHTSA confirmed on Wednesday that it will conduct an investigation into complaints about the mechanical door releases of 2022 Tesla （TSLA） Model 3 vehicles. The investigation will cover 179,071 vehicles. Investigate defects in the mechanical door release mechanism. Tesla (TSLA) shares fell 1.0% in early trading on Wednesday.": -0.6,
  "As Markets Rise, Risk-Taking Takes a Back Seat": -0.5,
  "3 High Growth Companies Insiders Are Eager To Own": 0.5,
  "These Stocks Are Moving the Most Today: Intel, Nike, UiPath, Tesla, Micron, Disney, Lam Research, AMC, Strategy, Dynavax, and More": 0.2,
  "PepsiCo vs. Coca-Cola: Which Stock Dominates Global Beverage Space?": 0.5,
  "AppLovin's Strategic Reset: Going All-In on AI-Driven Advertising": 0.6,
  "Options trading: This analyst's calls on Palo Alto, TJX, SoFi": 0.2,
  "Global semiconductor sales will reach $1 trillion by 2026, with these six companies set to be the biggest beneficiaries. - Various signs indicate that the artificial intelligence boom is not only showing no signs of cooling but is accelerating. Six stocks will lead the global $1 trillion chip surge in 2026, even as some AI skeptics remain on the sidelines due to perceived overvaluation. However, this industry is currently only in the middle phase of": 0.8,
  "AMC Stock Snaps 11-Day Losing Streak as Box Office Concerns Loom": 0.1,
  "Mondelēz Global LLC Conducts Voluntary Recall of 2 SKUs of CHIPS AHOY! Baked Bites Brookie in the US": -0.5,
  "Starbucks Stock Today: Trade This Bear Call Spread, Earn $55 Right Away": 0.2,
  "Oracle’s Topsy-Turvy Year Won’t Get Any Easier in 2026": -0.6,
  "Crude Oil Prices End Little Changed But See Continued Support From Recent Oil Tanker Disruptions": 0.5,
  "Online Casinos That Accept PayPal USA: High 5 Casino's Voted Leading PayPal Casino": 0.6,
  "Is Applied Materials (AMAT) Still Fairly Priced After Its Recent Strong Share Price Run?": 0.2,
  "Paypal (PYPL) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "Comcast (CMCSA) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "If you had to pick one long-term AI winner: Google or Nvidia and why? - I’m looking to add one individual stock as a small satellite position (5–10%) alongside a diversified core ETF. Horizon is 5–10 years, not trading, not options. Nvidia clearly dominates AI hardware today and has incredible momentum, but expectations are already extremely high. Google, on the other hand, feels more controversial: massive cash flow, distribution, data, TPUs, and vertical integration, but": 0.2,
  "Is Marvell Technology Attractively Priced After Recent AI Driven Share Price Rebound?": 0.5,
  "Amazon.com (AMZN) Is Up 5.0% After Expanding AI Infrastructure, AWS Backlog and Strategic Partnerships – What's Changed": 0.5,
  "Is Synopsys Still Attractively Priced After Recent AI Enthusiasm and Share Price Rebound?": 0.2,
  "Nvidia Absorbs Another Rival for $20B, Boosting Decentralized AI": 0.6,
  "Is Starbucks Stock Attractive After 2025 Slump And Premium Valuation Metrics?": 0.2,
  "Synopsys (SNPS): Has the Recent 18% Share Price Rebound Left the Stock Undervalued?": 0.5,
  "How The Evolving AI Storage Story Is Reshaping Seagate Technology Holdings Valuation": 0.5,
  "3 Reasons to Buy Uber Stock Like There's No Tomorrow": 0.5,
  "3 Reasons to Sell CSCO and 1 Stock to Buy Instead": -0.5,
  "Zscaler (ZS): Buy, Sell, or Hold Post Q3 Earnings?": 0.0,
  "Is It Too Late To Consider KLA After Its 100% Surge In 2025?": -0.5,
  "What’s your thoughts on NFLX? - The stock took a pretty decent hit in the past few weeks. What I’d mainly assume is due to the WBD drama, stock split and the tax dispute in Brazil. It honestly just seems oversold though. Do you guys think it’s starting to bottom off or does it have more to bleed? $93 seems really attractive for a stock like this. There’s two things I’m looking at for the": 0.2,
  "1 Software Stock to Own for Decades and 2 We Find Risky": 0.2,
  "New CEO and Breakup Plan Could Be A Game Changer For Kraft Heinz (KHC)": 0.8,
  "MercadoLibre (NasdaqGS:MELI): Assessing Valuation After Recent Share Price Volatility": 0.1,
  "5 Insightful Analyst Questions From Cintas’s Q4 Earnings Call": 0.5,
  "Revisiting Fastenal (FAST) Valuation After a Strong Multi‑Year Shareholder Return Run": 0.6,
  "How Investors May Respond To Comcast (CMCSA) Saudi Theme Park Plans And New Co-CEO Structure": 0.1,
  "Morgan Stanley Eyes Warner Bros. (WBD) Upside as 2026 Media Outlook Favors Premium Content and AI Protection": 0.6,
  "What Will Drive Starbucks (SBUX) Stock in 2026? 3 Important Factors Investors Must Watch.": 0.2,
  "Is T-Mobile US Still Attractive After Recent 5G Expansion and Share Price Pullback in 2025": 0.2,
  "Does CSX’s Recent 14% 2025 Rally Still Leave Room for Long Term Value?": 0.2,
  "Can Charter Communications, Inc.'s (NASDAQ:CHTR) ROE Continue To Surpass The Industry Average?": 0.2,
  "Is Monolithic Power Systems, Inc.'s (NASDAQ:MPWR) Recent Performance Tethered To Its Attractive Financial Prospects?": 0.2,
  "Possible Bearish Signals With Analog Devices Insiders Disposing Stock": -0.6,
  "The real AI revolution is going from the information era to the ‘intelligence era,’ Paypal senior VP says. That means your focus should be tokens": 0.5,
  "High Growth Companies With Strong Insider Confidence December 2025": 0.6,
  "Exploring US High Growth Tech Stocks In December 2025": 0.5,
  "Paychex Is Out of Favor—And That’s the Opportunity": 0.5,
  "E-Commerce Today - Emerging Opportunities in UK Online Retail Market": 0.5,
  "Is Starbucks open on Christmas 2025?": -0.5,
  "Lam Research (LRCX): Assessing Valuation After AI-Driven Upgrades and Strong Wafer Fab Demand": 0.6,
  "These 7 Stocks Are Analyst Favorites For Magnificent Earnings Growth; GE, Google Among Winners": 0.8,
  "What Offers Shopify (SHOP) a Durable Growth Profile?": 0.2,
  "TCW Concentrated Large Cap Growth Fund Sold Adobe Systems (ADBE) Due to Increasing Competition": -0.5,
  "Dogs of the Dow Beat the Market in 2025 — Here’s the Smarter 4-Stock Play for 2026": 0.5,
  "Is Synopsys (SNPS) an Attractive Investment Choice?": 0.5,
  "This ETF Will Benefit From Americans' Higher Energy Bills": 0.5,
  "Is Fastenal Stock Priced for Perfection After Its Strong Multi Year Rally?": -0.5,
  "Is Shopify’s 2025 Valuation Justified After a 419% Three Year Share Price Surge?": 0.5,
  "Analysts Confident in NXP Semiconductors (NXPI) Amid Improving Outlook on Diversified Analog Semiconductor Market": 0.8,
  "December 2025's Top Insider-Owned Growth Stocks": 0.0,
  "3 Stocks Estimated To Be Trading At Discounts Of 23.1% To 41.2%": 0.5,
  "Strategy behind Nvidia’s Groq deal - Nvidia paid $20 billion in the Groq deal to secure exclusive access to Groq’s AI inference technology and talent with the aim of dominating the rapidly growing market for real-time AI processing. Nvidia licensed Groq’s Language Processing Unit (LPU) tech which is custom AI inference chips optimized for ultra-low latency and high throughput. What is the strategy? Nvidia brought in Groq’s founder Jonathan Ross (ex-Google TPU architect), President Sunny": 0.8,
  "Why Analysts See Kraft Heinz’s Story Shifting After Guidance Cut and New CEO Announcement": 0.2,
  "Is Axon (AXON) Quietly Recasting Its Risk Profile With Debt Moves And AI-Driven Contracts?": 0.2,
  "Why The Narrative Around Intuit Is Shifting With OpenAI Partnership And Credit Karma Momentum": 0.5,
  "5 Insightful Analyst Questions From Paychex’s Q4 Earnings Call": 0.5,
  "The Zacks Analyst Blog Mineralys, Lyell, Insmed and Nektar": 0.0,
  "Starbucks' Q1 2026 Earnings: What to Expect": 0.0,
  "Gilead Sciences to acquire Repare’s RP-3467": 0.5,
  "China's rising biotech clout on show in flurry of billion-dollar licensing deals": 0.6,
  "2 Overlooked AI Stocks to Buy Before They Soar Up to 100% in 2026, According to Wall Street Analysts": 0.5,
  "Netflix: Market Overreacts to a One-Time Hit, Fundamentals Still Strong": 0.8,
  "Netflix: A Premium Business at a Premium Price: Why Netflix's Upside Looks Limited": -0.5,
  "How Costco Won Over Wine Snobs": 0.5,
  "r/Stocks Daily Discussion & Fundamentals Friday Dec 26, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is": 0.2,
  "Zscaler, Inc. (NASDAQ:ZS) is largely controlled by institutional shareholders who own 53% of the company": 0.1,
  "Booking Holdings Insider Lowered Holding By 30% During Last Year": -0.5,
  "S&P Futures Muted in Thin Post-Christmas Trade": 0.0,
  "MenuSifu Powers MIXUE's U.S. Expansion as Brand Becomes World's Largest Beverage Chain by Store Count": 0.6,
  "Is Amazon Stock a Buy Ahead of 2026?": 0.2,
  "Insider Confidence In December 2025's Leading Growth Companies": 0.5,
  "Exploring High Growth Tech Stocks In The US December 2025": 0.5,
  "Sector Rotation: 2 Smart Money Moves for 2026": 0.5,
  "Is ISRG's 20% Procedure Growth the New Normal or a Peak?": 0.1,
  "Got a Big Pile Of Unwanted Stuff to Send Back? You're Not Alone—It's Return Season": 0.2,
  "CELH vs. MNST: Which Energy Drink Stock Is the Better Bet Now?": 0.5,
  "4 Cybersecurity Stocks With Strong Demand and Durable Moats for 2026": 0.8,
  "Multiple Contraction Hit Atlassian Corp. (TEAM) in Q3": -0.5,
  "CrowdStrike at 'Forefront' of AI Revolution Amid Increasing Deal Momentum, Wedbush Says": 0.8,
  "Shopify Inc. (SHOP) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Investors Heavily Search Adobe Inc. (ADBE): Here is What You Need to Know": 0.5,
  "Here is What to Know Beyond Why AppLovin Corporation (APP) is a Trending Stock": 0.2,
  "Costco Wholesale Corporation (COST) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "The Zacks Analyst Blog Analog Devices, Amazon.com and Fortive": 0.0,
  "POET - An engineer's perspective - I kept seeing $POET floated around as a potential big play. Having not known anything about the company, I decided to do some personal due diligence. A little about my background. I am a mechanical engineering PhD with a specialization in robotics and artificial intelligence. I am the co-founder of a company launching it's first product in 2026 as well as an adjunct professor at a university occasionally. TL;DR": 0.5,
  "Is Axon (AXON) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Cisco Systems Stock Is Treading Water - How to Use Puts and Calls to Play CSCO": -0.2,
  "I kept MU RSU's and ESPP for a few years now, ride the wave or diversify? - As we all know, MU has been doing exceptionally well this last year and the outlook so far is only up. I've kept almost all of my RSU's and ESPP that I've gotten from MU for the last year or two and needless to say it's grown significantly in size and now I'm not sure what to do": 0.6,
  "Kuwait Taps Baker Hughes to Boost Output From Mature Fields": 0.5,
  "MRVL vs. SNDK: Which AI Infrastructure Stock is a Better Bet?": 0.5,
  "3 Stocks at 52-Week Lows With Way More Upside Than Downside": 0.8,
  "QCOM Rides on Strength in Premium Handset Market: Will it Sustain?": 0.5,
  "Roku vs. Netflix: Which Streaming Platform Stock is a Better Buy Now?": 0.5,
  "Micron and 28 Other S&P 500 Stocks Hit 52-Week Highs on Wednesday. These 12 Are Doing It Again Today.": 0.5,
  "European Equities Traded in the US as American Depositary Receipts Little Changed in Friday Trading; Gains 2% for Week": 0.5,
  "DDOG vs. FIVN: Which Cloud Software Stock is the Better Buy Now?": 0.2,
  "Space stocks in 2026 - Every thread here and elsewhere asking about top picks for 2026 has at least one space stock recommendation like RKLB or ASTS, but are they really a great investment when they're priced for perfection and at higher multiples than the industry leader? Why space stocks will struggle in 2026: 1. Space business requires a ton of capital, that means constant dilution. Both companies have tripled and quadrupled their shares in": -0.6,
  "Why This Long Strangle Trade Might Be Best For Palo Alto Stock": 0.5,
  "SE vs. TTWO: Which Gaming Stock Offers Better Growth Opportunity?": 0.5,
  "ADBE vs. GOOGL: Which AI-Driven Tech Stock Has an Edge Now?": 0.5,
  "Adobe Stock Rides on Expanding Partner Base: Is There More Upside?": 0.6,
  "HSTM vs. SHOP: Which Stock Should Value Investors Buy Now?": 0.2,
  "CrowdStrike Stock in Focus -- Wedbush Calls It 'AI Cybersecurity Leader' Ahead of 2026": 0.6,
  "Warner Bros. Discovery Shares Drop as Paramount Skydance Threatens Legal Action": -0.6,
  "Monster Beverage (MNST) Is Up 3.10% in One Week: What You Should Know": 0.5,
  "Costco breaks 3 records that will surprise its members": 0.5,
  "Iconic Mandarin Oriental owner files for Chapter 11 bankruptcy": -0.8,
  "Snowflake in Talks for $1 Billion Observe Acquisition": 0.5,
  "Target vs. Costco: Which Discount Retail Stock Offers More Upside Now?": 0.5,
  "FedEx (FDX) CEO is Playing Offense, Says Jim Cramer": 0.5,
  "Tech, Media & Telecom Roundup: Market Talk": 0.0,
  "Insiders Favor American Resources And Two Other Leading Growth Stocks": 0.5,
  "I've set aside 200K to invest in NVDA stock. Can it double in five years? - I'm considering investing a significant portion in NVIDIA stock. To be honest, it's not that I doubt the company itself, but I have reservations about the expected growth at its current valuation. For the stock price to double within five years, NVIDIA would need to sustain consistent growth and this growth must far exceed what the current AI cycle": -0.5,
  "These 3 Household Names Are Flashing Rare Oversold Signals": 0.2,
  "What PayPal’s stablecoin moves means for Wall Street’s crypto adoption in 2026": 0.5,
  "Top Analyst Reports for Advanced Micro Devices, Goldman Sachs and Lam Research": 0.5,
  "12 Days of Christmas? 12 Stocks That Are Gifts for 2026.": 0.5,
  "Here's Why Investors Should Hold Ensign Group Stock for Now": 0.5,
  "Samsung and SK Hynix Raise 2026 HBM3E Order Prices by 20% - South Korean memory manufacturers Samsung (SSNLF) and SK Hynix have reportedly raised prices for their fifth generation high bandwidth memory (HBM3E) chips by 20%, with deliveries expected in 2026. The HBM3E price hike comes amid surging demand for advanced memory chips driven by the rise of AI applications. This surge occurs as memory manufacturers prepare to shift resources toward HBM4 chips typically when": 0.2,
  "Stock Market Predictions For 2026? Worthless. This Approach? Priceless.": 0.5,
  "These Stocks Are Moving the Most Today: Nvidia, Apple, Tesla, Coupang, Micron, Lam Research, Newmont, Moderna, and More": 0.5,
  "Focus Universal Inc. Launches Cost-Effective Commercial IoT for Four Sectors": 0.5,
  "Nvidia Reportedly Shells Out $20.6 Billion For Groq, CEO Jonathan Ross Says He's Joining Rival Chip Giant Along With The Team": 0.2,
  "Market Chatter: Paramount Skydance May Consider Legal Action in Warner Bros. Battle": -0.5,
  "Holding META… but honestly conflicted - Still holding Meta Platforms. Not gonna lie, I’m a bit torn. The business works. Ads still print. Margins surprised me (in a good way). So I get the bull case. But at the same time… they’re spending a lot. Capex keeps going up. Data centers everywhere. AI spend isn’t small anymore. And yeah, AI helps ads. But right now it feels more like “making the old machine run better”": 0.1,
  "Sector Update: Consumer Stocks Mixed in Late Afternoon Trading": 0.0,
  "Ellison, Paramount Put Pressure on WBD for a Deal": -0.5,
  "2026 software stock outlook: Analyst's top pick": 0.5,
  "Better Artificial Intelligence Stock: ASML vs. Taiwan Semiconductor": 0.5,
  "Take-Two Interactive (TTWO) Increases Despite Market Slip: Here's What You Need to Know": 0.5,
  "Take Two (TTWO) Call Option - Thinking about making a call on Take Two Interaction Software for next year's GTA6 release. Problem is I've never done an option call so I'm pretty ignorant about options but I figure my first time making a call, doing it on TTWO would be a good first try. Any thoughts/opinions on this?": 0.2,
  "Western Digital (WDC) Rises As Market Takes a Dip: Key Facts": 0.5,
  "Warner faces a surprise new bid as investors do the real math": 0.2,
  "Broadcom’s Margin Warning Spooked Wall Street—But Cash Flow Could Still Win": 0.2,
  "I'm Sounding an Alarm on Opendoor Technologies Stock Following Its Massive Drop This Month": -0.5,
  "The FTSE 100 Soared in 2025. Making the Case for 2026.": 0.8,
  "3 Dividend Stocks to Buy to Create the Gift That Keeps on Giving": 0.6,
  "Why MicroStrategy’s Collapse Could Be the Next Black Swan for Crypto in 2026": -0.6,
  "This Stock More Than Doubled In 2025. Can It Keep Soaring?": 0.5,
  "Morgan Stanley Sees Policy Risks Receding for Regeneron (REGN)": 0.5,
  "Wells Fargo Trims Costco (COST) Target Amid Mixed Retail Backdrop": -0.2,
  "The Ultimate Growth Stock to Buy With $2,000 Right Now": 0.8,
  "The Outlook for Chinese Stocks and Economy Hinges on the U.S.": 0.1,
  "Energy Plays - Tech, Space, Industrials, and even your mother's basement need it. - As of late 2025, the transition from AI hype to infrastructure utility has made power availability a primary constraint for the Mag7, which has been highlighted repeatedly in numerous mag7 investor calls and more importantly evidenced in their drive to supply some of their own energy (i.e. solar panel initiatives & expenditure, Amazon hydrogen electrolysers). Big Tech is showing clear focus": 0.6,
  "“People Didn’t Like” Paychex (PAYX)’s Quarter": -0.5,
  "Have $2,000? 3 Top Robotics Stocks to Buy and Hold for at Least a Decade": 0.5,
  "Here's What Airbnb (ABNB) Stock Investors Need to Watch in 2026": 0.2,
  "My Due Diligence on Credo Technology ($CRDO) it doesnt get enough attention. - They provide the \"Active Electrical Cables\" (AECs) that connect the world's most powerful AI clusters. * **Triple-Digit Hypergrowth:** Q2 2026 revenue just hit **$268M (up 272% YoY)**. They aren't just growing; they are exploding as hyperscalers (Amazon, Microsoft, Meta) build out their data centers. * AI supercomputers (like the ones built by **Amazon**, **Microsoft**, and **Elon Musk**) require thousands of chips to": 0.8,
  "Should You Think About Buying Roper Technologies, Inc. (NASDAQ:ROP) Now?": 0.2,
  "Palo Alto Networks, Inc. (NASDAQ:PANW) Stock Has Shown Weakness Lately But Financials Look Strong: Should Prospective Shareholders Make The Leap?": 0.5,
  "Got $5,000? 3 Incredible Stocks to Buy for 2026": 0.5,
  "MarketBeat Week in Review – 12/22 - 12/26": 0.0,
  "Texas Instruments (NASDAQ:TXN) Seems To Use Debt Quite Sensibly": 0.6,
  "Monster Beverage Corporation (NASDAQ:MNST) Shares Could Be 26% Above Their Intrinsic Value Estimate": 0.5,
  "These stocks saw gains in shortened Christmas week trading": 0.5,
  "2 Dividend Stocks to Double Up on Right Now": 0.5,
  "Covering uncertainities in the market... - Is anyone else starting to feel the \"cracks\" for 2026? 2025 has been a massive year for AI and the s&p 500, but honestly, this \"santa rally\" feels a bit too perfect. i’m looking at my portfolio and for the first time in years, i’m actually worried about the concentration risk in tech. we’ve got hyperscalers like MSFT and GOOG spending $500B on infrastructure, but the forward P/E ratios": -0.6,
  "3 Stock-Split Stocks to Buy that Could Soar As Much as 40%, 35%, and 640%, According to Wall Street": 0.8,
  "45% Of This Constellation Energy Insider's Holdings Were Sold": -0.5,
  "Can Honeywell International Inc. (NASDAQ:HON) Maintain Its Strong Returns?": 0.2,
  "Palantir, Nvidia Lead 5 Stocks Near Buy Points Heading Into Final Days Of 2025": 0.5,
  "Peter Thiel warns US real estate ‘catastrophe’ will deal massive blow to young Americans, but boomers might get windfall": -0.7,
  "6 under-the-radar stocks to play the AI boom in 2026: BofA": 0.5,
  "Phishing scams becoming prevalent on LinkedIn: How to spot them": -0.6,
  "Here Are My Top 3 Growth Stocks to Buy Now": 0.5,
  "3 Reasons Broadcom Crashed 15% on Blockbuster Earnings — And the Real Reason to Load Up Now": 0.5,
  "r/Stocks Weekly Thread on Meme Stocks Saturday - Dec 27, 2025 - The meme stock scheduled posts will now run weekly and post Saturday afternoon and won't be a sticky; you're probably seeing this because automod sent you here! [Full list of meme stocks here.](https://www.reddit.com/r/stocks/wiki/meme-stocks) This will be updated every once in a while. ------ Welcome traders who just can't help them selves discuss the same exact stock that's been discussed 100s of times a": 0.1,
  "Is r/stocks actually good at stock picking? Analysis of recommendation posts for the past few years. - I did a quick analysis for various stock recommendation posts I found on r/stocks that were dated close to but prior to the year in question and figured out what the most recommended stocks were based on mentions and also based on # of upvotes. The data is [here](https://docs.google.com/spreadsheets/d/1f_gdYrPGSLqLV1fyBPt9LmamHkCnttG91ymClZa_GKM/edit?usp=sharing). In essence for 2025, the top 10 recommendations based": 0.2,
  "Billionaire Chase Coleman Has Formed His Own \"Magnificent Seven\" and It's Even Better Than the Original": 0.8,
  "Here Are My Top 2 No-Brainer Growth Stocks to Buy Now": 0.8,
  "Netflix Stock: Buy, Sell, or Hold?": 0.0,
  "2 Red-Hot Growth Stocks to Buy in 2026": 0.8,
  "Popular gift retailer shuts stores, cuts jobs over holidays": -0.8,
  "Walmart, Starbucks and More Are Accepting Crypto Payments: What It Means for You": 0.5,
  "From Power Grids to Data Centers: The Overlooked Winners in the AI Gold Rush": 0.5,
  "Longtime analyst resets Nvidia stock price target ahead of 2026. What is your opinion and predictions of a price target? - https://www.thestreet.com/investing/stocks/longtime-analyst-resets-nvidia-stock-price-target-ahead-of-2026 “We envision future NVDA platforms where GPU and LPU co-exist in a rack, connected seamlessly with NVDA’s NVLInk networking fabric. Groq’s LPU employ a large amount (hundreds of MB) of fast on-chip SRAM memory as primary storage for AI model weights and working data,” wrote Bank of America analyst Vivek Arya to clients": 0.5,
  "2 Dividend Stocks to Double Up On Right Now": 0.5,
  "How To Earn $500 A Month From Micron Stock": 0.2,
  "How Netflix, Paramount Sparked A $108 Billion Media War For Warner Bros. Discovery": 0.5,
  "Prediction: This Will Be Micron Technology's Stock Price in 2026": 0.2,
  "Prediction: AMD Stock Will Jump 60% in 2026, Thanks to President Donald Trump": 0.6,
  "2 No-Brainer Dividend Stocks to Buy Right Now": 0.5,
  "Major correction or just fud? - So long story short, i am getting about 140k from my dad plus i have 25k saved, i was thinking about picking 9-12 stocks of my own like amzn, google, unh, nflx, brk.b… proven companies with long term growth, not any speculative stocks. my question is do you guys think i should wait for a major correction or start dcaing now or just lump sum and hold for 10+years": 0.2,
  "4 Stocks to Hold for the Next 5 Years": 0.0,
  "Companies Are Outlining Plans for 2026. Hiring Isn’t One of Them.": -0.6,
  "Comcast Is Cheap. Investors Are Too Pessimistic on Broadband, This Analyst Says.": 0.5,
  "Costco’s (COST) Global Growth Story Gains Momentum, Says Northcoast": 0.6,
  "Costco Held Its IPO 40 Years Ago. Here's How Much $100 Invested Then Would Be Worth Today.": 0.5,
  "What Is One of the Best Consumer Goods Stocks to Hold for the Next 10 Years?": 0.5,
  "The Stock Market Could Soar in 2026 as the Economy Booms Despite President Trump's Tariffs, According to Wall Street": 0.6,
  "The Best Artificial Intelligence (AI) Stocks to Buy Ahead of 2026, According to Wall Street Analysts (Hint: Not Palantir)": 0.2,
  "5 Incredible Growth Stocks to Buy for 2026": 0.8,
  "Food Makers Need to Rekindle Demand in 2026. That’s a Tall Order.": -0.6,
  "There’s No Happy Ending for Movie Theaters, No Matter Who Wins Warner": -0.5,
  "2 Beaten-Down Stocks That Could Make a Comeback in 2026": 0.5,
  "Stocks sit near record highs as 'Santa Claus rally' builds, 2026 approaches: What to watch this week": 0.6,
  "Baker Hughes (NASDAQ:BKR) shareholders have earned a 20% CAGR over the last five years": 0.8,
  "2 Growth Stocks to Buy and Hold Through 2035": 0.5,
  "Netflix Is Out of Favor—and That’s Why It’s Getting Interesting": 0.5,
  "Costco Has Tumbled Despite Higher FCF and FCF Margins - Time to Buy COST Stock?": 0.2,
  "3 Stock-Split Stocks to Buy and Hold for at Least a Decade": 0.5,
  "Cyber scams on the rise: How to avoid getting phished by hackers": -0.7,
  "3 Must-Know Facts About Costco Before You Buy the Stock": 0.5,
  "Deutsche Bank Applauds Micron’s (MU) Consistent Execution and Technical Leadership Following Record Results": 0.8,
  "Morgan Stanley Names Western Digital (WDC) a 2026 Top Pick Amid Cloud Capital Expenditure Boom": 0.8,
  "Needham Highlights Vertical Aerospace’s (EVTL) Execution Strengths Following Site Visit to UK Facilities": 0.8,
  "Prediction: This AI Stock Could Be the First New $2 Trillion Company in 2026": 0.8,
  "Why are solar industry related stocks not reacting to the price of silver going up? - If silver is such a major component in the making of solar panels, why are most solar related stocks continuing to pump despite silver prices going parabolic? Would this not increase production cost thus putting margin pressure on there already razor thin margins?": -0.6,
  "2 Nuclear Energy Stocks That Could Be Going to $0, and 1 Generating Serious Portfolio Power": -0.5,
  "Advanced Micro Devices (AMD) up More Than 76% YTD, Is it Still a Buy?": 0.5,
  "Moody’s Upgraded Rating on Marvell Technology, Inc. (MRVL), Here’s Why": 0.8,
  "Wall Street Maintains a Positive Outlook on Charter Communications (CHTR)": 0.8,
  "Jim Cramer on International Business Machines: “It’s Still Cheap”": 0.6,
  "Jim Cramer Considers CrowdStrike One of the “Best of Breed” in Cybersecurity": 0.8,
  "Jim Cramer Discusses Warner Bros. Takeover Battle": 0.0,
  "Jim Cramer Highlights Cintas’ Attempts to Buy UniFirst": 0.5,
  "Jim Cramer on Costco: “I Am Concerned I Might Sell the Rest”": -0.6,
  "What Is the Best Artificial Intelligence (AI) Stock to Hold for the Next 10 Years?": 0.2,
  "Wedbush Lowers Price Goal On MercadoLibre, Inc. (MELI)": -0.5,
  "Warren Buffett Once Got Permission From the SEC to Hide His Trades for a Year to Buy 1 Stock: Decades Later, Is It Still a Buy?": 0.2,
  "Spotnana Declares Partnership With Booking Holdings Inc. (BKNG)’s Booking.com": 0.5,
  "Intuit Inc. (INTU) Plans To Use Circle Internet And USDC Infrastructure": 0.2,
  "Cantor Fitzgerald Maintains An Overweight Rating On ASML Holding N.V. (ASML)": 0.5,
  "Deutsche Bank Is Bullish On Broadcom Inc. (AVGO)": 0.6,
  "Theme Parks’ New Strategy: Smaller, Cheaper and Shorter": 0.2,
  "S&P Global Ratings Touts Strategy Inc. (MSTR) Stable Outlook Asserts B-Issuer Credit Rating": 0.5,
  "Charter Communications, Inc. (CHTR) Defends Cox Merger, Analysts Split on Stock Prospects": 0.2,
  "Is PayPal Holdings, Inc. (PYPL) One of the Best Beaten-Down Stocks to Invest in According to Analysts?": 0.5,
  "AI Infrastructure Demand Keeps KLA (KLAC) and Semiconductor Sector on Top for 2026": 0.6,
  "B. Riley Names Lam Research (LRCX) a Top Memory Recovery Play Due to Specialized Etch Leadership": 0.8,
  "Financially independent investors swear by this overlooked passive-income stream. Here’s why some call it ‘easy’ money": 0.5,
  "T-Mobile (TMUS) Upgraded as Subscriber Growth Outlook Improves": 0.8,
  "Comcast (CMCSA) Stock Holds Neutral Rating Amid Broadband Losses": 0.0,
  "Is Netflix, Inc. (NFLX) a Best Quality Stock To Buy Before 2026": 0.5,
  "Here’s What Kim Forrest and William Kerwin Think About Broadcom Inc (AVGO)": 0.2,
  "What is the current \"META 2022\"? Part 2 - On the same note as [yesterdays post](https://www.reddit.com/r/stocks/comments/1px2p4m/is_rstocks_actually_good_at_stock_picking/) I wondered how well Reddit's recommendations from **[February 2024](https://www.reddit.com/r/stocks/comments/1aoaskg/what_is_the_current_meta_2022/)** fared, specifically with regard to finding undervalued stocks - just like META in 2022. As you can see in [**this backtest**](https://testfol.io/?s=71WDfNsObz1), Reddit picks accumulated **46% CAGR***. I would kindly ask you to not simply post a ticker, but rather explain why the company is undervalued - where most people are": 0.2,
  "3 Supercharged Growth Stocks to Buy and Hold Into the 2030s": 0.6,
  "Weebit Nano secures a license agreement with Texas Instruments": 0.6,
  "1 Thing Every Cryptocurrency Investor Needs to Know About Bitcoin Treasuries": 0.5,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On December 22, 2025, the independent members (the “Independent Directors”) of the Board of Directors (the “Board”) of CrowdStrike Holdings, Inc. (the “Company” or “CrowdStrike”), upon the recommendation of the Compensation Committee of the Board (the “Compensation Committee”), approved a performance-based equity award under the Company’s 2019 Equity Incentive Plan (the “Plan”) to George Kurtz, the Company's\n\n(Item 5.02) is incorporated herein by reference. Leading CrowdStrike Through the Next Stage of Growth The Independent Directors approved the Award to incentivize achievement of CrowdStrike's long-term growth strategy by (i) aligning Mr. Kurtz's interests with those of the Company's stockholders through performance-based compensation tied directly to meaningful stock price outperformance, and (ii) providing a compelling incentive for Mr. Kurtz to continue to lead CrowdStrike as it executes on its ambition to achieve $20 billion in annual": 0.2,
  "(Item 8.01) Other Events. ATM Update On December 29, 2025, Strategy Inc (\"Strategy\") announced an update with respect to sales made under its at-the-market offering program (\"ATM\") of the following securities: During Period December 22, 2025 to December 28, 2025 As of December 28, 2025 Security Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) STRF Stock - $ - $ - $ 1,619.3 10.00% Series A": 0.1,
  "(Item 8.01) . Other Events. On December 29, 2025, the Company notified Computershare Trust Company, N.A. as successor to Wells Fargo Bank, N.A., as Trustee, that, in connection with the termination of the Merger Agreement, it will redeem, (1) $750,000,000 in aggregate principal amount of its 4.500% Senior Notes due 2030 (the “2030 Notes”) in full at the special mandatory redemption price, equal to 101% of the principal amount plus accrued and unpaid interest to the redemption": -0.2,
  "(Item 1.01) . Entry Into a Material Definitive Agreement. On December 22, 2025, American Electric Power Company, Inc. (“American Electric Power,” “AEP” or the “Company”) entered into a Board Observer Agreement (the “Board Observer Agreement”) with Carl C. Icahn, Icahn Partners LP, Icahn Partners Master Fund LP, Icahn Enterprises G.P. Inc., Icahn Enterprises Holdings L.P., IPH GP LLC, Icahn Capital LP, Icahn Onshore LP, Icahn Offshore LP and Beckton Corp (collectively, the “Icahn Group”) and Andrew J.\n\n(Item 1.01) of this Current Report on Form 8-K), the Company and the Icahn Group agreed to terminate the Director Appointment and Nomination Agreement (the “Nomination Agreement”), dated as of February 12, 2024, by and among the Icahn Group, the Company and, solely with respect to the provisions applicable to the New Independent Director (as defined in the Nomination Agreement), the New Independent Director. The termination of the Nomination Agreement was effective as of December 22, 2025.": 0.1,
  "Tell me why AVGO isn't overvalued or MU isn't cheap, after the massive run-up of both - Everyone spouted how Nvidia would crash as GPU sales are cyclical, oops, here we are again... Please tell me how MU is no longer a bargain without using the words 'cyclical', 'cyclicality' or 'cycle' in your analysis. AVGO - $1700 Billion Net income forecast next quarter - $9 Billion _____ MU - $320 Billion Net income forecast for": -0.5,
  "Sam’s Club Is Beating Costco at Its Own Game—in China": 0.5,
  "3 Hot Consumer Stocks to Leave Behind in 2026": -0.6,
  "Costco offers a rare membership deal you need to grab now": 0.8,
  "Agoda Releases Ranking of Japan's Most Popular Domestic Winter Travel Destinations": 0.5,
  "2 Reasons to Watch PYPL and 1 to Stay Cautious": 0.5,
  "2 Nasdaq 100 Stocks Worth Investigating and 1 We Turn Down": 0.2,
  "1 of Wall Street’s Favorite Stock with Exciting Potential and 2 We Ignore": 0.6,
  "2 S&P 500 Stocks to Target This Week and 1 We Brush Off": 0.2,
  "3 Volatile Stocks Walking a Fine Line": -0.5,
  "2 Profitable Stocks to Keep an Eye On and 1 Facing Challenges": 0.5,
  "1 Consumer Stock with Impressive Fundamentals and 2 We Turn Down": 0.5,
  "2 Nasdaq 100 Stocks with Exciting Potential and 1 That Underwhelm": 0.5,
  "1 Cash-Heavy Stock to Consider Right Now and 2 We Avoid": 0.2,
  "3 Quality Compounders to Consider Right Now": 0.5,
  "1 Cash-Producing Stock with Promising Prospects and 2 Facing Headwinds": 0.5,
  "2 Cash-Producing Stocks for Long-Term Investors and 1 We Turn Down": 0.2,
  "3 Profitable Stocks with Competitive Advantages": 0.5,
  "3 Cash-Heavy Stocks We Approach with Caution": -0.5,
  "2 Cash-Producing Stocks with Exciting Potential and 1 We Brush Off": 0.6,
  "1 Industrials Stock to Own for Decades and 2 We Ignore": 0.2,
  "3 Hyped Up  Stocks We Approach with Caution": -0.5,
  "Holiday Shoppers Brace for 2026 Payments on Record BNPL Loans": -0.6,
  "Financial resolutions for the New Year to help you make the most of your money": 0.5,
  "Major shop closures across the UK, mapped": -0.7,
  "The Motley Fool Interviews Axon Enterprise President Josh Isner": 0.5,
  "Nvidia and Tesla losses drag Wall Street lower while London ekes out modest gain": -0.5,
  "Apple CEO Tim Cook Just Gave Nike Investors 3 Million Reasons to Cheer": 0.8,
  "Q: What Are Companies Saying About Their 2026 Plans?": 0.0,
  "Starbucks doesn’t want to be on every street in New York and Los Angeles anymore": 0.2,
  "Jim Cramer Wants Micron (MU) CEO to be More Exuberant": 0.4,
  "Jim Cramer Wonders How Many People Would Lose Their Jobs From Paramount Skydance (PSKY)’s Warner. Bros Bid": -0.5,
  "Jim Cramer Discusses UniFirst (UNF) Being Targeted by Another Offer From Cintas": 0.5,
  "Jim Cramer Discusses Cintas’ (CTAS) Latest Offer for UniFirst": 0.2,
  "1 Artificial Intelligence (AI) Stock I'd Buy on Every Dip and Never Sell": 0.8,
  "Piper Sandler Says These 3 Energy Stocks Are Top Picks for 2026": 0.6,
  "Investors know about the AI bubble. They're buying AI stock anyway.": 0.5,
  "Synopsys' (NASDAQ:SNPS) Weak Earnings Might Be Worse Than They Appear": -0.6,
  "Why Nvidia Is Hands-Down a Better Stock to Buy Than Palantir for 2026": 0.8,
  "Micron (MU) Jumps 7% on Christmas Rush, Strong Earnings": 0.8,
  "Cathie Wood’s ARK Funds Have Crushed the Market This Year. What She’s Betting On for 2026.": 0.8,
  "3 Growth Stocks to Buy in January That Could Issue Stock Splits in 2026": 0.5,
  "Zacks Investment Ideas feature highlights: Nvidia, Broadcom, Vertiv and Alphabet": 0.5,
  "Why Monolithic Power Systems, Inc. (NASDAQ:MPWR) Could Be Worth Watching": 0.5,
  "Salesforce & other software names could make a comeback next year": 0.6,
  "Adobe (NASDAQ:ADBE) investors are sitting on a loss of 27% if they invested five years ago": -0.7,
  "Returns Are Gaining Momentum At Marvell Technology (NASDAQ:MRVL)": 0.5,
  "2025 market growth: Betting against the US is a 'fool's game'": 0.6,
  "Investors in Charter Communications (NASDAQ:CHTR) have unfortunately lost 68% over the last five years": -0.8,
  "Markets Hit Records as Tech Concentration Keeps Pressuring Active Fund Performance": 0.1,
  "Stocks Set to Open Lower as Investors Trim Risk at Year-End, Fed Minutes Awaited": -0.5,
  "The Zacks Analyst Blog Highlights Target and Costco Wholesale": 0.0,
  "The Zacks Analyst Blog Highlights Amazon, Microsoft and Alphabet": 0.5,
  "3 Growth Companies With Insider Ownership Up To 18%": 0.5,
  "AI Chips Today - Synopsys Faces Challenges Amid Market Turbulence And Legal Issues": -0.6,
  "The Zacks Analyst Blog Highlights Advanced Micro Devices, Goldman Sachs, Lam Research, AstroNova and Blue Dolphin": 0.5,
  "3 Stocks Estimated To Be Priced Below Value In December 2025": 0.1,
  "The Zacks Analyst Blog Highlights Micron, Applied Materials, Salesforce and Cisco Systems": 0.5,
  "Will AMD Be a Must-Own AI Stock in 2026?": 0.2,
  "Baker Hughes Announces Dates for Fourth-quarter and Full-year 2025 Earnings Release and Webcast": 0.0,
  "Micron Technology Bear Put Spread Could Return 197% in this Down Move": 0.8,
  "These 4 Measures Indicate That Analog Devices (NASDAQ:ADI) Is Using Debt Safely": 0.6,
  "Nvidia takes $5 billion stake in Intel under September agreement": 0.5,
  "Stocks Down Pre-Bell as Year-End Approaches": -0.5,
  "3 Medical Instrument Stocks to Counter Industry Woes Using GenAI": 0.2,
  "Latest News In Digital Payment - AI Transforming E-Commerce Across Asia-Pacific Markets": 0.5,
  "Will Intel Shock the World in 2026?": 0.5,
  "Here Are Monday’s Top Wall Street Analyst Research Calls: Doximity, KB Home, NVIDIA, Okta, On Holdings, Take-Two Interactive, Vail Resorts, and More": 0.2,
  "What Are Companies Actually Doing With AI? Our Reporters Talk It Out": 0.0,
  "Those who invested in Autodesk (NASDAQ:ADSK) three years ago are up 61%": 0.5,
  "Palantir Stock: Why Poolside, Cursor, Sierra Will Pressure Software Incumbents": 0.2,
  "Strategy reloads on bitcoin, acquires a further 1,229 BTC for $109 million": 0.8,
  "Celsius Holdings Bets on Brand Synergies to Drive Long-Term Scale": 0.5,
  "Why Amazon stock could have nearly 50% upside in 2026": 0.8,
  "Western Digital and Seagate Were 2025’s Surprise AI Winners. 7 Stocks That Could Shock in 2026.": 0.5,
  "An Actively Managed AI ETF Put 18% Into Two Chip Giants Just Ahead of Massive Infrastructure Buildout": 0.5,
  "AI Stocks Face 'Show Me' Moment: Why OpenAI's Success Or Failure Is Key": 0.2,
  "Amazon shelves commercial drone delivery roll-out in Italy after review": 0.1,
  "If You Invested $1000 in Lam Research a Decade Ago, This is How Much It'd Be Worth Now": 0.5,
  "Here's How Much a $1000 Investment in Atlassian Made 10 Years Ago Would Be Worth Today": 0.5,
  "Here's How Much You'd Have If You Invested $1000 in Micron a Decade Ago": 0.5,
  "Macy's and ADT have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Hidden Gem Stocks to Love at the End of the Year": 0.6,
  "REITs Should Bounce Back in 2026. 3 Stocks to Consider Buying Now.": 0.5,
  "Trappist Monks Sell Colorado Monastery Near To Palantir CEO For Record $120M": 0.5,
  "Should You Be Confident in Vertex Pharmaceuticals Incorporated’s (VRTX) Long-Term Outlook?": 0.2,
  "Verisk Ends Effort to Acquire AccuLynx": 0.0,
  "NVDA: Nvidia Takes 4% Stake in Intel With $5 Billion Buyout": 0.8,
  "BKR Secures Multi-Year Contract in Kuwait for Production Enhancement": 0.6,
  "Ranking the Best \"Magnificent Seven\" Stocks to Buy for 2026. Here's My No. 3": 0.5,
  "Amazon Tipped by Evercore ISI to Outperform in 2026": 0.6,
  "Intel Sells $5 Billion Stake to Nvidia in Private Deal": 0.5,
  "Nvidia AI Strategy to be Key Investor Focus at CES Tech Show, Wedbush Says": 0.5,
  "Nutriband Inc. Signs Agreement to Sell Majority Stake of Subsidiary Pocono Pharmaceutical for $5M USD to EarthVision Bio": 0.5,
  "Advanced Micro Devices, Inc. (AMD) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Amgen Inc. (AMGN) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Is Most-Watched Stock Datadog, Inc. (DDOG) Worth Betting on Now?": 0.2,
  "Warner Bros. Discovery, Inc. (WBD) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "QUALCOMM Incorporated (QCOM) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Investors Heavily Search PDD Holdings Inc. Sponsored ADR (PDD): Here is What You Need to Know": 0.5,
  "2025's Biggest Market Bets Deliver Wins, Wipeouts and Sharp Reversals": 0.5,
  "Exchange-Traded Funds, Equity Futures Lower Pre-Bell Monday as Investors Await Fed Minutes": -0.2,
  "Can These 2025 Stock Market Winners Keep Winning?": 0.2,
  "Strong Results, Softer Outlook: What’s Next for Adobe Inc. (ADBE)?": 0.5,
  "After a 4x Surge, Is There Anything Left to Gain in Western Digital Corporation (WDC)?": 0.2,
  "Why Analysts Are Split on Cisco Systems, Inc. (CSCO)": 0.0,
  "Why Workday, Inc. (WDAY) Continues to Attract Buy Ratings": 0.6,
  "Analysts Watch QUALCOMM Incorporated (QCOM)’s Expanding AI Data Center Footprint": 0.5,
  "I’m bullish on AI… just not at any price - I’m still long AI overall. I’m not betting against NVDA, MSFT, or the space in general. But I think it’s fair to separate two things: 1) the technology 2) the price we’re paying for it AI demand is real. The spending is real. The use cases will keep expanding. What gives me pause is valuation expectations. Right now the market seems to assume: margins stay": 0.5,
  "Seagate vs. Western Digital: Which Storage Stock is the Better Buy Now?": 0.5,
  "Bitcoin Falls to $88K Strategy Pours Another $108M Adding 1,229 BTC": 0.2,
  "AppLovin Corporation (APP) Delivered Exceptional Gains in Q3": 0.8,
  "Lam Research Corporation (LRCX) is Benefitting from Cyclical Demand": 0.5,
  "Medical Care Technologies (OTC PINK:MDCE) Achieves Global Distribution Approval from Apple's iOS App Store": 0.8,
  "Is Marvell (MRVL) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "SoftBank acquiring DigitalBridge for $4B, Lululemon proxy fight": 0.2,
  "Nvidia completes $5B purchase of shares from Intel - NVDAhas completed its $5 billion stock purchase from INTC. The agreement also includes joint development of PC and data center chips by NVDA and Intel. This historic collaboration tightly integrates NVDA AI and accelerated computing technology stack with Intel's CPUs and vast x86 ecosystem a fusion of two world class platforms. NVDA CEO Jensen Huang stated: “We will work together to expand the ecosystem and lay": 0.8,
  "Michael Saylor Once Mirrored Warren Buffett And 'Dr Doom' While Predicting Bitcoin's 'Days Are Numbered' — It Was A 'Big Mistake'": -0.6,
  "Is Ross Stores (ROST) Stock Outpacing Its Retail-Wholesale Peers This Year?": 0.5,
  "Is IDEXX Laboratories (IDXX) Stock Outpacing Its Medical Peers This Year?": 0.2,
  "MU is a classic cyclical stock whose share price revolves around memory prices. - Core Drivers: DRAM and NAND price cycles, inventory depletion pace, and AI servers' structural demand for high end storage. Common Misjudgments: Chasing valuations with growth stock perspectives, focusing solely on financial reports while ignoring pricing and inventory. One Sentence Conclusion: The main theme is the price cycle don't let sentiment sway you. I personally remain invested. What's your take on MU?": 0.2,
  "Do Options Traders Know Something About Exelon Stock We Don't?": 0.2,
  "What to Expect From Roper Technologies' Next Quarterly Earnings Report": 0.2,
  "Bitmine's ether stash tops 4.1 million tokens as crypto and cash holdings reach $13.2 billion": 0.8,
  "Bitcoin Could Rally Past $94K But Needs Real Volume First, Says QCP": 0.5,
  "Quantum computing works — now investors will see if the stocks do too": 0.5,
  "Strategy Inc. (MSTR) Bolsters Bitcoin Holdings as Analysts Stay Positive": 0.8,
  "Wall Street Firms Bullish on Similarweb Ltd (SMWB) on Improving Industry Trends": 0.8,
  "Nvidia Stock Slips as Groq Deal Raises Questions": -0.5,
  "Tesla Stock Defied the Odds in 2025. Can It Do It Again in 2026?": 0.5,
  "Figma vs. Autodesk: Which Design SaaS Stock is a Safer Bet?": 0.2,
  "nvidia taking a $5b stake in intel feels like a consolidation move nobody saw coming. what does this mean for the chip sector long term? - so i just saw that nvidia completed a $5 billion stock purchase in intel. this is wild because these two have been competitors for decades and now nvidia is literally a shareholder in intel. i work in tech (software dev in malaysia, been following chip sector closely because of": 0.5,
  "Does Lam Research Corporation (LRCX) Have an Attractive Valuation?": 0.5,
  "Strategy Snaps Up $109 Million Worth of Bitcoin After Week-Long Dry Spell": 0.5,
  "Artisan Value Fund’s Conviction Remains Strong on ASML (ASML). Here’s Why": 0.6,
  "GATX, Brookfield complete buy of Wells Fargo rail leasing": 0.5,
  "Do you see Micron transitioning from a cyclical stock to a structural AI growth name? - MU has been strong recently and the move has clearly been driven by improving fundamentals rather than just sentiment. From what we’ve seen so far Micron appears to be benefiting meaningfully from AI related memory demand particularly around HBM. The progress on HBM3E and early HBM4 sampling suggests MU may be executing well relative to peers especially in terms": 0.6,
  "Take the Zacks Approach to Beat the Markets: Castle Biosciences, Hamilton Insurance & Monster Beverage in Focus": 0.5,
  "Six years of savings as tuition. - I got into the stock market back in 2019. At first, I was only putting in small amounts. After getting stuck in a few losing positions, I kept averaging down and eventually worked my way back to breakeven. By 2020, I didn’t just recover I actually made over 50 grand. Honestly, if the story ended right there, that would’ve been perfect But once I tasted those speculative gains,": 0.6,
  "Strategy Adds 1,229 BTC as Schiff Questions Funding Source": 0.2,
  "That 'Would've Been A Big Mistake' — Sergey Brin Says Of Staying Retired After Feeling He Was 'Spiraling' Outside Google's AI Race": 0.2,
  "Strategy buys 1,229 bitcoin funded by $108.8M MSTR issuance": 0.5,
  "Just 16% Profit? Peter Schiff Challenges Strategy’s Billion-Dollar Bitcoin Bet": -0.5,
  "Nvidia Closes $5 Billion Purchase of Intel Shares": 0.5,
  "Crypto winter looms in 2026, but Cantor sees institutional growth and onchain shifts": 0.2,
  "Disney vs. Comcast: Which Media Giant Has Better Upside Potential?": 0.5,
  "Chip sales could top $1T in 2026. Is Nvidia still top AI play?": 0.5,
  "Stocks Head Lower as Tech and Metal Rallies Reverse Course": -0.5,
  "Can Microsoft Stock Rally on Dynamics 365 Business Applications?": 0.5,
  "Amazon And These Two Stocks Are Analyst's Top Picks With 'Resilient' Consumer Demand": 0.8,
  "Why BellRing Brands (BRBR) Shares Are Falling Today": -0.5,
  "Nvidia finalizes its roughly 4%, $5 billion stake in Intel": 0.5,
  "Xcel Energy Expands Giving, Supports Communities and Nonprofits in 2025": 0.6,
  "Alibaba, JD.com, Temu Parent PDD Stocks Fall. Why Chinese Names Are Under Pressure.": -0.6,
  "CRDO vs. MRVL: Which Data Center Connectivity Stock Is Smarter Pick?": 0.5,
  "Take-Two Stock Has Been Hurt by GTA 6 Delays. Bet on a 2026 Hit, Analyst Says.": -0.6,
  "StoneCo vs. PayPal: Which Fintech Stock Has More Upside Potential?": 0.5,
  "Arkansas Children's Receives Historic $50 Million Gift from Philanthropist B. Thomas Golisano": 0.8,
  "Is Palantir Stock a Buy Now?": 0.0,
  "The S&P 500 Is Too Exposed To Big Tech, Time To Buy JPMorgan’s Mid Cap Equity ETF Instead": 0.2,
  "NEE vs. CEG: Which Energy Stock Has a Better Prospect in 2026": 0.5,
  "Can Strong Platform Revenues Support Further Upside in Roku Stock?": 0.5,
  "A Less-Costly Way to Buy Costco to Gain Leveraged Upside in COST Stock": 0.5,
  "Could These 3 \"Recession-Proof\" Dividend Stocks Surge 100% by 2031?": 0.5,
  "Tom Lee’s BitMine Eyes $1 Million-Per-Day Ethereum Yield: What Needs to Line Up for MAVAN to Deliver": 0.2,
  "$EOSE : Sleeping Giant, lithium alternative. - **EoS Energy** : company that manufactures Zinc based battery storage systems, that are made in the US. Znyth Z3 Systems are best suited for AI/Hyperscale BESS, Long duration back up. The product is not thermal heavy, does not require cooling( massive cost saving/development). Longer life cycle(further cost saving). 1/4 of $EOSE pipeline is tied to data centers, best fast response alternative to outdated diesel generators and more cost": 0.8,
  "Cybersecurity: The innovation and worries around agentic AI": 0.5,
  "Pre-Market In Red": -0.5,
  "Apple Is Likely to Return to Double-Digit Revenue Growth in Fiscal 2026 -- and the Stock Looks Like a Buy": 0.8,
  "AMD stock faces its next big test in 2026": 0.0,
  "Morgan Stanley Names Seagate (STX) Core 2026 Selection as Cloud Capex Spending Gains Momentum": 0.6,
  "AVGO double in the next 5 years? - I’m considering investing in AVGO, but I’m a bit cautious about its current valuation. The company holds a strong position in semiconductors and 5G, with growth driven by increasing demand. However, for the stock to double in 5 years, Broadcom needs to keep innovating and expanding its market share. While its finances are solid, the valuation is already pretty high. Do you think it can continue growing": 0.2,
  "Low Volatility In Palantir Stock Sets Up This Options Strangle": 0.1,
  "Amazon Named Evercore ISI's Top Large-Cap Internet Pick for 2026": 0.6,
  "Why 2025’s Wild Ride Proves You Should Just Buy SPY and Chill": 0.5,
  "This 1 Cheap Quantum Computing Stock Could Be a Top Buy for 2026": 0.6,
  "Opinion: AMD Will Be the Semi Play to Beat in 2026": 0.8,
  "US Equity Indexes Decline in Midday Trading": -0.7,
  "PayPal Stock Trades Below Industry P/E: How to Play the Stock?": 0.2,
  "Billionaires Dump the Magnificent Seven and Load Up on These Stocks": 0.5,
  "Nvidia’s Stock Is Cheaper Than Intel’s and AMD’s. Here’s Where I See It in 2026": 0.5,
  "Strategy Buys $109 Million in Bitcoin": 0.5,
  "3 Promising Growth Companies With Insider Ownership Up To 14%": 0.5,
  "Amazon Gets Bullish 2026 Call From Evercore": 0.6,
  "Hasbro And 2 Other Stocks That May Be Priced Below Their Estimated Value": 0.2,
  "Snowflake Stock Earns Relative Strength Rating Upgrade To 81": 0.6,
  "The Netflix-Paramount saga caps a 2025 turning point, S&P says: Cable TV is in the ‘decline stage,’ with a long, slow bleedout ahead": -0.6,
  "Alphabet Isn’t a Search and Ad Company Anymore. Now It’s Valued Like an AI Stock": 0.5,
  "Wells Fargo Reaffirms Overweight on Apple as China iPhone Sales Surge": 0.8,
  "Jeff Bezos Warns: Do This Before Starting a Company in Your 20s": 0.2,
  "Is Micron Technology a Good Value in this Economy?": 0.5,
  "S&P 500 Slips From Record High as Tech Stocks Fall Ahead of Year-End": -0.5,
  "Apple Stock In Focus -- Wells Fargo Keeps 'Overweight' Rating Ahead of 2026": 0.5,
  "An Early Look at Michael Burry’s Bets Against Nvidia and Palantir": -0.5,
  "Forget High‑Risk AI Penny Stocks: This Established AI Leader Is a Safer Long‑Term Bet": 0.6,
  "Marriott hotel cracks down on perk many expect": -0.5,
  "1 Forever Stock I'll Hold for Dear Life": 0.8,
  "Does Sandisk Corp. (SNDK) Stand Out Among 2025 Spin-Offs?": 0.2,
  "Analysts Remain Split on Solstice Advanced Materials (SOLS) Despite Expansion Investments": 0.1,
  "Amazon Data Centers Aren’t Raising Your Electric Bills—They May Be Lowering Them": 0.8,
  "Could oil stocks become an unlikely AI play in 2026?": 0.2,
  "Risk Topography Signals a Contrarian Opportunity for Microchip (MCHP) Stock Options": 0.5,
  "Investor Kevin O'Leary Says Movie Theaters Are Not Dead — 'The Only Restraining Aspect of Content Consumption is How Many Hours People Are Awake'": 0.6,
  "Sector Update: Tech Stocks Fall Monday Afternoon": -0.5,
  "Consumer Discretionary, Technology Push US Equity Indexes Lower": -0.5,
  "North America Drops 64 Rigs Week on Week": -0.5,
  "1 Unstoppable Stock That Could Join Nvidia, Alphabet, Apple, and Microsoft in the $3 Trillion Club in 2026": 0.8,
  "Top Research Reports for Apple, Cisco & IBM": 0.0,
  "Is PepsiCo's Margin Outlook Improving Despite Tariff Cost Pressures?": 0.2,
  "The Top-Performing S&P 500 Stock in 2025 Was This 1 Unexpected Company": 0.5,
  "2025 was the year AI got a vibe check": 0.2,
  "Creator Capital Markets: How Pump.fun Changed Streaming in 2025": 0.5,
  "MicroStrategy Was the Worst Performing Nasdaq-100 Stock in 2025. Should You Buy the Dip?": -0.6,
  "I analyzed all of Trump's Truth posts (over 23,000!) and how they affected the market. - For each post, I used AI to analyze sentiment and predict relevant tickers. Then I cross-referenced it with data from Polygon.io. I compared the price 1 minute after the post and then 45 minutes later. Here’s the 5 posts with the biggest bullish impact: 1) The famous U.S. Steel partnership post. It's pretty long and I wanted to link": 0.6,
  "Should You Buy, Sell, or Hold the Top 3 S&P 500 Stocks of 2025?": 0.2,
  "Down 40%, This Growth Stock Could Be Set for a Recovery in 2026": 0.5,
  "AI chipmakers that could steal some of Nvidia's spotlight in 2026": 0.2,
  "US Equity Indexes Drop, Silver Turns Volatile in Final Leg of Trading": -0.5,
  "Why anchoring 2026 portfolios in Big Tech and cybersecurity is the way to go": 0.5,
  "Palantir Stock Is Up 145% in 2025. What The Data Tells Us to Expect for the New Year.": 0.5,
  "Equity Markets Fall Intraday as Nvidia, Tesla Drop": -0.7,
  "AMD Stock Is Up 78% in 2025. What to Expect for Shares in 2026... and Beyond": 0.8,
  "MU just hit another all time high fundamentals or pure momentum at this point? - Micron Technology quietly pushed to a fresh ATH again today, and what’s interesting is… there wasn’t really a single new headline behind it. Feels like a few things are stacking up: AI memory demand (HBM / DRAM) still looks very real Last earnings + guidance shifted sentiment hard Once MU cleared resistance, momentum kind of fed on itself That said": 0.5,
  "Intel Stock Had a Banner Year But Is Still 50% Off Its Record Highs. Are More Gains in Store for 2026?": 0.5,
  "Why 2026 could be Waymo's year": 0.5,
  "2026 Big Tech Quantum Bets: IBM and Amazon's Edge Over Pure-Plays?": 0.2,
  "Why Tesla (TSLA) Shares Are Trading Lower Today": -0.5,
  "MongoDB, AppLovin, and SoundHound AI Stocks Trade Down, What You Need To Know": -0.5,
  "Union Pacific–Norfolk Southern Merger Targets Trucking Market Share": 0.1,
  "Micron Stock Stole the Show in 2025. Options Data Says It Will Trade at These Levels in 2026.": 0.5,
  "Buy Stock in the Mag 7 Hyperscalers or Are They Spending Too Much?": 0.2,
  "Dogs of the Dow Had a Strong Year. Here Are the 10 Stocks for 2026.": 0.6,
  "Netflix vs. Spotify: Which Streaming Giant Is Poised for a Comeback in 2026?": 0.2,
  "Why One Fund Ditched Viper Energy in a $12 Million Exit Amid a 20% Stock Slide": -0.6,
  "Costco's 2025: 3 Things Investors Should Know Heading Into the New Year": 0.5,
  "Dan Ives Is Betting on Cyber-AI for 2026. 1 Stock to Load Up on Now.": 0.5,
  "What could end up being Walmart's biggest 2026 tailwind": 0.5,
  "Alphabet Stock’s 2025 Rebound Has Wall Street Betting on More Gains": 0.8,
  "The Silver Surge Is Giving Jewelers a New Headache": -0.5,
  "Sector Update: Tech Stocks Softer Late Afternoon": -0.5,
  "Sector Update: Consumer Stocks Mixed Late Afternoon": 0.0,
  "S&P 500 Drops. The Market Is Headed for a Risk-Off New Year.": -0.7,
  "Stock market today: Dow, S&P 500, Nasdaq slip as Santa Claus rally stumbles amid Nvidia, Tesla slide": -0.5,
  "Amazon to halt Italy drone delivery plans, Eightco stock pops": 0.2,
  "Silver Surges and Then Slumps. How ‘Index Rebalancing’ Could Lead to More Wild Swings.": 0.1,
  "Nvidia officially invests $5B in Intel: What's next for the chip giant?": 0.2,
  "Top Stock Picks for Week of December 29, 2025": 0.0,
  "'Grand Theft Auto' Game Publisher Is A Steal, Analyst Says": 0.6,
  "These Stocks Moved the Most Today: Nvidia, Tesla, Newmont, DigitalBridge, Praxis Precision, Ultragenyx, and More": 0.2,
  "Stock Market Today: Dow Loses Nearly 250 Points As Nvidia Falls; Precious Metal Stocks Hammered (Live Coverage)": -0.6,
  "US Equity Markets Fall as Materials, Consumer Discretionary Lead Declines": -0.6,
  "Nvidia-Groq deal is a $20B bet on 'deterministic processing'": 0.5,
  "Quantum Computing Stocks: Profit-Taking Looms Amid 2025 Roller Coaster": 0.1,
  "Tesla, These Mining Giants Are S&P 500's Biggest Losers Monday": -0.6,
  "This Company Just Announced Long-Term Contracts For Nuclear Power Amid Rosy Outlook For This Commodity": 0.8,
  "Big Moves On The Horizon For Tesla Stock As These Two Deadlines Loom": 0.5,
  "Tim Cook's Nike Buy, AI Smart Glasses, Court Victory And More: This Week In Appleverse": 0.5,
  "Symbotic (SYM) The AI Warehouse as a service company valued as a pure play robotics company - Opinion: Symbotic’s future growth valuation is not taking into account its 35% stake in Green Box, an AI warehouse as a service business. Currently Symbotic is viewed as a pure play robotics company, simply supplying its AI robotics system to companies such as Walmart and Target. Symbotic’s AI robotics system is the only rival to Amazon’s system, which": 0.5,
  "Stocks to Watch Monday Recap: Lululemon, Newmont, DigitalBridge": 0.5,
  "US Equities Fall in Muted Trading as Nvidia, Tesla Decline": -0.5,
  "2 Billionaires Just Loaded Up on Microsoft Stock. Do They Know Something We Don't for 2026?": 0.5,
  "Argo Corporation Announces Investment by TheVentureCity": 0.5,
  "Nvidia Is Ending the Year With Deals": 0.5,
  "US Equity Indexes Drop Amid Declines in Technology, Consumer Discretionary": -0.6,
  "1 Incredible Reason to Buy Nvidia Stock Before Feb. 25": 0.8,
  "Stock Market Today, Dec. 29: Nio Rises on CEO Forecast for Over $4 Billion in Fourth Quarter Vehicle Sales": 0.8,
  "Stock Market Today, Dec. 29: Stocks Slide as Investors Lock In Gains": -0.6,
  "The Case of the $400,000 Massachusetts Lobster Heist": -0.5,
  "Dow Jones Futures: AppLovin, Nvidia, Palantir, Tesla Slide During Stock Market Drop": -0.5,
  "Could This Underrated AI Stock Be the Best Growth Story of 2026 and the Next Decade?": 0.6,
  "Meta acquires Manus to expand AI agent capabilities": 0.5,
  "Meta to buy Chinese startup Manus to boost advanced AI": 0.5,
  "White House Advisor David Sacks Hints At Leaving California Over 'Confiscation Of Net Worth'": -0.6,
  "Cloudhands™ Announces Upcoming Unified Al Platform Launch and New Executive Leadership": 0.5,
  "Tech Stocks Aren't Always The Answer": -0.5,
  "What's next for Palantir stock in 2026?": 0.0,
  "After a Year of Blistering Growth, AI Chip Makers Get Ready for Bigger 2026": 0.8,
  "Agoda Spotlights Unique Ski Destinations in Asia for the 2026 Winter Ski Season": 0.5,
  "Asia Market Open: Bitcoin Holds $87k As Asia Rally Stalls, Wall Street Tech Slips": 0.1,
  "Nvidia, in the Last Days of 2025, Just Made a Game-Changing Move": 0.8,
  "Rocket Lab, Micron, And CoreWeave Are Among the Top 10 Large-Cap Gainers Last Week (Dec. 22-Dec. 26): Are the Others in Your Portfolio?": 0.2,
  "Marvell (MRVL)’s CEP is Very Humble, Says Jim Cramer": 0.6,
  "Jim Cramer is Enthusiastic About Honeywell (HON) Split": 0.8,
  "Jim Cramer Says Costco (COST) Needs to Improve Its Messaging": 0.1,
  "Weekend Round-Up: XPeng's Middle East Expansion, China's EV Energy Limits, Waymo's Service Pause, Holiday Travel Chaos And Tesla's European Decline": 0.1,
  "Why This \"Magnificent Seven\" Stock Is 1 of My Top Dividend Stock Ideas for 2026 and Beyond": 0.8,
  "Alphabet vs. Microsoft: Better AI Stock to Own in 2026?": 0.2,
  "Meta Buys AI Startup Manus for More Than $2 Billion": 0.5,
  "Is Gilead Sciences (GILD) An Affordable Healthcare Stocks to Invest In?": 0.2,
  "Citi Lowers PT on Strategy Inc (MSTR), Here’s Why": -0.5,
  "Here’s What Wall Street Think About Atlassian Corporation (TEAM)": 0.1,
  "Benchmark Co. Maintains a Hold Rating on Marvell Technology (MRVL)": 0.0,
  "Wall Street Bullish on Advanced Micro Devices (AMD), Here’s Why": 0.8,
  "NVIDIA Corporation (NVDA) Aims to Starts Shipping Chips to China Soon": 0.5,
  "Broadcom Inc. (AVGO) up 51% YTD, Wall Street Still Sees 31% Upside": 0.8,
  "Microsoft Corporation (MSFT) Announces Availability of Xbox Cloud Gaming": 0.5,
  "Here’s What Colin Sebastian of Baird Thinks About Meta Platforms (META)": 0.2,
  "~$36k investment ideas - Medium/Long Term - Hello everyone, I have about $36k of liquid cash I wanna invest for 2-3x growth in the next two years. Wanted to run my breakdown below to see what you think about some/many/all of these based on your experience/knowledge/analysis and understanding of the future of these companies and their fundamentals and business. Ones that say Non-stock will be the top crypto I'll allocate it to. Any thoughtful insights": 0.2,
  "Meta just bought Manus, an AI startup everyone has been talking about": 0.6,
  "Strategy and Other Crypto Treasury Stocks Face a Dangerous Spiral. How They Can Break It.": -0.5,
  "China’s Rich Are Repricing Property Against Bitcoin — and Housing Is Losing": -0.5,
  "OpenAI Wants Another $100 Billion": -0.5,
  "Meta acquires intelligent agent firm Manus, capping year of aggressive AI moves - https://www.cnbc.com/2025/12/30/meta-acquires-singapore-ai-agent-firm-manus-china-butterfly-effect-monicai.html Meta said the acquisition was aimed at boosting automation across consumer and business products. Manus will continue operating its subscription service after the acquisition, with no deal terms disclosed. The deal highlights Meta’s rapid push to secure AI talent and technology.": 0.8
}