{
  "Old Dominion Freight Line (ODFL) Valuation Revisited As Analyst Optimism And Sector Rotation Gain Pace": 0.5,
  "[Latest] Global Thin-film Electrode Market Size/Share Worth USD 1,595.3 Million by 2035 at a 11.8% CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trends, Forecast, Segmentation, Growth Rate, Value, SWOT Analysis)": 0.5,
  "The Zacks Analyst Blog Highlights GE Aerospace, KLA, Parker-Hannifin and Affinity Bancshares": 0.5,
  "Grubhub parent acquires restaurant rewards app Claim": 0.2,
  "Here's What to Expect From Copart’s Next Earnings Report": 0.2,
  "Crestline Adds Two Marriott Branded Orlando Hotels to its Growing Portfolio": 0.5,
  "At US$317, Is It Time To Put Cadence Design Systems, Inc. (NASDAQ:CDNS) On Your Watch List?": 0.5,
  "A Look At Regeneron Pharmaceuticals (REGN) Valuation After Recent Share Price Momentum": 0.5,
  "After a Lousy 2025, Can Theme Park Stocks Bounce Back in 2026?": 0.1,
  "What to Expect From Keurig Dr Pepper's Q4 2025 Earnings Report": 0.1,
  "LoyaltyLion launches AI Campaigns to help Shopify brands drive more loyalty revenue": 0.5,
  "Fastenal: Q4 Earnings Snapshot": 0.0,
  "Diamondback Energy Earnings Preview: What to Expect": 0.0,
  "A Look At Take Two Interactive Software (TTWO) Valuation After Recent Share Price Weakness": 0.2,
  "Bear Of The Day: Charter Communications (CHTR)": 0.0,
  "Fastenal (NASDAQ:FAST) Posts Q4 CY2025 Sales In Line With Estimates": 0.5,
  "Baker Hughes CEO Lorenzo Simonelli Outlines the Energy Reality of 2026": 0.2,
  "Legal AI startup Ivo raises $55 million in latest funding round": 0.8,
  "Stocks Fall as Investors Assess Trump's Tariff Announcement, Await Earnings": -0.5,
  "ADP National Employment Report Preliminary Estimate December 27, 2025": 0.0,
  "Should You Be Excited for Regeneron (REGN)?": 0.5,
  "Paychex Expands Board of Directors, Appoints New Member": 0.5,
  "BrightInsight Announces Multi-Million Dollar Strategic Investment to Advance its AI-Enabled Medication Persistence and Adherence Solutions": 0.8,
  "Are Options Traders Betting on a Big Move in Verisk Analytics Stock?": 0.2,
  "BrightInsight Strengthens Executive Leadership Team with Three Key Hires to Accelerate Global Growth and Innovation": 0.8,
  "Exchange-Traded Funds, Equity Futures Lower Pre-Bell Tuesday Amid Renewed Tariff Threats": -0.5,
  "Gauge Capital Announces Strategic Growth Investment in Ecosystems": 0.5,
  "Tapatio hot sauce acquired by private equity firm": 0.2,
  "Traders Digest Trump's Greenland Demands, US Equity Futures Down Pre-Bell": -0.2,
  "Worried About the Economy? Invest In These Quality Stocks": 0.5,
  "Is This Dividend Stalwart Signaling a Tough Economy in 2026?": -0.6,
  "SPECTRUM TO AWARD $1 MILLION IN 2026 SPECTRUM DIGITAL EDUCATION GRANTS": 0.5,
  "Buy the pullback in this chip stock: Mizuho": 0.5,
  "CRWD vs. CSCO: Which Cybersecurity Stock Has an Edge Right Now?": 0.2,
  "AI Darling to Crime World Laundromat? AppLovin Tanks on Short-Seller’s Bombshell Report": -0.5,
  "Comcast’s Universal Ads Appoints David Shaw as Head of Global Expansion to Oversee Platform's International Rollout": 0.5,
  "Bloom Energy (BE) Valuation Check After US$2.65b AEP Fuel Cell Deal And Growth Partnerships": 0.2,
  "Cintas Corporation (CTAS): A Bull Case Theory": 0.5,
  "Fastenal Fourth-Quarter Sales Miss Street Views Amid Sluggish Industrial Production": -0.6,
  "AMAT vs. ASML: Which Semiconductor Equipment Stock is a Better Buy?": 0.5,
  "Workday, Inc. (WDAY): A Bull Case Theory": 0.5,
  "Axon Enterprise Earnings Preview: What to Expect": 0.0,
  "Arm Holdings Stock is Down 43%. It’s an Underrated Play on Physical AI": 0.2,
  "SPECTRUM LAUNCHES WIFI 7 EXTENDERS FOR WHOLE-HOME CONNECTIVITY": 0.5,
  "Jim Cramer Says the “Big Five Travel” Including United Airlines “Are All Terrific”": 0.8,
  "Shopify Poised to Have 'Solid' Q4 on Strong Growth Momentum, RBC Says": 0.8,
  "Nonprofit Health Services Organization Files Lawsuit Against Fortune 500 Pharmaceutical Company Over Prescription Drug Access": -0.5,
  "Fastenal Q4 Earnings & Sales Meet Expectations, Stock Down": -0.2,
  "CrowdStrike Announces New Regional Clouds to Expand Secure Data Sovereignty": 0.5,
  "Fastenal Q4 Earnings Call Highlights": 0.0,
  "Why Is AppLovin Down Today? CapitalWatch Short Report Hits Stock": -0.6,
  "Teradyne vs. KLAC: Which AI Infrastructure Stock Is the Better Buy?": 0.5,
  "AI Needs Power Now—Bloom Energy and American Electric Power Deliver": 0.5,
  "Where Will Constellation Energy Be in 3 Years?": 0.1,
  "Workday pledges CAD $1 billion expansion in Canadian tech sector": 0.8,
  "Why Shopify (SHOP) Stock Is Down Today": -0.5,
  "Pegasystems and Cadence Design Systems Shares Are Falling, What You Need To Know": -0.5,
  "AI & Business Newsletter | Will AI Really Kill Software?": 0.2,
  "Why CrowdStrike (CRWD) Stock Is Down Today": -0.5,
  "Can an Expanding Portfolio Help Microchip Stock to Rise in 2026?": 0.2,
  "Unity Software Is Falling—So Why Are Pros Getting More Bullish?": 0.5,
  "ServiceNow Teams Up With OpenAI in Three Year AI Integration Deal": 0.6,
  "CrowdStrike Expands Regional Cloud Footprint": 0.5,
  "The Best Stocks to Buy With $500 Right Now": 0.5,
  "Hospitality group with 260 hotels files for Chapter 11 bankruptcy": -0.8,
  "Goldman Sachs Raising Price Targets 10%+ on Tech and Financial Blue Chip Giants": 0.8,
  "3 Software Stocks to Sell Before AI Replaces Them Entirely": -0.8,
  "Autodesk (ADSK) Seen Outgrowing Its End Markets, Rothschild Rates Buy": 0.6,
  "PepsiCo (PEP) Upgraded to Overweight by JPMorgan After Initiatives to Boost Shareholder Returns": 0.8,
  "Cintas Corporation Announces Quarterly Cash Dividend": 0.0,
  "Assessing Electronic Arts (EA) Valuation As Shares Trade Slightly Above Narrative Fair Value": 0.2,
  "AEP Declares Quarterly Dividend on Common Stock": 0.0,
  "Himax, Broadcom, KLA Corporation, Impinj, and Qualcomm Stocks Trade Down, What You Need To Know": -0.5,
  "Vertex to Announce Fourth Quarter and Full Year 2025 Financial Results on February 12th": 0.0,
  "Fastenal Co (FAST) Q4 2025 Earnings Call Highlights: Strong Growth and Strategic Advancements ...": 0.8,
  "RBC Initiates Coverage on Marvell (MRVL), Cites 25% Valuation Discount to Peers": 0.5,
  "Datadog Announces Date of Fourth Quarter and Fiscal Year 2025 Earnings Call": 0.0,
  "Datadog Announces Upcoming Investor Day": 0.5,
  "Milan Kovac Joins DoorDash Board of Directors": 0.5,
  "Piper Sandler Raises Microchip (MCHP) Target to $85, Calls It Top Mid-Cap Pick": 0.8,
  "These AI Stocks Could Lead the Next Bull Market, and They Are Still Cheap": 0.8,
  "Synopsys Announces New Converge Conference, March 11-12, to Drive Intelligent Systems Innovation": 0.5,
  "Fastenal Stock Dives. What Earnings Say About U.S. Manufacturing.": -0.5,
  "These Stocks Are Today’s Movers: Nvidia, Netflix, Intel, Sandisk, 3M, Coinbase, Newmont, RAPT, Fastenal, and More": 0.5,
  "Why Constellation Energy Stock Tumbled on Tuesday": -0.5,
  "Palo Alto Networks (PANW) Stock Moves -1.92%: What You Should Know": -0.5,
  "Shopify (SHOP) Falls More Steeply Than Broader Market: What Investors Need to Know": -0.5,
  "Why CrowdStrike Holdings (CRWD) Dipped More Than Broader Market Today": -0.5,
  "Why the Market Dipped But Comcast (CMCSA) Gained Today": 0.2,
  "MercadoLibre (MELI) Stock Moves -1.94%: What You Should Know": -0.5,
  "Is Qualcomm (QCOM) Now Attractive After Recent Share Price Pullback?": 0.5,
  "Booking Holdings (BKNG) Stock Moves -1.74%: What You Should Know": -0.5,
  "Assessing AppLovin (APP) Valuation After Strong Annual Return And Recent Momentum Cooldown": 0.5,
  "Fastenal (FAST) Q4 Earnings: How Key Metrics Compare to Wall Street Estimates": 0.5,
  "(Item 5.07) below, Company stockholders approved an amendment to the Company’s Restated Certificate of Incorporation (the “Company Charter”) to provide for the elimination of certain officers’ personal liability for monetary damages stemming from breaches of the duty of care as permitted by Section 102(b)(7) of the General Corporation Law of the State of Delaware (the “Exculpation Amendment”). A Certificate of Amendment to the Company Charter (the “Certificate of Amendment”) effecting the Exculpation Amendment was filed with the\n\n(Item 5.07) . Submission of Matters to a Vote of Security Holders. At the Annual Meeting held on January 15, 2026, the following proposals were submitted to a vote of Company stockholders: Proposal 1 Each of the following nominees for Director were elected to serve on the Board of Directors of the Company. Each person elected as a Director will serve until the next annual meeting of stockholders or until such person’s successor is elected and qualified.": 0.1,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders On January 15, 2026, Costco Wholesale Corporation (the \"Company\") held its Annual Meeting of Shareholders. There were 443,957,682 shares of common stock entitled to be voted; 352,303,581 shares were voted in person or by proxy. Shareholders voted on the following matters: 1. The election of each of the directors nominated by the Board of Directors to hold office until the 2027 Annual Meeting of Shareholders\n\n(Item 8.01) . Other Events The Board of Directors declared a quarterly cash dividend on the Company's common stock of $1.30 per share. The dividend was declared on January 15, 2026, and is payable February 13, 2026, to shareholders of record at the close of business on January 30, 2026.": 0.2,
  "35% Stock Sell-Off: Should You Buy the Dip?": 0.5,
  "Agoda and Mastercard Collaborate to Modernize Loyalty Programs with Flexible Travel Rewards": 0.6,
  "Is American Electric Power (AEP) Fairly Priced After Recent Share Price Strength?": 0.2,
  "Assessing Shopify (SHOP) Valuation After Recent Share Price Weakness And Rich Earnings Multiple": 0.2,
  "Did O'Reilly's (ORLY) 401(k) Forfeiture Lawsuit Just Reframe Its Corporate Governance Investment Narrative?": 0.2,
  "Is Axon Enterprise (AXON) Still Attractive After Surging On Public Safety Tech Adoption?": 0.2,
  "Reassessing DoorDash (DASH) After Recent Share Price Pullback And Strong Multi Year Gains": 0.6,
  "Spotting Winners: Applied Materials (NASDAQ:AMAT) And Semiconductor Manufacturing Stocks In Q3": 0.5,
  "2 Reasons to Watch ROST and 1 to Stay Cautious": 0.5,
  "1 Consumer Stock on Our Watchlist and 2 We Question": -0.5,
  "3 Mid-Cap Stocks We Find Risky": -0.7,
  "A Look At Mondelez International (MDLZ) Valuation As Mixed Returns Contrast With DCF Upside": 0.2,
  "FAST Q4 Deep Dive: Digital Expansion and Key Account Growth Shape Outlook": 0.6,
  "Is Mondelez (MDLZ) Pricing Reflect Its Mixed Returns And Strong Cash Flow Outlook": 0.2,
  "Assessing O'Reilly Automotive (ORLY) Valuation After Recent Share Price Moves And Growth Signals": 0.5,
  "Is It Time To Reassess Cintas (CTAS) After Its Strong Multi Year Share Price Run?": 0.5,
  "Is Arm Holdings (ARM) Pricing Reflect Future Growth After Recent Share Price Weakness": 0.2,
  "Here’s What to Expect From Intuit’s Next Earnings Report": 0.2,
  "Assessing Arm Holdings (NasdaqGS:ARM) Valuation After Recent Share Price Weakness": 0.2,
  "Assessing Workday (WDAY) Valuation As High P/E Contrasts With DCF Suggesting Upside Potential": 0.5,
  "Is Airbnb (ABNB) At An Attractive Price After Recent Share Price Weakness": 0.5,
  "Comcast (CMCSA) Valuation Check As Universal Ads Taps David Shaw For Global Expansion": 0.2,
  "How Arm’s AI-Focused Reorganization Amid Valuation Questions At Arm Holdings (ARM) Has Changed Its Investment Story": 0.1,
  "DoorDash Could Be One of the Best Stocks for a K-Shaped Economy": 0.8,
  "Lutnick in the FT: \"We’re not going to Davos to uphold the status quo. We’re going to confront it head-on.\" - [Another delusional and unhinged op-ed in the FT from the Trump admin, this time from Secretary of Commerce Howard Lutnick](https://www.ft.com/content/a675b8af-46b7-4f93-a616-41f0a002c22e) >Every year in January, leaders gather in Davos, Switzerland, for the World Economic Forum to discuss the global economy. This year, some people have asked a great question: Why is the Trump administration going": -0.6,
  "Amgen (NASDAQ:AMGN) Has Announced That It Will Be Increasing Its Dividend To $2.52": 0.5,
  "US Stock Market Today S&P 500 Futures Rise As Rate Jitters Meet Soft Jobs": 0.2,
  "Is Datadog (DDOG) Pricing Look Interesting After Recent Share Price Weakness": 0.5,
  "What You Need To Know Ahead of Workday’s Earnings Release": 0.2,
  "AT&T Unleashes Turbo Live: The First and Only VIP Connection Specifically for Live Events": 0.8,
  "Fortune and Korn Ferry Reveal the Fortune World's Most Admired Companies™ 2026 List": 0.5,
  "Is It Time To Reassess Workday (WDAY) After Recent Share Price Weakness?": 0.2,
  "Truck Wars King Crowned: General Motors or Ford Motor Company?": 0.2,
  "Bernstein Remains Bullish on T-Mobile US (TMUS) Amid Changing Competitive Dynamics Across U.S. Telecom": 0.6,
  "Nvidia and Broadcom Look Attractive Again. Citi Names Top Chip Picks": 0.8,
  "Cathie Wood Opens New Stakes in VELO, SNPS": 0.5,
  "High Growth US Tech Stocks To Watch In January 2026": 0.5,
  "Corvus shares nearly triple on positive data for eczema pill": 0.8,
  "Synopsys' Q1 2026 Earnings: What to Expect": 0.0,
  "Verisk Analytics' Q4 2025 Earnings: What to Expect": 0.0,
  "Ocular Therapeutix™ Appoints David W. Robinson as Global Chief Commercial Officer": 0.5,
  "Keurig Dr Pepper Inc.'s (NASDAQ:KDP) Stock Been Rising But Financials Look Weak: Should Shareholders Be Worried?": -0.5,
  "Morgan Stanley confident this software stock could double in value": 0.8,
  "As risk skyrockets, current and former CFOs are in demand for audit committees": 0.5,
  "Amgen (AMGN) Expands Obesity Strategy With Ro Collaboration on GLP-1 Therapies": 0.5,
  "Assessing Airbnb (ABNB) Valuation As P/E And DCF Send Mixed Signals": 0.1,
  "PepsiCo CEO says sustainability debate needs a ‘reframe’ at Davos": 0.5,
  "Is IDEXX Laboratories Stock the Right Pick for Your Portfolio Now?": 0.2,
  "Microchip Introduces 600V Gate Driver Family for High-Voltage Power Management Applications": 0.5,
  "Vortex Energy Highlights 2025 Technical Milestones Across Project Portfolio and Announces Adjournment of AGM to February 13, 2026": 0.2,
  "Stellar Cyber Appoints Eric van Sommeren as Vice President of EMEA to Accelerate Regional Expansion": 0.8,
  "Ember LifeSciences appoints Ann Hyllengren as Chief Financial Officer": 0.5,
  "Here's Why We Think T-Mobile US (NASDAQ:TMUS) Is Well Worth Watching": 0.6,
  "CrowdStrike Endpoint Security Delivered Customers a 273% Return on Investment Over Three Years, with a Payback Period of Under Six Months": 0.8,
  "Wall Street's Wild Week": 0.5,
  "Here Are Wednesday’s Top Wall Street Analyst Research Calls: Alibaba, Applied Digital, ARM Holdings, FedEx, Flutter Entertainment, Ulta Beauty, and More": 0.2,
  "Adobe vs. Intuit: Which 52-Week Low Is a Buy?": 0.2,
  "Almost half of the time saved using AI is spent correcting outputs": -0.6,
  "Verisk to Announce Fiscal Fourth-Quarter 2025 and Full-Year 2025 Results on February 18, 2026": 0.0,
  "Fortinet price target lowered to $88 from $95 at Truist": -0.5,
  "AppLovin shares drop 5% premarket after cautious CapitalWatch report": -0.5,
  "Top 3 Cheap Stocks With Massive Upside Potential, According to WarrenAI": 0.8,
  "NLR ETF Climbs 75% in One Year as Uranium Miners Ride $100 Per Pound Breakout": 0.8,
  "Fiber/Small Cell Business Sale Sparks Confidence for Crown Castle (CCI)": 0.6,
  "Qualcomm Schedules First Quarter Fiscal 2026 Earnings Release and Conference Call": 0.0,
  "Cadence Unveils Tensilica HiFi iQ DSP Purpose-Built for Next-Generation Voice AI and Audio Applications": 0.5,
  "New Xfinity Store Opens in South DeKalb": 0.5,
  "Versa Named Global SD-WAN Leader by Frost & Sullivan": 0.5,
  "Is Now The Time To Look At Buying NXP Semiconductors N.V. (NASDAQ:NXPI)?": 0.5,
  "SoundHound AI Partners With Leading Technology Advisory Firm, Bridgepointe Technologies to Expand Enterprise AI Adoption": 0.5,
  "Biocom Announces Powerhouse Keynote Panel Featuring Heads of Discovery and Research & Development from AbbVie, Amgen and Eli Lilly at 2026 Global Partnering & Investor Conference": 0.8,
  "Gilead Sciences (GILD) Valuation Check After Recent Share Price Softness": 0.1,
  "ADP Named One of Fortune's Most Admired Companies™ for 20th Straight Year": 0.8,
  "How Evolving Analyst Targets Are Reshaping The Story For Axon Enterprise (AXON)": 0.2,
  "New Research Exposes Critical Gap: 64% of Third-Party Applications Access Sensitive Data Without Authorization": -0.8,
  "PDD Stock Pops After Smaller-Than-Expected China Tax Fine": 0.6,
  "Marvel and OREO Unite for a First-of-Its-Kind Collaboration: The MARVEL OREO Stuf of Legends Cookies": 0.6,
  "Brokers Suggest Investing in AppLovin (APP): Read This Before Placing a Bet": 0.2,
  "Arm upgraded, Flutter downgraded: Wall Street's top analyst calls": 0.1,
  "Consumer Staples Are Exploding Higher in 2026: Buy 5 High-Yielding Dividend Kings Now": 0.8,
  "Atlassian ($TEAM) stock - trading at the same price as in 2019... - So I've been watching Atlassian (**$TEAM**) stock for a while now and have personally decided to pull the trigger. If you don't know Atlassian, they're a software company who create productivity software and are massively used in the tech industry and in most companies that use Agile processes. Put it this way, I work in tech and the majority of companies I": 0.2,
  "Booking Holdings to Webcast Fourth Quarter and Full Year 2025 Financial Results on February 18": 0.1,
  "The Bull Case For PepsiCo (PEP) Could Change Following JPMorgan Upgrade And Global Restructuring Push": 0.6,
  "Can PANW's Secure Browser Adoption Support Long-Term SASE Growth?": 0.5,
  "What to Expect From Monster Beverage's Next Quarterly Earnings Report": 0.2,
  "Energy costs will decide which countries win the AI race, Microsoft’s Nadella says - Davos 2026 - Energy costs for AI data centers are projected to rise to 10-12% of \\*total\\* US electricity by 2030. That’s a massive jump. MSFT CEO said it really comes down to which country can reduce the cost of energy production. But, as a scarce resource, what’s the outlook on this. Companies are investing \\*\\*billions\\*\\* to build these infrastructures. I": 0.2,
  "Investment Manager Doubles Down on MercadoLibre With $51 Million Purchase": 0.8,
  "NVTS vs. ADI: Which Semiconductor Stock Should You Buy Right Now?": 0.2,
  "Adobe nabs CIO from Airbnb": 0.2,
  "MRVL vs. LITE: Which AI Connectivity Stock is a Safer Bet?": 0.2,
  "Xcel Energy a \"World's Most Admired Company\" for Twelfth Year": 0.8,
  "Marvell (MRVL) Upgraded to Buy: Here's What You Should Know": 0.6,
  "The Nuts and Bolts of Fastenal Earnings—And What Comes Next": 0.5,
  "Nation’s Top 40 High School Scientists to Compete for $1.8 Million in Awards at the Prestigious Regeneron Science Talent Search": 0.8,
  "ServiceNow vs. Adobe: Which Cloud Software Stock Has an Edge Now?": 0.2,
  "Looking At The Texas Instruments (TXN) Narrative After The Latest Price Target Reset": 0.2,
  "Is CrowdStrike (CRWD) Fairly Priced After Recent Pullback And Cybersecurity Spotlight": 0.5,
  "Assessing Datadog (DDOG) Valuation After Recent Share Price Weakness": 0.1,
  "Why Microchip Tech (MCHP) Might be Well Poised for a Surge": 0.6,
  "Why AppLovin (APP) Stock Is Nosediving": -0.7,
  "T-Mobile quietly makes cold move as loyal customers leave": -0.6,
  "US High Growth Tech Stocks To Watch In January 2026": 0.5,
  "UPS to build massive $6.1M cooler in Louisville. Here's what we know": 0.5,
  "A Look At Seagate Technology (STX) Valuation After Analyst Upgrades And AI Storage Progress": 0.5,
  "Xfinity Unveils New Membership Experience Packed With Exclusive Perks and Surprises": 0.8,
  "Adobe (ADBE) Valuation Check After Recent Share Price Weakness": 0.2,
  "GlobalFoundries Pushes Deeper Into AI Chipmaking, Hits 80-Plus RS Rating": 0.6,
  "Sandisk Rips Higher, Tops S&P 500": 0.8,
  "/C O R R E C T I O N -- Mondelēz International/": 0.0,
  "Did AI-Fueled Earnings Beats Just Shift Applied Materials' (AMAT) Semiconductor Toolchain Investment Narrative?": 0.1,
  "PDD Shares Rise After Shanghai Tax Authority Issues Small Fine": 0.5,
  "Nvidia, Broadcom, Micron Stocks Jump -- JPMorgan Flags as Top Chip Picks": 0.8,
  "Microsoft, Other Software Stocks Report Earnings Soon. Here’s How to Trade It.": 0.5,
  "The US markets where Airbnb listings are surging, and where they’re collapsing": 0.1,
  "Intel Poised for 'Slight' Quarterly Beat, In-Line Outlook, RBC Says": 0.5,
  "Seagate Rises After Upgrade, Higher Target": 0.6,
  "Arm Stock Jumps After Top Analyst Upgrade Price Target to $150": 0.8,
  "AppLovin denies money laundering claims following short seller report - Statement": -0.5,
  "Sector Update: Tech Stocks Climb Late Afternoon": 0.5,
  "Atlassian, The Trade Desk, and Bandwidth Shares Skyrocket, What You Need To Know": 0.5,
  "Datadog, Wix, 8x8, Akamai Technologies, and Asure Software Stocks Trade Up, What You Need To Know": 0.5,
  "Sector Update: Consumer Stocks Rise in Late Afternoon Trading": 0.5,
  "CECP Welcomed 20 Leading Companies to Coalition in 2025, Expanding Network of Corporate Purpose-Driven Leaders": 0.8,
  "US Equity Markets Rise After Trump Rules Out Using Force in Greenland Bid": 0.6,
  "Homes.com Report: 2025 Showed Continued National Home Price Appreciation But the First Year-Over-Year Improvement in Affordability Since 2020": 0.5,
  "1 Growth Stock Down 19% to Buy Right Now": 0.5,
  "These Stocks Are Today’s Movers: Intel, Netflix J&J, GameStop, Kraft Heinz, Schwab, and More": 0.5,
  "Wall Street Rebounds as Trump Calls Off Greenland-Related Tariffs": 0.8,
  "Stock Market Today: Dow, S&P Surge As Trump Sees Framework For Greenland Deal; Nvidia Rises (Live Coverage)": 0.6,
  "New England Journal of Medicine Publishes Phase 3 ASCENT-04/KEYNOTE-D19 Results Supporting Trodelvy® Plus Keytruda® as a Potential New Standard of Care in First-line PD-L1+ Metastatic Triple-negative Breast Cancer": 0.8,
  "Stocks to Watch Wednesday Recap: Netflix, Schwab, J&J, United Airlines": 0.5,
  "Honeywell, Flexjet settle litigation, extend engine maintenance deal": 0.5,
  "Why AppLovin Stock Was Falling Today": -0.5,
  "Why Qualcomm (QCOM) Outpaced the Stock Market Today": 0.5,
  "AppLovin (APP) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Zscaler (ZS) Increases Yet Falls Behind Market: What Investors Need to Know": -0.2,
  "Why Airbnb, Inc. (ABNB) Outpaced the Stock Market Today": 0.5,
  "Cadence Design Systems (CDNS) Outperforms Broader Market: What You Need to Know": 0.5,
  "Booking Holdings (BKNG) Outperforms Broader Market: What You Need to Know": 0.5,
  "Axon Enterprise (AXON) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Berkshire to offload Kraft Heinz: What it means in post-Buffett era": 0.1,
  "MercadoLibre’s Expanding Fintech and Rising Credit Portfolio Might Change The Case For Investing In MELI": 0.5,
  "Why Ross Stores (ROST) Outpaced the Stock Market Today": 0.5,
  "KLA (KLAC) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Top Analyst Reports for Agnico Eagle, Monster & General Motors": 0.5,
  "TD Cowen Names NXP (NXPI) a Top Pick, Raises Price Target to $285": 0.8,
  "Citizens Reiterates Bullish View on CrowdStrike (CRWD) With $550 Price Target": 0.8,
  "1 Stock I'd Buy Before Vitesse Energy in 2026": 0.2,
  "KeyBanc Raises Applied Materials (AMAT) Target to $380, Keeps Overweight Rating": 0.8,
  "(ITEM 5.02) DEPARTURE OF DIRECTORS OR CERTAIN OFFICERS; ELECTION OF DIRECTORS; APPOINTMENT OF CERTAIN OFFICERS; COMPENSATORY ARRANGEMENTS OF CERTAIN OFFICERS. On January 16, 2026, Charter Communications, Inc. (“Charter”) entered into an employment agreement (the “Agreement”) with Adam Ray, Charter’s Executive Vice President, Chief Commercial Officer. The Agreement, which is effective as of January 19, 2026, has a term ending January 19, 2028 (or upon an earlier termination of employment) and provides that Mr. Ray will continue to": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On January 22, 2026, Intuitive Surgical, Inc. (“Intuitive”) issued a press release announcing its financial results for the quarter ended December 31, 2025. A copy of the press release is furnished hereto as Exhibit 99.1. The information in this Current Report on Form 8-K, including Exhibit 99.1, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition On January 22, 2026, CSX Corporation issued a press release and its CSX Quarterly Financial Report on financial and operating results for the quarter ended December 31, 2025. A copy of the press release is attached as Exhibit 99.1 and a copy of the CSX Quarterly Financial Report is attached as Exhibit 99.2, each of which is incorporated by reference herein. These documents are available on the Company's": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On January 22, 2026, Intel Corporation (“Intel” or the \"Company\") issued a press release announcing the financial results of its fourth quarter ended December 27, 2025 and forward-looking statements relating to its first quarter of 2026. A copy of this press release is attached hereto as Exhibit 99.1 and is incorporated by reference herein. The attached press release includes non-GAAP financial measures relating to our operations and forecasted outlook.\n\n(Item 2.02) of this Report and the press release attached hereto as Exhibit 99.1 are furnished and shall not be treated as filed for purposes of the Securities Exchange Act of 1934, as amended.": 0.1,
  "Is Bullish CF Analyst Sentiment Reframing the Pipeline Risk Narrative for Vertex Pharmaceuticals (VRTX)?": 0.5,
  "Constellation Energy (CEG) Valuation Check As PJM Policy Shifts Raise Regulatory Risk Concerns": -0.5,
  "As Taiwan Semi Hikes Its Dividend 20%, Should You Buy TSM Stock?": 0.5,
  "Review & Preview: A Greenland Rally": 0.0,
  "Ignore the S&P 500: These 3 Kings Could Mint Thousands of Millionaires": 0.5,
  "Is GE Vernova the Smartest Investment You Can Make Today?": 0.5,
  "A Look At Ross Stores (ROST) Valuation After Strong Results And Renewed Investor Interest": 0.6,
  "This Is One of the Best Nuclear Stocks to Hold for the Next 10 Years": 0.8,
  "Bernstein Cuts Comcast (CMCSA) Target to $32, Keeps Market Perform Amid Rising Competition": -0.2,
  "Winners And Losers Of Q3: Ross Stores (NASDAQ:ROST) Vs The Rest Of The Discount Retailer Stocks": 0.2,
  "Reflecting On Therapeutics Stocks’ Q3 Earnings: Vertex Pharmaceuticals (NASDAQ:VRTX)": 0.2,
  "Paychex (PAYX): Buy, Sell, or Hold Post Q4 Earnings?": 0.2,
  "1 Reason to Sell AMAT and 1 Stock to Buy Instead": -0.5,
  "2 Volatile Stocks to Target This Week and 1 We Question": 0.2,
  "2 Services Stocks Worth Investigating and 1 We Avoid": 0.2,
  "Is It Time To Reassess Palo Alto Networks (PANW) After Recent Share Price Weakness": 0.1,
  "3 Large-Cap Stocks We Keep Off Our Radar": -0.5,
  "Did New AI Data Center Chip Deals Just Shift Marvell Technology's (MRVL) Investment Narrative?": 0.2,
  "Did Board Exit and Dividend Move Just Shift QUALCOMM's (QCOM) Investment Narrative?": 0.1,
  "Only 3 of My Top 10 Stocks for 2025 Lost to the Market. Here Are the Ones I Think Are Still Buys for 2026.": 0.6,
  "Jim Cramer Calls Lam Research the “Best of the Best” But Warns Against Buying Parabolic Moves": 0.5,
  "Jim Cramer on GE HealthCare: “I Just Don’t Think It’s What You Want to Own”": -0.6,
  "Jim Cramer on American Electric Power: “One of My Favorite Utilities for Multiple Years”": 0.8,
  "Jim Cramer on Honeywell: “It’s Finally Getting Credit for All the Things It’s Doing”": 0.6,
  "Jim Cramer on Constellation Energy: “The Fact Is That When the President Gets Involved, It’s Too Uncertain”": -0.6,
  "Is Fastenal (FAST) Pricing Leave Enough Room After Strong Multi‑Year Share Gains": 0.5,
  "PJM cost concerns bleed into transmission planning": -0.5,
  "The Motley Fool Interviews Zscaler Founder and CEO Jay Chaudhry": 0.5,
  "Chile B2C Ecommerce Market Report 2025-2029: MercadoLibre Maintains a Leading Position, with Falabella and Others Embracing Marketplace Models to Capture Market Share": 0.5,
  "The Zacks Analyst Blog Highlights Agnico Eagle Mines, Monster Beverage, General Motors, Kewaunee Scientific and CSP": 0.0,
  "Key full-year US hotel metrics fall for first time since 2020": -0.5,
  "Peet’s Coffee to close several San Francisco Bay Area stores this month": -0.5,
  "IT Outsourcing (ITO): Global Market Trends and Regional Growth Forecasts (2026-2031)": 0.2,
  "PayPal buys Israeli AI firm": 0.2,
  "Electric Vehicle (EV) Battery Management Systems Market 2026-2031 - Rapid Scale-up in Global EV Production Sparks Modular BMS Adoption": 0.5,
  "Will private equity’s pivot to continuation vehicles continue in 2026?": 0.2,
  "Honeywell International (NASDAQ:HON) Ticks All The Boxes When It Comes To Earnings Growth": 0.8,
  "Do Its Financials Have Any Role To Play In Driving Analog Devices, Inc.'s (NASDAQ:ADI) Stock Up Recently?": 0.1,
  "Hibbett Launches on DoorDash, Bringing On-Demand Access to Footwear and Apparel Nationwide": 0.6,
  "Why 'Cheap' Software Stocks Could Be The Next Big AI Value Trap": -0.6,
  "Can Booking's Connected Trip Strategy Define Its Long-Term Investment Story After Q4 Call? (BKNG)": 0.1,
  "Stock Markets Are Relying on the TACO Trade Again. Why That’s Not Good.": -0.6,
  "Autodesk’s Q4 2026 Earnings: What to Expect": 0.0,
  "Cirrus Logic (CRUS) Stock Jumps 4.5%: Will It Continue to Soar?": 0.6,
  "Why Berkshire Put Its Kraft Stake on the Block": 0.0,
  "January 2026's Stocks That May Be Trading Below Estimated Value": 0.0,
  "High Growth Tech Stocks To Watch In The US January 2026": 0.5,
  "Intel Jumps 11% as Chip Stocks Rally": 0.8,
  "Jim Cramer Discusses Honeywell (HON)’s Spinoffs": 0.5,
  "Jim Cramer Reveals Why He Might Cancel His Adobe (ADBE) Subscription": -0.5,
  "Spencer Jakab | Why Berkshire Is Losing Its Taste for Kraft Heinz": -0.5,
  "Marriott International Again Named One of Fortune's World's Most Admired Companies": 0.8,
  "Ross Stores' Q4 2025 Earnings: What to Expect": 0.0,
  "A Look At Intuit’s (INTU) Valuation As AI TurboTax Stores And New Partnerships Draw Interest": 0.5,
  "PayPal to Acquire Cymbio, Accelerating Agentic Commerce Capabilities": 0.5,
  "Northern Trust Corporation Reports Fourth Quarter 2025 Financial Results": 0.0,
  "Okta’s Profits Are Up, But Its Credibility Still Hasn’t Recovered": -0.5,
  "Kraft falls after disclosing Berkshire may sell shares post split": -0.5,
  "Microchip price target raised to $78 from $72 at BofA": 0.5,
  "Analog Devices price target raised to $350 from $320 at BofA": 0.5,
  "PayPal’s Path Forward Doesn’t Require Winning the Stablecoin Battle": 0.2,
  "Applied Materials to Report Fiscal First Quarter 2026 Results on Feb. 12, 2026": 0.0,
  "3 stock winners this portfolio manager anticipates for 2026": 0.5,
  "E-Commerce Update - Austrian Market Growth Driven By Innovation And Localization": 0.6,
  "Denver woman has roaches and bad reviews after renting Airbnb to her hoarder mom. She has 2 options to fix the mess": -0.6,
  "Annual Comcast Advertising Report Highlights the State of AI in Advertising": 0.5,
  "CrowdStrike Achieves ISO 42001 Certification for Responsible AI-Powered Cybersecurity": 0.5,
  "Is There Now An Opportunity In Autodesk, Inc. (NASDAQ:ADSK)?": 0.2,
  "Here Are Thursday’s Top Wall Street Analyst Research Calls: Alphabet, Callaway Golf, Datadog, Hyatt Hotels, Palantir, Texas Instruments, Verizon, and More": 0.2,
  "Bernstein names Big Beautiful tax refunds winners": 0.6,
  "2 Top Cybersecurity Stocks to Buy in January": 0.5,
  "CoStar Group Founder and CEO Andy Florance Earns Top Ten Placement on the 2026 SP 200": 0.6,
  "Amplitude to Host Fourth Quarter and Full Year 2025 Earnings Webcast on February 18, 2026": 0.0,
  "Defiance ETFs & Futurum Equities Launch RKNG, the Defiance Retail Kings ETF Tracking Retail-Sentiment-Driven Market Leaders": 0.5,
  "Why Analysts Think Analog Devices Stock Can Hit $375 in 2026": 0.8,
  "Here is What to Know Beyond Why Axon Enterprise, Inc (AXON) is a Trending Stock": 0.2,
  "Investors Heavily Search Marvell Technology, Inc. (MRVL): Here is What You Need to Know": 0.5,
  "Autodesk cuts 7% of workforce to redirect investments to AI, cloud": -0.5,
  "Jim Cramer Calls Bloom Energy’s Valuation “Dangerous”": -0.7,
  "Jim Cramer Calls KLA Corporation an “Incredibly Well-Run Company”": 0.8,
  "Cadence Unveils HiFi iQ DSP to Power Next-Gen Voice AI and Audio": 0.5,
  "Ahead of Roper Technologies (ROP) Q4 Earnings: Get Ready With Wall Street Estimates for Key Metrics": 0.2,
  "Insights Into Paccar (PCAR) Q4: Wall Street Projections for Key Metrics": 0.2,
  "Exploring Analyst Estimates for Texas Instruments (TXN) Q4 Earnings, Beyond Revenue and EPS": 0.2,
  "Why It's Time to Start Thinking of Walmart as a Tech Stock": 0.5,
  "simplyFUEL Announces Strategic Partnership with Humble Growth": 0.5,
  "Stifel initiates Micron at Outperform, upgrades Datadog on attractive risk-reward": 0.6,
  "Wall Street Bulls Look Optimistic About Booking Holdings (BKNG): Should You Buy?": 0.8,
  "Is It Worth Investing in ASML (ASML) Based on Wall Street's Bullish Views?": 0.5,
  "Are Computer and Technology Stocks Lagging  Applied Materials (AMAT) This Year?": -0.5,
  "CrowdStrike Holdings' Quarterly Earnings Preview: What You Need to Know": 0.5,
  "A Hidden Monopoly: Why AI Can’t Exist Without Cadence": 0.2,
  "Autodesk Cutting 1,000 Jobs As Part of Restructuring": -0.7,
  "This software stock is ’attractive’ after 25% year-to-date drop: Morgan Stanley": 0.6,
  "Jim Cramer Believes Motorola Could Possibly “Give Axon a Run for the Money”": 0.6,
  "IntelliTrans and DAT Bring Smarter Rate Intelligence to Shippers": 0.5,
  "Smith-Midland Awarded $1.8M Barrier Contract for Georgia DOT Project": 0.8,
  "Honeywell International Inc. (HON) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "KLA (KLAC) Reports Next Week: Wall Street Expects Earnings Growth": 0.6,
  "Analysts Estimate Comcast (CMCSA) to Report a Decline in Earnings: What to Look Out for": -0.5,
  "Nvidia Stock Is Lagging Behind Other AI Names. Why the Chips Darling Is Out of Favor.": -0.5,
  "U.S. fintech could gain as Trump pushes affordability agenda, Citi says": 0.5,
  "Can AMAT Lead the Display Market With Advanced OLED and AR/VR Push?": 0.5,
  "Should CrowdStrike’s Identity Security and AI Governance Push Require Action From CrowdStrike Holdings (CRWD) Investors?": 0.1,
  "Should You Buy the Dip in Qualcomm Stock?": 0.2,
  "Micron, DataDog, Capri: Top Analyst Calls": 0.2,
  "Forget the Chips, Buy Memory: Why AI Money Is Moving to Storage": 0.2,
  "Antibody Discovery Market to Hit USD 35.35 Billion by 2035, Driven by AI and Technology Innovations": 0.8,
  "Is Fortinet (FTNT) Attractively Priced After Recent Share Price Weakness?": 0.5,
  "Why Lam Research (LRCX) Is Up 5.0% After AI Buzz And Tariff Jitters Hit Spotlight": 0.2,
  "Vertex Pharmaceuticals Poised for Higher Valuation on Povetacicept, Cystic Fibrosis Pipeline, RBC Says": 0.8,
  "Arista Stock Moves Into Positive Territory Ahead Of Q4 Earnings": 0.8,
  "Workday CEO dismisses concerns that AI is destroying software": 0.5,
  "Autodesk's Share Jump On Plan To Cut 7% of Workforce in New Restructuring Plan": -0.5,
  "Raymond James, Comcast, and Gentex to Deliver Keynotes at Parks Associates' 30th CONNECTIONS™: The Premier Connected Home Conference in Santa Clara, May 5-7": 0.5,
  "Top Midday Stories: Abbott Shares Fall After Q4 Revenue Miss; GE Shares Down Despite EPS, Revenue Beat": -0.5,
  "National Advertising Review Board Finds T-Mobile Failed to Comply with Panel Recommendations": -0.6,
  "PRGS vs. INTU: Which Stock Is the Better Value Option?": 0.2,
  "Atlassian May Beat Q2 Forecasts, Faces Mixed Long-Term Data Center Outlook, Oppenheimer Says": 0.1,
  "SaaS Demand and Client Retention Aid Paychex Amid Heavy Competition": 0.5,
  "KHC Is Low-Hanging Fruit for Greg Abel: Which Warren Buffett Stock Will He Sell Next?": 0.2,
  "The Ultimate Growth Stock to Buy With $1,000 Right Now": 0.5,
  "4D Path Joins Phase II Clinical Trial to Advance Predictive Biomarkers in Bladder Cancer": 0.5,
  "Coca-Cola vs. Monster Beverage: Which Stock Stays Ahead of the Curve?": 0.5,
  "This Potential Stock-Split Stock Could Make You Rich": 0.8,
  "Will Lam Research (LRCX) Beat Estimates Again in Its Next Earnings Report?": 0.5,
  "Will Western Digital (WDC) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "Why Seagate (STX) is Poised to Beat Earnings Estimates Again": 0.8,
  "COHR vs. ARM: Which Tech Growth Stock Is the Better Buy Now?": 0.5,
  "Roper Gears Up to Post Q4 Earnings: What's in the Offing?": 0.5,
  "Seagate Elevates HDD Performance Through Aerial Density Advancements": 0.5,
  "A ‘Crippling’ Winter Storm is Coming. Utilities Are at Risk.": -0.6,
  "Can PayPal’s Latest AI Bet Spark a Stock Revival?": 0.5,
  "How This Options Expert Screens for High-Probability Spread Trades, Step-by-Step": 0.2,
  "Adobe's Digital Media Revenues Gain Traction: What's the Path Ahead?": 0.5,
  "Old National Bancorp Among 3 Value Stocks Priced Below Estimated Worth": 0.5,
  "AppLovin's Price Volatility is a Feature, Not a Business Fall": 0.5,
  "Autodesk layoffs today: Software company cuts 7% of jobs in latest tech downsizing": -0.6,
  "Why Is Datadog (DDOG) Stock Soaring Today": 0.5,
  "2 Healthcare Stocks Poised for a Comeback in 2026": 0.5,
  "Why Arm Holdings Stock Was Climbing This Week": 0.5,
  "Western Digital Stock Surges As Analysts Raise Price Targets": 0.8,
  "Is This Beaten-Down Tech Stock a Once-in-a-Decade Opportunity?": 0.6,
  "PayPal Agrees to Acquire Cymbio to Expand AI Chatbot Commerce Push": 0.5,
  "DoubleVerify, Pegasystems, Varonis Systems, and Intuit Shares Skyrocket, What You Need To Know": 0.8,
  "HubSpot, Autodesk, BILL, nCino, and Paylocity Stocks Trade Up, What You Need To Know": 0.5,
  "Why MercadoLibre Stock Just Popped": 0.5,
  "Arista Networks Is the S&P 500’s Top Stock Today. It Isn’t Clear Why It’s Soaring.": 0.1,
  "This Value Stock ETF Is Crushing the S&P 500. Here’s Its Secret Weapon.": 0.5,
  "Charter Communications (CHTR) Valuation Check After Prolonged Share Price Weakness": 0.1,
  "Sector Update: Tech Stocks Higher Late Afternoon": 0.5,
  "Qualcomm Gets Crushed: $150 Is the Level to Watch Going Forward": -0.7,
  "Analog Devices to Report First Quarter Fiscal Year 2026 Financial Results on Wednesday, February 18, 2026": 0.0,
  "HONEYWELL ANNOUNCES CFO, BUSINESS UNIT LEADERS FOR HONEYWELL AEROSPACE": 0.0,
  "Paramount extends deadline for Warner Bros. offer, which company calls 'inferior scheme' amid Netflix deal": -0.6,
  "Intel Reports Fourth-Quarter and Full-Year 2025 Financial Results": 0.5,
  "Mondelēz International’s Global R&D Team Opens Applications for CoLab Tech 2026": 0.5,
  "CSX (NASDAQ:CSX) Reports Sales Below Analyst Estimates In Q4 CY2025 Earnings": -0.5,
  "US Equity Markets Rise as Geopolitical Tensions Ease": 0.8,
  "Assessing Atlassian (TEAM) Valuation After AI Concerns And Cloud Pricing Updates": 0.1,
  "Keurig Dr Pepper to Report Fourth Quarter 2025 Results and Host Conference Call": 0.0,
  "CSX: Q4 Earnings Snapshot": 0.0,
  "Reaching for the Stars": 0.8,
  "First look: CSX Q4 earnings": 0.2,
  "Tech Buyouts Are Coming. 6 Stocks That Can Benefit.": 0.5,
  "Honeywell Settles Litigation With Flexjet. The Stock Rose.": 0.5,
  "CSX Profit, Revenue Fall on Subdued Industrial Demand": -0.7,
  "Adobe Partners With Hollywood Players On Generative AI": 0.5,
  "Equities Extend Gains as Focus Turns to Economic Data, Corporate Earnings": 0.5,
  "Utility Stocks Beware. Politics Are Starting to Eat Into Profits.": -0.5,
  "Warner Bros. dominates Oscars amid Netflix–Paramount bidding war": 0.5,
  "CSX railroad profit slips 2% as shipping demand remained weak and severance costs hurt results": -0.6,
  "Assessing Palo Alto Networks (PANW) Valuation After Recent Share Price Weakness": 0.2,
  "CSX (CSX) Misses Q4 Earnings and Revenue Estimates": -0.7,
  "Stock Market Today, Jan. 22: Netflix Drops as Guidance Tempers Strong Q4 Results": -0.6,
  "T-Mobile Announces Redemption of 4.750% Senior Notes due February 1, 2028": 0.0,
  "Adobe Systems (ADBE) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Constellation Energy Corporation (CEG) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "ASML (ASML) Outperforms Broader Market: What You Need to Know": 0.5,
  "PepsiCo (PEP) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Workday (WDAY) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Take-Two Interactive (TTWO) Outperforms Broader Market: What You Need to Know": 0.5,
  "Fortinet (FTNT) Laps the Stock Market: Here's Why": 0.5,
  "CSX (CSX) Q4 2025 Earnings Call Transcript": 0.0,
  "Amgen (AMGN) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Why Gilead Sciences (GILD) Outpaced the Stock Market Today": 0.5,
  "Vertex Pharmaceuticals (VRTX) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "Record Holiday Attendance and New Tech Partnerships Might Change The Case For Investing In Madison Square Garden Entertainment (MSGE)": 0.5,
  "Applied Materials (AMAT) Valuation Check After Strong Recent Share Price Gains": 0.5,
  "Amgen (AMGN) Faces 340B Lawsuit: What Does Sagebrush Dispute Reveal About Its Stakeholder Strategy?": 0.1,
  "Kraft Heinz (KHC) Laps the Stock Market: Here's Why": 0.5,
  "Analog Devices (ADI) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "CSX Q4 Earnings Call Highlights": 0.0,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (b) On January 20, 2026, Persis Drell resigned from the Board of Directors, or the Board, of NVIDIA Corporation, or the Company, including as a member of the Compensation Committee of the Board, effective immediately. Dr. Drell resigned to pursue a new professional opportunity and not because of any disagreement with the Company on any matter": 0.2,
  "(Item 8.01) Other Events. On January 23, 2026, the Company filed a prospectus supplement with the Securities and Exchange Commission (the “SEC”) to supersede and replace the prospectus supplement filed on September 5, 2025 (the “prior prospectus supplement”), pursuant to the terms of the Warrant and Common Stock Agreement, dated as of August 22, 2025 (the “Purchase Agreement”), by and between the Company and the United States Department of Commerce (the “selling securityholder”). The prospectus supplement was": 0.1,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Susie Wee Retirement On January 20, 2026, Susie Wee informed the Board of Directors (the “Board”) of Analog Devices, Inc. (the “Company”) that she had decided to retire from the Board and not to stand for re-election at the Company’s 2026 annual meeting of shareholders (the “2026 Annual Meeting”) to be held on March 11, 2026.": -0.2,
  "Here's What Key Metrics Tell Us About CSX (CSX) Q4 Earnings": 0.5,
  "Why Iridium Communications Stock Soared Today": 0.8,
  "Best brokers for buying fractional shares": 0.6,
  "MercadoLibre (MELI) Valuation Check After Chile Leadership Confirmation And Northcape Capital Stake Increase": 0.5,
  "The Age of AI Agents Brings a Risk No One Is Prepared For": -0.6,
  "CSX sees small drop in revenue, slight gain in volume": 0.2,
  "Tet 2026 Travel Trends: Vietnamese Travelers Choose to Explore Home Destinations, Agoda Finds": 0.5,
  "SNAPCHATS TIME IS HERE - [](https://www.reddit.com/r/wallstreetbets/?f=flair_name%3A%22Discussion%22) MANAGEMENT IS NOT INSANE, THEY JUST CHOSE INNOVATION DESPITE THE COSTS Dilution isn't *as* bad as it seems, as the company has been repurchasing 500 Million a year, but the reason for Stock based comp is to fund these glasses which are releasing Snapchat glasses are releasing this year If the glasses fail and he scraps them, Snapchat saves roughly $1B a year in R&D, turns cash-flow positive, slows": 0.2,
  "Is Charter Communications (CHTR) Starting To Look Attractive After A Prolonged Share Price Slump": 0.5,
  "Is Dollar General’s Same-Day Delivery Push Reshaping the Digital Convenience Narrative For DG?": 0.2,
  "Coca-Cola vs. PepsiCo: What's the Better Long-Term Play?": 0.2,
  "2 of Wall Street’s Favorite Stocks with Promising Prospects and 1 We Question": 0.5,
  "Is It Too Late To Reconsider Constellation Energy (CEG) After Its Recent Share Price Pullback?": 0.1,
  "How Investors Are Reacting To Costco Wholesale (COST) Dividend Amid Strong Membership Fee Engine": 0.5,
  "1 S&P 500 Stock on Our Watchlist and 2 We Question": -0.5,
  "1 Profitable Stock with Exciting Potential and 2 We Avoid": 0.5,
  "How The Latest Price Target Is Rewriting The Story For Copart (CPRT)": 0.5,
  "3 Profitable Stocks That Concern Us": -0.5,
  "1 Safe-and-Steady Stock to Research Further and 2 We Turn Down": 0.0,
  "Netflix says Paramount bid ‘doesn’t pass sniff test’ as Warner battle intensifies": -0.5,
  "CSX Corp (CSX) Q4 2025 Earnings Call Highlights: Navigating Challenges with Strategic Growth ...": 0.5,
  "How Investors May Respond To Microchip Technology (MCHP) Expanding Into High-Voltage Motor Control And Embedded Vision": 0.2,
  "Netflix says Paramount bid 'doesn't pass sniff test' as Warner battle intensifies, FT reports": -0.5,
  "CSX Q4 Deep Dive: Cost Initiatives and Intermodal Growth Underpin 2026 Outlook": 0.6,
  "Walmart CEO pay gap widens with workers": -0.7,
  "10 appealing homes with an abundance of exposed beams": 0.8,
  "Income Investor Alert: Buy Constellation Energy While It's Below $310?": 0.5,
  "A Look At Texas Instruments (TXN) Valuation As Analyst Upgrades Highlight Industrial Restocking Cycle": 0.5,
  "Personal bios for customer service agents can boost satisfaction": 0.6,
  "Earnings Preview: What To Expect From Adobe's Report": 0.5,
  "Is It Time To Reassess CSX (CSX) After Recent Rail Infrastructure Focus?": 0.2,
  "Walmart’s Premium Music Push and Nasdaq Move Could Be A Game Changer For Walmart (WMT)": 0.5,
  "How CoStar’s Growing Homes.com Platform And CEO Recognition At CoStar Group (CSGP) Has Changed Its Investment Story": 0.5,
  "Is It Time To Reassess Synopsys (SNPS) After Recent Share Price Recovery?": 0.2,
  "Zacks Investment Ideas feature highlights: NextEra Energy, Google and Constellation Energy": 0.5,
  "3 Growth Stocks to Buy and Hold Forever": 0.5,
  "1 Reason I'm Never Selling Netflix Stock": 0.5,
  "Bull of the Day: Cameco (CCJ)": 0.2,
  "Best Bookkeeping Software (2026): QuickBooks Recognized as Leading Digital Bookkeeping Tool for UK Businesses by Better Business Advice": 0.8,
  "The Zacks Analyst Blog Highlights AtriCure, REV Group, Oceaneering International and Analog Devices": 0.5,
  "A Once-in-a-Decade Investment Opportunity: The 2 Best AI Stocks to Buy Now": 0.8,
  "Paypal Casino 2026 | Online Casino That Accept Paypal By Cafe Casino": 0.1,
  "The Zacks Analyst Blog Highlights Walmart, Morgan Stanley and SAP SE": 0.0,
  "Costco Introduced a Controversial Perk Last Year -- and It Plans to Follow This Up With 4 New Benefits in 2026": 0.2,
  "CFOs On the Move: Week ending Jan. 23": 0.0,
  "New Strong Buy Stocks for January 23rd": 0.5,
  "Market Chatter: Netflix Co-CEO Says on Track to Win Shareholder Backing for Warner Bros. Discovery Bid": 0.5,
  "How Regeneron’s Broader Biologics Pipeline And Capital Return Focus At Regeneron Pharmaceuticals (REGN) Has Changed Its Investment Story": 0.2,
  "Genetic Engineering Tools - Global Market Opportunity and Forecast Report 2026-2031": 0.0,
  "r/Stocks Daily Discussion & Fundamentals Friday Jan 23, 2026 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is": 0.2,
  "Did Exelon Corporation (NASDAQ:EXC) Use Debt To Deliver Its ROE Of 10%?": 0.1,
  "3 priorities Walmart's new CEO needs to maintain success": 0.5,
  "The U.S. was ‘the operating system of the world,’ Scott Galloway says, but now ‘the American brand is chaos, corruption, and coercion’": -0.6,
  "The Bull Case For CSX (CSX) Could Change Following Profit Dip Amid Buybacks And Layoffs": 0.2,
  "Does Earnings Buzz And Zero Sugar Momentum Change The Bull Case For Monster Beverage (MNST)?": 0.2,
  "What You Need to Know Ahead of Solstice’s Earnings Release": 0.0,
  "Intuitive Surgical Fourth-Quarter Results Top Street Views": 0.8,
  "PayPal to acquire Cymbio in push for AI-driven e-commerce": 0.5,
  "Nasdaq Futures Fall as Intel Sinks on Disappointing Outlook, U.S. PMI Data in Focus": -0.5,
  "Intuitive Surgical Stock Moves Higher on Record Sales Growth": 0.8,
  "NRG Energy Controls Both Power Generation and Distribution as AI Data Centers Reshape the Grid": 0.5,
  "3 Stocks Including Datadog That May Be Priced Below Their Estimated Value": 0.5,
  "Exploring US High Growth Tech Stocks For Potential Opportunities": 0.5,
  "Analog Devices Appoints Yoky Matsuoka to its Board of Directors": 0.5,
  "Stocks Fall Pre-Bell as Traders Parse Economic Data, Intel's Quarterly Results": -0.5,
  "Where Will Costco Stock Be in 5 Years?": 0.0,
  "Citizens Remains a Buy on ​Zscaler, Inc (ZS)": 0.5,
  "BTIG Remains a Buy on CrowdStrike Holdings, Inc. (CRWD)": 0.6,
  "Cisco Systems, Inc. (CSCO) Announces its Multi-Year Partnership with Georgetown University": 0.5,
  "Here’s What Mizuho Securities Has to Say About ​Palo Alto Networks (PANW)": 0.2,
  "PBJ’s Five-Year Return Falls Disappointingly Short": -0.6,
  "China Tells Alibaba, Tech Firms to Prep Nvidia H200 Orders - Chinese officials have told the country’s largest tech firms including Alibaba Group Holding Ltd. ([BABA](https://finance.yahoo.com/quote/BABA)) they can prepare orders for Nvidia Corp.’s ([NVDA](https://finance.yahoo.com/quote/NVDA)) H200 AI chips, suggesting Beijing is close to formally approving imports of components essential to running artificial intelligence. Regulators have recently granted in-principle approval for Alibaba ([BABA](https://finance.yahoo.com/quote/BABA)), Tencent Holdings Ltd. ([TCEHY](https://finance.yahoo.com/quote/TCEHY)) and ByteDance Ltd. to move to the next stage of": 0.2,
  "Here Are Friday’s Top Wall Street Analyst Research Calls: Applied Materials, e.l.f. Beauty, Fortinet, Freeport MacMoRan, Procter & Gamble, Spotify, and More": 0.2,
  "Earnings Preview: What to Expect From Costco Wholesale's Report": 0.5,
  "Netflix Stock Drops 35%+ After Q4 as WBD Deal Risk Rises": -0.7,
  "India Chocolate Market Trends and Growth Opportunities 2025-2033 | Astute Analytica": 0.2,
  "If You Invested $1000 in Analog Devices 10 Years Ago, This Is How Much You'd Have Now": 0.5,
  "Why Fortinet stock is rising today: TD Cowen upgrade and $100 target": 0.5,
  "CSX Q4 Earnings & Revenues Lag Estimates, Both Down Year Over Year": -0.8,
  "Seagate Stock Ahead of Q2 Earnings Release: Buy, Sell or Stay Put?": 0.2,
  "Investors Heavily Search PayPal Holdings, Inc. (PYPL): Here is What You Need to Know": 0.5,
  "Here is What to Know Beyond Why Amgen Inc. (AMGN) is a Trending Stock": 0.1,
  "Palo Alto Networks, Inc. (PANW) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "CrowdStrike (CRWD) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Investors Heavily Search Airbnb, Inc. (ABNB): Here is What You Need to Know": 0.5,
  "Linde (LIN) Target Price Raised by Citi": 0.5,
  "Exchange-Traded Funds, Equity Futures Edge Lower Pre-Bell Friday as Traders Look Ahead to Economic Data Releases": 0.1,
  "Khazna Solar And PepsiCo Biomethane Deals Might Change The Case For Investing In Engie (ENXTPA:ENGI)": 0.2,
  "Walmart CEO started his career unloading trailers at the warehouse. He says he got promotion after promotion by raising his hand when his boss was out": 0.5,
  "20 Million Patients Benefit from da Vinci Surgery Globally": 0.8,
  "Stay Ahead of the Game With Lam Research (LRCX) Q2 Earnings: Wall Street's Insights on Key Metrics": 0.5,
  "Gear Up for ADP (ADP) Q2 Earnings: Wall Street Estimates for Key Metrics": 0.2,
  "Honeywell poaches Deere CFO for aerospace spinoff": 0.1,
  "Intuitive Surgical (ISRG) Reports Q4 Earnings: What Key Metrics Have to Say (Revised)": 0.2,
  "TXN Likely to Beat Q4 Earnings Estimates: How to Play the Stock": 0.5,
  "Mizuho Says You Should Buy the Dip in Arm Stock. Why?": 0.5,
  "Wall Street Analysts Think Vertex (VRTX) Is a Good Investment: Is It?": 0.5,
  "Global Asset Tracking Software Market Analysis and Growth Outlook to 2031 Featuring Strategic Profiles of Zebra Technologies, IBM Corporation, Honeywell, Datalogic, Trimble and Other Key Competitors": 0.5,
  "Netflix price target lowered to $110 from $141 at Argus": -0.6,
  "Trump's attack on the affordability crisis makes these stocks buyable": 0.6,
  "Darden upgraded, Trade Desk downgraded: Wall Street's top analyst calls": 0.2,
  "Alphabet upgraded, Micron initiated: Wall Street’s top analyst calls": 0.5,
  "Joveo Introduces Workday Design Approved Integration for its AI Job Advertising Platform": 0.5,
  "Here's Why Take-Two Interactive (TTWO) is a Strong Growth Stock": 0.8,
  "Infrastructure Spending Is Exploding And Will Drag This ETF With It": 0.5,
  "Best Momentum Stock to Buy for January 23rd": 0.6,
  "Charter Communications (CHTR) Earnings Expected to Grow: Should You Buy?": 0.5,
  "Regeneron (REGN) Expected to Beat Earnings Estimates: Can the Stock Move Higher?": 0.5,
  "ISRG Q4 Deep Dive: New Product Launches and International Growth Drive Results": 0.6,
  "'Jobs, jobs, jobs' the AI mantra in Davos as fears take back seat": 0.5,
  "Intel Faces Memory-Price Crunch. Why Apple Will Be the Next Victim.": -0.7,
  "BKR to Report Q4 Earnings: Here's What You Need to Know": 0.0,
  "Boeing Stock Rips Higher Ahead Of Q4 Results; 3 Data Storage Stocks In Earnings Spotlight": 0.5,
  "Buy stocks in USD or other currencies? - For diversification to my home country's currency (Philippine peso) and USD, is it advisable to buy some international stocks/bonds in Euro? For ex., ASML (AEB) and NVO (IBIS) in Euro markets/currency instead of NYSE/USD? Thanks.": 0.2,
  "PepsiCo vs. Vita Coco: Which Beverage Stock Offers Better Growth?": 0.5,
  "Airbnb CEO says Steve Jobs taught him that obsessing over details isn’t about control—it’s about helping people think bigger and move faster. But Gen Z doesn’t agree": 0.2,
  "Software Stocks Have Plunged: Steals or Traps?": -0.5,
  "PayPal to Expand Agentic Commerce: Will it Boost Revenue Growth?": 0.5,
  "Intuitive Surgical Stock Beats Earnings Estimates. The Stock Is Barely Moving.": 0.2,
  "Dollar General Enhances Shopping Speed With Expanded myDG Delivery": 0.5,
  "Do Compliance Allegations Reframe AppLovin’s (APP) AI Adtech Ambitions as a Governance Stress Test?": 0.1,
  "Should Board Shake-Up and Shareholder Rights Debate Require Action From Analog Devices (ADI) Investors?": 0.1,
  "From Vibe Coding to Exclusive LLM Deals: AI Takeaways From Agoda’s CEO": 0.2,
  "REGN or ILMN: Which Is the Better Value Stock Right Now?": 0.2,
  "ISRG Stock Gains on Q4 Earnings & Revenue Beat, Gross Margin Declines": 0.2,
  "Fortinet Surges After Upgrade. Don’t Buy the ‘AI Is Eating Software’ Narrative.": 0.6,
  "Gen Z Rejects 'Radioactive' Diet Sodas for Zero Sugar Ones": 0.5,
  "Lam Research (LRCX) Upgraded to Strong Buy: Here's What You Should Know": 0.8,
  "Amazon Grocery Push Seen Gaining Momentum. What That Means For Instacart, DoorDash.": 0.5,
  "Dear Netflix Stock Fans, You Have 1 Month Until a Major Catalyst": 0.5,
  "ALAB Expands Portfolio on Acquisitions: What's Ahead for the Stock?": 0.5,
  "Crypto custodian BitGo down 12%, falling well below IPO price on second trading day": -0.8,
  "Intuitive Surgical Just Proved the Growth Engine Still Runs": 0.8,
  "Assessing Monster Beverage (MNST) Valuation As Earnings Hype And Zero Sugar Partnerships Draw Fresh Attention": 0.5,
  "Reassessing T-Mobile US (TMUS) After Recent Share Price Weakness": 0.2,
  "Domo Undervalued After Selloff in Software Sector, RPD Fund Management Says": 0.5,
  "ADP to Report Q2 Earnings: Here's What Investors Should Know": 0.5,
  "Is Arm Holdings' High Valuation Testing Market Patience?": -0.5,
  "LRCX Likely to Beat Q2 Earnings Estimates: Should You Buy the Stock?": 0.6,
  "Intuit Stockholders Re-Elect Directors, Back Say-on-Pay; DEI ROI Proposal Fails at AGM": 0.2,
  "Technical Breakdown of Epic v. Google: Major Risks for GOOGL and the Scaling Opportunity for Digital Turbine (APPS) - The ongoing proceedings have confirmed that Google’s \"Play Store\" dominance is being challenged not just on a monetary basis (the 30% fee), but on a technical infrastructure level. The court is focused on the \"friction\" Google creates to prevent third-party app stores and direct installations. 1. The Risk for Google ($GOOGL): Google’s high-margin Services segment relies": 0.2,
  "Marvell Stock Slips. Why the Celestial AI Deal Is Making Investors Cautious": -0.5,
  "Update: Judge Denies Bid by DoorDash, Uber to Block NYC Tipping Law": -0.5,
  "What Catalysts Are Shifting The Fair Value Story For PayPal Holdings (PYPL)?": 0.2,
  "CEOs Flag Jittery US Consumers as Global Tensions Intensify": -0.5,
  "Reassessing Seagate Technology Holdings (STX) After Its 226% One Year Share Price Surge": 0.5,
  "Two Chip Stocks Morgan Stanley Favors Ahead of Q4 Earnings": 0.5,
  "Applied Materials Stock Rises On Deutsche Bank Upgrade": 0.6,
  "Plasma Integrates NEAR Intents for Large-Volume Stablecoin Settlements": 0.5,
  "Comcast adds generous offer for customers after major loss": 0.8,
  "U.S. Oil Drillers Add One Rig as Winter Weather Sets In": 0.2,
  "US Equity Indexes Mixed in Midday Trading After Silver Hits $100 Milestone": 0.2,
  "As Short Sellers Take Aim at AppLovin Stock Again, How Should You Play APP?": 0.1,
  "Is Costco Stock a Buy in 2026?": 0.0,
  "As Autodesk Slashes Jobs, Should You Buy, Sell, or Hold ADSK Stock?": 0.1,
  "Sector Update: Consumer Stocks Higher in Afternoon Trading": 0.5,
  "Dow Jones Stocks: Nvidia, Amgen Are Near Buy Points But This Longtime Loser Is Winning The Week": 0.5,
  "After a 32% Reckoning In Shares, Investors Are Calling The Salesforce Bottom. It’s Time To Rally | CRM": 0.6,
  "How New Price Targets Are Rewriting The Story For Monster Beverage (MNST)": 0.2,
  "Walmart (WMT) Valuation Check After Recent Share Price Pullback And Growing Higher Margin Businesses": 0.5,
  "Weebit Nano (ASX:WBT) Is Up 22.2% After Tier‑1 Licensing And Foundry Qualification Milestones – What's Changed": 0.6,
  "Tesla removes Autopilot software, Fortinet upgraded to Buy": 0.2,
  "Down 25% in 2026, Morgan Stanley Says You Should Buy the Dip in This 1 Tech Stock": 0.5,
  "6 of My Top 10 Stocks for 2025 Increased by More Than 25%. Are They Still Buys Now?": 0.5,
  "Doordash, Uber Fail to Stop NYC Law Requiring 10% Tip Prompt": -0.5,
  "These Two Charts Sum Up the AI Stock Rally in 2026": 0.5,
  "Marvell Technology, Western Digital, Photronics, FormFactor, and Amkor Shares Plummet, What You Need To Know": -0.8,
  "MSTR Drops 50%+: Buy the Dip or Walk Away?": -0.5,
  "Fed Meeting, Apple, Microsoft Earnings: What to Watch Next Week": 0.5,
  "Intel stock plunges as hopes for a 'clean' turnaround story meet reality": -0.7,
  "Cathie Wood: Bitcoin Is Set To Rally After 'Shallowest Four-Year Cycle Decline'": 0.6,
  "Top Stocks to Double Up on Right Now": 0.5,
  "Sector Update: Consumer Stocks Advance Late Afternoon": 0.5,
  "Autodesk to cut 1,000 workers as the tech company bets on AI": -0.5,
  "Why Intuitive Surgical's Lackluster 2026 Guidance Isn't All Doom": 0.2,
  "Is Warner Bros. Discovery (WBD) Pricing In Too Much After A 176% One-Year Surge?": -0.5,
  "CSX Stock Rises After Earnings Miss Estimates. It’s the Outlook.": 0.2,
  "Marvell technology - https://finance.yahoo.com/news/marvell-stock-slips-why-celestial-175647659.html Marvell (MRVL) dropped \\~3–4% recently after headlines about the FTC issuing an “early termination notice” related to its Celestial AI acquisition. What is this early termination notice? How likely is the MRVL–Celestial AI acquisition to go through? Risk vs reward thoughts?": 0.1,
  "Winter Storm Fern Is Gathering Force. Businesses Are Bracing for Its Impact.": -0.6,
  "Gold's best week since 2020, Spotify & Applied Materials upgraded": 0.6,
  "US Equity Markets Mixed as Consumer Sentiment Improves; Silver Tops $102": 0.5,
  "Dr Pepper used a TikTok creator’s jingle. Now everyone wants to get in on the act": 0.5,
  "US Equity Indexes End Week Mixed While Silver Tops $100 Mark, Crude Oil Soars": 0.5,
  "Stock Market Today: Dow Falls While Nasdaq Is The Day's Bright Spot (Live Coverage)": 0.2,
  "Stocks to Watch Friday Recap: Intel, Capital One, CSX, Booz Allen": 0.2,
  "Trump-backed stablecoin quietly overtakes PayPal amid Binance boost": 0.5,
  "Where Will Broadcom Stock Be by December 2026?": 0.1,
  "Market Chatter: Netflix Proposed Acquisition of Warner Bros Has Competition Concerns, Paramount Deal Better": 0.2,
  "These Stocks Are Today’s Movers: Intel, AMD, Capital One, Booz Allen, BitGo, Fortinet, and More": 0.5,
  "Why Broadcom Stock Fell Today": -0.5,
  "Fidelity settles lawsuit over access to 'business-critical' Broadcom software": 0.2,
  "Stock Market Today, Jan. 23: Intel's Weak Outlook Weighs on Dow While Nasdaq Edges Higher": -0.5,
  "Self-Employed? Here's What You Need To Know This Tax Season": 0.5,
  "Intuit (INTU) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Synopsys (SNPS) Stock Falls Amid Market Uptick: What Investors Need to Know": 0.1,
  "Starbucks (SBUX) Outpaces Stock Market Gains: What You Should Know": 0.5,
  "Marvell Technology (MRVL) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Western Digital (WDC) Stock Dips While Market Gains: Key Facts": 0.1,
  "Did GlobalFoundries' (GFS) New Board Appointment Signal a Deeper Shift in Its Manufacturing Strategy?": 0.1,
  "Paccar (PCAR) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "Diamondback Energy (FANG) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "AI Bubble or Sustainable Growth? Here Are 2 Healthcare Companies Harnessing AI for the Long Term.": 0.5,
  "META earnings have quietly been trending up, how much does earnings momentum still matter at this size? - I’ve been digging a bit more into META recently and something stood out when I looked at earnings over the last several quarters. Actual EPS has consistently come in above expectations, and forward estimates haven’t rolled over going into the next report (Jan 28). At META’s scale, that kind of sustained earnings momentum feels harder to dismiss": 0.6,
  "Mag 7 earnings, Fed's rate decision: What to Watch": 0.2,
  "Autodesk (ADSK) Valuation Reassessed After Recent Share Price Weakness And Mixed Return Profile": 0.1,
  "Buffett's Successor Is Ready To Pass The Ketchup — Berkshire's Kraft Heinz Losses Are Bigger Than You Think": -0.5,
  "This Overlooked Artificial Intelligence (AI) Stock Could Be a Long-Term Compounder": 0.6,
  "Up 1,000% in Less Than a Year, Is This AI Stock a Buy to Start 2026?": 0.5,
  "US rig count up one as prices climb": 0.5,
  "U.S. Millionaires Considering Migration: The Numbers": 0.0,
  "Palantir Billionaire Peter Thiel Sells Tesla and Buys This Consumer Electronics Stock Instead": 0.5,
  "Amazon takes aim at Walmart crown in $883 billion battle": 0.5,
  "Is It Time To Revisit Automatic Data Processing (ADP) After Recent Share Price Weakness?": 0.2,
  "Is There Now An Opportunity In Marvell Technology (MRVL) After Recent Share Price Weakness": 0.5,
  "Intel stock crashes ~17% in a single session - Intel (INTC) shares plunged roughly 17%, marking one of the company's steepest single-day drops in years. This sell-off came despite Intel beating Q4 2025 earnings expectations. The real problem? A weak outlook for Q1 2026 that badly missed Wall Street's expectations: • Revenue guidance came in below analyst estimates • EPS is expected to be around breakeven or worse • Intel warned of supply constraints and": -0.8,
  "What Catalysts Are Shifting The Story For ASML Holding (ENXTAM:ASML)?": 0.1,
  "Assessing Whether Lam Research (LRCX) Still Offers Value After Strong Recent Gains": 0.5,
  "Legal AI giant Harvey acquires Hexus as competition heats up in legal tech": 0.6,
  "Trump uncertainty: Crypto startups raise $362m despite roaring ‘Sell America’ trade": -0.6,
  "A Look At Automatic Data Processing (ADP) Valuation After Recent Share Price Weakness": 0.2,
  "Will Palantir Stock Skyrocket After Feb. 2?": 0.5,
  "Bigger Tax Refunds Are Coming. Which Retailers Gain the Most.": 0.2,
  "Better Stablecoin Buy: USD Coin vs. PayPal USD": 0.5,
  "3 Troubling Trends for Intuitive Surgical – and 1 Bright Spot": -0.5,
  "Why The Narrative Around Mondelez International (MDLZ) Is Shifting After The Latest Price Target Update": 0.5,
  "1 Unstoppable Stock I'm Buying on the Dip for My Daughter's Portfolio in 2026": 0.8,
  "Is Cadence Design Systems (NASDAQ:CDNS) A Risky Investment?": -0.5,
  "Here’s What Truist Financial Thinks About Fortinet, Inc (FTNT)": 0.2,
  "Jim Cramer on Micron: “It Could Be Worth Buying Even Up Here, You Know, If It’s Down For a Day”": 0.5,
  "Jim Cramer Says “Palantir’s Great, I Would Not Leave Palantir”": 0.8,
  "Jim Cramer on Kraft Heinz: “I’m a Seller, Not a Buyer”": -0.6,
  "What Are the 3 Top Artificial Intelligence (AI) Stocks to Buy Right Now?": 0.5,
  "MarketBeat Week in Review – 01/19 - 01/23": 0.0,
  "$DAVE & PayDay Lenders - Warning: Significant Increasing Regulatory Risks - *I would like to preface this by saying I had attempted to post this on or around December 31, 2025 but was unable due to account newness.* *As a result I'm posting this now, despite not being as fresh-to-market news, to ensure those who are looking into FinTech in the current landscape are aware of the risks present.* \\------- Dave Inc. (DAVE) has recently": -0.6,
  "Here is why investors are snubbing Michael Saylor’s 10% dividend offer in Europe": -0.5,
  "US Pushes for Quickest Fixes to Boost Venezuela Oil Output": 0.5,
  "How Investors Are Reacting To Airbnb (ABNB) Balancing Softer Demand With High Efficiency And Monetization Potential": 0.5,
  "Atlassian Has Been Crushed—But the Setup Into Earnings Is Shifting": 0.2,
  "Wolfe Research Flags Tax Refund Tailwinds as a Positive for Costco Wholesale (COST)": 0.6,
  "These 7 Stocks Are Analyst Favorites For Magnificent Earnings Growth; Google Stock Holds Near Buy Point": 0.8,
  "Cognizant price target raised to $98 from $90 at Susquehanna": 0.5,
  "This millennial founder got rejected 73 times before building a 9-figure coffee company. One more no, ‘I would have figured out how to sell a kidney’": 0.2,
  "Morning Movers: Nvidia up after report of potential China move on H200 chips": 0.5,
  "PDD Holdings (NASDAQ:PDD) shareholders have endured a 36% loss from investing in the stock five years ago": -0.8,
  "Notable open interest changes for January 23rd": 0.0,
  "How Evolving Analyst Assumptions Are Reshaping The Story For Vertex Pharmaceuticals (VRTX)": 0.2,
  "Berkshire Hathaway (BRK-B) Looks to Exit Its 27.5% Stake in Kraft Heinz": -0.5,
  "Crypto Currents: BitGo raises $212.8M in U.S. IPO": 0.5,
  "Is Honeywell International (HON) Attractive After Recent Share Price Strength And Valuation Signals": 0.5,
  "Why a Costco membership makes sense for seniors & retirees": 0.5,
  "From No Fees to AI Agents: Ex-CEO Brett Keller’s 26 Years at Priceline": 0.5,
  "Sam’s Club makes key menu changes to take down Costco": 0.2,
  "'Years Ago, People Laughed At McDonald's Workers.' Now A Jobseeker Says Landing A Job There Feels Like A Miracle": 0.6,
  "Netflix's Greg Peters Says Paramount's Warner Bros Bid Has No Chance Without Larry Ellison, Calls Debt Plan 'Pretty Crazy'": 0.2,
  "Walmart (WMT) is a Sign of Growing Interest in Domestic Stocks, Says Jim Cramer": 0.6,
  "1 No-Brainer Nuclear Energy Stock to Buy Now and Never Sell": 0.8,
  "Assessing Baker Hughes (BKR) Valuation After Strong Recent Share Price Momentum": 0.5,
  "Is Honeywell’s Spinoffs and AI Push Altering The Investment Case For Honeywell International (HON)?": 0.1,
  "Is This Greg Abel’s Next Stock to Sell From Berkshire Hathaway’s Portfolio?": -0.5,
  "Will Any of These 3 High-Priced Stocks Split Their Stock?": 0.0,
  "Prediction: ASML Stock Could Surge 70%, According to a Wall Street Analyst": 0.8,
  "r/Stocks Weekly Thread on Meme Stocks Saturday - Jan 24, 2026 - The meme stock scheduled posts will now run weekly and post Saturday afternoon and won't be a sticky; you're probably seeing this because automod sent you here! [Full list of meme stocks here.](https://www.reddit.com/r/stocks/wiki/meme-stocks) This will be updated every once in a while. ------ Welcome traders who just can't help them selves discuss the same exact stock that's been discussed 100s of times a": 0.1,
  "Costco makes major investment in online shopping for members": 0.8,
  "Wedbush Is Betting That Netflix Can Double Ad Revenue in 2026. Does That Make NFLX Stock a Buy Here?": 0.5,
  "What Palantir Technologies (PLTR)'s Expanded Role in Sovereign and Industrial AI Infrastructure Means For Shareholders": 0.5,
  "Does Shopify (SHOP) Still Justify Its Price After Recent Pullback And Soaring P/E Ratio": -0.5,
  "Auto Parts Industry - Hi All , a noobie investor here. I know EV cars , and self-driving cars are booming . Even for EV cars tires need to be changed and some parts need to be maintained. Are there any other EV car parts and accessories stock ? I guess most companies won't give those to third party dealers as their margins will be affected . How do you guys view the auto parts": 0.2,
  "2 catalysts for bitcoin prices": 0.2,
  "A Look At Fortinet (FTNT) Valuation After Recent Share Price Rebound": 0.5,
  "Applied Materials Hits New High: Is AMAT Stock Poised for Continued Gains in 2026?": 0.6,
  "Netflix Stock Tanks After Earnings: Warning Sign or Should You Ignore?": -0.5,
  "Netflix Shares Continue to Fall. Is It Time to Buy the Dip?": -0.5,
  "A Look At Cognizant Technology Solutions (CTSH) Valuation After Its Recent 24% Three Month Share Price Gain": 0.2,
  "Should You Invest $1,000 in Netflix Stock Right Now?": 0.5,
  "Is Broadcom’s (AVGO) Expanding AI Deal Pipeline Redefining Its Core Investment Story?": 0.5,
  "Does Netflix’s Warner Bros. Bid and Buyback Pause Change The Bull Case For Netflix (NFLX)?": 0.2,
  "My Top 3 Chip Stocks for 2025 Crushed the Market. Here's Why They Can Repeat Again in 2026.": 0.8,
  "The Best Stocks to Invest $1,000 in Right Now": 0.5,
  "SpaceX IPO Will Help People Build Generational Wealth - If you had bought four shares of Nvidia at its 1999 IPO, it would have cost you about $48. After stock splits and one of the most extreme compounding runs in market history, those four original shares would today be worth just under $500,000. Now imagine applying that same compounding logic to SpaceX, even if it does not start small. Assume, conservatively, that any eventual public": 0.8,
  "Buffett Successor's First Big Move Could Be Exiting 1 of Berkshire's Largest Holdings": 0.5,
  "Google is about to replace Nvidia as the world's #1 value company - The path to #1 is shorter than anyone realizes. Nvidia is sitting at roughly $4.62 Trillion while Google is at $3.99 Trillion. The magic number Google needs to hit to surpass Nvidia is $380.50. That is just a 15.8% move from the current price of roughly $328 based on the close numbers. Remember what happened when Nvidia first took the top spot?": 0.6,
  "Where do I start investing at 19? - I have a Robinhood that I put a couple hundred on. It gave me the portfolio and I selected higher risk higher return. So I put like 300 on it there. But I am seeing people are saying Robinhood is bad. Also idk if putting it in the random portfolio is good. Should I be using a different app or not an app at all? I have": -0.5,
  "Is Earnings Momentum And Freight Intelligence Expansion Altering The Investment Case For Roper Technologies (ROP)?": 0.2,
  "A Look At Honeywell International (HON) Valuation After JPMorgan Upgrade And Aerospace Spinoff Plans": 0.2,
  "A Look At Vertex Pharmaceuticals (VRTX) Valuation After Recent Analyst Upgrades And CASGEVY Approval": 0.2,
  "Is Netflix a Buy Right Now? Why the Streaming Giant is Spooking Investors.": -0.5,
  "Assessing Cadence Design Systems (CDNS) Valuation After Recent Flat Returns And Mixed Growth Expectations": 0.0,
  "Wells Fargo Upgrades Broadcom (AVGO), Bernstein Keeps Outperform Rating": 0.5,
  "Bernstein Lowers Comcast (CMCSA) Price Target, BofA Turns Bullish": 0.5,
  "Analysts Lower T-Mobile (TMUS) Price Targets": -0.5,
  "Is QUALCOMM (QCOM) One of the Best 5G Stocks to Invest In?": 0.5,
  "Wells Fargo Downgrades Charter Communications (CHTR), UBS Cuts PT": -0.5,
  "Memory Super-Cycle, $MU - Hello there, I’m sure many are aware of a memory super-cycle taking place. What I’m not seeing is a lot of retail sentiment toward these tickers yet. I know there has been a lot of fear, and I know there has been a lot of concern of the cyclical nature of memory stocks. However, most experts are expecting the memory shortage to last until at least 2028. I’m going to focus": 0.5,
  "Assessing PACCAR (PCAR) Valuation After Recent Share Price Momentum And Mixed Fair Value Signals": 0.2,
  "Meet the Under-the-Radar AI Stock and Palantir Partner That's Up 219%": 0.5,
  "Palantir Stock for the Next 10 Years: Buy, Hold, or Avoid?": 0.2,
  "Is Intuit (INTU) Offering Value After Recent Share Price Pullback?": 0.2,
  "Prediction: This AI Chip Stock Will Outperform Nvidia Again in 2026": 0.6,
  "Why Bernstein Sees Structural Upside for ASML Through 2029": 0.5,
  "Citizens Reiterates Market Outperform on Palo Alto Networks (PANW) After Industry Checks": 0.6,
  "Has The Market Overreacted To Adobe (ADBE) After Recent AI Competition Concerns?": 0.2,
  "Street Calls of the Week": 0.0,
  "Goldman Reaffirms Preference for Nvidia (NVDA) in AI Compute Ecosystem": 0.8,
  "Our US roots are no threat to Britain’s security, claims Palantir boss": 0.2,
  "Here Are the Top Four Blue-Chip Stocks To Buy in 2026, According to WarrenAI": 0.5,
  "Prediction: This Will Be the Next Artificial Intelligence (AI) Chip Stock to Join Nvidia, Taiwan Semiconductor, and Broadcom in the Trillion-Dollar Club (Hint: It's Not AMD)": 0.6,
  "The Smartest Nuclear Stock to Buy With $500 Right Now": 0.5,
  "Wall Street Has Fallen Out of Love With Software Stocks": -0.5,
  "ASML EARNINGS - I know ASML is a monopoly and will be for most likely the next maybe 5 years, but with its current valuation and my belief of weak guidance in its q4, ASML seems like an easy short/put. Q3 was weak, indicates flat to maybe revenue being up above 2025 with chinas segment declining dramatically. Built a model with reasonable growth rates, operating margins trends, wacc and perp growth rates. My number came": -0.6,
  "3 Things Investors Need to Know About the YieldMax MSTR Option Income Strategy ETF in 2026": 0.2,
  "Should You Bet Against This AI Stock in 2026?": -0.5,
  "Big Tech earnings, Fed meeting feature as markets end January with busiest week of Q1: What to watch": 0.2,
  "Is There Now An Opportunity In Axon Enterprise, Inc. (NASDAQ:AXON)?": 0.2,
  "Michael Saylor Warns on Bitcoin Protocol Drift as Quantum Risk Enters the Mainstream": -0.5,
  "When Will Zscaler, Inc. (NASDAQ:ZS) Turn A Profit?": -0.5,
  "Analog Devices, Inc. (ADI) Stands to Benefit as BofA Highlights Sector Tailwinds": 0.6,
  "Will Diamondback Energy Raise Its Dividend Next Month? If So, FANG Stock Could Rise": 0.5,
  "Big Tech Earnings Land With 2026’s AI Winners Still In Question": 0.1,
  "Western Digital (NASDAQ:WDC) stock performs better than its underlying earnings growth over last three years": 0.5,
  "The Home Depot, Inc. (HD) Remains a Key Pick as TD Cowen Updates Hardlines Outlook": 0.5,
  "American Electric Power Company, Inc. (AEP) in Focus as Morgan Stanley Reassesses Regulated Utilities": 0.1,
  "PYPL PayPal earnings move in two weeks? - PayPal has beaten earnings expectations more often than not but usually a green price reaction will be small (1 to 5 %) while a red move will be big (5 to 10 %). Considering the price is hovering around its multi-year low level and that the current 52-week range sits between $55.02 and $90.93, the current price at $56.62 is screaming high risk high reward opportunity. Of": 0.5,
  "JPMorgan Sees Back-Half Recovery for Mondelez International, Inc. (MDLZ) Despite Cocoa Headwinds": 0.5,
  "Investors Hedge China, Tech Risks Amid Trump TACO Trade Drama": -0.5,
  "How The Story For Booking Holdings (BKNG) Is Shifting With New Price Target Signals": 0.1,
  "A Look At Keurig Dr Pepper (KDP) Valuation As GHOST Energy Deal Reshapes Its Growth Strategy": 0.5,
  "Memory demands reality - From the perspective of a company investing in AI infrastucture: Memory prices have been rising fast, but even with strong demand, isn’t there a point where prices get so irrational that not buying becomes the more rational choice? In radical example, if price is ridiculously expensive that which surpassed expected gains or profits.. personally I would not invest at some point because it is not end of the world not using": 0.1,
  "Beyond Biotech—3 Healthcare Stocks for Growth-Minded Investors": 0.5,
  "Assessing Verisk Analytics (VRSK) Valuation After Recent Share Price Weakness And Mixed Performance": 0.1,
  "What Could Shift The Story Behind Ross Stores (ROST) After The New Price Target?": 0.2,
  "Assessing Marriott International (MAR) Valuation After Recent Share Price Strength": 0.5,
  "Texas Deep Freeze Shutters Some Energy-Consuming Industry Sites": -0.5,
  "2 Cybersecurity Stocks You Can Buy and Hold for the Next Decade": 0.5,
  "Barclays Sees 2026 as a Pivotal Year for Comcast Corporation (CMCSA) and the Broader Telecom Landscape": 0.5,
  "'America Has Been Over-Retailed'— Over 8K Stores Are Gone And Even Luxury Isn't Safe As Saks, Neiman Marcus, And Starbucks Start Slashing": -0.7,
  "How a 'perpetual’ stock trick could solve Michael Saylor’s $8 billion debt problem": 0.5,
  "Nvidia's 85% GPU Market Share Faces Growing Competition: Is This AI Stock Still a Buy for 2026?": 0.2,
  "Long on Copper? - Gold and silver are crowded debasement trades. Prices are extreme and positioning is heavy, making forward returns fragile. Copper hasn’t repriced to the same degree. It’s under-owned relative to its importance and increasingly looks like a value metal within hard assets. Copper is the backbone of reindustrialization. AI data centers, power grids, defense, EVs, electrification, and energy infrastructure all require large and rising amounts of copper. Nearly every credible growth or": 0.5,
  "Walmart vs. Target: Which Is the Better Long-Term Play?": 0.5,
  "Baker Hughes Announces Fourth-Quarter and Full-Year 2025 Results": 0.5,
  "Should You Buy Netflix Stock After Its 36% Plunge?": -0.5,
  "Afraid You Missed the AI Boom? This Late-Cycle Winner Could Be Your Second Chance.": 0.5,
  "Samsung to start production of HBM4 chips next month for Nvidia supply, source says": 0.5,
  "Micron stock - cyclical? - I got lucky enough to start a position in MU last Summer just before it jumped so much. I was anxious last earning and sold 1 of my calls which will expire this June and missed out tons of extra profit. I still have 2 calls expiring in September and 100 shares. My calls are up 1000% now and stock up 250%. I've read that after 2026 growth could slow": 0.5,
  "(Item 1.01) Entry Into Material Definitive Agreements. On January 23, 2026, Copart, Inc. (“ Copart ”) entered into a Senior Revolving Credit Agreement (the “ Credit Agreement ”) by and among Copart, certain subsidiaries of Copart party thereto, the lenders party thereto, and Wells Fargo Bank, National Association, as administrative agent. Concurrently with entry into the Credit Agreement, Copart terminated all available commitments and repaid all amounts outstanding under that certain Second Amended and Restated Credit Agreement,\n\n(Item 1.01) of this Current Report is incorporated herein by reference. Section 9 — Financial Statements and Exhibits": 0.1,
  "(Item 8.01) Other Events. ATM Update On January 26, 2026, Strategy Inc (\"Strategy\") announced an update with respect to sales made under its at-the-market offering program (\"ATM\") of the following securities: During Period January 20, 2026 to January 25, 2026 As of January 25, 2026 Security Shares Sold (1) Notional Value (in millions) (2) Net Proceeds (in millions) (3) Available for Issuance and Sale (in millions) STRF Stock - $ - $ - $ 1,619.3 10.00% Series": 0.1,
  "Oscar Mayer Wienie 500 Returns for its Second Year with a Sizzling New Twist": 0.6,
  "(Item 1.01) Entry into a Material Definitive Agreement. Amendment to and Extension of the 2017 Credit Facility On January 23, 2026, Paychex of New York LLC, a Delaware limited liability company (“PoNY”) and Paychex, Inc., a Delaware corporation (the “Parent”) entered into an amendment (the “2017 Credit Facility Amendment”) to the $750.0 million, five-year, unsecured, revolving credit facility established in favor of PoNY as borrower on August 17, 2017 (as previously amended and extended from time to\n\n(Item 1.01) is hereby incorporated by reference into this": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On January 25, 2026, Baker Hughes Company (the \"Company\") issued a news release announcing its financial results for the quarter and year ended December 31, 2025, a copy of which is furnished with this Form 8-K as Exhibit 99.1 and incorporated herein by reference. In accordance with General Instructions B.2. of Form 8-K, the information shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange\n\n(Item 2.02) , \"Results of Operations and Financial Condition.\"": 0.1,
  "Oppenheimer Sees Shopify Inc. (SHOP) Positioned for Recovery Despite Software AI Volatility": 0.5,
  "Samsung Nears Nvidia’s Approval for Key HBM4 AI Memory Chips": 0.6,
  "Baker Hughes Posts Record Backlog as LNG and Power Orders Lift 2025 Results": 0.8,
  "What To Expect From Texas Instruments’s (TXN) Q4 Earnings": 0.2,
  "PACCAR (PCAR) To Report Earnings Tomorrow: Here Is What To Expect": 0.5,
  "Seagate Technology (STX) Q4 Earnings: What To Expect": 0.2,
  "Will Industrial Restocking and Dividend Stability Change Texas Instruments' (TXN) Embedded AI Supply-Chain Narrative?": 0.2,
  "Medical Devices & Supplies - Imaging, Diagnostics Stocks Q3 Results: Benchmarking GE HealthCare (NASDAQ:GEHC)": 0.1,
  "Q3 Rundown: Amgen (NASDAQ:AMGN) Vs Other Therapeutics Stocks": 0.0,
  "3 Reasons KDP is Risky and 1 Stock to Buy Instead": -0.5,
  "US stocks rise as gold hits another record and the dollar's value sinks again": 0.6,
  "3 Software Stocks with Questionable Fundamentals": -0.5,
  "2 Growth Stocks to Stash and 1 We Question": 0.2,
  "2 Unprofitable Stocks to Consider Right Now and 1 That Underwhelm": -0.5,
  "2 High-Flying Stocks to Target This Week and 1 That Underwhelm": 0.2,
  "Anthropic’s Claude Code Platform Looks Like a Software Killer": 0.8,
  "Kuala Lumpur is Among Top 10 Destinations in Asia for Celebrating the Lunar New Year - Agoda": 0.6,
  "Should You Buy the Dip in Palantir Stock?": 0.2,
  "This Controversial AI Stock Could Shock Investors in 2026": 0.2,
  "Baker Hughes: Q4 Earnings Snapshot": 0.0,
  "Zacks Investment Ideas feature highlights Advanced Micro Devices and Nvidia": 0.5,
  "How Analyst Price Targets Are Rewriting The Story For Palo Alto Networks (PANW)": 0.5,
  "Meta Earnings, Fed Decision, Venezuela Testimony: What to Watch This Week": 0.2,
  "Micron Stock Is Up Over 260%. Here's Why It Could Go Even Higher": 0.8,
  "Zacks Market Edge Highlights: Twilio, Salesforce and Adobe": 0.0,
  "Retail’s risky AI commerce bet": -0.5,
  "3 AI Stocks That Will Trounce Palantir in 2026, According to Wall Street": 0.5,
  "Intuitive’s cardiac initiative includes valve repair, LAA closure": 0.5,
  "Power Over Ethernet Chipsets Market Report 2026 - Global Industry Size, Share, Trends, Opportunity, and Forecast, 2021-2031": 0.0,
  "Commercial Aircraft Gas Turbine Engines Market Report 2026-2030 Featuring Profiles of GE Aviation, Honeywell, MTU Aero Engines, Raytheon Technologies Corp., Rolls-Royce and Other Key Players": 0.2,
  "2 Cheap Tech Stocks to Buy Right Now": 0.5,
  "Marriott International Announces Outstanding Global Growth and Milestone Achievements in 2025": 0.8,
  "Why Strategy is still betting on bitcoin": 0.2,
  "1 AI Stock Down 14% to Start 2026 That Looks Like an Absolute Bargain Right Now": 0.6,
  "Assessing ASML Holding (NasdaqGS:ASML) Valuation After A Strong Multi‑Month Share Price Run": 0.2,
  "Tariffs linger over earnings, even as companies get used to them": -0.5,
  "PDD Holdings (PDD) Facing Regulatory Challenges, Here’s What You Need To Know": -0.5,
  "Stocks Set for Muted Open After Trump’s Tariff Threats, Big Tech Earnings and Fed Meeting in Focus": 0.2,
  "Top Growth Companies With High Insider Ownership In January 2026": 0.5,
  "AI Chips Today - Europe Advances AI Sovereignty With EU AI GRID Launch": 0.6,
  "Analyzing Workday And Two Other Stocks That May Be Priced Below Fair Value Estimates": 0.5,
  "RBC Lowers Price Target on Seven Technology Stocks": -0.5,
  "Aircraft Sensors Market Report 2026-2030 & 2035 Featuring Strategic Analysis of General Electric, United Technologies, Raytheon, Lockheed Martin, Honeywell and More": 0.5,
  "Silver prices surge as gold rally spreads": 0.6,
  "Amgen's (NASDAQ:AMGN) 11% CAGR outpaced the company's earnings growth over the same five-year period": 0.2,
  "Baker Hughes Q4 Earnings Beat Estimates on IET Segment Performance": 0.8,
  "Stocks Down Pre-Bell Ahead of Major Tech Earnings, Fed Policy Decision": -0.5,
  "Hardware Firewall Market Outlook (2026-2031) Featuring Profiles of Fortinet, Palo Alto Networks, Cisco Systems, Check Point Software Technologies, Juniper Networks and More": 0.5,
  "$44.13 Billion Hyperlocal Grocery Delivery Market Outlook, 2031: Key Players are Shadowfax, RoadCast, Amazon, Grofers India, Yandex, Maplebear, Walmart, Big Basket, Delivery Hero": 0.5,
  "Why January 2026 Is the Perfect Time to Buy This Beaten-Down Tech Stock": 0.6,
  "This Week In Digital Payment - Revolutionizing Payment Security: AI and Tokenisation Lead Charge": 0.6,
  "Evercore ISI upgrades Cisco, sees ’plenty of tailwinds’": 0.8,
  "ASML Holding Before Q4 Earnings: How Should Investors Play the Stock?": 0.2,
  "CEG vs. D: Which Stock Benefits More From Rising Power Demand?": 0.0,
  "Reed Semiconductor Prevails in USPTO PTAB Patent Invalidation Proceeding Against Monolithic Power Systems": 0.5,
  "AI Fuels Surge in Data Privacy Investments and Redefines Governance, Cisco Reports": 0.5,
  "Retail Investors Dump Apple Stock While Nvidia, Tesla See Massive Inflows": 0.5,
  "USA Rare Earth Deal Adds to Trump Administration's Portfolio": 0.5,
  "Cisco Launches New Cisco 360 Partner Program, Built with Partners for the AI Era": 0.5,
  "Quantum ActiveScale & Telestream DIVA Build Sustainable Media Archives": 0.5,
  "Cisco Stock Rises on Upgrade. It’s a Big-Cap Bargain, Analyst Says.": 0.8,
  "Billionaire Michael Saylor’s Strategy Buys 2,932 Bitcoin for $264M": 0.8,
  "Here Are Monday’s Top Wall Street Analyst Research Calls: Amazon.com, AppLovin, Cisco Systems, Cognizant Technology, Dutch Bros., Meta Platforms, Netflix, and More": 0.5,
  "Strategy purchased $264 million in bitcoin last week, a slowdown from recent acquisition pace": 0.1,
  "AI-Driven Foundry Demand Likely to Boost LRCX's Systems Revenues in Q2": 0.6,
  "Factbox-Trump administration pivots to buying stakes in critical sectors": 0.2,
  "If You Invested $1000 in Walmart a Decade Ago, This is How Much It'd Be Worth Now": 0.5,
  "Earnings live: Nucor stock falls, Baker Hughes rises as Big Tech earnings loom": 0.2,
  "Strategy buys 2,932 bitcoin for $264 million funded by common and preferred shares": 0.5,
  "Nvidia and HubSpot have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Intel's Make-or-Break Foundry Moment Arrives This Year": 0.5,
  "Private companies account for 37% of Coca-Cola Europacific Partners PLC's (AMS:CCEP) ownership, while institutions account for 31%": 0.1,
  "Netflix in Focus After Strong Q4 Earnings With Huge Short-Term Upside": 0.8,
  "Cognizant and Typeface Partner to Modernize Enterprise Marketing Through Agentic AI Orchestration": 0.5,
  "Checkr and Intuit Partner to Streamline Background Checks for Millions of Growing Businesses": 0.8,
  "Sandisk Stock Is Up 1,000% in 6 Months. Analysts Think It Can Gain Another 20% from Here.": 0.8,
  "Investors Heavily Search Intuitive Surgical, Inc. (ISRG): Here is What You Need to Know": 0.5,
  "Here is What to Know Beyond Why Netflix, Inc. (NFLX) is a Trending Stock": 0.2,
  "Intel Corporation (INTC) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Constellation Energy Corporation (CEG) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Take the Zacks Approach to Beat the Markets: Drilling Tools, Alcoa & Starbucks in Focus": 0.5,
  "Tech earnings, gold & silver highs, gov't shutdown odds: 3 Things": 0.2,
  "AI Push Drives SHOP's Merchant Solutions Revenues: More Upside Ahead?": 0.6,
  "Da Vinci 5 Cleared for Cardiac Procedures": 0.5,
  "Don't Overlook Netflix (NFLX) International Revenue Trends While Assessing the Stock": 0.5,
  "Insights Into Comcast (CMCSA) Q4: Wall Street Projections for Key Metrics": 0.2,
  "Ahead of Honeywell International (HON) Q4 Earnings: Get Ready With Wall Street Estimates for Key Metrics": 0.2,
  "Countdown to KLA (KLAC) Q2 Earnings: A Look at Estimates Beyond Revenue and EPS": 0.2,
  "Prediction: PayPal Beats Earnings On Feb 3rd and Will Hit $90 Soon": 0.8,
  "Tech stocks are confronting a challenge they haven't had to worry about in a while": -0.4,
  "Meta, Apple, Microsoft report earnings this week: What to watch": 0.0,
  "Brokers Suggest Investing in Micron (MU): Read This Before Placing a Bet": 0.5,
  "Brokers Suggest Investing in Walmart (WMT): Read This Before Placing a Bet": 0.2,
  "CoreWeave stock surges amid fresh $2 billion investment from Nvidia": 0.8,
  "Nvidia’s Unspoken Problem: 40% of Revenue Comes From Companies Developing Their Own AI Chips": -0.5,
  "China Remains Competitive: Can ISRG Defend Share Amid Local Rivals?": 0.2,
  "Netflix, Meta upgraded: Wall Street's top analyst calls": 0.5,
  "Needham upgrades AppLovin, sees stronger e-commerce growth and ‘potential upside’": 0.6,
  "The AI Infrastructure Stock That's About to Flip the Script": 0.6,
  "Intuit (INTU): Morgan Stanley’s Optimism Stems from Emerging growth drivers, Attractive Valuation": 0.8,
  "Workday (WDAY) Announces Plans to Invest CA$1 billion in Canada": 0.6,
  "TD Cowen Remains Optimistic on Datadog (DDOG) Stock Amidst Attractive Valuation": 0.8,
  "HD Hyundai and Palantir Technologies (PLTR) Strengthen Their Partnership": 0.5,
  "Teradyne (TER) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "NXP Semiconductors (NXPI) Earnings Expected to Grow: Should You Buy?": 0.5,
  "Will Twist Bioscience (TWST) Report Negative Earnings Next Week? What You Should Know": -0.5,
  "Eaton Stock Rises as Spin-Off Revealed. Why It’s Going All-In on Planes and AI Data Centers.": 0.5,
  "Michael Saylor’s Strategy Buys 2,932 BTC for $264M amid Market Pullback": 0.5,
  "ETFs to Buy as Intel Plunges 17% Despite Q4 Earnings Beat": 0.5,
  "Will Check Point's Recent AI Advancements Help Steer the Competition?": 0.5,
  "Nvidia’s rally shows DeepSeek fears were unfounded a year later": 0.5,
  "DoorDash and Uber Lose Bid to Block NYC Tipping Law": -0.5,
  "Can Akamai's Cybersecurity Deal With Deutsche Telekom Fuel Its Shares?": 0.2,
  "BC-Most Active Stocks": 0.0,
  "Cisco Upgraded On Above Consensus Profit, Revenue Outlook": 0.8,
  "Palantir CEO on AI, immigration: Karp says the quiet part out loud": 0.1,
  "Wall Street Sours on Intel After Q4 Earnings. Should You Buy the Dip or Stay Far, Far Away?": -0.6,
  "Micron stock falls after Samsung nears HBM4 certification for Nvidia": -0.5,
  "Microsoft takes aim at Google, Amazon, and Nvidia with new AI chip": 0.5,
  "Strategy Spends $267 Million on Bitcoin, Issues STRC for Third Straight Week": 0.2,
  "Chart of the Day: Tech stock domination gets a reality check": 0.1,
  "Microsoft rolls out next generation of its AI chips, takes aim at Nvidia's software": 0.5,
  "BofA flags attractive compute valuations, highlights 4 key stocks": 0.5,
  "TD Cowen Bullish on Constellation Energy (CEG) Amid Heightened Regulatory Risks and Recently Completed Calpine Acquisition": 0.8,
  "1 Stock Down 21% So Far in 2026 to Buy Before It Rebounds 76%, According to Wall Street Analysts": 0.6,
  "Lululemon Founder Outraged Over See-Through Leggings: 'A New Low'": -0.8,
  "Crypto Investors Cry 'Rug' As Token Tied To Pokémon Card Trading Project Crashes Near Zero": -0.8,
  "Tom Lee’s BitMine Corners 3.5% of Ethereum Supply as Treasury Tops With 4.24M ETH Buy": 0.5,
  "EXPE or MELI: Which Is the Better Value Stock Right Now?": 0.5,
  "Baker Hughes Q4 Earnings Call Highlights": 0.5,
  "Bloom Energy (BE) Sees Strong Share Price Momentum Amid Expectations For Strong Volumes": 0.8,
  "My 2026 Strong Bullish Recommendations - Spent a long time hand picking these by going one by one through thinkorswim and looking for solid companies that have bottomed and are showing strong Nikki’s momentum going forward. Each has a great near term opportunity but would also be good long term holds. Options are cheaper here than other popular names from social media and offer a higher near term upside. Good luck out there. Worked hard": 0.8,
  "Could Micron Technology Stock Make You a Millionaire in 2026?": 0.5,
  "PACCAR (PCAR) Q3 2024 Earnings Call Transcript": 0.0,
  "Roper (ROP) Q1 2025 Earnings Call Transcript": 0.2,
  "Roper (ROP) Q3 2025 Earnings Call Transcript": 0.0,
  "What Starbucks’s New CEO Has Changed, and What He Says Is Next on His List": 0.2,
  "Microchip Technology (MCHP) Is Up 0.01% in One Week: What You Should Know": 0.5,
  "Walmart (WMT) Upgraded to Buy: What Does It Mean for the Stock?": 0.5,
  "Jeff Bezos Said He Made $80K A Year At Amazon And Turned Down More Because It Would Feel 'Icky' —'How Could I Possibly Need More Incentive?'": 0.6,
  "2 No-Brainer AI Stocks to Buy Hand Over Fist for 2026": 0.6,
  "The ‘Magnificent 7’ Are Off to a Mixed Start in 2026. Here’s What to Watch as Their Earnings Start": 0.1,
  "Amazon delivers more bad news for workers before earnings": -0.6,
  "Why The Trade Desk (TTD) Shares Are Falling Today": -0.5,
  "Western Digital (WDC) Stock Is Up, What You Need To Know": 0.5,
  "After 40 years of climbing the ladder, Walmart’s CEO Doug McMillon is retiring—his top tip for Gen Z is that ‘life is too short’ to hate their jobs": 0.5,
  "Seagate (STX) Q1 2025 Earnings Call Transcript": 0.0,
  "Netflix Stock Is Living a Nightmare. Why It Just Got Upgraded.": 0.5,
  "Trump’s economy is the ‘least conservative’ in a lifetime, top economist warns. ‘Our kids will feel it in a set of lost opportunities’": -0.6,
  "Exploring High Growth Tech Stocks in the US Market": 0.5,
  "3 Noteworthy Stocks Trading Up To 43.9% Below Estimated Intrinsic Value": 0.5,
  "It’s tax-filing time — here’s what to know about deductions, 'no tax on tips,' and more": 0.5,
  "AMD Gets a Price-Target Raise on Its Strong 2026 Prospects": 0.8,
  "What Is One of the Best Growth Stocks to Hold for the Next 5 Years?": 0.5,
  "Amazon Stock Has Trailed Tech Peers. Why It’s This Analyst’s Top Pick.": 0.5,
  "Tradr to Launch Leveraged ETFs on LITE, SNDK and WDC": 0.2,
  "Roper (ROP) Q3 2024 Earnings Call Transcript": 0.0,
  "Micron Slips on Samsung HBM4 Nvidia Report": -0.5,
  "Costco Stock Has Moved Up Over the Last Month - What Are the Best Plays Now?": 0.5,
  "Strategy buys more Bitcoin—$264 million of it—even as Bitcoin slumps to $87,000": 0.2,
  "Seagate, Western Digital Stocks Stay Red-Hot Ahead Of Earnings. What To Know.": 0.5,
  "3 ETFs Seeing Record Redemptions As Investors Rush For The Exits": -0.8,
  "Roper (ROP) Q2 2025 Earnings Call Transcript": 0.0,
  "Why Cisco Systems (CSCO) Price Target Revision Is Rewriting The Story Around The Stock": 0.5,
  "Dear Seagate Technology Fans, Mark Your Calendars for January 27": 0.5,
  "BMBL struggles with revenue decline despite cost cuts and balance sheet improvements - Bumble Inc BMBL has been trading near multiyear lows recently, around 3.55 to 3.60 USD, reflecting pressure from declining revenue and changing user metrics. Over the past year, the stock has fallen sharply from previous highs, while management has taken steps to cut costs and improve financial flexibility. For context, Q3 2025 revenue came in at about 246.2 million USD, down roughly": -0.6,
  "Why this onetime sleepy tech stock has already exploded 100% in 2026": 0.6,
  "Bank of America Still Thinks Palantir Is One of the Best Stocks to Buy for 2026": 0.8,
  "AMD's Profits Set To Surge, Analysts Say; Two Data Center Plays Also On Watch": 0.8,
  "Costco's $4.99 chicken under fire over 'no preservatives' claim": -0.5,
  "AppLovin Stock Is Climbing. The Ad Platform Won Some Big Clients, Analyst Says.": 0.6,
  "Microsoft Takes Aim at Amazon, Google AI Chips": 0.5,
  "Amazon Shares Slip on Reports of 16,000 Job Cuts": -0.7,
  "Intel Stock Slides Again. Analysts Pin Hopes on PC Rebound": -0.5,
  "The Intel Business Growing 50% That Nobody's Talking About": 0.5,
  "Micron Shares Fall as Samsung Nears Nvidia HBM4 Certification": -0.5,
  "Why MicroStrategy’s Latest Bitcoin Purchase Is Deeply Concerning": -0.8,
  "Meta Has the Best Ad ‘Demand Machine.’ Why the Stock Can Rise 34% This Year.": 0.8,
  "Figma’s IPO Is a Cautionary Tale. How AI Busted the Stock.": -0.5,
  "Why investors should focus on robots that do the 'dirty jobs'": 0.5,
  "Generali Loads Up 5,000 MELI Shares Worth $10.6 Million": 0.5,
  "Netflix, Visa and 7 Other U.S. Stocks to Ride the International Stock Rally": 0.5,
  "Should Wells Fargo’s AI Hire and Emberpoint Bet Prompt a Rethink by WFC Investors?": 0.2,
  "This Artificial Intelligence (AI) Stock Is Trading at a Massive Discount Despite Red-Hot Growth": 0.8,
  "Shopify Stock Has Been Slammed in 2026. Is Now the Time to Buy This Growth Stock?": 0.2,
  "BofA says the chip reshuffle makes Nvidia a 'compelling' value play": 0.8,
  "Microsoft debuts its next-gen AI chip": 0.5,
  "Apple (AAPL) Stock Trades Up, Here Is Why": 0.5,
  "AMD (AMD) Stock Trades Down, Here Is Why": -0.5,
  "Why Seagate Technology (STX) Stock Is Up Today": 0.5,
  "Why CrowdStrike (CRWD) Stock Is Trading Up Today": 0.5,
  "Why Datadog (DDOG) Stock Is Up Today": 0.5,
  "Why Cisco (CSCO) Stock Is Trading Up Today": 0.5,
  "Baker Hughes Co (BKR) Q4 2025 Earnings Call Highlights: Record EBITDA and Strategic Growth ...": 0.8,
  "As Nvidia Sets Up, This AI Stock Tickles New Buy Zone While Top Funds Gobble Up Shares": 0.8,
  "Stock market today: Dow, S&P 500, Nasdaq rise to kick off key week with Big Tech earnings, Fed decision": 0.5,
  "AMD Stock Flirts With Buy Point Ahead Of Q4 Report": 0.5,
  "Susquehanna Sees CSX Refocusing on Fundamentals Under New CEO": 0.5,
  "These Stocks Are Today’s Movers: USA Rare Earth, CoreWeave, Micron, Intel, Newmont, Booz Allen, IonQ, and More": 0.5,
  "How major US stock indexes fared Monday, 1/26/2026": 0.0,
  "Tesla and 3 More Mag 7 Stocks Report Earnings This Week. What the Options Market Predicts.": 0.2,
  "3 AI Chip Stocks to Buy in January: Nvidia, AMD, and Broadcom Battle for Market Share": 0.5,
  "Tesla reality plays catch-up with Elon Musk's promises": 0.5,
  "Samsung Wins Memory Chip Deal With Nvidia, Report Says. Why Micron Stock Is Dropping.": 0.2,
  "Stock Market Today: Dow Up Despite Schumer Shutdown Call; Michael Burry Boosts GameStop (Live Coverage)": 0.5,
  "Susquehanna Sees Early Industrial Recovery Lifting Texas Instruments (TXN) Outlook": 0.6,
  "UPS Earnings Are Arriving. The Dividend, MD-11s, and the Economy Are on the Docket.": 0.1,
  "GameStop’s Original Bull Is Back. CEO Ryan Cohen Has Berkshire-Like Ambitions.": 0.8,
  "Minnesota CEOs Walk a Fine Line in Call for ‘Immediate De-Escalation’": 0.1,
  "How Nvidia Just Made CoreWeave Stock a Winner Again": 0.6,
  "Microsoft Reports Q2 Earnings Jan. 28. Is MSFT Stock a Buy Before Then?": 0.2,
  "Stocks to Watch Monday Recap: CoreWeave, IonQ, USA Rare Earth, RevMed": 0.5,
  "Senate Antitrust Panel Chair Raises Concerns Over Netflix-Warner Deal": -0.5,
  "Energy & Utilities Roundup: Market Talk": 0.0,
  "Cathie Wood trims $8 million in major tech stock before earnings": -0.5,
  "Pursue Wealth Sells Entire Advance Auto Parts Holding": -0.5,
  "Agilysys (AGYS) Misses Q3 Earnings Estimates": -0.5,
  "ROSS STORES ANNOUNCES THE PASSING OF FORMER CHAIRMAN AND CEO NORMAN A. FERBER": -0.8,
  "Monster Storm Disrupts Business at Tens of Thousands of Stores": -0.8,
  "Here's How Much Traders Expect Tesla Stock to Move After Earnings This Week": 0.2,
  "Dan Niles: Not All AI-Associated Stocks Will Win": -0.5,
  "Palo Alto Networks (PANW) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Shopify (SHOP) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.5,
  "Marvell Technology (MRVL) Rises Higher Than Market: Key Facts": 0.5,
  "Micron (MU) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Alphabet (GOOGL) Rises Higher Than Market: Key Facts": 0.5,
  "Alphabet Inc. (GOOG) Outperforms Broader Market: What You Need to Know": 0.6,
  "Stock Market Today, Jan. 26: CoreWeave Jumps After Nvidia Invests $2 Billion in AI Infrastructure Partnership": 0.6,
  "3 Things Alphabet Needs to Prove in 2026": 0.1,
  "Amgen (AMGN) Laps the Stock Market: Here's Why": 0.5,
  "Cadence Design Systems (CDNS) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "Trump Hikes Tariffs on South Korea to 25%, up from 15% - Looks like he's not done trying to rally gold after his weekend threat against Canada. Load up on your stocks boys because it'll be TACO Tuesday tomorrow [From NBC](https://www.nbcnews.com/business/economy/trump-says-hiking-tariffs-south-korean-goods-25-rcna256028): President Donald Trump said Monday that he was hiking tariffs on imports from South Korea to 25% from 15%, complaining that the nation's legislature wasn't \"living up\" to a trade deal that was struck": 0.2,
  "Warner Bros. Discovery (WBD) Stock Dips While Market Gains: Key Facts": 0.1,
  "Kraft Heinz (KHC) Rises Higher Than Market: Key Facts": 0.5,
  "Agilysys Q3 Earnings Call Highlights": 0.5,
  "Meta to test premium subscriptions on Instagram, Facebook, and WhatsApp": 0.2,
  "The Bull Case For Tencent Holdings (SEHK:700) Could Change Following Fresh Access To Nvidia H200 Chips - Learn Why": 0.5,
  "Should Apple’s New Creator Studio Bundle Reshape How Investors View AAPL’s Services Ecosystem Strategy?": 0.5,
  "Is DoorDash’s Hibbett Partnership Reshaping the Investment Case For DASH?": 0.2,
  "Prediction: These 2 Growth Stocks Will Beat the Market Through 2031": 0.5,
  "Prediction: Nvidia's Stock Price Will Reach This Level By the End of 2026": 0.2,
  "U.S. judge weighs school districts' addiction claims against social media companies": 0.1,
  "Stock market today: Dow, S&P 500, Nasdaq futures rise with Fed meeting, Big Tech earnings on deck": 0.5,
  "Veteran analyst drops bombshell call on Intel stock": 0.5,
  "AI chip startup Ricursive hits $4B valuation two months after launch": 0.8,
  "Costco Stock Has Jumped In 2026. Is It Too Late to Buy?": 0.2,
  "Why CleanSpark Plunged Nearly 10% Today": -0.7,
  "Why CoreWeave Stock Climbed Today": 0.5,
  "Google pays $68M to settle claims its voice assistant spied on users": -0.7,
  "Review & Preview: Another Swing at 7K": 0.2,
  "Can This Artificial Intelligence (AI) Stock Justify Its Valuation?": -0.5,
  "Is Texas Instruments (TXN) Pricing In Too Much Growth After Recent Share Price Strength": -0.5,
  "DoorDash (DASH) Valuation Check As New Retail Partnerships And Regulatory Challenges Draw Attention": 0.2,
  "Is ASML Holding (NasdaqGS:ASML) Pricing In Its Rapid 1 Year Share Price Surge?": 0.1,
  "Is Shopify’s (SHOP) Agentic Commerce Pivot Rewiring Its Competitive Moat Or Just Its Partnerships?": 0.1,
  "META: Threads Monetisation, Smart Glasses Dominance, and New Subscription Tiers - Meta is executing a three pronged strategy: text based social market (Threads), next gen hardware platform (Smart Glasses) and diversifying revenue (Subscriptions). **Threads** Meta is pivoting Threads from growth to revenue mode. * Threads recently surpassed X in global mobile Daily Active Users: 141.5M vs X’s 125M. * After a year of testing, Meta is rolling out ads globally to all users this week.": 0.6,
  "This Artificial Intelligence (AI) Stock, Up 28,700% Since Its IPO, Could Be the Biggest Bargain of the Decade": 0.8,
  "Qualcomm backs SpotDraft to scale on-device contract AI with valuation doubling toward $400M": 0.8,
  "Why Intel Stock Fell 5.7% Today": -0.6,
  "Starbucks CEO Brian Niccol Earned $31 Million in 2025": -0.5,
  "Exclusive-Micron to announce memory chip manufacturing investment in Singapore, sources say": 0.5,
  "Stocks up as earnings hopes offset Trump's Korea tariff move, dollar wobbles": 0.5,
  "Is It Too Late To Consider MercadoLibre (MELI) After Its Recent Share Price Climb?": 0.1,
  "Is It Too Late To Consider KLA (KLAC) After Its 121% One Year Surge?": 0.1,
  "What Berkshire Hathaway (BRK.A)'s Potential Kraft Heinz Exit Means For Shareholders": 0.2,
  "Micron Breaks Ground on Advanced Wafer Fabrication Facility in Singapore": 0.5,
  "Does This New Chip Threaten Nvidia?": 0.0,
  "Jim Cramer Says Seagate Needs a “Massive Beat and Raise” to “Keep It Running”": 0.2,
  "Jim Cramer on Danaher: “This Could Be the First Truly Strong Quarter in Years”": 0.8,
  "Jim Cramer on Starbucks: “It Can’t Keep Climbing Unless the Numbers Are Insanely Strong”": 0.2,
  "Jim Cramer on GE Vernova: “I Think You Need a Better Entry Point”": 0.2,
  "Jim Cramer on Corning: “I Think You Have to Just Hope It Comes Down So You Can Buy Some”": 0.2,
  "Jim Cramer Says Pressure From Generative AI “Shaved the Microsoft Price-to-Earnings Multiple Pretty Mightily”": -0.5,
  "Jim Cramer Discusses Meta Stock Performance and Concerns Over Future Capital Expenditures": 0.1,
  "Jim Cramer on Tesla: “It’s Not Just a Car Company”": 0.5,
  "Jim Cramer Discusses How the Honeywell Breakup Might Impact the Stock": 0.5,
  "Jim Cramer Says “I’m Not Changing My View, I Say, Own Apple, Don’t Trade It”": 0.6,
  "Jim Cramer Says Sandisk Is “Up Huge, Way Too Much for Me”": 0.2,
  "Jim Cramer Expects Western Digital’s Quarter to Be “Very Positive”": 0.8,
  "A New Era in Options Trading! Moomoo Partners with Nasdaq to Deliver Monday & Wednesday Expirations for Greater Flexibility and Opportunity": 0.8,
  "ADP (ADP) Reports Earnings Tomorrow: What To Expect": 0.0,
  "Meta (META) Q4 Earnings: What To Expect": 0.0,
  "Lam Research Earnings: What To Look For From LRCX": 0.5,
  "What To Expect From Microsoft’s (MSFT) Q4 Earnings": 0.2,
  "Starbucks (SBUX) Reports Earnings Tomorrow: What To Expect": 0.5,
  "Is It Too Late To Consider AppLovin (APP) After Its Strong Multi Year Share Price Run": 0.2,
  "Dow Jones Futures: AMD, Astera, Oklo, Rocket Lab, Tesla Sell Off; Fed Meeting Next": -0.2,
  "Nvidia Supply Deal In Crosshairs, Samsung Set To Start HBM4 Chip Production Next Month As Korean Giant Takes On SK Hynix: Report": 0.1,
  "Bank of America resets Meta stock forecast before earnings": 0.2,
  "Could Amazon Be a Millionaire-Maker Stock?": 0.5,
  "Micron plans $24-billion memory chipmaking plant in Singapore": 0.5,
  "Lightmatter Collaborates with Synopsys to Integrate Advanced Interface IP with Its Passage Co-Packaged Optics Platform": 0.5,
  "Lightmatter and Cadence Collaborate to Accelerate Optical Interconnect for AI Infrastructure": 0.5,
  "Morgan Stanley resets Apple stock forecast ahead of earnings": 0.5,
  "China’s Moonshot Unveils New AI Model Ahead of DeepSeek Release": 0.5,
  "India To Slash Tariffs On EU Car Imports To 40%: How This Move Could Affect Elon Musk's Tesla, Stellantis": 0.2,
  "Tesla vs. Meta Platforms: Which AI Growth Stock Is a Better Buy in 2026?": 0.5,
  "Gold, silver pull off shock move big tech never saw coming": 0.5,
  "Micron to Invest $24 Billion in Singapore to Boost Chip Production": 0.8,
  "Open Invention Network Unveils “OIN 2.0” to Enable the Next Era of Open Source Patent Protection": 0.5,
  "Agoda Launches Open-Source API Agent to Simplify MCP Server Integrations": 0.5,
  "ONE Data and Rockefeller Foundation to Launch New Development Finance Observatory in 2026": 0.5,
  "SpotDraft Secures $8M from Qualcomm Ventures, Pioneering On-Device AI for Enterprise Legal": 0.8,
  "Target breaks silence on ICE raids": 0.1,
  "Fully electric vehicle sales in EU overtake petrol for first time in December": 0.8,
  "Wall Street's Most Hated Stock Is About to Surprise Everyone": 0.5,
  "Tesla Ends 2025 With Lower Sales in Europe, While China’s BYD Powers On": -0.5,
  "Honeywell's Maheshwari On India's Trade Deals": 0.2,
  "Palantir and 5 More Stocks to Play Trump’s Plan to Invest in America": 0.5,
  "Shop price inflation 'defies expectations' to jump to 1.5% in January": 0.5,
  "Pros and cons of downsizing when you retire": 0.0,
  "Taxing tech: How do digital services levies differ across Europe?": 0.1,
  "ASML rides Nvidia's coattails with lasers and huge chip 'printers'": 0.5,
  "Axon's 9-Year Winning Streak Just Snapped. Can It Get Back on Track in 2026?": -0.5,
  "A Year After the DeepSeek Crash, Markets Face a New Chinese AI Threat": -0.5,
  "Bernstein Calls 2026 a “Waiting Year” for Amgen’s (AMGN) MariTide": 0.1,
  "Qualcomm (QCOM) Valuation Looks Elevated After Recent Move, Citi Says": -0.5,
  "Barclays Sees Defensive Appeal in PepsiCo (PEP) but Flags 2026 Risks": -0.5,
  "If You Invested $1,000 in Apple vs. Bitcoin in 2015, Here’s Which One Made You Richer": 0.5,
  "Stifel Sees Signs of a Demand Recovery for Texas Instruments (TXN)": 0.5,
  "Did NVIDIA’s US$2 Billion AI “Factory” Bet Just Shift CoreWeave’s (CRWV) Investment Narrative?": 0.2,
  "Will a Bigger Credit Line and Audit Expertise Change Paychex's (PAYX) Capital Structure Narrative?": 0.2
}