{
  "What Will Drive Starbucks (SBUX) Stock in 2026? 3 Important Factors Investors Must Watch.": 0.2,
  "Is T-Mobile US Still Attractive After Recent 5G Expansion and Share Price Pullback in 2025": 0.2,
  "Does CSX’s Recent 14% 2025 Rally Still Leave Room for Long Term Value?": 0.2,
  "Can Charter Communications, Inc.'s (NASDAQ:CHTR) ROE Continue To Surpass The Industry Average?": 0.2,
  "Is Monolithic Power Systems, Inc.'s (NASDAQ:MPWR) Recent Performance Tethered To Its Attractive Financial Prospects?": 0.2,
  "Possible Bearish Signals With Analog Devices Insiders Disposing Stock": -0.6,
  "The real AI revolution is going from the information era to the ‘intelligence era,’ Paypal senior VP says. That means your focus should be tokens": 0.6,
  "High Growth Companies With Strong Insider Confidence December 2025": 0.6,
  "Exploring US High Growth Tech Stocks In December 2025": 0.5,
  "Paychex Is Out of Favor—And That’s the Opportunity": 0.5,
  "E-Commerce Today - Emerging Opportunities in UK Online Retail Market": 0.5,
  "Is Starbucks open on Christmas 2025?": -0.5,
  "Lam Research (LRCX): Assessing Valuation After AI-Driven Upgrades and Strong Wafer Fab Demand": 0.6,
  "These 7 Stocks Are Analyst Favorites For Magnificent Earnings Growth; GE, Google Among Winners": 0.8,
  "What Offers Shopify (SHOP) a Durable Growth Profile?": 0.2,
  "TCW Concentrated Large Cap Growth Fund Sold Adobe Systems (ADBE) Due to Increasing Competition": -0.5,
  "Dogs of the Dow Beat the Market in 2025 — Here’s the Smarter 4-Stock Play for 2026": 0.5,
  "Is Synopsys (SNPS) an Attractive Investment Choice?": 0.5,
  "This ETF Will Benefit From Americans' Higher Energy Bills": 0.5,
  "Rothschild & Co LongRun Equity’s Investment Thesis for Cadence Design Systems (CDNS)": 0.5,
  "Is Fastenal Stock Priced for Perfection After Its Strong Multi Year Rally?": -0.5,
  "Is Shopify’s 2025 Valuation Justified After a 419% Three Year Share Price Surge?": 0.2,
  "Analysts Confident in NXP Semiconductors (NXPI) Amid Improving Outlook on Diversified Analog Semiconductor Market": 0.8,
  "December 2025's Top Insider-Owned Growth Stocks": 0.0,
  "3 Stocks Estimated To Be Trading At Discounts Of 23.1% To 41.2%": 0.5,
  "Why Analysts See Kraft Heinz’s Story Shifting After Guidance Cut and New CEO Announcement": 0.2,
  "Is Axon (AXON) Quietly Recasting Its Risk Profile With Debt Moves And AI-Driven Contracts?": 0.2,
  "Why The Narrative Around Intuit Is Shifting With OpenAI Partnership And Credit Karma Momentum": 0.5,
  "5 Insightful Analyst Questions From Paychex’s Q4 Earnings Call": 0.5,
  "The Zacks Analyst Blog Mineralys, Lyell, Insmed and Nektar": 0.0,
  "Starbucks' Q1 2026 Earnings: What to Expect": 0.0,
  "Gilead Sciences to acquire Repare’s RP-3467": 0.5,
  "China's rising biotech clout on show in flurry of billion-dollar licensing deals": 0.6,
  "2 Overlooked AI Stocks to Buy Before They Soar Up to 100% in 2026, According to Wall Street Analysts": 0.5,
  "Zscaler, Inc. (NASDAQ:ZS) is largely controlled by institutional shareholders who own 53% of the company": 0.1,
  "Booking Holdings Insider Lowered Holding By 30% During Last Year": -0.5,
  "S&P Futures Muted in Thin Post-Christmas Trade": 0.0,
  "MenuSifu Powers MIXUE's U.S. Expansion as Brand Becomes World's Largest Beverage Chain by Store Count": 0.6,
  "Is Amazon Stock a Buy Ahead of 2026?": 0.2,
  "Insider Confidence In December 2025's Leading Growth Companies": 0.5,
  "Exploring High Growth Tech Stocks In The US December 2025": 0.5,
  "Is ISRG's 20% Procedure Growth the New Normal or a Peak?": 0.1,
  "Got a Big Pile Of Unwanted Stuff to Send Back? You're Not Alone—It's Return Season": 0.2,
  "CELH vs. MNST: Which Energy Drink Stock Is the Better Bet Now?": 0.5,
  "4 Cybersecurity Stocks With Strong Demand and Durable Moats for 2026": 0.8,
  "Multiple Contraction Hit Atlassian Corp. (TEAM) in Q3": -0.5,
  "CrowdStrike at 'Forefront' of AI Revolution Amid Increasing Deal Momentum, Wedbush Says": 0.8,
  "Shopify Inc. (SHOP) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Investors Heavily Search Adobe Inc. (ADBE): Here is What You Need to Know": 0.5,
  "Here is What to Know Beyond Why AppLovin Corporation (APP) is a Trending Stock": 0.2,
  "The Zacks Analyst Blog Analog Devices, Amazon.com and Fortive": 0.0,
  "Is Axon (AXON) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Cisco Systems Stock Is Treading Water - How to Use Puts and Calls to Play CSCO": 0.0,
  "Kuwait Taps Baker Hughes to Boost Output From Mature Fields": 0.5,
  "MRVL vs. SNDK: Which AI Infrastructure Stock is a Better Bet?": 0.5,
  "3 Stocks at 52-Week Lows With Way More Upside Than Downside": 0.8,
  "QCOM Rides on Strength in Premium Handset Market: Will it Sustain?": 0.5,
  "Micron and 28 Other S&P 500 Stocks Hit 52-Week Highs on Wednesday. These 12 Are Doing It Again Today.": 0.5,
  "European Equities Traded in the US as American Depositary Receipts Little Changed in Friday Trading; Gains 2% for Week": 0.5,
  "DDOG vs. FIVN: Which Cloud Software Stock is the Better Buy Now?": 0.2,
  "Why This Long Strangle Trade Might Be Best For Palo Alto Stock": 0.5,
  "SE vs. TTWO: Which Gaming Stock Offers Better Growth Opportunity?": 0.5,
  "ADBE vs. GOOGL: Which AI-Driven Tech Stock Has an Edge Now?": 0.5,
  "Adobe Stock Rides on Expanding Partner Base: Is There More Upside?": 0.6,
  "HSTM vs. SHOP: Which Stock Should Value Investors Buy Now?": 0.2,
  "CrowdStrike Stock in Focus -- Wedbush Calls It 'AI Cybersecurity Leader' Ahead of 2026": 0.6,
  "Monster Beverage (MNST) Is Up 3.10% in One Week: What You Should Know": 0.5,
  "Iconic Mandarin Oriental owner files for Chapter 11 bankruptcy": -0.8,
  "Snowflake in Talks for $1 Billion Observe Acquisition": 0.5,
  "Cadence's Free Cash Flow Continues to Power M&A, Buybacks": 0.6,
  "FedEx (FDX) CEO is Playing Offense, Says Jim Cramer": 0.5,
  "Tech, Media & Telecom Roundup: Market Talk": 0.0,
  "Insiders Favor American Resources And Two Other Leading Growth Stocks": 0.5,
  "What PayPal’s stablecoin moves means for Wall Street’s crypto adoption in 2026": 0.5,
  "Top Analyst Reports for Advanced Micro Devices, Goldman Sachs and Lam Research": 0.5,
  "Here's Why Investors Should Hold Ensign Group Stock for Now": 0.5,
  "Stock Market Predictions For 2026? Worthless. This Approach? Priceless.": 0.5,
  "These Stocks Are Moving the Most Today: Nvidia, Apple, Tesla, Coupang, Micron, Lam Research, Newmont, Moderna, and More": 0.5,
  "Focus Universal Inc. Launches Cost-Effective Commercial IoT for Four Sectors": 0.5,
  "Nvidia Reportedly Shells Out $20.6 Billion For Groq, CEO Jonathan Ross Says He's Joining Rival Chip Giant Along With The Team": 0.2,
  "2026 software stock outlook: Analyst's top pick": 0.5,
  "Better Artificial Intelligence Stock: ASML vs. Taiwan Semiconductor": 0.5,
  "Take-Two Interactive (TTWO) Increases Despite Market Slip: Here's What You Need to Know": 0.5,
  "Western Digital (WDC) Rises As Market Takes a Dip: Key Facts": 0.5,
  "I'm Sounding an Alarm on Opendoor Technologies Stock Following Its Massive Drop This Month": -0.5,
  "3 Dividend Stocks to Buy to Create the Gift That Keeps on Giving": 0.5,
  "This Stock More Than Doubled In 2025. Can It Keep Soaring?": 0.5,
  "Morgan Stanley Sees Policy Risks Receding for Regeneron (REGN)": 0.2,
  "The Ultimate Growth Stock to Buy With $2,000 Right Now": 0.5,
  "The Outlook for Chinese Stocks and Economy Hinges on the U.S.": 0.1,
  "“People Didn’t Like” Paychex (PAYX)’s Quarter": -0.5,
  "Have $2,000? 3 Top Robotics Stocks to Buy and Hold for at Least a Decade": 0.5,
  "Here's What Airbnb (ABNB) Stock Investors Need to Watch in 2026": 0.2,
  "Should You Think About Buying Roper Technologies, Inc. (NASDAQ:ROP) Now?": 0.2,
  "Palo Alto Networks, Inc. (NASDAQ:PANW) Stock Has Shown Weakness Lately But Financials Look Strong: Should Prospective Shareholders Make The Leap?": 0.5,
  "Got $5,000? 3 Incredible Stocks to Buy for 2026": 0.5,
  "Texas Instruments (NASDAQ:TXN) Seems To Use Debt Quite Sensibly": 0.5,
  "Monster Beverage Corporation (NASDAQ:MNST) Shares Could Be 26% Above Their Intrinsic Value Estimate": 0.5,
  "2 Dividend Stocks to Double Up on Right Now": 0.5,
  "45% Of This Constellation Energy Insider's Holdings Were Sold": -0.5,
  "Can Honeywell International Inc. (NASDAQ:HON) Maintain Its Strong Returns?": 0.2,
  "Palantir, Nvidia Lead 5 Stocks Near Buy Points Heading Into Final Days Of 2025": 0.5,
  "Peter Thiel warns US real estate ‘catastrophe’ will deal massive blow to young Americans, but boomers might get windfall": -0.7,
  "Phishing scams becoming prevalent on LinkedIn: How to spot them": -0.6,
  "Here Are My Top 3 Growth Stocks to Buy Now": 0.5,
  "Is r/stocks actually good at stock picking? Analysis of recommendation posts for the past few years. - I did a quick analysis for various stock recommendation posts I found on r/stocks that were dated close to but prior to the year in question and figured out what the most recommended stocks were based on mentions and also based on # of upvotes. The data is [here](https://docs.google.com/spreadsheets/d/1f_gdYrPGSLqLV1fyBPt9LmamHkCnttG91ymClZa_GKM/edit?usp=sharing). In essence for 2025, the top 10 recommendations based": 0.1,
  "Here Are My Top 2 No-Brainer Growth Stocks to Buy Now": 0.8,
  "Netflix Stock: Buy, Sell, or Hold?": 0.0,
  "2 Red-Hot Growth Stocks to Buy in 2026": 0.8,
  "Popular gift retailer shuts stores, cuts jobs over holidays": -0.7,
  "Walmart, Starbucks and More Are Accepting Crypto Payments: What It Means for You": 0.5,
  "How Netflix, Paramount Sparked A $108 Billion Media War For Warner Bros. Discovery": 0.5,
  "2 No-Brainer Dividend Stocks to Buy Right Now": 0.5,
  "4 Stocks to Hold for the Next 5 Years": 0.0,
  "Companies Are Outlining Plans for 2026. Hiring Isn’t One of Them.": -0.6,
  "Comcast Is Cheap. Investors Are Too Pessimistic on Broadband, This Analyst Says.": 0.5,
  "What Is One of the Best Consumer Goods Stocks to Hold for the Next 10 Years?": 0.5,
  "5 Incredible Growth Stocks to Buy for 2026": 0.8,
  "Food Makers Need to Rekindle Demand in 2026. That’s a Tall Order.": -0.6,
  "There’s No Happy Ending for Movie Theaters, No Matter Who Wins Warner": -0.5,
  "GE HealthCare CEO Peter Arduini is forging a new chapter for the $20 billion-a-year business while drawing on Jack Welch’s legacy": 0.5,
  "2 Beaten-Down Stocks That Could Make a Comeback in 2026": 0.5,
  "Stocks sit near record highs as 'Santa Claus rally' builds, 2026 approaches: What to watch this week": 0.6,
  "Baker Hughes (NASDAQ:BKR) shareholders have earned a 20% CAGR over the last five years": 0.8,
  "2 Growth Stocks to Buy and Hold Through 2035": 0.5,
  "Netflix Is Out of Favor—and That’s Why It’s Getting Interesting": 0.5,
  "Costco Has Tumbled Despite Higher FCF and FCF Margins - Time to Buy COST Stock?": 0.2,
  "3 Stock-Split Stocks to Buy and Hold for at Least a Decade": 0.5,
  "Cyber scams on the rise: How to avoid getting phished by hackers": -0.7,
  "3 Must-Know Facts About Costco Before You Buy the Stock": 0.2,
  "Morgan Stanley Names Western Digital (WDC) a 2026 Top Pick Amid Cloud Capital Expenditure Boom": 0.8,
  "Needham Highlights Vertical Aerospace’s (EVTL) Execution Strengths Following Site Visit to UK Facilities": 0.6,
  "Why are solar industry related stocks not reacting to the price of silver going up? - If silver is such a major component in the making of solar panels, why are most solar related stocks continuing to pump despite silver prices going parabolic? Would this not increase production cost thus putting margin pressure on there already razor thin margins?": -0.6,
  "2 Nuclear Energy Stocks That Could Be Going to $0, and 1 Generating Serious Portfolio Power": -0.5,
  "Moody’s Upgraded Rating on Marvell Technology, Inc. (MRVL), Here’s Why": 0.8,
  "Wall Street Maintains a Positive Outlook on Charter Communications (CHTR)": 0.8,
  "Jim Cramer on International Business Machines: “It’s Still Cheap”": 0.6,
  "Jim Cramer Considers CrowdStrike One of the “Best of Breed” in Cybersecurity": 0.8,
  "Jim Cramer Discusses Warner Bros. Takeover Battle": 0.0,
  "Jim Cramer Highlights Cintas’ Attempts to Buy UniFirst": 0.5,
  "Jim Cramer on Costco: “I Am Concerned I Might Sell the Rest”": -0.6,
  "Wedbush Lowers Price Goal On MercadoLibre, Inc. (MELI)": -0.5,
  "Warren Buffett Once Got Permission From the SEC to Hide His Trades for a Year to Buy 1 Stock: Decades Later, Is It Still a Buy?": 0.2,
  "Spotnana Declares Partnership With Booking Holdings Inc. (BKNG)’s Booking.com": 0.5,
  "Intuit Inc. (INTU) Plans To Use Circle Internet And USDC Infrastructure": 0.2,
  "Cantor Fitzgerald Maintains An Overweight Rating On ASML Holding N.V. (ASML)": 0.5,
  "Theme Parks’ New Strategy: Smaller, Cheaper and Shorter": 0.2,
  "Charter Communications, Inc. (CHTR) Defends Cox Merger, Analysts Split on Stock Prospects": 0.2,
  "Is PayPal Holdings, Inc. (PYPL) One of the Best Beaten-Down Stocks to Invest in According to Analysts?": 0.5,
  "AI Infrastructure Demand Keeps KLA (KLAC) and Semiconductor Sector on Top for 2026": 0.6,
  "B. Riley Names Lam Research (LRCX) a Top Memory Recovery Play Due to Specialized Etch Leadership": 0.8,
  "Financially independent investors swear by this overlooked passive-income stream. Here’s why some call it ‘easy’ money": 0.5,
  "T-Mobile (TMUS) Upgraded as Subscriber Growth Outlook Improves": 0.8,
  "Comcast (CMCSA) Stock Holds Neutral Rating Amid Broadband Losses": 0.0,
  "Is Netflix, Inc. (NFLX) a Best Quality Stock To Buy Before 2026": 0.5,
  "What is the current \"META 2022\"? Part 2 - On the same note as [yesterdays post](https://www.reddit.com/r/stocks/comments/1px2p4m/is_rstocks_actually_good_at_stock_picking/) I wondered how well Reddit's recommendations from **[February 2024](https://www.reddit.com/r/stocks/comments/1aoaskg/what_is_the_current_meta_2022/)** fared, specifically with regard to finding undervalued stocks - just like META in 2022. As you can see in [**this backtest**](https://testfol.io/?s=71WDfNsObz1), Reddit picks accumulated **46% CAGR***. I would kindly ask you to not simply post a ticker, but rather explain why the company is undervalued - where most people are": 0.1,
  "3 Supercharged Growth Stocks to Buy and Hold Into the 2030s": 0.6,
  "Weebit Nano secures a license agreement with Texas Instruments": 0.6,
  "(Item 8.01) . Other Events. On December 29, 2025, the Company notified Computershare Trust Company, N.A. as successor to Wells Fargo Bank, N.A., as Trustee, that, in connection with the termination of the Merger Agreement, it will redeem, (1) $750,000,000 in aggregate principal amount of its 4.500% Senior Notes due 2030 (the “2030 Notes”) in full at the special mandatory redemption price, equal to 101% of the principal amount plus accrued and unpaid interest to the redemption": -0.2,
  "(Item 1.01) . Entry Into a Material Definitive Agreement. On December 22, 2025, American Electric Power Company, Inc. (“American Electric Power,” “AEP” or the “Company”) entered into a Board Observer Agreement (the “Board Observer Agreement”) with Carl C. Icahn, Icahn Partners LP, Icahn Partners Master Fund LP, Icahn Enterprises G.P. Inc., Icahn Enterprises Holdings L.P., IPH GP LLC, Icahn Capital LP, Icahn Onshore LP, Icahn Offshore LP and Beckton Corp (collectively, the “Icahn Group”) and Andrew J.\n\n(Item 1.01) of this Current Report on Form 8-K), the Company and the Icahn Group agreed to terminate the Director Appointment and Nomination Agreement (the “Nomination Agreement”), dated as of February 12, 2024, by and among the Icahn Group, the Company and, solely with respect to the provisions applicable to the New Independent Director (as defined in the Nomination Agreement), the New Independent Director. The termination of the Nomination Agreement was effective as of December 22, 2025.": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On December 22, 2025, the independent members (the “Independent Directors”) of the Board of Directors (the “Board”) of CrowdStrike Holdings, Inc. (the “Company” or “CrowdStrike”), upon the recommendation of the Compensation Committee of the Board (the “Compensation Committee”), approved a performance-based equity award under the Company’s 2019 Equity Incentive Plan (the “Plan”) to George Kurtz, the Company's\n\n(Item 5.02) is incorporated herein by reference. Leading CrowdStrike Through the Next Stage of Growth The Independent Directors approved the Award to incentivize achievement of CrowdStrike's long-term growth strategy by (i) aligning Mr. Kurtz's interests with those of the Company's stockholders through performance-based compensation tied directly to meaningful stock price outperformance, and (ii) providing a compelling incentive for Mr. Kurtz to continue to lead CrowdStrike as it executes on its ambition to achieve $20 billion in annual": 0.2,
  "(Item 8.01) Other Events. ATM Update On December 29, 2025, Strategy Inc (\"Strategy\") announced an update with respect to sales made under its at-the-market offering program (\"ATM\") of the following securities: During Period December 22, 2025 to December 28, 2025 As of December 28, 2025 Security Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) STRF Stock - $ - $ - $ 1,619.3 10.00% Series A": 0.1,
  "Tell me why AVGO isn't overvalued or MU isn't cheap, after the massive run-up of both - Everyone spouted how Nvidia would crash as GPU sales are cyclical, oops, here we are again... Please tell me how MU is no longer a bargain without using the words 'cyclical', 'cyclicality' or 'cycle' in your analysis. AVGO - $1700 Billion Net income forecast next quarter - $9 Billion _____ MU - $320 Billion Net income forecast for": -0.5,
  "Sam’s Club Is Beating Costco at Its Own Game—in China": 0.5,
  "3 Hot Consumer Stocks to Leave Behind in 2026": -0.6,
  "Costco offers a rare membership deal you need to grab now": 0.8,
  "Agoda Releases Ranking of Japan's Most Popular Domestic Winter Travel Destinations": 0.5,
  "2 Reasons to Watch PYPL and 1 to Stay Cautious": 0.5,
  "2 Nasdaq 100 Stocks Worth Investigating and 1 We Turn Down": 0.2,
  "2 S&P 500 Stocks to Target This Week and 1 We Brush Off": 0.2,
  "3 Volatile Stocks Walking a Fine Line": -0.5,
  "2 Profitable Stocks to Keep an Eye On and 1 Facing Challenges": 0.5,
  "1 Consumer Stock with Impressive Fundamentals and 2 We Turn Down": 0.5,
  "2 Nasdaq 100 Stocks with Exciting Potential and 1 That Underwhelm": 0.5,
  "1 Cash-Heavy Stock to Consider Right Now and 2 We Avoid": 0.2,
  "3 Quality Compounders to Consider Right Now": 0.5,
  "1 Cash-Producing Stock with Promising Prospects and 2 Facing Headwinds": 0.5,
  "2 Cash-Producing Stocks for Long-Term Investors and 1 We Turn Down": 0.2,
  "3 Profitable Stocks with Competitive Advantages": 0.5,
  "3 Cash-Heavy Stocks We Approach with Caution": -0.5,
  "1 Industrials Stock to Own for Decades and 2 We Ignore": 0.2,
  "3 Hyped Up  Stocks We Approach with Caution": -0.5,
  "Holiday Shoppers Brace for 2026 Payments on Record BNPL Loans": -0.6,
  "The Motley Fool Interviews Axon Enterprise President Josh Isner": 0.5,
  "Q: What Are Companies Saying About Their 2026 Plans?": 0.0,
  "Jim Cramer Wonders How Many People Would Lose Their Jobs From Paramount Skydance (PSKY)’s Warner. Bros Bid": -0.5,
  "Jim Cramer Discusses UniFirst (UNF) Being Targeted by Another Offer From Cintas": 0.5,
  "Jim Cramer Discusses Cintas’ (CTAS) Latest Offer for UniFirst": 0.2,
  "1 Artificial Intelligence (AI) Stock I'd Buy on Every Dip and Never Sell": 0.8,
  "Piper Sandler Says These 3 Energy Stocks Are Top Picks for 2026": 0.6,
  "Synopsys' (NASDAQ:SNPS) Weak Earnings Might Be Worse Than They Appear": -0.6,
  "3 Growth Stocks to Buy in January That Could Issue Stock Splits in 2026": 0.5,
  "Why Monolithic Power Systems, Inc. (NASDAQ:MPWR) Could Be Worth Watching": 0.5,
  "Salesforce & other software names could make a comeback next year": 0.6,
  "Adobe (NASDAQ:ADBE) investors are sitting on a loss of 27% if they invested five years ago": -0.6,
  "Retail: 5 top stock picks despite 'sentimentally weak' consumers": 0.2,
  "Returns Are Gaining Momentum At Marvell Technology (NASDAQ:MRVL)": 0.5,
  "Investors in Charter Communications (NASDAQ:CHTR) have unfortunately lost 68% over the last five years": -0.8,
  "Stocks Set to Open Lower as Investors Trim Risk at Year-End, Fed Minutes Awaited": -0.5,
  "The Zacks Analyst Blog Highlights Target and Costco Wholesale": 0.0,
  "3 Growth Companies With Insider Ownership Up To 18%": 0.2,
  "AI Chips Today - Synopsys Faces Challenges Amid Market Turbulence And Legal Issues": -0.6,
  "The Zacks Analyst Blog Highlights Advanced Micro Devices, Goldman Sachs, Lam Research, AstroNova and Blue Dolphin": 0.5,
  "3 Stocks Estimated To Be Priced Below Value In December 2025": 0.2,
  "The Zacks Analyst Blog Highlights Micron, Applied Materials, Salesforce and Cisco Systems": 0.5,
  "Baker Hughes Announces Dates for Fourth-quarter and Full-year 2025 Earnings Release and Webcast": 0.0,
  "Cadence Design Systems' (NASDAQ:CDNS) investors will be pleased with their strong 135% return over the last five years": 0.8,
  "These 4 Measures Indicate That Analog Devices (NASDAQ:ADI) Is Using Debt Safely": 0.6,
  "3 Medical Instrument Stocks to Counter Industry Woes Using GenAI": 0.2,
  "Latest News In Digital Payment - AI Transforming E-Commerce Across Asia-Pacific Markets": 0.5,
  "Here Are Monday’s Top Wall Street Analyst Research Calls: Doximity, KB Home, NVIDIA, Okta, On Holdings, Take-Two Interactive, Vail Resorts, and More": 0.2,
  "GE HealthCare management to present at upcoming investor conference": 0.2,
  "Those who invested in Autodesk (NASDAQ:ADSK) three years ago are up 61%": 0.5,
  "Celsius Holdings Bets on Brand Synergies to Drive Long-Term Scale": 0.5,
  "Western Digital and Seagate Were 2025’s Surprise AI Winners. 7 Stocks That Could Shock in 2026.": 0.5,
  "If You Invested $1000 in Lam Research a Decade Ago, This is How Much It'd Be Worth Now": 0.5,
  "Here's How Much a $1000 Investment in Atlassian Made 10 Years Ago Would Be Worth Today": 0.5,
  "Hidden Gem Stocks to Love at the End of the Year": 0.6,
  "Qualcomm Shares Are Back Near Their 2021 Price—Should Investors Be Worried or Excited?": 0.5,
  "REITs Should Bounce Back in 2026. 3 Stocks to Consider Buying Now.": 0.5,
  "Should You Be Confident in Vertex Pharmaceuticals Incorporated’s (VRTX) Long-Term Outlook?": 0.2,
  "Verisk Ends Effort to Acquire AccuLynx": 0.0,
  "BKR Secures Multi-Year Contract in Kuwait for Production Enhancement": 0.5,
  "Amgen Inc. (AMGN) Is a Trending Stock: Facts to Know Before Betting on It": 0.2,
  "Cadence Design Systems, Inc. (CDNS) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Is Most-Watched Stock Datadog, Inc. (DDOG) Worth Betting on Now?": 0.2,
  "Warner Bros. Discovery, Inc. (WBD) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "QUALCOMM Incorporated (QCOM) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Investors Heavily Search PDD Holdings Inc. Sponsored ADR (PDD): Here is What You Need to Know": 0.5,
  "Strong Results, Softer Outlook: What’s Next for Adobe Inc. (ADBE)?": 0.5,
  "After a 4x Surge, Is There Anything Left to Gain in Western Digital Corporation (WDC)?": 0.2,
  "Why Analysts Are Split on Cisco Systems, Inc. (CSCO)": 0.0,
  "Why Workday, Inc. (WDAY) Continues to Attract Buy Ratings": 0.6,
  "Analysts Watch QUALCOMM Incorporated (QCOM)’s Expanding AI Data Center Footprint": 0.5,
  "I’m bullish on AI… just not at any price - I’m still long AI overall. I’m not betting against NVDA, MSFT, or the space in general. But I think it’s fair to separate two things: 1) the technology 2) the price we’re paying for it AI demand is real. The spending is real. The use cases will keep expanding. What gives me pause is valuation expectations. Right now the market seems to assume: margins stay": 0.5,
  "Seagate vs. Western Digital: Which Storage Stock is the Better Buy Now?": 0.5,
  "AppLovin Corporation (APP) Delivered Exceptional Gains in Q3": 0.8,
  "Lam Research Corporation (LRCX) is Benefitting from Cyclical Demand": 0.5,
  "Is Marvell (MRVL) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Nvidia completes $5B purchase of shares from Intel - NVDAhas completed its $5 billion stock purchase from INTC. The agreement also includes joint development of PC and data center chips by NVDA and Intel. This historic collaboration tightly integrates NVDA AI and accelerated computing technology stack with Intel's CPUs and vast x86 ecosystem a fusion of two world class platforms. NVDA CEO Jensen Huang stated: “We will work together to expand the ecosystem and lay": 0.6,
  "Is Ross Stores (ROST) Stock Outpacing Its Retail-Wholesale Peers This Year?": 0.5,
  "Is IDEXX Laboratories (IDXX) Stock Outpacing Its Medical Peers This Year?": 0.2,
  "MU is a classic cyclical stock whose share price revolves around memory prices. - Core Drivers: DRAM and NAND price cycles, inventory depletion pace, and AI servers' structural demand for high end storage. Common Misjudgments: Chasing valuations with growth stock perspectives, focusing solely on financial reports while ignoring pricing and inventory. One Sentence Conclusion: The main theme is the price cycle don't let sentiment sway you. I personally remain invested. What's your take on MU?": 0.2,
  "Do Options Traders Know Something About Exelon Stock We Don't?": 0.2,
  "What to Expect From Roper Technologies' Next Quarterly Earnings Report": 0.0,
  "Wall Street Firms Bullish on Similarweb Ltd (SMWB) on Improving Industry Trends": 0.8,
  "Nvidia Stock Slips as Groq Deal Raises Questions": -0.5,
  "Figma vs. Autodesk: Which Design SaaS Stock is a Safer Bet?": 0.2,
  "nvidia taking a $5b stake in intel feels like a consolidation move nobody saw coming. what does this mean for the chip sector long term? - so i just saw that nvidia completed a $5 billion stock purchase in intel. this is wild because these two have been competitors for decades and now nvidia is literally a shareholder in intel. i work in tech (software dev in malaysia, been following chip sector closely because of": 0.5,
  "Gold and silver prices retreat: What consumers are seeing": 0.1,
  "Does Lam Research Corporation (LRCX) Have an Attractive Valuation?": 0.5,
  "Artisan Value Fund’s Conviction Remains Strong on ASML (ASML). Here’s Why": 0.6,
  "GATX, Brookfield complete buy of Wells Fargo rail leasing": 0.5,
  "Do you see Micron transitioning from a cyclical stock to a structural AI growth name? - MU has been strong recently and the move has clearly been driven by improving fundamentals rather than just sentiment. From what we’ve seen so far Micron appears to be benefiting meaningfully from AI related memory demand particularly around HBM. The progress on HBM3E and early HBM4 sampling suggests MU may be executing well relative to peers especially in terms": 0.6,
  "Take the Zacks Approach to Beat the Markets: Castle Biosciences, Hamilton Insurance & Monster Beverage in Focus": 0.5,
  "Six years of savings as tuition. - I got into the stock market back in 2019. At first, I was only putting in small amounts. After getting stuck in a few losing positions, I kept averaging down and eventually worked my way back to breakeven. By 2020, I didn’t just recover I actually made over 50 grand. Honestly, if the story ended right there, that would’ve been perfect But once I tasted those speculative gains,": 0.6,
  "Disney vs. Comcast: Which Media Giant Has Better Upside Potential?": 0.5,
  "Chip sales could top $1T in 2026. Is Nvidia still top AI play?": 0.5,
  "Stocks Head Lower as Tech and Metal Rallies Reverse Course": -0.5,
  "Amazon And These Two Stocks Are Analyst's Top Picks With 'Resilient' Consumer Demand": 0.8,
  "Xcel Energy Expands Giving, Supports Communities and Nonprofits in 2025": 0.6,
  "Alibaba, JD.com, Temu Parent PDD Stocks Fall. Why Chinese Names Are Under Pressure.": -0.6,
  "CRDO vs. MRVL: Which Data Center Connectivity Stock Is Smarter Pick?": 0.5,
  "Take-Two Stock Has Been Hurt by GTA 6 Delays. Bet on a 2026 Hit, Analyst Says.": -0.6,
  "StoneCo vs. PayPal: Which Fintech Stock Has More Upside Potential?": 0.5,
  "Arkansas Children's Receives Historic $50 Million Gift from Philanthropist B. Thomas Golisano": 1.0,
  "Is Palantir Stock a Buy Now?": 0.0,
  "NEE vs. CEG: Which Energy Stock Has a Better Prospect in 2026": 0.5,
  "A Less-Costly Way to Buy Costco to Gain Leveraged Upside in COST Stock": 0.5,
  "$EOSE : Sleeping Giant, lithium alternative. - **EoS Energy** : company that manufactures Zinc based battery storage systems, that are made in the US. Znyth Z3 Systems are best suited for AI/Hyperscale BESS, Long duration back up. The product is not thermal heavy, does not require cooling( massive cost saving/development). Longer life cycle(further cost saving). 1/4 of $EOSE pipeline is tied to data centers, best fast response alternative to outdated diesel generators and more cost": 0.8,
  "Cybersecurity: The innovation and worries around agentic AI": 0.5,
  "Pre-Market In Red": -0.5,
  "Morgan Stanley Names Seagate (STX) Core 2026 Selection as Cloud Capex Spending Gains Momentum": 0.6,
  "AVGO double in the next 5 years? - I’m considering investing in AVGO, but I’m a bit cautious about its current valuation. The company holds a strong position in semiconductors and 5G, with growth driven by increasing demand. However, for the stock to double in 5 years, Broadcom needs to keep innovating and expanding its market share. While its finances are solid, the valuation is already pretty high. Do you think it can continue growing": 0.2,
  "Why 2025’s Wild Ride Proves You Should Just Buy SPY and Chill": 0.5,
  "This 1 Cheap Quantum Computing Stock Could Be a Top Buy for 2026": 0.6,
  "PayPal Stock Trades Below Industry P/E: How to Play the Stock?": 0.2,
  "Billionaires Dump the Magnificent Seven and Load Up on These Stocks": 0.5,
  "Strategy Buys $109 Million in Bitcoin": 0.5,
  "3 Promising Growth Companies With Insider Ownership Up To 14%": 0.5,
  "Hasbro And 2 Other Stocks That May Be Priced Below Their Estimated Value": 0.2,
  "The Netflix-Paramount saga caps a 2025 turning point, S&P says: Cable TV is in the ‘decline stage,’ with a long, slow bleedout ahead": -0.6,
  "Broadcom's Insider Selling: A Big Red Flag, or Business as Usual?": -0.5,
  "Marriott hotel cracks down on perk many expect": -0.5,
  "1 Forever Stock I'll Hold for Dear Life": 0.8,
  "Does Sandisk Corp. (SNDK) Stand Out Among 2025 Spin-Offs?": 0.2,
  "Analysts Remain Split on Solstice Advanced Materials (SOLS) Despite Expansion Investments": 0.1,
  "Could oil stocks become an unlikely AI play in 2026?": 0.2,
  "Risk Topography Signals a Contrarian Opportunity for Microchip (MCHP) Stock Options": 0.5,
  "Investor Kevin O'Leary Says Movie Theaters Are Not Dead — 'The Only Restraining Aspect of Content Consumption is How Many Hours People Are Awake'": 0.6,
  "Sector Update: Tech Stocks Fall Monday Afternoon": -0.5,
  "Consumer Discretionary, Technology Push US Equity Indexes Lower": -0.6,
  "North America Drops 64 Rigs Week on Week": -0.5,
  "Top Research Reports for Apple, Cisco & IBM": 0.0,
  "Is PepsiCo's Margin Outlook Improving Despite Tariff Cost Pressures?": 0.2,
  "The Top-Performing S&P 500 Stock in 2025 Was This 1 Unexpected Company": 0.5,
  "2025’s Most Downgraded Stocks: Buy, Sell, or Hold in 2026": 0.1,
  "MicroStrategy Was the Worst Performing Nasdaq-100 Stock in 2025. Should You Buy the Dip?": -0.6,
  "I analyzed all of Trump's Truth posts (over 23,000!) and how they affected the market. - For each post, I used AI to analyze sentiment and predict relevant tickers. Then I cross-referenced it with data from Polygon.io. I compared the price 1 minute after the post and then 45 minutes later. Here’s the 5 posts with the biggest bullish impact: 1) The famous U.S. Steel partnership post. It's pretty long and I wanted to link": 0.6,
  "Why Q4 Earnings Season Could Be a Bullish Catalyst for S&P 500 Stocks": 0.8,
  "Should You Buy, Sell, or Hold the Top 3 S&P 500 Stocks of 2025?": 0.2,
  "AI chipmakers that could steal some of Nvidia's spotlight in 2026": 0.2,
  "Why anchoring 2026 portfolios in Big Tech and cybersecurity is the way to go": 0.5,
  "MU just hit another all time high fundamentals or pure momentum at this point? - Micron Technology quietly pushed to a fresh ATH again today, and what’s interesting is… there wasn’t really a single new headline behind it. Feels like a few things are stacking up: AI memory demand (HBM / DRAM) still looks very real Last earnings + guidance shifted sentiment hard Once MU cleared resistance, momentum kind of fed on itself That said": 0.6,
  "MongoDB, AppLovin, and SoundHound AI Stocks Trade Down, What You Need To Know": -0.5,
  "Union Pacific–Norfolk Southern Merger Targets Trucking Market Share": 0.1,
  "Netflix vs. Spotify: Which Streaming Giant Is Poised for a Comeback in 2026?": 0.2,
  "Why One Fund Ditched Viper Energy in a $12 Million Exit Amid a 20% Stock Slide": -0.6,
  "Costco's 2025: 3 Things Investors Should Know Heading Into the New Year": 0.5,
  "Dan Ives Is Betting on Cyber-AI for 2026. 1 Stock to Load Up on Now.": 0.5,
  "What could end up being Walmart's biggest 2026 tailwind": 0.5,
  "Sector Update: Tech Stocks Softer Late Afternoon": -0.5,
  "'Grand Theft Auto' Game Publisher Is A Steal, Analyst Says": 0.6,
  "Symbotic (SYM) The AI Warehouse as a service company valued as a pure play robotics company - Opinion: Symbotic’s future growth valuation is not taking into account its 35% stake in Green Box, an AI warehouse as a service business. Currently Symbotic is viewed as a pure play robotics company, simply supplying its AI robotics system to companies such as Walmart and Target. Symbotic’s AI robotics system is the only rival to Amazon’s system, which": 0.5,
  "Stocks to Watch Monday Recap: Lululemon, Newmont, DigitalBridge": 0.5,
  "US Equity Indexes Drop Amid Declines in Technology, Consumer Discretionary": -0.6,
  "The 5 Most Upgraded Stocks from 2025: Double-Digit Upside in 2026": 0.6,
  "The Case of the $400,000 Massachusetts Lobster Heist": -0.5,
  "Dow Jones Futures: AppLovin, Nvidia, Palantir, Tesla Slide During Stock Market Drop": -0.5,
  "White House Advisor David Sacks Hints At Leaving California Over 'Confiscation Of Net Worth'": -0.6,
  "Tech Stocks Aren't Always The Answer": -0.5,
  "Agoda Spotlights Unique Ski Destinations in Asia for the 2026 Winter Ski Season": 0.5,
  "Marvell (MRVL)’s CEP is Very Humble, Says Jim Cramer": 0.6,
  "Jim Cramer is Enthusiastic About Honeywell (HON) Split": 0.8,
  "Jim Cramer Says Costco (COST) Needs to Improve Its Messaging": 0.1,
  "3 Financials Stocks for Long-Term Investors": 0.0,
  "2 Cash-Heavy Stocks on Our Buy List and 1 We Question": 0.2,
  "3 Profitable Stocks We Keep Off Our Radar": -0.5,
  "1 Mooning  Stock to Own for Decades and 2 We Find Risky": 0.5,
  "Is Gilead Sciences (GILD) An Affordable Healthcare Stocks to Invest In?": 0.2,
  "Citi Lowers PT on Strategy Inc (MSTR), Here’s Why": -0.5,
  "Here’s What Wall Street Think About Atlassian Corporation (TEAM)": 0.1,
  "Benchmark Co. Maintains a Hold Rating on Marvell Technology (MRVL)": 0.0,
  "Wall Street Bullish on Advanced Micro Devices (AMD), Here’s Why": 0.8,
  "Broadcom Inc. (AVGO) up 51% YTD, Wall Street Still Sees 31% Upside": 0.8,
  "Meta acquires intelligent agent firm Manus, capping year of aggressive AI moves - https://www.cnbc.com/2025/12/30/meta-acquires-singapore-ai-agent-firm-manus-china-butterfly-effect-monicai.html Meta said the acquisition was aimed at boosting automation across consumer and business products. Manus will continue operating its subscription service after the acquisition, with no deal terms disclosed. The deal highlights Meta’s rapid push to secure AI talent and technology.": 0.8,
  "Morgan Stanley Reduces Price Target on PayPal Holdings (PYPL)": -0.5,
  "Block, Inc. (XYZ)’s Square and Thrive Expand Partnership": 0.5,
  "Traders Warn Bitcoin Price Could Fall to $40,000 — Even as Strategy Adds Another $100M": -0.5,
  "Korea Crushes Global Benchmarks With Best Stock Rally Since 1999": 0.8,
  "ASST Stock Performance Comes Into Question Amid Semler Scientific and Strive Merger Prospects": -0.5,
  "What 2025 Tells Us About MercadoLibre's Long-Term Story": 0.2,
  "Market Chatter: China Requiring Chipmakers to Use at Least 50% Domestically Made Equipment for Expanding Capacity": 0.2,
  "Nvidia, AMD, and Micron Technology Could Help This Unstoppable ETF Turn $250,000 Into $1 Million in 10 Years": 0.8,
  "Zacks Industry Outlook Highlights Veracyte, IDEXX Laboratories and Intuitive Surgical": 0.5,
  "AI Trade’s Next Leg Is All About Tech’s ‘Pick-and-Shovel’ Stocks": 0.5,
  "The Zacks Analyst Blog Highlights General Motors, Western Digital and Standard Chartered": 0.0,
  "The Zacks Analyst Blog Highlights International Business Machines, Analog Devices, Johnson & Johnson's, The Gap and Hewlett Packard Enterprise": 0.5,
  "Nvidia Shares Slide on Rumors of Next-Year GPU Price Jumps": -0.7,
  "The Zacks Analyst Blog Highlights Apple, Cisco Systems and IBM": 0.5,
  "3 Growth Stocks With High Insider Confidence": 0.5,
  "Celsius Holdings Among 3 Value Stocks Trading Below Estimated Worth": 0.5,
  "Exploring High Growth Tech Stocks In The US For December 2025": 0.5,
  "My 3 Favorite Stocks to Buy Right Now": 0.0,
  "AI trade next year: This stock is an AI 'sleeper hit'": 0.6,
  "How to Buy PYPL for a 29% Discount, or Achieve a 7% Annual Return": 0.2,
  "AppLovin (APP) Surged Spurred By Broad-Based Growth Drivers": 0.8,
  "Micron Stock Climbs to Record High as AI Drives Memory Chip Demand": 0.8,
  "Microsoft and Palantir Lead Wedbush's Top AI Picks for 2026": 0.8,
  "How Tempus AI Is Building Scale While Near-Term Risks Persist": 0.2,
  "3 Stocks Likely to Gain From Rising HSA Contribution & Medicare Premium": 0.5,
  "Is Netflix a Must-Own Stock for 2026?": 0.2,
  "Low-Beta Stocks to Own as We Head Into 2026: MNST, TDC, NGS & COCO": 0.5,
  "Do You Believe in the Growth Potential of Warner Bros. Discovery (WBD)?": 0.5,
  "3 ETFs Warren Buffett Is Quietly Keeping in His Secret Portfolio": 0.2,
  "Vertex Pharmaceuticals price target raised to $525 from $456 at Leerink": 0.5,
  "Company News for Dec 30, 2025": 0.0,
  "2 Growth Stocks to Buy For 2026 and Beyond": 0.5,
  "The Lazy Way to Play NVIDIA’s $20B Groq Deal": 0.1,
  "Here's How Much a $1000 Investment in KLA Made 10 Years Ago Would Be Worth Today": 0.5,
  "Cathie Wood’s ARK Funds Have Crushed the Market This Year. What’s She’s Buying Now.": 0.8,
  "Here’s what you should know about the US TikTok deal": 0.0,
  "Three Key Trends CoStar Says Are Likely to Shape Canada’s Real Estate Market in 2026": 0.5,
  "Want Better Returns? Don't Ignore These 2 Computer and Technology Stocks Set to Beat Earnings": 0.8,
  "PayPal Holdings, Inc. (PYPL) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Palo Alto Networks, Inc. (PANW) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "CrowdStrike (CRWD) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Investors Heavily Search Constellation Energy Corporation (CEG): Here is What You Need to Know": 0.5,
  "AI Arms Race Drives Capex Boom: 3 AI Stocks to Watch in 2026": 0.5,
  "The Dividend Aristocrat With 53% Margins Just Widened the Gap on the Frozen Dividend Competitor": 0.6,
  "Reasons Why Investors Can Consider Buying ADP Stock Now": 0.5,
  "Starbucks Winning Battle Against Labor": -0.5,
  "Is It Finally Time to Buy This Dividend Stock Now That It Has a 6.6% Dividend Yield?": 0.5,
  "Strategy Stock Faces a Dangerous Spiral. How It Can Break Out.": 0.1,
  "eBay (EBAY) Climbs 3% on Holiday Boost": 0.6,
  "Micron Technology (MU) Soars to All-Time High Ahead of Dividend Payout": 0.8,
  "This Could Derail Intel's Comeback in 2026": -0.5,
  "Datadog (DDOG) Is Considered a Good Investment by Brokers: Is That True?": 0.5,
  "GE HealthCare Technologies (GEHC) Boasts Earnings & Price Momentum: Should You Buy?": 0.6,
  "Costco's Traffic Growth Signals Strong Member Engagement Trends": 0.8,
  "Bitcoin Market Signals That Could Trigger a 2026 Breakout": 0.5,
  "Warner Bros likely to reject Paramount's latest hostile bid, source says": -0.5,
  "RBLX vs TTWO: Which Gaming Stock Has the Stronger 2026 Setup?": 0.5,
  "Is MU's current trend continuation or anticipation exhaustion? - Recently, MU has continued to fluctuate within a high-range band. Although volatility has increased, it remains fundamentally strong overall. The market's core logic surrounding it still revolves around: AI memory demand, data center expansion, and tight HBM supply these are indeed genuine long-term drivers. My personal perspective: MU currently exhibits distinct characteristics: Solid fundamental logic, not purely a sentiment-driven narrative Continued support at elevated levels, with": 0.6,
  "CorpGov Yearly Highlights: Looking Ahead to Princeton, LA and Palm Beach in 2026": 0.5,
  "Nvidia Stock and the Bright Side of the Groq Deal": 0.5,
  "CES 2026: AI, Robots, Wearables, Industrial Machines In Focus": 0.5,
  "Mondelēz Global LLC Expands Voluntary Recall of 2 SKUs of CHIPS AHOY! Baked Bites Brookie in the US": -0.5,
  "Warner Bros Discovery to reject Paramount’s $108.4B bid, CNBC says": -0.5,
  "Can Intel's Investment-Driven Strategy Regain Its Competitive Edge?": 0.2,
  "Metaplanet Resumes Bitcoin Buying Spree With Major Q4 Bitcoin Purchase: Strategy Faces Stock Slump": 0.1,
  "NKE is currently priced at $60... Even Tim Cook is buying, but I'm still feeling pretty down about it. What do you all think? - NKE is hovering around $60-$61 today. I've been stuck in this position for a long time (down about 20% year to date), and this stock feels dead completely stagnant. The recently released Q2 earnings report did beat expectations (EPS $0.53 vs. $0.37 forecast), which is somewhat comforting. However, the profit": -0.6,
  "Can Amgen's MariTide Take on Leaders in the Obesity Space?": 0.2,
  "Strive CIO Explains the Structure That Lets MicroStrategy’s Stock Beat Bitcoin | US Crypto News": 0.5,
  "AMD Seen Rebounding in China AI Sales on $675 Million Alibaba Order": 0.8,
  "Coty E-Commerce Grows Mid-Single Digits: Is Digital the Backbone?": 0.5,
  "Why Trump blocking Netflix-WBD deal would be 'the right thing to do'": -0.5,
  "SpaceX IPO 2026: A Generational Play or a Valuation Trap? - With the rumors of a 2026 SpaceX IPO heating up, we’re looking at a potential $1.5 trillion valuation. I’m torn On one hand, it’s a generational play. Starlink is already a cash-cow and their moat in launch tech is untouchable. But at $1.5T, is it priced to perfection? We’ve seen what happens to \"hyped\" listings when the macro shifts I'm curious to hear your": 0.2,
  "3 Top Tech Stocks to Buy if You Want to Outperform Next Year": 0.8,
  "Prediction: Costco Has What it Takes to Surge and Split in 2026": 0.6,
  "Top Midday Stories: Meta Acquires AI Startup Manus; Tesla Says Analysts Project Lower Q4 Deliveries": 0.2,
  "OGE vs. AEP: Which Stock Is the Better Value Option?": 0.0,
  "Amazon Eyes $3 Trillion Valuation as AI and AWS Drive 2026 Growth": 0.8,
  "Can Unified SASE Adoption Strengthen FTNT's Growth Trajectory in 2026?": 0.5,
  "Can Netflix's Content Strength Drive Further Upside in the Stock in 2026?": 0.2,
  "Frore Systems' AirJet®Mini G2 Powers Silent, Sustained AI Performance in the Qualcomm 2-in-1 Notebook and Mini PC Reference Designs": 0.5,
  "Peter Schiff: \"I May Have Influenced More People To Buy Bitcoin Than People Who Advocate Bitcoin\"": 0.2,
  "SoftBank Finishes $40 Billion OpenAI Bet": 0.5,
  "Bought INTC on Dec 29, 2025 at $36.495 thoughts on my trade? - Yesterday I commented on the Nvidia/Intel news post that I bought INTC at $36.495 on December 29, 2025. I’ve received some interesting feedback from others about risk management and investing experience which I really appreciate. I’m curious how others here are thinking about INTC right now are you bullish cautious, or seeing opportunities in this stock? I’m sharing this purely as a": 0.5,
  "What Makes Monolithic (MPWR) a New Buy Stock": 0.5,
  "DOE to Announce Plutonium Awards by Tomorrow (12/31) – Oklo is a top contender - https://www.reuters.com/business/energy/us-announce-by-end-2025-companies-taking-surplus-plutonium-nuclear-reactor-fuel-2025-10-22/ The U.S. Department of Energy expects to announce **by December 31** which companies will be selected to receive approximately 19.7 metric tons of surplus Cold War–era plutonium for use as nuclear reactor fuel. The initiative follows a May executive order that prioritizes repurposing surplus plutonium for advanced reactor applications rather than diluting and disposing of it. Companies must apply": 0.2,
  "India's Fast Fashion, Delivery Apps Push Into Smaller Cities": 0.5,
  "Nvidia, AMD Set CES 2026 Agenda": 0.5,
  "S&P 500 and Nasdaq Trades Near Flat As Investors Awaiting Fed Guidance": 0.0,
  "A Christmas Stress Test: Why Diesel Pricing Stress Means Profits": 0.2,
  "PayPal Holdings, Inc. (PYPL) Offers Upside, but Analysts Aren’t Fully Convinced": 0.2,
  "DJT Stock Falls as Trump Media Launches Five ‘America-First’ ETFs. What Is It Trying to Do?": -0.2,
  "Robinhood makes shocking prediction for 2026": 0.1,
  "Analysts Call NVIDIA Corporation (NVDA) Groq Deal a ‘Tech and Talent Grab’": 0.2,
  "QUALCOMM Incorporated (QCOM) Closes Alphawave Deal, Expands Push Into AI Data Centers": 0.6,
  "Porch Group And 2 Other Growth Stocks Insiders Are Confident In": 0.5,
  "Marriott’s controversial new ban draws guest criticism": -0.6,
  "3 ESG Stocks to Add to Your Portfolio for Sustainable Returns in 2026": 0.5,
  "PLTR vs. ARM: Which AI-Tech Stock is the Better Buy Now?": 0.5,
  "REIT Player LXP Industrial Trust Churns Out A High 5.6% Yield": 0.6,
  "BMY vs AMGN: Which Biotech Stock Is More Resilient Now?": 0.2,
  "PLTR's ROE Snapshot: A Long-Term Efficiency Story in the Making": 0.5,
  "David Beckham-backed Prenetics ditches bitcoin purchase": 0.1,
  "Investors should beware of AI's circular financing trap, look for alternatives like Broadcom": -0.5,
  "New $17 Million Bet on STAAR Surgical Comes as Sales Jump 7% and Margins Hit 82%": 0.8,
  "No. 10: Target hit hardest by DEI boycott; Costco saw double-digit traffic increase": 0.2,
  "Sector Update: Consumer Stocks Decline in Afternoon Trading": -0.5,
  "Top Stock Reports for Berkshire Hathaway, AstraZeneca & Intel": 0.0,
  "Why Intel (INTC) Stock Is Up Today": 0.5,
  "Exclusive: China mandates 50% domestic equipment rule for chipmakers, sources say - [https://www.reuters.com/world/china/china-mandates-50-domestic-equipment-rule-chipmakers-sources-say-2025-12-30/](https://www.reuters.com/world/china/china-mandates-50-domestic-equipment-rule-chipmakers-sources-say-2025-12-30/) Beijing's new chip self-sufficiency mandate to benefit domestic suppliers Chinese chipmakers must use 50% domestically made equipment for adding new capacity China has long been dependent on foreign chipmaking equipment But US export curbs have forced Chinese fabs to go domestic Does this mean China has opened the door for US chipmakers to fill the other 50%? Which US chipmakers do you": 0.2,
  "Electronic Arts Is Going Private. Is It Too Late to Buy EA Stock?": 0.1,
  "Warner Bros. Plans to Reject Paramount Offer Next Week": -0.5,
  "Are ASTS and RKLB too risky for long-term holds? - I know they're inflated right now, but if they do well in the long term, buying at these prices shouldn't really matter. I am considering about $15K/per company. Losing it all is, of course, a factor. But do you see these companies closing shop or making it?": 0.2,
  "Dow Jones AI Giant Nvidia Hits Early Buy Trigger": 0.5,
  "2 AI Stocks Outpacing NVIDIA in 2025 With Bigger Gains Ahead": 0.5,
  "4 retail brands that shut down in 2025 — and reboots to come": -0.5,
  "As Nvidia Reportedly Snubs the Intel 18A Process, How Should You Play INTC Stock for 2026?": 0.2,
  "ADP Downgraded to Underperform as Jefferies Flags Structural Headwinds": -0.6,
  "Stocks to Watch Tuesday: Boeing, Meta, Applied Digital, Pop Mart": 0.0,
  "This Company Just Announced Long-Term Contracts For Nuclear Power Amid Rosy Outlook For This Commodity": 0.8,
  "Insiders Made Their Bets in 2025—These Were the Top 5 Stocks They Bought": 0.5,
  "Stock Market Today: Dow Ends Lower After Fed Minutes; Two Biotech Names Tank (Live Coverage)": -0.5,
  "U.S. Stocks Defy ‘Sell America’ Warnings and Are Ending 2025 Near Record Highs": 0.8,
  "Micron Gains Momentum, Again—30% to 80% Upside in 2026": 0.8,
  "Nvidia makes good on a key 2025 promise": 0.8,
  "Gilead (GILD) Reaches Pricing Agreement with US Government to Lower Drug Costs": 0.8,
  "Strong Results and Pipeline Momentum Power Amgen’s (AMGN) 2025 Rally": 0.8,
  "Shopify (SHOP) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Applied Materials (AMAT) Dips More Than Broader Market: What You Should Know": -0.5,
  "Intel (INTC) Increases Despite Market Slip: Here's What You Need to Know": 0.5,
  "Lam Research (LRCX) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "CSX Says Train Derailed in Kentucky; Delays Expected": -0.5,
  "Why Gilead Sciences (GILD) Dipped More Than Broader Market Today": -0.5,
  "Vertex Pharmaceuticals (VRTX) Dips More Than Broader Market: What You Should Know": -0.5,
  "KLA (KLAC) Suffers a Larger Drop Than the General Market: Key Insights": -0.5,
  "Wall Street Overcame This Year's Slowdown Predictions": 0.8,
  "This Restaurant Tech Stock Is Down 50% and Just Lost a $17 Million Backer": -0.7,
  "Diamondback Energy (FANG) Increases Despite Market Slip: Here's What You Need to Know": 0.5,
  "2 Surefire Chip Stocks to Buy and Hold for the Next Decade": 0.5,
  "Unusual Move｜Tesla Directly Releases Analyst Forecasts: Q4 Deliveries May Drop 15%, Signaling Demand Pressure? - Tesla's stock price has fallen for six consecutive trading days. I just came across an unusual piece of news about Tesla (TSLA) and wanted to share it for discussion. Tesla recently proactively disclosed analysts' forecasts for its fourth-quarter deliveries, breaking from its usual low-key approach. According to these projections, fourth-quarter deliveries may decline by approximately 15% year-over-year, a rare occurrence": -0.6,
  "Why NVIDIA’s AI Power-Play Could Drive the Next Major Rally in 2026": 0.8,
  "Bankers Are Gearing Up for Another Onslaught of Monster Deals in 2026": 0.6,
  "Should You Buy Stock Splits?": 0.0,
  "Intel Investors Just Got Great News for 2026": 0.8,
  "DD on Coeur Mining ($CDE) - Couer Mining (CDE) closed the day at $18.09 according to VectorVest, they are valued at 32.5/ share. Therefore, they are extremely undervalued. Here is why I like CDE as a hold into 2026: They have an upcoming potential merger with NGD, a Canadian mining company. Once this merger goes through, they will have 7 operations across North America. They will have the production capability of 900,000oz of gold and": 0.8,
  "AMD's Lisa Su Pays Tribute To Former IBM CEO Lou Gerstner: An 'Amazingly Curious' Leader Who Shaped Her Early Career": 0.8,
  "Q3 Earnings Roundup: Monolithic Power Systems (NASDAQ:MPWR) And The Rest Of The Analog Semiconductors Segment": 0.2,
  "Tech Startups Are Handing Out Free Nicotine Pouches to Boost Productivity": -0.5,
  "Amgen (AMGN): Buy, Sell, or Hold Post Q3 Earnings?": 0.0,
  "3 Reasons to Avoid REGN and 1 Stock to Buy Instead": -0.5,
  "3 High-Flying Stocks That Fall Short": -0.6,
  "1 S&P 500 Stock to Target This Week and 2 We Turn Down": 0.2,
  "1 Safe-and-Steady Stock to Keep an Eye On and 2 We Question": 0.0,
  "1 Cash-Heavy Stock to Keep an Eye On and 2 We Turn Down": 0.2,
  "2 Large-Cap Stocks with Solid Fundamentals and 1 Facing Challenges": 0.2,
  "China's CXMT eyes $4.2 billion Shanghai listing to fund DRAM expansion": 0.5,
  "How Meta’s Newest Acquisition Target Got Around Worries Over Its Ties to China": 0.1,
  "The Best Stocks to Invest $50,000 in Right Now": 0.5,
  "It’s Earnings Warning Season. How to Profit From Others’ Misery.": 0.2,
  "Netflix vs. TikTok, Disney Soars, and 3 More Not-So-Wild Media Predictions for 2026": 0.5,
  "This Money Pro Sees Higher Stock Prices and More Rate Cuts in 2026": 0.6,
  "2026 Is a Make-or-Break Year for the AI Trade": 0.2,
  "Facebook co-founder bankrolling calls for stricter farming rules in Britain": 0.5,
  "Update: Market Chatter: China Requiring Chipmakers to Use at Least 50% Domestically Made Equipment for Expanding Capacity": 0.2,
  "Meta's multibillion Manus buyout draws plaudits,  but raises spectre of a China AI exodus": 0.2,
  "2 Popular AI Stocks to Sell Before They Drop 50% and 72% in 2026, According to Certain Wall Street Analysts": -0.8,
  "IDEXX Laboratories (NASDAQ:IDXX) shareholders have earned a 65% return over the last year": 0.8,
  "Is Advanced Micro Devices (AMD) the Best New Stock from David Tepper’s Portfolio?": 0.6,
  "Tecnotree Included as a Representative Provider in Gartner® Innovation Insight: AI SOC Agents Accelerate CSP SecOps Transformation": 0.6,
  "Trump 2.0, stocks soar again, gold hits records, AI boom rolls on — Yahoo Finance's 2025 year in review": 0.8,
  "Update: Meta's Deal to Acquire Manus Reportedly Valued at More Than $2 Billion": 0.8,
  "A $2.2 Trillion Jump in Billionaire Net Worth": 0.5,
  "Wedbush Names Apple a Top AI Pick for the 2026 Market Cycle": 0.8,
  "Starbucks doesn’t want to be on every street in New York and Los Angeles anymore": 0.2,
  "Investors should reallocate Big Tech plays 'now.' Here's how.": 0.5,
  "Starbucks Closes 400 U.S. Stores": -0.7,
  "AI Chips Today - AI Infrastructure Surge Driving Market Growth": 0.6,
  "Exploring 3 High Growth Tech Stocks In The US Market": 0.0,
  "The Zacks Analyst Blog Highlights NVIDIA, Micron Technology and Palantir": 0.5,
  "Warner Bros. Board Prepares to Reject Revised Paramount Skydance Bid": -0.5,
  "AI Weekly: Meta wants Manus, AI investors want more in 2026": 0.5,
  "The Zacks Analyst Blog Highlights Robinhood Markets, Micron Technology, Ciena and Credo Technology": 0.5,
  "Company News for Dec 31, 2025": 0.0,
  "Palo Alto Networks (NASDAQ:PANW) Is Looking To Continue Growing Its Returns On Capital": 0.6,
  "The Zacks Analyst Blog Highlights Berkshire Hathaway, AstraZeneca, Intel, Kingsway Financial and BK Technologies": 0.5,
  "Baker Hughes' Quarterly Earnings Preview: What You Need to Know": 0.0,
  "Palantir Technologies (NASDAQ: PLTR) Stock Price Prediction for 2026: Where Will It Be in 1 Year": 0.2,
  "Stocks Decline Pre-Bell Ahead of Final Trading Session of 2025": -0.5,
  "Intel Stock Climbs on Strategic Nvidia Deal, Caps a Pivotal 2025": 0.8,
  "Nvidia (NASDAQ: NVDA) Stock Price Prediction for 2026: Where Will It Be in 1 Year (Dec 31)": 0.1,
  "American Electric's Investments and Renewables Fuel Long-Term Growth": 0.8,
  "ISRG Sees 91% SP Growth: A Turning Point for Single-Port Surgery?": 0.8,
  "2 Stocks That Could Create Lasting Generational Wealth": 0.8,
  "Intel's Q4 2025 Earnings: What to Expect": 0.0,
  "Earnings Preview: What to Expect From KLA Corporation's Report": 0.5,
  "Stocks making big moves yesterday: FTAI Aviation, ON24, Bumble, Intel, and Byrna": 0.2,
  "12 Stocks Turn $10,000 Into $488,286 In 12 Months": 0.5,
  "Bristol Gate US Equity Strategy: NVDA’s Demand Today is Broadcom’s (AVGO) Opportunity Tomorrow": 0.5,
  "Dow Jones Futures Fall On 2025's Final Day; Eli Lilly, Shopify Forge Buy Points": -0.2,
  "Donna Rae Garff Marriott, Cherished Wife, Mother, Grandmother, and Community Leader, Passes Away at Age 90": -0.8,
  "Warren Buffett Says Goodbye Today With 65% of Berkshire Hathaway in 5 of His Favorite Stocks": 0.5,
  "Intuit (INTU) Slipped as the Outlook and Guidance Fell Short of Expectations": -0.6,
  "The 5 Best Stocks to Play AI in 2026, According to Wall Street’s Loudest Tech Bull": 0.5,
  "Can Qualcomm Stock Benefit From a Foray Into Mid-Range AI Chips?": 0.5,
  "Do Options Traders Know Something About MercadoLibre Stock We Don't?": 0.2,
  "Why Lam Research Is a Must-Own Pick-and-Shovel Stock for the AI Boom": 0.8,
  "Inside OpenAI's $1.5 million compensation packages": 0.2,
  "Western Digital Corporation (WDC) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Starbucks Corporation (SBUX) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Ultragenyx (RARE) Moves 15.5% Higher: Will This Strength Last?": 0.5,
  "Micron Technology's NAND Revenues Reach $2.7B: Is It a Growth Lever?": 0.5,
  "New report shows OpenAI offers historic pay packages amid AI talent war": 0.5,
  "Remember DeepSeek? China Could Have a New Nvidia Threat.": -0.5,
  "NBIS vs. MSFT: Which AI Infrastructure Stock Has More Upside?": 0.5,
  "Nvidia asks TSMC to ramp up H200 production, Paramount's WBD offer": 0.0,
  "Thoughts on AppLovin (APP) at current levels? - I’ve been watching AppLovin Corporation (APP) closely lately and wanted to get some outside perspectives. APP has been one of the strongest performers in the ad-tech / mobile monetization space, driven largely by its AI powered ad optimization (Axon) and improving margins. Revenue growth has been strong, and the market clearly rewarded that over the past year. That said, at these levels, a few things I’m personally": 0.5,
  "Brokers Suggest Investing in Analog Devices (ADI): Read This Before Placing a Bet": 0.5,
  "Mark Zuckerberg Threw $77 Billion 'Into The Toilet' On Metaverse, Says Economist Dean Baker: Asks If He Is Set To Waste Billions More On AI": -0.8,
  "Nike CEO Buys $1 Million of Stock as Insiders Bet on a Turnaround": 0.8,
  "Is Monolithic Power Systems (MPWR) Outperforming Other Computer and Technology Stocks This Year?": 0.2,
  "Inside the Streaming Consolidation Battle": 0.0,
  "Warren Buffett Added a Big Chunk of This Tech Stock. Should You Add It Too?": 0.5,
  "Nvidia Stock Has Barely Budged Since the End of July. What Gets It Going Again.": 0.2,
  "Jim Cramer Thinks Amazon Stock’s a Buy After Doing Nothing All Year. Why He’s Absolutely Right.": 0.6,
  "Meta will be the clear winner in the rise of synthetic relationships. - The trend lines are rather obvious. At some point, people became unable to form romantic and platonic relationships, and the data from late 2025 confirms this As of December 2025, the U.S. Census Bureau confirmed that fewer than half (47%) of U.S. households are married couples, a slide from 66% fifty years ago. The median age for a first marriage is at": 0.2,
  "Why Meta Platforms May Not Be a Winner This Next Year": -0.6,
  "Here Are the Top-Performing S&P 500 Stocks From 2025": 0.5,
  "By 2026, These Underrated AI Stocks Could Be the Market's Biggest Winners": 0.6,
  "AI bubble vs. the pizza bubble: Eric Jackson compares Nvidia, Domino's": 0.2,
  "Should I rebalance my stocks portfolio? - I structured my portfolio with ETFs (VOO, VGT, QQQ) as the core and stocks as a smaller allocation (15–20%). Due to outsized gains in stocks like PLTR, NVDA, and RKLB, the stocks portion has now grown to 50% of the portfolio (stocks total is about $100k). Should I rebalance my portfolio? I sold about 30% of PLTR and RKLB late last year when they grew 6-7x, but since": 0.2,
  "Every fusion startup that has raised over $100M": 0.2,
  "Market Movers: Nike Exploding Higher on Insider Buying": 0.8,
  "Buy 5 Solid Semiconductor Stocks of 2025 With Room for Growth in 2026": 0.8,
  "Tesla Stock In Spotlight -- Michael Burry Says 'I am Not Short Tesla'": 0.5,
  "Google's 2026 Test: Slowing EPS Will Put Cloud Growth In The Spotlight": 0.2,
  "BC-Most Active Stocks": 0.0,
  "New Year’s Day 2026: What’s open & what’s closed?": 0.0,
  "Mondelez expands voluntary recall of Chips Ahoy Baked Bites Brookie in U.S.": -0.5,
  "Revealed: A Cheap Semiconductor Stock is One of This Wall Street Pro’s “Top Picks” for 2026": 0.5,
  "Micron, Trade Desk, Western Digital: 2025's Big Stock Movers": 0.5,
  "World's 500 Richest Reach $11.9 Trillion After Record $2.2 Trillion Gain": 0.8,
  "AppLovin's High Revenue-to-Profit Conversion is the Story": 0.6,
  "Brookfield to start cloud business amid AI frenzy, The Information reports": 0.2,
  "Meta Pushes OpenAI to Raise Pay With $6 Billion Stock Compensation Plan": 0.5,
  "An 80% Wipeout Hasn’t Stopped Korean Retail From Chasing Tom Lee’s BitMine": 0.2,
  "Markets: AI isn't 'a runaway train' compared to Dot-Com Bubble": 0.1,
  "Nike Shares Rise After CEO Elliott Hill, Director Tim Cook Buy Stock": 0.8,
  "Microsoft Is Riding the AI Wave. Wall Street Sees More Upside Ahead": 0.8,
  "If You'd Invested $1,000 in Costco 10 Years Ago, Here's Your Return Today": 0.5,
  "Is Monster Beverage Driving Momentum Through Innovation and Marketing?": 0.5,
  "Last trading day of 2025. What's the move with MU before the ball drops? - Happy New Year! I'm staring blankly at the sell button right now. This year's AI and HBM boom has delivered some seriously sweet returns, but I'm growing increasingly worried about potential overcapacity next year. Everyone knows how volatile MU stock can be once the cycle reverses, the sell off can be brutal. My gut tells me to hold after all,": 0.2,
  "Amazon Analysts See Renewed Growth Potential Into 2026": 0.8,
  "Can T-Mobile's Customer-Focused Strategy Benefit the Stock?": 0.5,
  "TSMC Shares Rise on AI Demand and Next-Gen Chip Launch": 0.8,
  "ASML (ASML) Positioned for Growth as Citi Identifies AI Demand as Primary Catalyst for 2026 Semiconductor Equipment Outlook": 0.8,
  "Lam Research (LRCX) Leads Etch Market as AI-Driven Memory Supercycle Fuels Robust WFE Spending Outlook Through 2026": 0.8,
  "Micron (MU) Positioned for Growth as AI-Driven Memory Demand Triggers Major Analyst Upgrades": 0.8,
  "BNP Paribas Exane Reaffirms Rating on Alphabet (GOOGL) Amid Intersect Power Acquisition": 0.2,
  "Palantir: How Bootcamps Could Drive 2026 AI Dominance": 0.5,
  "China AI chip firm Biren raises $717 million in Hong Kong IPO": 0.8,
  "3 Stocks to Watch From the Challenging Computer Industry": 0.2,
  "Cantor Fitzgerald Urges Long Position on Western Digital (WDC) Amid AI Infrastructure Wave": 0.8,
  "Goldman Sachs Initiates Iren (IREN) With Neutral Rating, Cites AI Growth and High Valuation": 0.5,
  "Citi: SpaceX’s $800B Valuation Doubles EchoStar’s (SATS) Expected Equity Value Following Spectrum Deal": 0.6,
  "Morgan Stanley Expects Gilead Sciences (GILD) to Thrive as Biopharma Policy Uncertainties Fade in 2026": 0.8,
  "PTRN: Jefferies Warns of Margin Pressure and AI Disruption for Internet Equities in 2026": -0.6,
  "1 Artificial Intelligence (AI) Revenue Machine You'll Want to Watch in 2026 (Hint: It's Beaten Everyone Except Nvidia)": 0.8,
  "Meta Platforms Just Bought AI Agent Startup Manus. Should You Buy META Stock?": 0.5,
  "DV vs. ADSK: Which Stock Is the Better Value Option?": 0.2,
  "Is KLA Corporation (KLAC) The Best Performing Quantum Computing Stock of 2025?": 0.5,
  "Intel Corporation (INTC) Falls as Nvidia Stops Testing its Intel 18": -0.5,
  "Alphabet Inc. (GOOGL) Acquires Intersection of $4.75 Billion, Here’s What You Need to Know": 0.2,
  "Top Midday Stories: Nvidia Approaches TSMC in Quest to Boost H200 Chip Production; Corcept Faces Setback From FDA on Hypertension Drug": 0.1,
  "Why did most semiconductor stocks weaken at year end while NVDA bucked the trend and rose? - Semiconductor stocks were mostly lower to end the 2025 trading year, as investors looked to lock in profits heading into 2026. However, NVDA bucked the trend, posting a modest gain after reports emerged that the company had approached Taiwan Semiconductor Manufacturing Company TSM to increase production of its H200 GPUs, amid a surge in Chinese demand. TSM shares": 0.2,
  "Is Shopify (SHOP) One of the High Growth Large Cap Stocks to Buy Right Now?": 0.5,
  "Wedbush Lifts PT on DoorDash (DASH) Stock": 0.5,
  "Accenture and Palantir Technologies (PLTR) Form Accenture Palantir Business Group": 0.2,
  "J.P. Morgan Maintains Bullish Stance on CrowdStrike Holdings (CRWD) Stock": 0.8,
  "Morgan Stanley Reduces PT on Axon Enterprise (AXON) Stock": -0.5,
  "Morgan Stanley Reduces PT on Zscaler (ZS) Stock": -0.5,
  "Nvidia Is Getting Creative as Options to Use Its Cash Flood Narrow": 0.1,
  "The \"Trump trade\" is accelerating: Five brand-new \"America First\" ETFs have launched on the New York Stock Exchange. - Just yesterday (December 30th), Trump Media & Technology Group ($DJT) officially launched five new ETFs through its fintech brand \"Truth.Fi\". Although $DJT's stock price fell by 4.5% after the announcement (a typical \"buy the rumor, sell the news\" scenario), the underlying holdings of these funds reveal the current administration's economic strategy for 2026. The \"America First\"": 0.6,
  "2 No-Brainer Artificial Intelligence (AI) Stocks to Buy With $2,000 Right Now": 0.5,
  "Burry calls Tesla ’ridiculously overvalued’ but avoids shorting ’dangerous’ stock": -0.5,
  "Memory Stocks Could Dominate (Again) in 2026. Should You Buy Micron Stock Now?": 0.5,
  "Ross Gerber Slams Politicians For Pushing Higher Taxes As The 'Solution For Every Issue,' Calls Them The Most 'Incompetent Group' In Society": -0.8,
  "Nvidia Could Buy AI21 Next. What Does That Mean for NVDA Stock?": 0.2,
  "Mother swan? - While the stock market continues to hit all-time highs, the underlying structural integrity of the global economy is disintegrating. We are currently witnessing a massive divergence where asset prices are decoupled from the reality of a K-shaped economy and skyrocketing cost of living. For the average person, the economy has been in a recession for a year, while the top quintile rides an AI-fueled wave that is increasingly looking like the largest": -0.8,
  "Should I reduce or sell my Tesla holdings? - I've begun seriously considering whether to reduce or exit my Tesla position. Background: I've held Tesla (TSLA) for over three years. Long-term, I still believe the stock could reach $500 next year, but its recent performance... has been disappointing. Even as the broader market resumed its rally, TSLA failed to follow suit. Therefore, I'm contemplating: Limited upside potential over the next six months Volatility has significantly": -0.5,
  "Warren Buffett is stepping down as Berkshire Hathaway CEO. It's one of several big C-suite shake-ups in 2026.": 0.2,
  "Starbucks store hours for New Year's Eve and New Year's Day 2026": 0.0,
  "Tesla Stock: Buy, Sell, or Hold in 2026?": 0.2,
  "How are all these SaaS companies STILL unprofitable? - I haven't followed these companies in a long time, but I've been doing some light digging on these names. The ones I'm talking about: * Crowdstrike (CRWD) * Snowflake (SNOW) * Cloudflare (NET) * MongoDB (MDB) * Asana (ASAN) * Unity (U) How are they all still unprofitable? Many of these companies are well past the hypergrowth phase. Some of these have been around for 15": -0.5,
  "3 Stocks Set to Benefit as Elon Musk’s xAI Expands Its Huge Data Center": 0.6,
  "Alphabet Stock Can Rise Another 22%, Analyst Says. Here’s Why.": 0.8,
  "Microsoft Named A Top Pick Amid AI 'Inflection Point'; Is Microsoft A Buy Now?": 0.5,
  "Sector Update: Tech Stocks Lower in Wednesday Afternoon Trading": -0.5,
  "Global X Cybersecurity’s ETF May Be 2026’s Best Investment As Cybercrime Explodes | BUG": 0.8,
  "2025 Stock Market Review: Surprises, Strong Performers & What’s Next for 2026? - 2025 Stock Market Review: Tech stocks led the charge, with AI and semiconductors performing strongly. TSLA and NVDA delivered as expected. But the real surprise was SanDisk, which surged as storage demand skyrocketed. Definitely a dark horse this year. Looking ahead to 2026, which sectors or stocks do you think will continue to rise? Any predictions or surprises in the making?": 0.6,
  "J.P. Morgan Reveals Top Stocks for 2026! AI Giants Dominate the List, But Carvana Emerges as a Dark Horse? - J.P. Morgan's latest report releases its 2026 “Top Investment Picks.” After reviewing it, I believe these companies must meet the following criteria: Rock-solid finances (strong cash flow, low debt) Pricing power (inflation resistant, stable profits) Bets on major trends (AI, data centers, infrastructure, resilient sectors) Three key themes: AI Boom: Explosive demand for computing power": 0.5,
  "The Best Tech Stocks to Buy in January for 2026 Gains": 0.5,
  "If I think that helicopter drones are the future of package delivery, who should I invest in? - Feel free to tell me why you think that helicopter type drones might not be the future of package delivery, but why would a company like Amazon pay for a bunch of vehicles/gas and contracted driving companies who then have to pay workers and benefits and all the other associated trainings and fees? When really they could": 0.2,
  "Dogs of the Dow Had a Strong Year. Here Are the 10 Stocks for 2026.": 0.6,
  "Nike Insider Robert Swan Just Loaded Up on NKE Shares. Should You Too?": 0.5,
  "Funds Plow Money Into AppLovin, Broadcom, Google — And This Top 100 Stock": 0.5,
  "Do You Hold The ETFs That Own 2025's Best Stocks?": 0.1,
  "Rival Railroads Slam UP-NS Merger Application, Citing Incomplete Data": -0.6,
  "Robo-Taxis and Home Runs? 40 ’Forgotten’ Stocks for 2026.": 0.2,
  "Last Call: Should You Load Up on Intel Stock Before 2025 Ends?": 0.2,
  "So Long, Warren. Buffett Leaves Astonishing Gains As He Steps Down As CEO.": 0.8,
  "MU Is it the Next Super Stock - Planning to drop $100k on MU next year. The storage demand from AI and data centers is off the charts. MU's got the tech edge, solid earnings, and steady cash flow. Sure, semiconductors are cyclical, but I'm bullish, betting it'll be the next mega winner. Folks, is jumping on MU now a safe bet? My financial freedom hinges on this. What do you say?": 0.8,
  "US Equity Indexes Slip in Final Leg of Trading": -0.5,
  "Warren Buffett’s last day as Berkshire CEO puts focus back on rare asset": 0.2,
  "Palantir CEO Alex Karp nabs Aspen-area ranch for $120M": 0.5,
  "Prediction: This Company Could Overtake Nvidia as the Largest in the World in 2026": 0.6,
  "Sector Update: Tech Stocks Fall Late Afternoon": -0.5,
  "Elon Musk's Deadline Has Arrived. Will An Unsupervised Tesla Robotaxi Ring In The New Year?": 0.2,
  "Michael Saylor’s MicroStrategy plunges on New Year’s Eve": -0.7,
  "Tesla Closes Year on Six-Day Losing Streak. Next Up, EV Deliveries.": -0.5,
  "US Equity Indexes Lower Amid Mixed Economic Data": -0.3,
  "Ending the year still overweight big cap tech, but trimming and holding cash curious how others are positioned - Wrapping up the year with a pretty familiar setup for me. I’m still overweight big cap tech / AI adjacent names, mainly because the fundamentals and cash flow are hard to ignore but I’ve definitely been trimming into strength and sitting on more cash than earlier this year. This week’s price action didn’t really change my": 0.2,
  "Nvidia Asks TSMC To Boost H200 Production Amid China Demand": 0.5,
  "Tesla 2026: 'Defining Year' Hinges On Self-Driving Robotaxis And True Autonomy": 0.5,
  "Stocks end the year up a solid 16% as AI hype powers gains": 0.8,
  "These Stocks Moved the Most Today: Nvidia, Tesla, Nike, DJT, Hecla, Newmont, Corcept, Vanda, and More": 0.0,
  "Gold, silver, & Strategy trade lower; Brookfield's cloud business": -0.2,
  "Here Are My Top 2 Stocks to Buy for 2026 and Beyond": 0.5,
  "Gary Black Calls Tesla's Move To Release Delivery Estimate Data 'Highly Unusual:' Says Delivery Shortfall Could Coincide With Robotaxi Announcement": -0.2,
  "2 Luxury EV Stocks Headed to $0, And 1 That Could Make You a Multimillionaire": -0.5,
  "Stock Market Today: Dow Sinks As Year-End Rally Sputters; Nvidia Slides As Warren Buffett Steps Down (Live Coverage)": -0.5,
  "How Western Digital Became the S&P 500’s Best Stock in 2025—and Why Trade Desk Was the Worst": 0.2,
  "Microsoft killed an $8.5 billion mistake in 2025": -0.6,
  "Where Will Intuitive Surgical Be in 5 Years?": 0.2,
  "US Equities Fall in Final 2025 Session; Indexes Still Post Solid Annual Gains": 0.5,
  "The World’s Wealthiest People Got $2.2 Trillion Richer This Year": 0.8,
  "South Korean Stocks Had a Breakout 2025. Can It Continue?": 0.5,
  "How Fast Top CEOs Like Warren Buffett Make the Average US Salary in 2025": 0.5,
  "Dow Jones, Stock Market Fall To Key Levels To End 2025; Tesla, Palantir, Nvidia Chipmaker In Focus": 0.2,
  "AppLovin (APP) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Here's Why Datadog (DDOG) Fell More Than Broader Market": -0.5,
  "Constellation Energy Corporation (CEG) Declines More Than Market: Some Information for Investors": -0.5,
  "Palo Alto Networks (PANW) Dips More Than Broader Market: What You Should Know": -0.5,
  "Paypal (PYPL) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "Why Qualcomm (QCOM) Dipped More Than Broader Market Today": -0.5,
  "Why Starbucks (SBUX) Dipped More Than Broader Market Today": -0.5,
  "Intuit (INTU) Suffers a Larger Drop Than the General Market: Key Insights": -0.5,
  "Fortinet (FTNT) Declines More Than Market: Some Information for Investors": -0.5,
  "Intuitive Surgical, Inc. (ISRG) Dips More Than Broader Market: What You Should Know": -0.2,
  "Analog Devices (ADI) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Why Strategy (MSTR) Dipped More Than Broader Market Today": -0.5,
  "Booking Holdings (BKNG) Registers a Bigger Fall Than the Market: Important Facts to Note": -0.5,
  "Paccar (PCAR) Declines More Than Market: Some Information for Investors": -0.5,
  "Here's Why Texas Instruments (TXN) Fell More Than Broader Market": -0.5,
  "Wall Street ends 2025's final session lower but posts big annual gains": 0.5,
  "Supermicro Unveils High-Density, Liquid-Cooled and Air-Cooled 6U SuperBlade® Powered by Intel® Xeon® 6900 Series Processors for Maximum Performance and Efficiency": 0.8,
  "Tesla Is About to Report Fourth-Quarter Deliveries. The Number May Be Weak -- And Investors May Not Care": 0.1,
  "Best Stocks Of 2025: Palantir, Micron, Other Fundamental Giants Highlight Elite 100 List": 0.8,
  "Crypto Winter Could Return in 2026, Motley Fool Warns": -0.6,
  "Prediction: These 2 Growth Stocks Will Beat the Market Through 2031": 0.5,
  "Flixy Stick Draws Scrutiny as Consumers Research Streaming Alternatives Amid Rising Subscription Costs": -0.5,
  "After Soaring In 2025, Is It Time to Take Profits on This High-Flying AI Stock? Or Is It Time to Double Down?": 0.5,
  "Prediction: This Will Be the Next AI Stock That Berkshire Hathaway Buys": 0.5,
  "1 Reason I'm Never Selling Amazon Stock": 0.5,
  "CoreWeave (CRWV) Being Down Is Silly, Says Jim Cramer": 0.5,
  "Could Spotify Be a Multimillionaire-Maker Stock?": 0.5,
  "Michael Saylor, Crypto Titans Lost Billions After October Market Crash": -0.8,
  "2026 individual stocks - I have my foundation etf for now. I made a little money on meta, did pretty good on Sofi, and made 110%+ on first majestic call before the silver craze, I’m just sitting on my etf, but I’m looking for insight on some good stocks/sectors/plays to add for 2026. I’ll do the research but if anyone has some names I’m open to hearing input.": 0.6,
  "Here’s What Will Surely Happen in 2026. Unless It Doesn’t.": 0.0
}