{
  "1 No-Brainer Stock-Split Stock to Buy Before the End of the Year, and 1 That Investors Would Be Wise to Avoid": 0.5,
  "Is There Now an Opportunity in PACCAR After Five-Year Gains of 116%?": 0.5,
  "1 Glorious Growth Stock Down 31% to Buy Hand Over Fist, According to Wall Street": 0.6,
  "Is Monster Beverage Stock Outperforming the Dow?": 0.5,
  "MGM rebrands NoMad Las Vegas as The Reserve at Park MGM": 0.2,
  "Waterford and Maverick strengthen market position with strategic merger": 0.8,
  "Kessler Collection CEO on the balancing act of hotel brand partnership": 0.1,
  "FERC urged to reject AEP waiver request for PJM capacity sale": -0.5,
  "How the Story Behind Amgen Is Shifting After Pipeline and Guidance Updates": 0.2,
  "Returns On Capital At Honeywell International (NASDAQ:HON) Have Stalled": -0.5,
  "We Think Baker Hughes (NASDAQ:BKR) Can Stay On Top Of Its Debt": 0.6,
  "Axon Enterprise (AXON): Evaluating Valuation After Recent Share Declines and Long-Term Gains": 0.5,
  "3 Stocks Estimated To Be Trading Below Their Intrinsic Value In December 2025": 0.5,
  "High Growth Tech Stocks In The US Market To Watch": 0.5,
  "Report shows how AI drives shift in UK engineering and consultancy sector": 0.5,
  "Returns Are Gaining Momentum At NXP Semiconductors (NASDAQ:NXPI)": 0.5,
  "Market Chatter: Disney Expected to Choose Internal Successor to CEO Bob Iger": 0.5,
  "A Look at Amgen (AMGN) Valuation After Full FDA Approval and NCCN Guideline Update for IMDELLTRA": 0.2,
  "Eikon Therapeutics Announces the Election of David W. Meline to its Board of Directors": 0.5,
  "Cytactic Appoints Veteran Cybersecurity Sales Executive Bill Hogan as Chief Revenue Officer (CRO)": 0.5,
  "Zscaler Awarded a 2025 AWS Partner Award": 0.5,
  "Stocks making big moves yesterday: DoorDash, Chegg, Noodles, Red Robin, and DraftKings": 0.5,
  "Software firm Vinci, which speeds up hardware simulation, raises $36 million": 0.5,
  "NVIDIA Soars 27% in Six Months: Is the Stock Still Worth Buying?": 0.5,
  "Baker Hughes (BKR): Is the Stock Still Undervalued After Its Recent Rally?": 0.2,
  "Rosenblatt starts Workday at Neutral as slowing growth offsets stronger earnings": 0.1,
  "Is O'Reilly Automotive Stock Underperforming the Nasdaq?": -0.5,
  "Is PACCAR Stock Outperforming the Dow?": 0.2,
  "U.S. Small Business Employment Sees Modest Uptick in November": 0.5,
  "Amazon Tests 'Ultrafast' Deliveries In These Two Cities. Rival Grocery Delivery Stock Takes A Hit.": -0.5,
  "NAPA VALLEY MARRIOTT AND PREFERABLI ANNOUNCE PARTNERSHIP TO CREATE TRULY PERSONALIZED GUEST EXPERIENCES": 0.6,
  "Orca Security Expands Strategic Partnership with Zscaler to Strengthen Zero Trust and Cloud Risk Management": 0.8,
  "Carpe Data Joins Verisk ClaimSearch Ecosystem": 0.5,
  "GE HealthCare introduces advanced imaging solutions powered by NVIDIA technology to support timely diagnoses and streamlined clinical workflows": 0.8,
  "Amplitude to Present at Upcoming Investor Conference": 0.0,
  "Perforce Introduces New Diagram App for Confluence Users with Data Egress Constraints": 0.1,
  "1Kosmos CSO to Lead Expert Panel on Modernizing Identity Verification at 2025 Gartner IAM Summit": 0.6,
  "Atlassian Announces Availability of Cloud Apps on AWS Marketplace": 0.5,
  "MercadoLibre (MELI) Slid in Q3 Despite Reporting Strong Results": -0.5,
  "Buy These 3 Consumer Staple Stocks to Navigate Market Volatility": 0.5,
  "Baxdrostat New Drug Application accepted under FDA Priority Review in the US for patients with hard-to-control hypertension": 0.8,
  "Teradyne upgraded, Circle Internet initiated: Wall Street's top analyst calls": 0.5,
  "Zacks Investment Ideas feature highlights: JP Morgan, Home Depot, Lennar, NextEra Energy and American Electric Power": 0.5,
  "Zacks Investment Ideas feature highlights: Oklo, Constellation Energy, Microsoft, Meta Platforms, Bloom Energy, First Solar and Nextpower": 0.2,
  "T-Mobile fears are ‘somewhat exaggerated,’ KeyBanc says": 0.5,
  "OhioHealth Deploys NetMenu to Standardize Patient Nutrition Across 16 Hospitals": 0.5,
  "3 Dirt Cheap Dividend Stocks to Buy and Hold": 0.5,
  "Healthcare Robotics Research Report 2025: Market to Reach $15.35 Billion by 2030, Driven by Aging Populations and Rising Demand for Minimally Invasive Surgical Solutions": 0.8,
  "Palo Alto Networks Plunges 14% in a Month: Time to Hold Tight or Exit?": -0.6,
  "onsemi and Innoscience Announce Plans to Collaborate to Speed Global Rollout of GaN Power Portfolio": 0.5,
  "The Zacks Analyst Blog Highlights Amazon.com, Expedia, Etsy, Booking and 1stdibs.Com": 0.5,
  "Can Axon Maintain EBITDA Margin Momentum Amid Cost Pressures?": 0.1,
  "I Name CEO Starbucks CEO Brian Niccol “Worst CEO of 2025”": -0.8,
  "BuildOps Assembles Go-to-Market Leadership Team to Power Next Phase of Growth": 0.6,
  "Lam Research (LRCX) Stock Is Up, What You Need To Know": 0.5,
  "OpenTable reveals its annual Top 100 Restaurants in Canada for 2025, along with 2026 dining trends": 0.5,
  "Insiders Swarm Vertical Aerospace Stock Ahead of Make-or-Break Reveal": 0.5,
  "Amazon starts testing ‘ultra-fast’ 30-minute deliveries": 0.8,
  "Market Chatter: AstraZeneca, GSK to Join UK Working Group on New Drug-Pricing Framework": 0.5,
  "Why This T-Mobile Bear Is Throwing in the Towel and Upgrading the Stock": 0.5,
  "EXPE or MELI: Which Is the Better Value Stock Right Now?": 0.5,
  "FIVN vs. ADSK: Which Stock Is the Better Value Option?": 0.2,
  "Datadog Launches Bits AI SRE Agent to Resolve Incidents Faster": 0.6,
  "T-Mobile US, Inc. to Present at the UBS Global Media and Communications Conference": 0.0,
  "DexCom Stock Upgraded. How the Glucose Monitor Maker Is ‘Turning a Corner.’": 0.6,
  "3 Interesting Buys Bill Nygren Made Last Quarter": 0.5,
  "Chagee Holdings And 2 Other Stocks That May Be Priced Below Estimated Value": 0.2,
  "GEHC Unveils Allia Moveo to Elevate Mobility in Interventional Care": 0.5,
  "Saudi Fund to Own Almost All of Electronic Arts After Buyout": -0.5,
  "AT&T Stock Declines 7.8% in Six Months: Should You Buy in the Dip?": -0.5,
  "Here's Why You Should Retain Ecolab Stock in Your Portfolio Now": 0.6,
  "ON Semiconductor Shares Steady Amid Analyst Upgrades and Year-to-Date Drop of 18%": 0.5,
  "New Amazon Bedrock AgentCore Capabilities Power the Next Wave of Agentic AI Development": 0.5,
  "San Francisco Takes Aim at Ultraprocessed Foods, and Food Stocks Slump": -0.6,
  "Sector Update: Health Care Stocks Lower Tuesday Afternoon": -0.5,
  "MercadoLibre (MELI) Stock Trades Up, Here Is Why": 0.5,
  "How a Giant Saudi Fund Will Get Majority Ownership of Electronic Arts": 0.1,
  "Cintas (CTAS): Exploring Valuation Signals After Recent Share Price Cooldown": 0.5,
  "REGN & Tessera Collaborate to Develop Gene-Editing Therapy for AATD": 0.5,
  "This Zscaler \"Buy the Dip\" Signal is Rarely Wrong": 0.8,
  "Metropolis Launches Real-Time Reporting for Expo XT Webex Contact Center": 0.2,
  "Saudi Arabia's public investment fund to own almost all of EA under buyout plan, report says": 0.5,
  "Kraft Heinz, Mondelez, PepsiCo, Coca-Cola, General Mills Among Food Makers Sued by San Francisco Over Ultra-Processed Products": -0.8,
  "Charter to Participate in UBS Global Media and Communications Conference": 0.2,
  "Starbucks Declares Quarterly Cash Dividend": 0.5,
  "Why Applied Materials (AMAT) Stock Is Up Today": 0.5,
  "Cadence’s Anirudh Devgan to Present at Nasdaq Investor Conference": 0.5,
  "San Francisco Sues Food Makers Over Ultraprocessed Products": -0.5,
  "New Data Presented at the Clinical Trials on Alzheimer's Disease (CTAD) Conference 2025 Confirms Pharmacological Effect of LEQEMBI® (lecanemab-irmb) on Neurotoxic Aβ Protofibrils in CSF": 0.8,
  "KLA, IBD Stock Of The Day, Flashes Buy Signal Amid AI Demand": 0.6,
  "AT&T commits to ending DEI programs": -0.8,
  "Popular analyst unveils two new AI stocks for 2026": 0.5,
  "Datadog (DDOG): Evaluating Valuation After Strong Earnings and AI-Driven Growth Outlook": 0.6,
  "Biogen (BIIB): Assessing Valuation After Recent Share Price Gains": 0.5,
  "Are Shares of AEP a Bargain After Recent Renewable Energy Initiatives and 31% YTD Gain?": 0.6,
  "Old Dominion Freight Line Provides Update for Fourth Quarter 2025": 0.0,
  "Autodesk (ADSK) Valuation: Assessing Upside Potential After Upbeat Results and Upgraded Guidance": 0.8,
  "How Recent Developments Are Rewriting the Story for Datadog": 0.5,
  "A Look at American Electric Power's (AEP) Valuation After New Long-Term Growth and Investment Plans": 0.5,
  "Is The Breakout in SoFi Stock Just Beginning?": 0.5,
  "(Item 8.01) Other Events On December 3, 2025, the Board of Directors (the “Board”) of Comcast Corporation (“Comcast”) approved the previously announced separation of certain cable television networks and complementary digital platforms from its remaining businesses (the “Separation”), which will be achieved through a pro rata distribution of 100% of the outstanding shares of Class A common stock of Versant Media Group, Inc. (“Versant”) and 100% of the outstanding shares of Versant Class B common stock to": 0.1,
  "(Item 1.01) . Entry into a Material Definitive Agreement. 364-Day Credit Agreement On December 3, 2025, Linde plc (the “Company”) and certain of its subsidiaries entered into an unsecured 364-day revolving credit agreement (the “Credit Agreement”) with Bank of America, N.A., as administrative agent, and a syndicate of banking institutions as lenders. The initial borrowers under the Credit Agreement are the Company, Linde Inc., Linde GmbH and Linde Finance B.V. Additional subsidiaries of the Company may become\n\n(Item 1.01) .\n\n(Item 1.01) . Entry into a Material Definitive Agreement” is incorporated herein by reference.": 0.1,
  "(Item 5.07) . Submission of Matters to a Vote of Security Holders. Atlassian Corporation (the “Company”) held its 2025 Annual Meeting of Stockholders on December 2, 2025 (the “Meeting”). The proposals considered at the Meeting are described in the Company’s 2025 Proxy Statement filed with the Securities and Exchange Commission on October 15, 2025 (the “Proxy Statement”). Each stockholder present in person, or by proxy, was entitled to one vote for every share of Class A Common": 0.0,
  "Did Flywl’s Cloud Cost Integration Just Shift Datadog’s (DDOG) Enterprise Investment Narrative?": 0.1,
  "OutSystems Appoints Kim Seabrook as Chief Revenue Officer": 0.5,
  "NagaCorp Featured Among Best in Region on Fortune 100 Best Companies to Work For™ Southeast Asia 2025 List": 0.8,
  "Agoda CEO: \"The travel landscape is transforming at an unprecedented pace - and Asia is at the forefront of emerging trends\"": 0.6,
  "3 Reasons to Avoid KHC and 1 Stock to Buy Instead": -0.5,
  "1 Healthcare Stock with Promising Prospects and 2 We Question": 0.2,
  "2 High-Flying Stocks to Keep an Eye On and 1 Facing Challenges": 0.2,
  "3 Large-Cap Stocks That Fall Short": -0.5,
  "Goldman Sachs Maintains Price Target on Amgen (AMGN) Before Key Trial Readouts": 0.5,
  "AstraZeneca (AZN) Named One of BofA’s Top 25 Stocks for 2026": 0.8,
  "Why Applied Materials (AMAT) Is Up 6.1% After Fresh AI-Focused Analyst Upgrades – And What's Next": 0.5,
  "How Is Autodesk's Stock Performance Compared to Other Software Stocks?": 0.2,
  "Up 7,400% All Time, Is It Too Late to Buy MercadoLibre Stock?": 0.2,
  "Is Fortinet Stock Underperforming the Dow?": -0.5,
  "BNSF, CSX boost intermodal speed, launch new lanes": 0.6,
  "Does Billionaire David Tepper Know Something Wall Street Doesn't? He's Selling Alphabet and Amazon and Piling Into This AI Stock Instead.": 0.5,
  "2 Software Stocks to Own for Decades and 1 We Brush Off": 0.2,
  "2 S&P 500 Stocks Worth Investigating and 1 We Brush Off": 0.2,
  "How Oreo maker Mondelēz is rethinking snack marketing with AI": 0.5,
  "Is Roper Technologies (ROP) Now Undervalued After Its Recent Share Price Pullback?": 0.5,
  "Why The Narrative Around DoorDash Is Shifting Amid Fresh Analyst Updates And New Risks": 0.2,
  "Does Cadence Design Systems Still Offer Value After Its Big AI Driven Run?": 0.2,
  "How Recent Moves Are Changing What Analysts Think Gives T Mobile The Edge Over Rivals": 0.5,
  "How Good Has Airbnb (ABNB) Stock Actually Been?": 0.5,
  "$21+ Bn Industrial Gloves Market - Global Forecasts from 2025 to 2030 with 3M, Ansell, Top Glove, Honeywell International, and Radians Leading": 0.5,
  "Trending tickers: CrowdStrike, Marvell Technology, Inditex, Sainsbury's and Smiths": 0.0,
  "Texas Instruments Incorporated's (NASDAQ:TXN) Stock Is Going Strong: Have Financials A Role To Play?": 0.5,
  "Analog Devices' (NASDAQ:ADI) five-year earnings growth trails the 16% YoY shareholder returns": 0.2,
  "S&P Futures Tick Higher With U.S. Economic Data in Focus": 0.5,
  "Is Paychex, Inc.'s (NASDAQ:PAYX) ROE Of 41% Impressive?": 0.2,
  "2 Brilliant Growth Stocks to Buy Now and Hold for the Long Term": 0.8,
  "Amazon to Integrate Nvidia Technology Into Future AI Chips, Launches New High-Performance Servers": 0.8,
  "Lyft And 2 Other Stocks That May Be Trading Below Fair Value Estimates": 0.5,
  "Exploring 3 High Growth Tech Stocks In The US Market": 0.0,
  "Tech Is Getting Left Behind in the S&P 500’s Latest Rebound": -0.5,
  "Win for pharma in UK – zero US tariffs, VPAG rate cap and NICE threshold increase": 0.5,
  "The $100 Million Tell: Following Smart Money Into DoorDash": 0.5,
  "Is DexCom Stock Underperforming the S&P 500?": -0.5,
  "Owkin Announces International Validation Results of BRCAura: AI-Driven Screening for gBRCA Mutations Directly From Pathology Slides": 0.5,
  "Investing in Cognizant Technology Solutions (NASDAQ:CTSH) three years ago would have delivered you a 37% gain": 0.6,
  "O'Reilly Automotive, Inc. (NASDAQ:ORLY) is a favorite amongst institutional investors who own 86%": 0.5,
  "Stocks making big moves yesterday: Lam Research, Sweetgreen, Applied Materials, Lattice Semiconductor, and The Pennant Group": 0.0,
  "Razorpay gains payment aggregator-cross border licence from India’s RBI": 0.5,
  "Is Keurig Dr Pepper Stock Underperforming the Dow?": -0.5,
  "Booking (BKNG) Valuation Check After Q3 Beat, Guidance Hike, and New viagogo Partnership": 0.6,
  "Is Ross Stores Stock Underperforming the Nasdaq?": -0.5,
  "Can Dutch Bros Unlock Higher Transactions Through Order Ahead?": 0.2,
  "The Trade Desk (TTD) Slid on Investors’ Concerns": -0.5,
  "2 Energy Drink Stocks to Buy for a Stable Portfolio in 2026": 0.5,
  "Intuitive Surgical (ISRG) Declined Due to Management’s Cautious Commentary": -0.5,
  "Intuit (INTU) Fell Despite Reporting Strong Results": -0.5,
  "University of Rochester Medical Center and GE HealthCare form seven-year Care Alliance to build advanced capabilities across system": 0.5,
  "Investors Heavily Search Starbucks Corporation (SBUX): Here is What You Need to Know": 0.5,
  "ON Semiconductor Corporation (ON) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Vertex Up 9.2% in 3 Months: Should You Buy, Sell or Hold the Stock?": 0.5,
  "Brown Advisors Large-Cap Growth Strategy Sold Workday (WDAY) Due to Slower Than Anticipated Revenue Growth": -0.5,
  "Here Are Wednesday’s Top Wall Street Analyst Upgrades and Downgrades: American Eagle Outfitters, Equinix, Garmin, Honeywell, Uber, Wendy’s and More": 0.5,
  "Company News for Dec 3, 2025": 0.0,
  "Can LLY Strengthen Its Lead as GLP-1 Price Cuts Reshape the Market?": 0.2,
  "Zacks Investment Ideas feature highlights: Amazon and Shopify": 0.5,
  "Oracle initiated, Uber upgraded: Wall Street's top analyst calls": 0.5,
  "Chris Schultz named CEO of Velvet Taco": 0.2,
  "Are Computer and Technology Stocks Lagging  Analog Devices (ADI) This Year?": -0.2,
  "Is Paychex Stock Underperforming the Dow?": -0.5,
  "Globant presents a new edition of Converge, its annual thought-provoking event, with global leaders sharing how to move from AI ideation to execution": 0.8,
  "Nebius leverages Microsoft, Meta contracts for AI expansion": 0.5,
  "Design Hotels Boosts Growth in Asia Pacific with Fourteen Landmark Signings": 0.6,
  "AZN's Baxdrostat Gets FDA Priority Tag for Uncontrolled Hypertension": 0.5,
  "ASML Is Becoming the New \"Pick-and-Shovel\" Stock for the AI Era": 0.6,
  "What Will the Future of Farming Look Like? DigiKey's New Episodes of \"Farm Different\" Share Three Notable Outlooks": 0.5,
  "onsemi, Innoscience to collaborate on rollout of GaN power portfolio": 0.5,
  "Old Dominion again sees yields improve as volumes sag": 0.2,
  "The Bulls Are Back—Why Qualcomm Stock Is Gaining Strength Again": 0.8,
  "1 Top Growth Stock Down 25% to Buy Right Now": 0.5,
  "NXP Semiconductors (NXPI) Surges 8% Ahead of Ex-Dividend Date": 0.8,
  "ASML, Oracle, Roblox: Top Analyst Calls": 0.0,
  "2 Growth Stocks to Invest $1,000 In Right Now": 0.5,
  "Cognizant and Merchants Fleet Set New Standard for Fleet Management Efficiency": 0.8,
  "How AppLovin is Evolving Into a Multi-Channel Advertising Leader": 0.5,
  "Vertex Pharmaceuticals' Kidney Pipeline Seen as Growth Driver, Morgan Stanley Says": 0.8,
  "Operation HOPE Announces Historic Partnership with the Country’s Top Nonprofits to Launch HOPE AI™ - a National Strategy for Inclusive Financial and AI Literacy": 0.8,
  "Axsome (AXSM) Up 5.3% Since Last Earnings Report: Can It Continue?": 0.5,
  "Why Is Diamondback (FANG) Up 11.9% Since Last Earnings Report?": 0.5,
  "Idexx (IDXX) Up 1.5% Since Last Earnings Report: Can It Continue?": 0.5,
  "Lattice (LSCC) Up 12.9% Since Last Earnings Report: Can It Continue?": 0.5,
  "Why Is Myriad (MYGN) Up 8.7% Since Last Earnings Report?": 0.5,
  "ON Semiconductor Corp. (ON) Up 6.6% Since Last Earnings Report: Can It Continue?": 0.5,
  "Why Is Vertex (VRTX) Up 2.7% Since Last Earnings Report?": 0.2,
  "Werner (WERN) Shares Skyrocket, What You Need To Know": 0.8,
  "Old Dominion Freight Line (ODFL) Stock Is Up, What You Need To Know": 0.5,
  "Why Are onsemi (ON) Shares Soaring Today": 0.5,
  "United States Radiation Dose Management Market Report 2025-2033: Growth Driven by Expanding Healthcare Infrastructure, Rising Chronic Illness Burden, and Increasing Adoption of Dose Monitoring Systems": 0.8,
  "AT&T Drops DEI To Push Spectrum Deal Forward": -0.5,
  "T-Mobile to Host Q4 and Full Year 2025 Earnings Call on February 4, 2026": 0.0,
  "Are You Looking for a Top Momentum Pick? Why Monster Beverage (MNST) is a Great Choice": 0.8,
  "Does Airbnb’s Recent Share Slide Offer Long Term Value in 2025?": 0.5,
  "High Insider Ownership Growth Companies To Watch In December 2025": 0.5,
  "3 Stocks Estimated To Be Trading At Up To 43.6% Below Intrinsic Value": -0.8,
  "GEV Stock Rises 3.5% in a Month: What's the Best Move for Investors?": 0.5,
  "Transact + CBORD Names Greg Brown as CEO, Announces Rebrand to Illumia": 0.5,
  "GE HealthCare and Mayo Clinic unveil GEMINI-RT: A bold research collaboration in radiation therapy and advanced cancer care": 0.8,
  "VZ Stock Declines 6.1% in Past Six Months: Should You Buy the Dip?": 0.2,
  "Over $803 Million Coming to ComEd Customers": 0.8,
  "Old Dominion Unveils Weak LTL Unit Performance for November": -0.6,
  "Sector Update: Health Care Stocks Higher Wednesday Afternoon": 0.5,
  "Thomson Reuters Corporation's (TSE:TRI) Stock Has Shown Weakness Lately But Financial Prospects Look Decent: Is The Market Wrong?": 0.2,
  "Assessing Qualcomm (QCOM) Valuation as New AI Platforms and Strategic Acquisitions Reshape Growth Prospects": 0.5,
  "Cadence Design Systems (CDNS) Stock Is Up, What You Need To Know": 0.5,
  "Why Vertex Pharmaceuticals (VRTX) Stock Is Up Today": 0.5,
  "T-Mobile (TMUS): Evaluating the Stock After Its New AI-Powered Switching and Holiday Perks Upgrade": 0.5,
  "ASML Named Bank of America's Top Semiconductor Pick for 2026": 0.8,
  "Ignore the AI Bubble Talk. Morgan Stanley Still Thinks Nvidia Stock Can Gain 40% from Here.": 0.6,
  "xLight's Pat Gelsinger talks light source tech for chip production": 0.2,
  "Okta: Excuses to Sell Vs. Reasons to Buy": 0.5,
  "Mizuho’s Katz sees 'fertile' conditions driving robust M&A market into 2026": 0.8,
  "Autodesk CEO explains software maker's role in AI build-out": 0.2,
  "Applied Materials (AMAT) Positioned for DRAM and TSMC-Driven WFE Growth, Says Morgan Stanley": 0.6,
  "Bears Calling the AI Top Might Be Early - Very Early": 0.2,
  "Datadog Announces Expanded Collaboration Agreement, Highlights New Capabilities with AWS Across AI, Observability and Security at AWS re:Invent": 0.5,
  "Why Lumen (LUMN) Stock Is Trading Up Today": 0.5,
  "Sector Update: Tech Stocks Rise Late Afternoon": 0.5,
  "Ensign Group Expands Foothold in Three U.S. States With Facility Buyouts": 0.5,
  "Sector Update: Health Care Stocks Higher Late Afternoon": 0.5,
  "AMD vs. Texas Instruments: Which chip stock should you buy": 0.5,
  "Intuit CFO Sandeep Aujla to Present at the Nasdaq 53rd Investor Conference": 0.0,
  "AppLovin Stock Rides Swarm Of Setups Beyond Just Mining, Medical Names": 0.2,
  "Intuit Executive Mark Notarainni to Present at the Barclays 23rd Annual Global Technology Conference": 0.0,
  "C3 AI Announces Fiscal Second Quarter 2026 Results": 0.0,
  "Snowflake Doubles AWS Marketplace Growth YoY, Eclipses $2 Billion in Sales as New Integrations Accelerate Enterprise Data and AI Adoption": 0.8,
  "US Equity Markets Close Higher After Surprise Drop in Private-Sector Jobs": 0.5,
  "Why Microchip Technology Rallied Double-Digits Today": 0.5,
  "Is DoorDash (DASH) Using WWE and UFC To Deepen Its Grip On Young Consumers?": 0.1,
  "These Stocks Are Moving the Most Today: Marvell, Microsoft, Pure Storage, GitLab, Microchip Technology, and More": 0.5,
  "This Chip Maker Is the S&P 500’s Top Stock Today. It’s Having a Great Quarter.": 0.8,
  "Stocks Climb on Fed Rate Cut Optimism": 0.8,
  "S&P 500 Gains and Losses Today: Paramount and Netflix Slide; Microchip Technology Surges on Strong Guidance": 0.5,
  "Top Stock Reports for Procter & Gamble, Lam Research & Texas Instruments": 0.5,
  "Dow Hits 3-Week High as Fresh Data Reinforce Fed Rate Cut Bets": 0.6,
  "Why Are Microchip Technology (MCHP) Shares Soaring Today": 0.5,
  "Why Analysts See Shopify’s Story Shifting Amid AI Momentum and Lofty Valuation Concerns": 0.2,
  "Is Vera Therapeutics (VERA) Quietly Recasting Its Commercial Strategy With the Meyers Board Appointment?": 0.2,
  "Beyond NVIDIA: 5 Semiconductor Stocks Set to Dominate 2026": 0.5,
  "5 Transport Stocks Are Spiking After Slumps. Analysts Debate Their Future.": 0.2,
  "Starbucks (SBUX) Laps the Stock Market: Here's Why": 0.5,
  "AT&T sues T-Mobile for bold new tactic to lure customers": -0.5,
  "Paccar (PCAR) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Eisai Presents New Data on the Continued and Expanding Benefit of LEQEMBI® (lecanemab-irmb) Maintenance Treatment in Early Alzheimer's Disease at the Clinical Trials on Alzheimer's Disease (CTAD) Conference 2025": 0.6,
  "3M Expands Margins While Honeywell Absorbs Restructuring Pressure": 0.5,
  "(Item 1.01) . Entry into a Material Definitive Agreement On December 4, 2025, Exelon Corporation (the “Company”) completed its previously announced sale of $1 billion aggregate principal amount of 3.25% Convertible Senior Notes due 2029 (the “Notes”), which amount includes the exercise in full of the $100 million option to purchase additional Notes granted to the initial purchasers, in a private offering to persons reasonably believed to be qualified institutional buyers pursuant to Rule 144A under the\n\n(Item 1.01) of this Current Report on Form 8-K is incorporated by reference into this\n\n(Item 1.01) of this Current Report on Form 8-K is incorporated by reference into this\n\n(Item 8.01) . Other Events On December 1, 2025, the Company issued a press release announcing the launch of its offering of the Notes. The press release is filed as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated herein by reference. On December 1, 2025, the Company issued a press release announcing the pricing of its offering of the Notes. The press release is filed as Exhibit 99.2 to this Current Report on": 0.1,
  "Agoda Spotlights Central Asia as Rising Travel Destination for South Korean Travelers": 0.5,
  "Why I'm Never Selling Airbnb Stock": 0.5,
  "Gilead (GILD) Valuation After Fresh Buy Rating and Extended Biktarvy Exclusivity Boost Investor Confidence": 0.8,
  "Advertising Software Stocks Q3 Recap: Benchmarking The Trade Desk (NASDAQ:TTD)": 0.2,
  "A Look Back at Travel and Vacation Providers Stocks’ Q3 Earnings: Marriott (NASDAQ:MAR) Vs The Rest Of The Pack": 0.2,
  "3 Reasons to Sell HON and 1 Stock to Buy Instead": -0.5,
  "1 Software Stock on Our Watchlist and 2 Facing Challenges": 0.2,
  "1 Growth Stock with All-Star Potential and 2 We Question": 0.2,
  "3 Cash-Producing Stocks We Find Risky": -0.7,
  "1 Value Stock Worth Your Attention and 2 We Turn Down": 0.0,
  "3 Mid-Cap Stocks to Research Further": 0.0,
  "3 Industrials Stocks with Questionable Fundamentals": -0.5,
  "1 Services Stock Worth Investigating and 2 We Brush Off": 0.2,
  "1 Profitable Stock for Long-Term Investors and 2 We Avoid": 0.5,
  "1 Cash-Producing Stock to Keep an Eye On and 2 We Find Risky": 0.2,
  "3 Unprofitable Stocks with Questionable Fundamentals": -0.8,
  "1 Cash-Producing Stock with Impressive Fundamentals and 2 That Underwhelm": 0.2,
  "3 Unpopular Stocks We Think Twice About": -0.5,
  "How Good Has Starbucks (SBUX) Stock Actually Been?": 0.5,
  "Cognizant Doubles Down on Synapse Commitment with New Target to Reach Two Million by 2030": 0.6,
  "Jim Cramer Says “Once again, I Say Own NVIDIA, Don’t Trade It”": 0.6,
  "Japan’s 10Y Yield Hits 17-Year High as BOJ Faces a No-Win Policy Setup - Japan’s 10-year JGB yield touched 1.917% on Thursday the highest level since 2007. It’s basically the market’s way of signaling that investors aren’t fully convinced about the Bank of Japan’s current policy path. The BOJ is stuck between two bad options: Raise rates further: yields likely push even higher, tightening conditions at a time when parts of the economy are still": -0.6,
  "What CrowdStrike Holdings (CRWD)'s Strong Q3 Revenue and New AI Alliances Mean For Shareholders": 0.6,
  "How Is IDEXX Laboratories’ Stock Performance Compared to Other Health Care Stocks?": 0.1,
  "BeOne brought Brukinsa to the blood cancer mountaintop. Can it hit those heights again?": 0.2,
  "Why The Narrative Around MercadoLibre Is Shifting Amid Mixed Analyst Signals": 0.1,
  "What's your best investment in 2025? - Can’t believe we’re almost at the end of 2025. I’ve been reflecting on this year’s markets and wanted to hear how everyone else did. For me, my best investment was probably Costco. I bought in March during that random dip and just held. Boring but solid. Biggest regret? Selling too early on AMD. I took profits in May thinking it ran too far, too fast. Now I just": 0.5,
  "How Investors May Respond To Intuit (INTU) Earnings Beat, Capital Returns and New Ad Data Partnership": 0.5,
  "Huawei's 2022 patent details novel technique to make 2-nm-class chips without EUV tool": 0.6,
  "CrowdStrike Reports Strong Results. But Shares Are Overvalued.": -0.5,
  "Is stocktwits after hour just pump and dump noise or is it actually useful - I've been trying to figure out stocktwits for like the last few months to get stock ideas and honestly I can't tell if it's useful or if I'm just wasting my time scrolling through absolute garbage Like every other post is literally someone screaming about how their penny stock is going to the moon with rocket emojis and zero analysis,": -0.8,
  "Zacks Investment Ideas feature highlights: Alphabet, Meta Platforms, Nvidia, Microsoft, Cisco and MongoDB": 0.5,
  "AI Boom Fuels Bullish Analyst Outlook for Applied Materials (AMAT)": 0.8,
  "Why Analysts Say ASML Is the Top Semiconductor Pick Heading Into 2026": 0.5,
  "Zacks.com featured highlights include Hamilton Insurance, Macy's, Cognizant Technology Solutions, PCB Bancorp and PRA": 0.2,
  "US Stock Market Today: S&P 500 Futures Dip Amid Cooling Jobs, Resilient Services Signals": 0.1,
  "Bond Offering And El Buen Fin Outperformance Could Be A Game Changer For MercadoLibre (MELI)": 0.6,
  "The Zacks Analyst Blog Highlights Procter & Gamble, Lam Research, Texas Instruments, SandRidge Energy and Crown Crafts": 0.5,
  "Medtronic’s Hugo surgical robot earns FDA clearance": 0.5,
  "Contrast Security and Datadog Partner to Deliver Verified Application Runtime Threat Detection in Datadog Cloud SIEM": 0.5,
  "OECD-Cisco research finds stark geographical and generational divides in AI uptake and digital well-being": -0.5,
  "Stocks Muted Before the Open as Rally Pauses, U.S. Jobless Claims Data on Tap": 0.1,
  "The Most Profitable Fast Food Restaurant Chain In The World Is Also A Favorite": 0.6,
  "3 Growth Companies With Insider Ownership Up To 35%": 0.2,
  "3 Stocks Estimated To Be Trading Below Their Intrinsic Value": 0.5,
  "US High Growth Tech Stocks to Watch": 0.5,
  "3 Reasons Verizon Stock Will Likely Continue to Underperform the Market": -0.8,
  "AstraZeneca advances hematology and cell therapy ambition with largest-ever presence at ASH": 0.6,
  "Neurimmune expands collaboration with AstraZeneca to develop and commercialize fibril depleter NI009 for AL amyloidosis": 0.8,
  "Is This the Most Overlooked AI Stock Trading Today?": 0.2,
  "Is Kraft Heinz (KHC) Undervalued After Its Recent Share Price Slide?": 0.5,
  "Intuitive Surgical (ISRG): Revisiting Valuation After a 25% Three-Month Share Price Surge": 0.2,
  "These stocks are new additions to Mizuho’s ’Americas Top Picks’ list": 0.5,
  "Peraton Partners with Zscaler to Secure the Mission and Fortify the Future": 0.5,
  "With 86% ownership, Fastenal Company (NASDAQ:FAST) boasts of strong institutional backing": 0.8,
  "Stocks making big moves yesterday: Affirm, Bark, Microchip Technology, Paramount, and Amkor": 0.5,
  "Listening to Healthcare Professionals: Dexcom Launches New Education Offering, Dexcom Academy": 0.5,
  "Snowflake tumbles on slower quarterly product revenue growth forecast": -0.6,
  "Stock Market News for Dec 4, 2025": 0.0,
  "Vertex Pharmaceuticals (VRTX): Assessing Valuation After Recent Multi-Month Share Price Gains": 0.5,
  "Is Honeywell A Smart Opportunity After Its 2025 Share Price Pullback?": 0.5,
  "Is Keurig Dr Pepper (KDP) Quietly Undervalued After Its Recent Share Price Rebound?": 0.5,
  "Is Old Dominion Freight Line Stock Underperforming the Nasdaq?": -0.5,
  "Battle of the Big-Upside Tech Names: HUBS vs. NBIS vs. TEAM": 0.2,
  "Atlassian Corporation (TEAM): A Bull Case Theory": 0.5,
  "Mondelez International, Inc. (MDLZ): A Bull Case Theory": 0.5,
  "Strong Results Lifted CoStar Group. (CSGP) in Q3": 0.8,
  "Is CoStar Group Stock Underperforming the Dow?": -0.5,
  "Workday President to Present at Barclays 23rd Annual Global Technology Conference on December 11, 2025": 0.0,
  "Margins Face Tariff Pressure: Is ISRG's Profitability at Risk?": -0.5,
  "DoorDash, Inc. (DASH): A Bull Case Theory": 0.5,
  "Here’s Why Cadence (CDNS) Surged in Q3": 0.5,
  "Intuit Inc. (INTU): A Bull Case Theory": 0.5,
  "TTD's Innovations This Quarter Set the Stage for Long-Term Growth": 0.8,
  "Dutch Bros Up 10% in a Month: Should You Buy, Sell or Hold the Stock?": 0.5,
  "Do Rising Earnings Estimates Strengthen the Case for Qualcomm Stock?": 0.5,
  "MercadoLibre, Inc. (MELI): A Bull Case Theory": 0.5,
  "DSGX Q3 Earnings Top, Sales Up Y/Y Amid a Volatile Global Supply Chain": 0.6,
  "NVTS Deepens Global Partnerships: Will This Fuel Long-Term Gains?": 0.6,
  "Comstock Celebrates Starbucks Opening at Loudoun Station": 0.5,
  "Cohesity Recognized as \"Top Durable Growth and Innovation Partner, FY25\" in Cisco SolutionsPlus Program": 0.6,
  "Is Trending Stock Booking Holdings Inc. (BKNG) a Buy Now?": 0.2,
  "Investors Heavily Search Gilead Sciences, Inc. (GILD): Here is What You Need to Know": 0.5,
  "Here is What to Know Beyond Why ASML Holding N.V. (ASML) is a Trending Stock": 0.2,
  "Meet Your New Magenta BFF: T-Mobile and Baby Three Release Limited-Edition Plush Collab": 0.6,
  "Here Are Thursday’s Top Wall Street Analyst Research Calls: AutoZone, BXP, Fiserv, Meta Platforms, PayPal, Salesforce, Toast and More": 0.2,
  "Is It Too Late to Consider ASML After Its Strong 2025 Share Price Rally?": 0.2,
  "CRDO Stock on an Upswing Post Robust Q2: Hold or Make an Exit?": 0.6,
  "Prediction: 3 Beginner Stocks That Could Turn Small Bets Into Big Fortunes": 0.5,
  "3 Large Drug Stocks to Watch as the Industry Shows Some Recovery": 0.5,
  "Is It Worth Investing in Synopsys (SNPS) Based on Wall Street's Bullish Views?": 0.5,
  "Wall Street Bulls Look Optimistic About Workday (WDAY): Should You Buy?": 0.8,
  "Wall Street Bulls Look Optimistic About Lam Research (LRCX): Should You Buy?": 0.8,
  "U.S. Weekly Jobless Claims Fall to 3-Year Low Ahead of FOMC Meeting": 0.8,
  "Harding Loevner Global Equity’s Views on Vertex Pharmaceuticals Incorporated (VRTX)": 0.0,
  "Axon Plunges 31.1% in 6 Months: Should You Hold or Fold the Stock?": -0.6,
  "Copart: The Economics Behind a Quietly Dominant Marketplace": 0.5,
  "Honeywell's Losing Grip in Industrial Automation: What's Impeding Its Growth?": -0.6,
  "3 Growth Beasts That Have Beaten the Market in 8 of the Past 10 Years": 0.5,
  "Introducing Our FY25 Cisco Foundation Impact Report": 0.0,
  "Meta reportedly preparing major cuts to its metaverse unit stock jumps - Meta shares moved higher today after a Bloomberg report suggested the company is planning deep cuts to its metaverse division potentially as much as 30%. The restructuring would likely include layoffs as Meta continues shifting resources away from its earlier metaverse ambitions and into AI, efficiency, and core products. The pivot isn’t surprising. Meta rebranded back in 2021 to bet big on the": 0.2,
  "Boyar Value Group Urges UniFirst Board to Initiate a Strategic Review Following Rejection of Multiple Credible Acquisition Offers": 0.5,
  "Bond Investors Cast Doubt on Hassett as Fed Chair": -0.6,
  "Booking Holdings Inc. (BKNG): A Bull Case Theory": 0.5,
  "ASML Holding N.V. (ASML): A Bull Case Theory": 0.5,
  "Workday Recognized as a Leader in 2025 Gartner® Magic Quadrant™ for Financial Planning Software for Fourth Year in a Row": 0.8,
  "CrowdStrike Holdings, Inc. (CRWD): A Bull Case Theory": 0.5,
  "Better Artificial Intelligence Stock: ASML vs. Nebius Group": 0.5,
  "GEHC and Mayo Clinic Launch GEMINI-RT to Aid Personalized Cancer Care": 0.8,
  "Why Is Amgen (AMGN) Up 8% Since Last Earnings Report?": 0.5,
  "Why Is Beam Therapeutics (BEAM) Up 15.9% Since Last Earnings Report?": 0.5,
  "Why Is Axon (AXON) Down 15% Since Last Earnings Report?": -0.5,
  "Why Is CDW (CDW) Down 1.8% Since Last Earnings Report?": -0.5,
  "Why Is Marriott (MAR) Up 8.3% Since Last Earnings Report?": 0.5,
  "Why Is Paylocity (PCTY) Up 0.2% Since Last Earnings Report?": 0.2,
  "Rivian Automotive (RIVN) Up 13.7% Since Last Earnings Report: Can It Continue?": 0.5,
  "Why Is Shopify (SHOP) Down 1.8% Since Last Earnings Report?": -0.5,
  "Intuitive Surgical, Inc. (ISRG): A Bull Case Theory": 0.5,
  "IDEXX Laboratories Stock Rallies 75.6% YTD: What's Behind the Surge?": 0.6,
  "Sionna Therapeutics Valuation Topping $2 Billion Is 'Too Optimistic', RBC Says": -0.6,
  "The Dealmaking 3 – Goldman Buys Excel Sports Stake, Tariffs & Sportswear, Big 12 Moves": 0.2,
  "Are You Looking for a Top Momentum Pick? Why ASML (ASML) is a Great Choice": 0.8,
  "Analog Devices (ADI) is a Great Momentum Stock: Should You Buy?": 0.8,
  "Datadog, Inc. (DDOG): A Bull Case Theory": 0.5,
  "S&P 500 Additions Are Friday. 9 Stocks That Don’t Stand a Chance.": -0.6,
  "QUALCOMM Incorporated (QCOM): A Bull Case Theory": 0.5,
  "Shopify Inc. (SHOP): A Bull Case Theory": 0.5,
  "The Bull Case For Keurig Dr Pepper (KDP) Could Change Following CFO Shift And Premium Push In Coffee Collective - Learn Why": 0.5,
  "Electronic Arts Inc. (EA): A Bear Case Theory": -0.5,
  "Copart, Inc. (CPRT): A Bull Case Theory": 0.5,
  "Export controls alone cannot reverse technological momentum on this scale. - While the United States has struggled to execute at speed, China has invested hundreds of billions of dollars in semiconductor subsidies, research institutes, national talent programs and indigenous lithography efforts. Beyond chips, China has already established global leadership or gained strong momentum in electric vehicles, solar manufacturing, battery materials, grid-scale energy storage, shipbuilding, commercial drones, and rare-earth production. Indeed, according to the Australian Strategic": -0.8,
  "Wall Street Loves CrowdStrike Stock After Q3 Earnings. Should You?": 0.8,
  "PayPal's Branded Checkout & OpEx Concern: Will Growth be Affected?": -0.5,
  "3 Growth Companies Insiders Are Betting On": 0.5,
  "Three Stocks Estimated To Be Trading Below Their Intrinsic Value In December 2025": 0.5,
  "High Growth US Tech Stocks To Watch In December 2025": 0.5,
  "Buy Visa and Toast, Avoid PayPal, These Analysts Say. How to Play Payments Stocks in 2026.": 0.2,
  "AppLovin Corporation (APP): A Bull Case Theory": 0.5,
  "Wix.com Ltd. (WIX): A Bull Case Theory": 0.5,
  "Gold Rises as Traders Await U.S. Inflation Data": 0.5,
  "Axon Enterprise, Inc. (AXON): A Bull Case Theory": 0.5,
  "CrowdStrike Enters Mature Phase While Zscaler Accelerates With AI Security Acquisitions": 0.5,
  "ON Semiconductor (ON) Soars 11% on Aggressive Expansion Plan": 0.8,
  "Microchip (MCHP) Climbs 12% on Higher Growth Outlook": 0.8,
  "Layoff Announcements Top 1.1 Million in Year Through November, Challenger Gray Says": -0.7,
  "Cintas Corporation Announces Webcast for Second Quarter Fiscal Year 2026 Results": 0.0,
  "Why Analysts See Vertex Pharmaceuticals Story Shifting With New Pipeline Momentum and Valuation Debates": 0.5,
  "AWS Introduces Graviton5—the Company’s Most Powerful and Efficient CPU": 0.8,
  "Why does the massive spending Meta does on projects that never fully work out never seem to hurt their financials? - With news today that Meta might be cutting their \"Metaverse\" groups by 30% it got me thinking. I realize they have an absolutely massive geyser of cash from their advertising but why did sinking tens of billions into the metaverse several years ago never seem to depress their income? I assume they're capitalizing most": -0.5,
  "Microsoft will raise prices of commercial Office subscriptions in July - https://www.cnbc.com/2025/12/04/microsoft-will-raise-prices-of-commercial-office-bundles-in-july-.html * Microsoft is increasing prices for various Office productivity software subscriptions for commercial customers on July 1. * The cost of a low-priced offering for front-line workers will jump 33%. * Microsoft most recently bumped up commercial Office prices in 2022. > Here’s a breakdown of the commercial price changes: > * For small and medium-sized businesses, Microsoft 365 Business Basic will cost": -0.8,
  "LKQ Corporation (LKQ): A Bull Case Theory": 0.5,
  "Roper Technologies, Inc. (ROP): A Bull Case Theory": 0.5,
  "Celebrate the Holidays Seaside at Fort Lauderdale Marriott Harbor Beach Resort & Spa": 0.8,
  "Verizon Communications Inc. (VZ): A Bull Case Theory": 0.5,
  "JPMorgan Benches PayPal, Bets on Toast": 0.2,
  "Marriott Cools on U.S. Outlook": -0.5,
  "CSX Stock Earns Relative Strength Rating Upgrade": 0.5,
  "NICE Ltd. (NICE): A Bull Case Theory": 0.5,
  "Lam Research Corporation (LRCX): A Bull Case Theory": 0.5,
  "Nvidia Faces Challenge of Deploying Rapidly Growing Cash Pile": -0.5,
  "US weekly jobless claims drop to more than 3-year low": 0.8,
  "Gold Inches Higher as Traders Continue to Mull ADP Jobs Report": 0.2,
  "ComEd Announces Upcoming Low-Income Discount as Latest Program to Assist with Rising Energy Costs": 0.6,
  "Could This Be the Most Overlooked Way to Profit From the AI Boom?": 0.5,
  "1 Reason I'll Never Sell Vertex Pharmaceuticals Stock": 0.5,
  "Treasury Yields Rise as Layoff Indicator Falls": 0.5,
  "Salesforce’s Agentforce Life Sciences Selected by AstraZeneca as Its Unified Global Platform to Help Transform Customer Engagement": 0.8,
  "Rubrik Reports Third Quarter Fiscal Year 2026 Financial Results": 0.0,
  "Is Copart Now a Bargain After 31% 2025 Slide Amid Expansion Push?": 0.2,
  "Is It Too Late To Consider Lam Research After Its 120% Surge In 2025?": -0.5,
  "SentinelOne forecasts lackluster revenue, CFO to depart": -0.7,
  "Mixed day for US equities as Japan's Nikkei rallies": 0.2,
  "Equities Mixed as Traders Assess Labor Market Data Amid Fed Rate-Cut Expectations": 0.2,
  "Apple announces departure of general counsel and policy chief - Apple’s general counsel, Kate Adams, and its vice president for environment, policy, and social initiatives, Lisa Jackson, will retire from Apple, the company announced on Thursday. Apple said that Jennifer Newstead would become Apple’s new general counsel in March next year and that Jackson’s government affairs staff would report to her. The two executives previously reported to Apple CEO Tim Cook and represent the latest": -0.5,
  "Does BMO’s Upgrade Reveal Old Dominion (ODFL) Has More Durable Pricing Power Than Believed?": 0.2,
  "Atlassian (TEAM): Valuation Check as Shares Pull Back Despite Ongoing Revenue Growth": 0.2,
  "DocuSign (DOCU) Q3 Earnings and Revenues Beat Estimates": 0.8,
  "Mercado Libre Successfully Issues USD 750 million of 2033 Senior Unsecured Notes": 0.5,
  "Texas Instruments (TXN) Stock Declines While Market Improves: Some Information for Investors": -0.5,
  "Is Palo Alto Networks (PANW) Swapping Buybacks for AI Deals to Redefine Its Growth Story?": 0.2,
  "Has AstraZeneca’s Strong 30% Rally Left Further Upside in 2025?": 0.2,
  "AMD chief says company ready to pay 15% tax on AI chip shipments to China - SAN FRANCISCO, Dec 4 (Reuters) - Advanced Micro Devices (AMD.O), CEO Lisa Su on Thursday said the company has licenses to ship some of its MI 308 chips to China and is prepared to pay a 15% tax to the U.S. government if it ships them. Su made the remarks at a conference held by technology publication Wired in": 0.2,
  "S&P 500 ekes out slight gain as investors await Fed decision": 0.2,
  "Monster's 'Girly' Energy Drink Reveal Riddled With Big Promises – But Not Everyone Loves The Name": -0.5,
  "The Trade Desk: After a 70% Plunge, This Could Be The Time to Buy": 0.6,
  "(Item 1.01) . Entry into a Material Definitive Agreement. On December 4, 2025, MercadoLibre, Inc. (the “Company”) and its subsidiaries MercadoLibre S.R.L., eBazar.com.br Ltda., Mercado Pago Instituição de Pagamento Ltda, DeRemate.com de México, S. de R.L. de C.V., MPFS, S. de R.L. de C.V., MP Agregador, S. de R.L. de C.V., MercadoLibre Chile Ltda. and MercadoLibre Colombia Ltda. entered into an underwriting agreement (the “Underwriting Agreement”) with Citigroup Global Markets Inc., Goldman Sachs & Co. LLC and": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On December 4, 2025, Apple Inc. (“Apple”) announced that Jennifer Newstead will become Apple’s general counsel on March 1, 2026, following a transition of duties from Kate Adams, who has served as Apple’s general counsel since 2017. Ms. Newstead will join Apple as senior vice president in January, reporting to CEO Tim Cook and serving on Apple’s": 0.2,
  "(ITEM 5.02) DEPARTURE OF DIRECTORS OR CERTAIN OFFICERS; ELECTION OF DIRECTORS; APPOINTMENT OF CERTAIN OFFICERS; COMPENSATORY ARRANGEMENTS OF CERTAIN OFFICERS. On December 3, 2025, the Compensation and Benefits Committee of the Board of Directors (the “Compensation and Benefits Committee”) of Charter Communications, Inc. (the “Company”) approved an amended and restated employment agreement between the Company and Christopher L. Winfrey effective December 1, 2025 (the “Winfrey Employment Agreement”). In addition, on December 3, 2025, the Compensation and Benefits": 0.1,
  "(Item 8.01) .Other Events On December 3, 2025, American Electric Power Company, Inc. (the “Company”) entered into an Underwriting Agreement with Guggenheim Securities, LLC, J.P. Morgan Securities LLC, MUFG Securities Americas Inc., PNC Capital Markets LLC, Scotia Capital (USA) Inc., and Wells Fargo Securities, LLC as representatives of the underwriters named therein, relating to the offering and sale by the Company of $400,000,000 of 5.800% Fixed-to-Fixed Reset Rate Junior Subordinated Debentures, Series C, due 2056 (the “Series": 0.1,
  "(Item 8.01) Other Events. On December 4, 2025, WBD entered into the Merger Agreement, by and among WBD, Netflix, Merger Sub and New Company. Important Information about the Transaction and Where to Find It This communication does not constitute an offer to sell or the solicitation of an offer to buy any securities or a solicitation of any vote or approval. This communication may be deemed to be solicitation material in respect of the proposed transaction between": 0.0,
  "(Item 1.01) Entry into a Material Definitive Agreement. Agreement and Plan of Merger On December 4, 2025, Netflix, Inc., a Delaware corporation (“Netflix”), Nightingale Sub, Inc., a Delaware corporation and wholly owned subsidiary of Netflix (“Merger Sub”), Warner Bros. Discovery, Inc., a Delaware corporation (“WBD”), and New Topco 25, Inc., a newly formed Delaware corporation and wholly owned subsidiary of WBD (“Newco”), entered into an Agreement and Plan of Merger (the “Merger Agreement”), pursuant to which, subject": 0.1,
  "(Item 1.01) Entry into a Material Definitive Agreement. On December 4, 2025, Warner Bros. Discovery, Inc., a Delaware corporation (“WBD”), Netflix, Inc., a Delaware corporation (“Netflix”), Nightingale Sub, Inc., a Delaware corporation and wholly owned subsidiary of Netflix (“Merger Sub”), and New Topco 25, Inc., a newly formed Delaware corporation and wholly owned subsidiary of WBD (“NewCo”), entered into an Agreement and Plan of Merger (the “Merger Agreement”), pursuant to which, subject to the terms of which,\n\n(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On December 3, 2025, the compensation committee of WBD’s board of directors (the “Compensation Committee”) adopted a transaction bonus program (the “Transaction Bonus Program”), the purpose of which is both to recognize and incentivize the contributions of selected key employees, which may include WBD’s executive officers other than its Chief Executive Officer, to the success of the": 0.1,
  "T-Mobile Declares Quarterly Cash Dividend": 0.0,
  "Evaluating Palo Alto Networks (PANW) Valuation After Its Recent Share Price Uptick": 0.5,
  "Why Constellation Energy Stock Topped the Market on Thursday": 0.5,
  "CrowdStrike Holdings Inc (CRWD) Q3 2026 Earnings Call Highlights: Record ARR Growth and ...": 0.8,
  "Savor the Flavors: Agoda Highlights Must-Visit Foodie Destinations Across Asia": 0.6,
  "CDW (CDW): Assessing Valuation After New AWS AI Recognition and Cloud Solutions Launch": 0.2,
  "Regeneron Pharmaceuticals, Inc. (REGN): A Bull Case Theory": 0.5,
  "Amkor Technology, Inc. (AMKR): A Bull Case Theory": 0.5,
  "Remitly Global, Inc. (RELY): A Bull Case Theory": 0.5,
  "Arm Holdings plc (ARM): A Bull Case Theory": 0.5,
  "Airbnb, Inc. (ABNB): A Bull Case Theory": 0.5,
  "Cadence Design Systems, Inc. (CDNS): A Bull Case Theory": 0.5,
  "Is selling too early/short-term trading the hidden wealth killer? - From doing past analysis, I realized that most people, including myself, miss out on life-changing huge gains because we sell our stocks too early. There are ton of stocks that within 1Y went up 100-200% and some over 5Y went up 1000%-3000%. One thing I noticed people like to do is day-trade or swing-trade and they feel good making a few thousand in one trade": 0.5,
  "Baird Lifts Autodesk, Inc. (ADSK) Price Target  on Solid Q3 Results": 0.8,
  "Wall Street Analysts Tout Texas Instruments Incorporated (TXN) Growth Prospects amid Weak Guidance": 0.5,
  "QUALCOMM Incorporated (QCOM) Gains Analyst Confidence as AI and Data Center Strategy Accelerates": 0.8,
  "General Industrial Machinery Stocks Q3 Highlights: Honeywell (NASDAQ:HON)": 0.0,
  "Jim Cramer on Linde: “This Stock Has Just Been Nothing But Nastiness”": -0.6,
  "3 Reasons to Avoid MAR and 1 Stock to Buy Instead": -0.5,
  "2 High-Flying Stocks with Exciting Potential and 1 We Ignore": 0.6,
  "How AAR’s (AIR) CFO Transition Shapes Its Pursuit of Higher Growth and Margins": 0.5,
  "T-Mobile quietly makes major move to keep customers paying longer": 0.5,
  "2 Growth Stocks with Explosive Upside and 1 We Question": 0.5,
  "1 S&P 500 Stock with Solid Fundamentals and 2 That Underwhelm": 0.2,
  "1 Mooning  Stock to Consider Right Now and 2 We Find Risky": 0.2,
  "1 Profitable Stock on Our Buy List and 2 Facing Headwinds": 0.2,
  "1 Value Stock with Competitive Advantages and 2 We Ignore": 0.2,
  "1 Unprofitable Stock for Long-Term Investors and 2 We Ignore": -0.5,
  "3 Market-Beating Stocks to Consider Right Now": 0.5,
  "2 Profitable Stocks Worth Investigating and 1 We Ignore": 0.2,
  "3 Unpopular Stocks That Concern Us": -0.5,
  "1 Semiconductor Stock with Exciting Potential and 2 We Question": 0.5,
  "Bloomberg: Morgan Stanley Considers Offloading Some of Its Data-Center Exposure - Morgan Stanley, one of the key players in financing the artificial-intelligence race, is considering offloading some of its data-center exposure via a so-called significant risk transfer. The bank has held preliminary talks with potential investors about an SRT tied to a portfolio of loans to businesses involved in AI infrastructure, according to people with knowledge of the matter, who asked not to be identified": 0.2,
  "2 Profitable Stocks to Own for Decades and 1 That Underwhelm": 0.2,
  "3 Market-Beating Stocks on Our Watchlist": 0.5,
  "‘China’s Nvidia’ Moore Threads surges over 400% on trading debut after $1.1 billion listing - Moore Threads had a massive first day in Shanghai, jumping more than 400% after its $1.1 billion IPO. It’s one of the biggest debuts for a Chinese chip company this year and comes at a time when Beijing is pushing hard to build a domestic GPU ecosystem. The timing matters. With U.S. sanctions limiting China’s access to advanced manufacturing, companies": 0.8,
  "Did PayPal’s AI-Native Checkout Push with Perplexity Just Shift PayPal Holdings’ (PYPL) Investment Narrative?": 0.1,
  "SoftBank's Arm plans to set up chip design facility in South Korea": 0.5,
  "With Netflix's 10-for-1 Stock Split Complete, Here Are 3 Growth Stocks to Buy in December That Could Issue Stock Splits in 2026": 0.5,
  "Is Texas Instruments Fairly Priced After Its Recent Share Price Rebound in 2025?": 0.2,
  "China's Licensing Trends Shaping Global Drug Development Analysis Report 2025: Parent Companies Benefitted from Upfront Payments for R&D, Gaining Equity in Novel Chinese Therapeutics": 0.5,
  "Trending tickers: Warner Bros. Discovery, Meta, SMX, Ocado and BAT": 0.0,
  "SoftBank's Arm plans to set up chip training facility in South Korea": 0.5,
  "Praxis soars higher; Bristol Myers’ CAR-T therapy wins broader use": 0.8,
  "Reassessing NXP Semiconductors (NXPI) Valuation After Renewed Optimism on Financial Strength and Growth Prospects": 0.8,
  "Reassessing Linde (LIN) Valuation After Media Scrutiny on Its Recent Stock Underperformance": 0.1,
  "Zacks Investment Ideas feature highlights: Tesla, Honeywell International, Teradyne, UiPath, Ondas and Unusual Machines": 0.2,
  "r/Stocks Daily Discussion & Fundamentals Friday Dec 05, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is": 0.2,
  "How Is Baker Hughes’ Stock Performance Compared to Other Oilfield Services Stocks": 0.0,
  "Zacks Industry Outlook Highlights Eli Lilly, Johnson & Johnson and Sanofi": 0.5,
  "Workday, Inc.'s (NASDAQ:WDAY) Intrinsic Value Is Potentially 60% Above Its Share Price": 0.8,
  "Investing in Monster Beverage (NASDAQ:MNST) five years ago would have delivered you a 66% gain": 0.8,
  "The labor market is not going to give any straight answers anytime soon": -0.5,
  "Kroger to cut 132 Nashville jobs, close 'Blue Truck Delivery' center": -0.8,
  "Kroger nixes Nashville grocery truck delivery. How it affects you": -0.5,
  "How Investors Are Reacting To Linde (LIN) After Cramer’s Critique And New Credit Facility": 0.2,
  "Does NXP Semiconductors’ (NXPI) Interim Dividend Reveal a New Capital Allocation Focus?": 0.2,
  "S&P Futures Gain With All Eyes on Key U.S. PCE Inflation Data": 0.5,
  "November in Review: 11 Top Technology Press Releases": 0.0,
  "The World's Largest Fast Food Chain Isn't McDonald's Or Starbucks": 0.1,
  "$480+ Mn Rapid Liquid Printing Market - Global Forecasts from 2025 to 2030 Featuring Autodesk, Steelcase, 3D Systems, Materialise, BMW, MIT Self-Assembly Lab, Stratasys, EOS": 0.2,
  "Wall Street Just Abandoned PayPal--Here's Who They're Betting On Instead": 0.2,
  "PepsiCo Faces Activist Shockwave as Elliott's $4 Billion Push Nears a Deal": 0.2,
  "Insider-Owned Growth Leaders To Watch In December 2025": 0.5,
  "Three Stocks That Could Be Undervalued By Market Estimates In December 2025": 0.5,
  "Exploring US High Growth Tech Stocks For Potential Portfolio Enhancement": 0.5,
  "At US$717, Is IDEXX Laboratories, Inc. (NASDAQ:IDXX) Worth Looking At Closely?": 0.2,
  "Could Ross Stores Stock Hit $200 by Christmas? Here Are 3 Reasons Analysts Think So": 0.5,
  "How Is Fastenal's Stock Performance Compared to Other Industrial Stocks?": 0.0,
  "Netflix says it’s struck a deal to buy Warner Bros. Discovery for $27.75 per share - Netflix announced Friday it’s reached a deal to buy Warner Bros. Discovery, bringing a swift end to a dramatic bidding process that saw Paramount Skydance and Comcast also vying for the legacy assets. The deal is comprised of cash and stock and is valued at $27.75 per WBD share, the companies said. That puts the total enterprise value of": 0.5,
  "See How Analog Devices Attracts Huge Institutional Inflows": 0.5,
  "Kroger targets convenience and flexibility in e-commerce": 0.5,
  "Is Electronic Arts Stock Outperforming the S&P 500?": 0.2,
  "AI Back-End Networks Continue Their Shift to Ethernet, Now Accounting for Over Two-Thirds of 3Q 2025 Switch Sales in AI Clusters, According to Dell'Oro Group": 0.5,
  "Calculating The Intrinsic Value Of Exelon Corporation (NASDAQ:EXC)": 0.1,
  "How Is Diamondback Energy's Stock Performance Compared to Other Energy Stocks?": 0.0,
  "Nvidia, Palantir AWOL, But Top Funds Go Bonkers For This AI Mobilizer": 0.6,
  "Baidu, Softbank, Arm, SoFi: Trending Stocks": 0.2,
  "Marvell's Rally Extends: Data Centers and AMZN Chips Boost Shares": 0.6,
  "Here's How Much a $1000 Investment in Fortinet Made 10 Years Ago Would Be Worth Today": 0.5,
  "If You Invested $1000 in Synopsys a Decade Ago, This is How Much It'd Be Worth Now": 0.5,
  "If You Invested $1000 in Marvell Technology a Decade Ago, This is How Much It'd Be Worth Now": 0.5,
  "Buy Marvell Technology as a Potential Dark Horse of AI Chips in 2026": 0.6,
  "Will McDonald's Beverage Strategy Reignite Its 2026 U.S. Momentum?": 0.5,
  "Is Exelon Stock Underperforming the Nasdaq?": -0.5,
  "The Trade Desk (TTD) Tumbled on Softer Than Expected Guidance": -0.6,
  "Exchange-Traded Funds, Equity Futures Higher Pre-Bell Friday Ahead of Key Inflation Report": 0.5,
  "Stoke Therapeutics and Biogen Present Data that Further Support the Disease-Modifying Potential of Zorevunersen, an Investigational Medicine for the Treatment of Dravet Syndrome, at the 2025 American Epilepsy Society (AES) Annual Meeting": 0.8,
  "Biogen and Stoke Therapeutics Present Data that Further Support the Disease-Modifying Potential of Zorevunersen, an Investigational Medicine for the Treatment of Dravet Syndrome, at the 2025 American Epilepsy Society (AES) Annual Meeting": 0.8,
  "The Los Angeles Sports & Entertainment Commission (LASEC) Names Amgen as Official Biotech Partner and Los Angeles World Cup 2026 Host City Supporter Ahead of FIFA World Cup 2026™": 0.6,
  "Here is What to Know Beyond Why Amgen Inc. (AMGN) is a Trending Stock": 0.0,
  "Datadog, Inc. (DDOG) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Cadence Design Systems, Inc. (CDNS) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "PDD Holdings Inc. Sponsored ADR (PDD) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Is Now The Time To Look At Buying Automatic Data Processing, Inc. (NASDAQ:ADP)?": 0.2,
  "Here's Why You Should Add Inogen Stock to Your Portfolio Now": 0.6,
  "Does Cognizant Still Offer Value After Recent Gains and DCF Upside Signals?": 0.2,
  "COO Gains as Q4 Earnings & Sales Beat Estimates, MyDay Adoption Rises": 0.8,
  "GE HealthCare Technologies Stock: Is GEHC Underperforming the Health Care Sector?": -0.5,
  "Paychex Schedules Second Quarter Fiscal 2026 Earnings Conference Call on December 19, 2025": 0.0,
  "Insights Into Synopsys (SNPS) Q4: Wall Street Projections for Key Metrics": 0.2,
  "Is Verisk Analytics Stock Underperforming the S&P 500?": -0.5,
  "Is ON Semiconductor Stock Outperforming the Nasdaq?": 0.2,
  "Fortinet (FTNT) Recently Broke Out Above the 50-Day Moving Average": 0.5,
  "Wall Street Bulls Look Optimistic About CrowdStrike (CRWD): Should You Buy?": 0.8,
  "Brokers Suggest Investing in ASML (ASML): Read This Before Placing a Bet": 0.5,
  "CoreWeave initiated, Unity upgraded: Wall Street's top analyst calls": 0.5,
  "Wall Street Analysts Think Atlassian (TEAM) Could Surge 50.43%: Read This Before Placing a Bet": 0.5,
  "Toast upgraded, PayPal downgraded: Wall Street’s top analyst calls": 0.1,
  "The September PCE and core PCE data, delayed due to the government shutdown, are about to be released. - This is the most critical inflation data ahead of next week's Fed FOMC meeting. After a rapid rally in the three days leading up to Thanksgiving, the broader market has entered its seventh trading day of consolidation within a high-level flag pattern. SPY's upside test remains around $686, while the downside test continues to focus on": 0.1,
  "Clean energy isn’t failing. It’s threatening the people who built fortunes on scarcity. - Most people are reading the clean energy sector completely wrong. They look at red charts, crushed valuations, and ugly sentiment and think: \"See, it was all hype. The tech doesn’t work. The economics don’t add up.\" No. The tech works. The physics work. The economics work. What doesn’t work anymore is the old power structure built on scarcity. # 1. Oil": 0.8,
  "Microchip Technology (MCHP): Reassessing Valuation After Outlook Upgrade and New Power Monitor Launch": 0.6,
  "HPE Q4 revenue comes in soft as AI server shipments get delayed - Hewlett Packard Enterprise’s Q4 numbers came in lighter than expected, mainly due to weaker server revenue. The server segment posted $4.46B, which is down both QoQ (-10%) and YoY (-5%). Management pointed to two main issues:AI server shipments didn’t land in the quarter as expected . Government spending was softer than planned. Not a great quarter operationally, but the commentary suggests the": -0.6,
  "Consumer confidence has shown a slight rebound, but sentiment remains cautious what does this really mean for the market outlook? - Today's data is a bit complex. The December Consumer Confidence Index edged up slightly to 53.3, which appears positive, but the increase actually falls within the margin of error. The real notable improvement lies in the expectations of younger demographics and personal financial outlooks, which rose by 13%. However, overall consumer sentiment remains cautious,": 0.1,
  "Consumer sentiment ticks higher in December as inflation expectations improve": 0.6,
  "2 Oversold Stocks Primed to Rebound and 1 Facing Headwinds": 0.5,
  "Paychex Q2 Expected In-Line as H2 Acceleration Looms, RBC Says": 0.5,
  "Wells Fargo Advises on Netflix-Warner Deal in M&A Win for Bank": 0.6,
  "Core inflation rate watched by Fed hit 2.8%, delayed September data shows, lower than expected - he latest core PCE numbers showed a 0.2% increase month-over-month and a 2.8% annual rate, keeping inflation on the gradual downward trend the Fed has been hoping for. Since PCE is the Fed’s preferred gauge, this print will likely factor into next week’s meeting, where markets already expect another rate cut. Personal income rose 0.4% for the month, while": 0.2,
  "Hims and Hers acquires Livewell ahead of generic Ozempic launch in Canada": 0.5,
  "European Equities Traded in the US as American Depositary Receipts Rise in Friday Trading": 0.5,
  "Why The Trade Desk (TTD) Stock Is Up Today": 0.5,
  "Lululemon (LULU) Stock Is Up, What You Need To Know": 0.5,
  "Spotting Winners: Microchip Technology (NASDAQ:MCHP) And Analog Semiconductors Stocks In Q3": 0.5,
  "1 Growth Stock Set to Flourishand 2 Facing Challenges": 0.5,
  "Iron Mountain (IRM) Down 15.7% Since Last Earnings Report: Can It Rebound?": -0.5,
  "Why Is PTC Inc. (PTC) Up 2.6% Since Last Earnings Report?": 0.2,
  "Why Is Fortinet (FTNT) Up 5.8% Since Last Earnings Report?": 0.2,
  "Adma Biologics (ADMA) Up 43.3% Since Last Earnings Report: Can It Continue?": 0.5,
  "Why Is DoorDash (DASH) Up 12.6% Since Last Earnings Report?": 0.5,
  "Jazz (JAZZ) Up 24.5% Since Last Earnings Report: Can It Continue?": 0.5,
  "Lyft (LYFT) Up 6% Since Last Earnings Report: Can It Continue?": 0.5,
  "Why Is Qualcomm (QCOM) Up 0.7% Since Last Earnings Report?": 0.5,
  "Revolution Medicines (RVMD) Up 27.9% Since Last Earnings Report: Can It Continue?": 0.5,
  "Which stocks show potential as the final wave of promising stocks before year-end? - Today, U.S. stocks staged a sharp rebound as inflation data eased and expectations for interest rate cuts intensified, with tech stocks leading the charge. It feels like a prime opportunity to bottom-fish or add positions in growth, tech, and semiconductor stocks. I'm currently monitoring META and NVDA: 1.META: Its advertising and social platform fundamentals remain solid. If new ventures like AI,": 0.8,
  "CTSH vs. HXGBY: Which Stock Is the Better Value Option?": 0.0,
  "Cloudflare Says It Fixed Outage That Slowed Banking Sites": 0.5,
  "GEHC Forms 7-Year Care Alliance to Advance URMC Imaging & Monitoring": 0.5,
  "Coca-Cola's Margins Soar: Can It Sustain the Efficiency Push?": 0.5,
  "S&P 500 Pulls Back From Record as Bond Yields Rise": -0.5,
  "CEG Outpaces Its Industry in the Past Month: How to Play the Stock?": 0.5,
  "Cloudflare’s Second Outage in 3 Weeks Hits Coinbase, Others. The Stock Barely Budges.": -0.5,
  "River Road Asset Management Addresses UniFirst Board Regarding Shareholder Concerns": 0.5,
  "How To Get Bullish Exposure With Limited Risk On This Options Trade": 0.5,
  "Can Credo Maintain Margin Strength as Its Business Accelerates?": 0.2,
  "Guidewire Supports Cincinnati Insurance to Transform Claims Operations": 0.5,
  "Microsoft's annual shareholder meeting has just concluded, leaving the market with several intriguing signals. - Today, Microsoft shareholders formally approved all company proposals, including board elections and the 2026 stock plan. But more notably shareholders rejected all six shareholder proposals, including one demanding Microsoft submit a “human rights due diligence report.” This raises several questions: Amid AI's sweeping expansion, Microsoft increasingly resembles a “state-owned enterprise among tech giants.” Yet shareholders have clearly granted the company": 0.2,
  "3 Growth Companies With High Insider Ownership And 95% Earnings Growth": 0.8,
  "Three Stocks Estimated To Be Trading Below Intrinsic Value In December 2025": 0.2,
  "Oklo Unveils $1.5 Billion Public Offering. The Nuclear Stock Sinks.": -0.6,
  "Cognizant (CTSH) is an Incredible Growth Stock: 3 Reasons Why": 0.8,
  "Lam Research (LRCX) is an Incredible Growth Stock: 3 Reasons Why": 0.8,
  "The Bull Case For IDEXX Laboratories (IDXX) Could Change Following Strong Q3 Beat And Guidance Hike - Learn Why": 0.6,
  "US Oil Rig Count Stages A Comeback After Last Week’s Losses": 0.5,
  "Tesla, Netflix, and ON Semiconductor: 3 Unusually Active Cash-Secured Put Options to Sell Now": 0.2,
  "Taiwan Semiconductor Manufacturing vs. ASML: Which Stock Will Outperform in 2026?": 0.2,
  "Amazon Just Released Its Graviton5 CPU. Should You Buy, Sell, or Hold AMZN Stock Here?": 0.2,
  "Constellation Reaches Resolution With U.S. Department of Justice for Calpine Transaction": 0.5,
  "Selling Covered Calls to Tax Loss Harvest - I have a bunch of loser stocks I want to sell to offset some gains this year. I thought I'd be clever and sell in-the-money covered calls on them to at least capture some premium while I get rid of them. But does this somehow trigger a wash sale? (Assuming I do NOT buy them back for at least 31 days). I'm seeing conflicting information with online": -0.2,
  "The Most Overlooked Artificial Intelligence Stock of 2025": 0.2,
  "AMD Shares Rise as Reports Confirm GPU Price Increases Tied to VRAM Costs": 0.5,
  "Amazon's Secret Weapon? New Graviton5 Chip Could Rewrite the Cloud Playbook": 0.6,
  "Mercado Libre Just Pulled Off a $750 Million Power Move--Here's Why It Matters Now": 0.8,
  "So what’s your game plan for 2026? - Man, I still can’t wrap my head around the fact that we’re like twenty something days away from 2026. This year just flew by and honestly, it was kinda wild in a good way. Hands down, my favorite move of the year was piling into NVDA back in March/April when the market vibe was super doom and gloom. Everyone was like, “chips are way too high, risky": 0.6,
  "Constellation Energy Gets Final Regulatory Clearance for Calpine Acquisition": 0.5,
  "How The Evolving AI Networking Cycle Is Shaping Cisco’s Story And Valuation": 0.5,
  "Why ON Semiconductor (ON) Is Up 9.1% After $6 Billion Buyback And New GaN Alliance": 0.8,
  "TD Cowen Says This Memory Chip Maker Is One of the Best Stocks to Buy for 2026": 0.8,
  "Weekly Oil Rig Count Rises by 6; Crude Prices Extend Rally Amid Stalled Russia-Ukraine Peace Talks": 0.5,
  "Top Funds Get Googly-Eyed Over This Breakout AI Stock Not Named Nvidia Or Palantir": 0.6,
  "QXO - why so little coverage? - I read about this company in another thread here about future moonshots. Their current valuation isn't that far off from the bid on Beacon to begin with and as far as I can tell the CEO, Brad Jacobs, seems to have a great track record. I am from Sweden so I don't know that much about the construction sector in the US, but with coming (probable) decision on": 0.2,
  "Sector Update: Energy Stocks Mixed Late Afternoon": 0.0,
  "Fastenal and National FFA Organization Launch Corporate Partnership": 0.5,
  "How Shifting Analyst Expectations Are Reshaping the Story Behind Fortinet’s Valuation": 0.5,
  "Top Research Reports for Bank of America, Salesforce & Pepsi": 0.0,
  "Fermi America Executes Electric Service Agreement with Southwestern Public Service Company, a Subsidiary of Xcel Energy, Securing Up to 200 MW of Power": 0.6,
  "S&P 500 Starts December With Slight Weekly Gain Led by Energy, Tech": 0.5,
  "Fed Policy Easing Expectations Help Push Gains in US Equity Indexes This Week": 0.6,
  "Has Take-Two (TTWO) Stock Been Good for Investors?": 0.5,
  "GLOBALFOUNDRIES Inc. (GFS): A Bull Case Theory": 0.5,
  "Micron Technology, Inc. (MU): A Bull Case Theory": 0.5,
  "Cognizant (CTSH) Valuation Check After New AI-Powered Merchants Fleet Partnership": 0.2,
  "The Score: Warner, Boeing, Dollar General, American Eagle and More Stocks That Defined the Week": 0.2,
  "Why Constellation Energy Stock Flopped on Friday": -0.5,
  "Cisco Systems, Inc. (CSCO): A Bull Case Theory": 0.5,
  "PayPal Holdings, Inc. (PYPL): A Bull Case Theory": 0.5,
  "Marvell Technology, Inc. (MRVL): A Bull Case Theory": 0.5,
  "Texas Instruments Incorporated (TXN): A Bull Case Theory": 0.5,
  "Arm Holdings (NasdaqGS:ARM) Valuation Check After South Korea Chip Design School Deal": 0.2,
  "Fees changed how I trade more than I expected - I used to think trading fees were just part of trading,like you pay them and move on. But lately I’ve been noticing how much they mess with my decisions. I lookout for larger profit margin before each trade A few days ago I tried a small experiment on Bitget 0 fee stock race. I did some trades using tokenized stocks (E.G. NVDA/AMZN tokenized stocks). I": 0.4,
  "Apple Stock Can Rise on Services Segment, Says Analyst. Plus, Uber, American Eagle, and More.": 0.5,
  "Does a Quiet Domino's (DPZ) Board Exit Reveal Anything About Its Third‑Party Delivery Pivot?": 0.1,
  "Why Home Buyers See Some Hope in 2026": 0.5,
  "Exclusive-How Netflix won Hollywood's biggest prize, Warner Bros Discovery": 0.5,
  "US rig count up five as prices climb": 0.5,
  "PayPal Stock Looks Dirt Cheap. Time to Buy?": 0.6,
  "3 Dividend Stocks to Double Up on Right Now": 0.5,
  "Nvidia vs. Everybody Else: Competition Mounts Against the Top AI Chip Company": -0.5,
  "Is Linde Fairly Priced After Recent Share Price Pullback?": 0.5,
  "Why did I loose my trade? - I’m trying to understand why the market caught me by surprise today regarding my trade. I’ve only been trading since late March this year and I’m not consistently profitable yet. My strategy is basically options trading and determining the support and resistance levels for tickers. Robinhood has been the ticker I’ve been going in and out of since I started this strategy back in September. Anyways on DEC": -0.2,
  "Jim Cramer on Bristol-Myers’ Recent Stock Gain: “Unbelievable”": 0.8,
  "Jim Cramer Says CrowdStrike Reported a “Pretty Darn Good Quarter”": 0.8,
  "What Monster Beverage (MNST)'s Ultra Momentum and FLRT Launch Reveal About Its Growth Strategy": 0.5,
  "Down More Than 60% From Its High, Is Strategy MSTR Dip a cheap buy? - Strategy (NASDAQ: MSTR) is the largest corporate holder of Bitcoin and one of the biggest bulls of the top cryptocurrency. But amid weakness in the crypto market of late, its shares have been in a free fall. And that's putting it lightly. In just the past six months, the stock has lost more than half of its value. Heading into": -0.6,
  "How does ETF actually work - Do we just keep pumping in the same amount on a consistent basis and wait till the ETF multiplies from the average price we bought? (e.g., VOO, VXUS, SMH, or QQQM) How does compounding actually work? If that’s not the case, what is the best way to maximise the amount of ETF that was and will be bought?": 0.1,
  "What Analysts Think Is Changing the Story for PayPal and Its Future Edge Over Competitors": 0.5,
  "Puts vs. inverse ETFs? A one year update on MSTR - A year ago on Saturday, December 7, 2024, [I joined the chorus of skeptics in calling bullshit on MSTR](https://www.reddit.com/r/stocks/comments/1h8me2c/best_way_to_establish_a_short_position_on_mstr/), which had closed the previous Friday (December 6, 2024) at 395.01. As I was 100% convinced it would go down, I wanted to figure how to establish a bearish position. Unfortunately, as a long-only investor, I had no experience in doing this, so I thought": -0.6,
  "PepsiCo (PEP): Revisiting Valuation After Recent Share Price Softness Despite Ongoing Earnings Growth": 0.5,
  "Wall St Week Ahead Fed's internal split puts spotlight on Powell's rate guidance, dissents - The Federal Reserve’s meeting next week is looking a lot more tense than usual, mainly because policymakers don’t seem to agree on whether another rate cut is the right move. Out of the 12 voting members on the FOMC, five have openly pushed back against further easing, while three members of the Board of Governors are in favor of cutting": -0.6,
  "Netflix Makes a Blockbuster Deal for Warner Bros. But Is It a Win for Investors?": 0.2,
  "Marvell (MRVL) Wins $90 Target as Data Center Momentum Accelerates": 0.8,
  "CrowdStrike (CRWD) Delivers Upside Across Metrics; BMO Lifts Target to $555": 0.8,
  "Is Qualcomm Still Attractive After 2025 AI and 5G Growth Drives Share Price Rebound": 0.6,
  "Evaluating KHC Stock's Actual Performance": 0.0,
  "/r/Stocks Weekend Discussion Saturday - Dec 06, 2025 - This is the weekend edition of our stickied discussion thread. Discuss your trades / moves from last week and what you're planning on doing for the week ahead. Some helpful links: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips *": 0.5,
  "5 questions on what's next for Netflix after the Warner Bros. deal": 0.1,
  "Is Baker Hughes Company's (NASDAQ:BKR) Latest Stock Performance Being Led By Its Strong Fundamentals?": 0.5,
  "Is It Too Late To Consider Buying Constellation Energy Corporation (NASDAQ:CEG)?": 0.1,
  "At US$178, Is Ross Stores, Inc. (NASDAQ:ROST) Worth Looking At Closely?": 0.2,
  "Diamondback Energy, Inc.'s (NASDAQ:FANG) Stock Has Seen Strong Momentum: Does That Call For Deeper Study Of Its Financial Prospects?": 0.5,
  "Lululemon (LULU): Reassessing Valuation After Mixed Quarter, Lower Guidance and Margin Pressure from New Tariffs": -0.5,
  "CrowdStrike (CRWD) Valuation Check After Record Q3 Growth and Expanding AI-Driven Cybersecurity Partnerships": 0.8,
  "MarketBeat Week in Review – 12/1 - 12/5": 0.0,
  "Vertex Presents New Data on CASGEVY®, Including First-Ever Data in Children Ages 5-11 Years, at the American Society of Hematology Annual Meeting and Announces Plan for Global Regulatory Submissions": 0.5,
  "With next Fed interest rate cut in sight, Wall street rebounds, a bit": 0.5,
  "Microchip Technology (MCHP) Climbs 22.8% on Upbeat Outlook": 0.8,
  "AI Plays Lead Five Stocks To Watch Near Buy Points": 0.2,
  "Driverless 18-wheelers may reach your street sooner than you think": 0.5,
  "Assessing Amkor Technology (AMKR) Valuation After Intel EMIB Win and Strong Q3 Earnings": 0.6,
  "These 7 Stocks Are Analyst Favorites For Magnificent Earnings Growth; Lam Research, Google Among Winners": 0.8,
  "A Thanksgiving Dealmaking Sprint Helped Netflix Win Warner Bros.": 0.5,
  "Berkshire is on track to lag behind the S&P 500 in Buffett's last year as CEO - Berkshire Hathaway had a pretty interesting run this year, especially around the time Warren Buffett announced he would step down as CEO at the end of the year. Before that surprise in early May, BRK.B was actually beating the S&P 500 by a wide margin outperformance of over 22 percentage points in 2025. That changed quickly after the": -0.6,
  "Did Intuit’s SMB Data Tie-Up Quietly Strengthen The Trade Desk’s (TTD) Competitive Moat?": 0.2,
  "How Investors May Respond To Shopify (SHOP) Record Holiday GMV And Surging Shop Pay Adoption": 0.5,
  "Is It Too Late To Consider Booking After Its Massive Multi Year Share Price Surge?": -0.6,
  "Has the Market Run Too Far on Constellation Energy After a 311% Three Year Surge?": -0.6,
  "Constellation Holds Margin Lead as Vistra Expands With Gas Plants and Buybacks": 0.5,
  "The Bull Case For Autodesk (ADSK) Could Change Following Raised Guidance And Buybacks Amid Cloud-AI Push": 0.6,
  "Dollar stores continue to see higher-income shoppers, even as consumer sentiment improves": 0.6,
  "Starbucks Under Strain as CEO Brian Niccol Confronts Growing Missteps": -0.6,
  "Here's Why Shares in This Nvidia Partner Soared This Week": 0.5,
  "Netflix Stock Might Be Stuck If WBD Actually Closes: Disney & Comcast Show That Big Media M&A Doesn’t Create Shareholder Returns - Say the Warner Bros deal actually closes, Netflix would effectively win the streaming wars along with YouTube. But winning the streaming wars & doing a transformative M&A deal doesn't mean the stock will go up. Using two examples: Disney acquired Fox for $71 billion & Comcast acquired Sky for $39 billion. Both acquisitions": -0.5,
  "How much is DeepMind actually worth? - OpenAI looking to IPO at $1 trillion Anthropic eyeing 3-500B valuation xAI valued at ~200B DeepMind has arguably better tech than all of them and synergizes within the Google ecosystem (shared computing resources with Alphabet/GCP, TPU, etc). DeepMind is most likely THE frontier lab to bet on for achieving AGI. And DeepMind does more than LLMs, but putting that aside for now... Is it unreasonable to suggest that": 0.5,
  "Investors wait for value. Traders wait for imbalance. Same patience, different weapon. - Whenever I talk to investors, they think traders are reckless chasing every candle. The reality? The best traders I know are more patient than long-term investors. They just operate on a smaller timeframe. The mindset is identical: Wait for your conditions Manage risk Don’t chase Curious how do you define patience in your approach? Is it time-based, or condition-based?": 0.5,
  "r/Stocks Weekly Thread on Meme Stocks Saturday - Dec 06, 2025 - The meme stock scheduled posts will now run weekly and post Saturday afternoon and won't be a sticky; you're probably seeing this because automod sent you here! [Full list of meme stocks here.](https://www.reddit.com/r/stocks/wiki/meme-stocks) This will be updated every once in a while. ------ Welcome traders who just can't help them selves discuss the same exact stock that's been discussed 100s of times a": 0.1,
  "Utility Stocks Are Rebounding. Here Are 3 That Could Continue to Soar In 2026.": 0.6,
  "Is Verisk Still Attractive After a Tough 2024 and Mixed Long Term Returns?": -0.2,
  "Best Stock to Buy Right Now: Sirius XM vs. Lululemon": 0.5,
  "BMO Capital Lifts Amgen (AMGN) Price Target as MariTide Outlook Strengthens": 0.6,
  "Kite Announces New Data for Pivotal iMMagine-1 Study at ASH 2025, Highlighting Anito-cel’s Opportunity in Relapsed or Refractory Multiple Myeloma": 0.6,
  "Kite’s Next-Generation Bicistronic CAR T-Cell Therapies Show Encouraging Phase 1 Results in Relapsed/Refractory B-Cell Lymphoma in New Data at ASH 2025": 0.8,
  "2 Top Dividend Stocks to Buy in December": 0.5,
  "CICC Initiates Linde (LIN) With Outperform as Earnings Hit New Highs": 0.8,
  "Comcast (CMCSA) Moves to Merge NBCUniversal With Warner Bros. Discovery": 0.5,
  "Is LULU a Buy Right Now?": 0.0,
  "Largest Corporate bankruptcy in US - U.S. ON TRACK TO SEE THE HIGHEST NUMBER OF LARGE CORPORATE BANKRUPTCIES SINCE 2010: S&P GLOBAL Source :- 1- https://m.economictimes.com/news/international/us/us-bankruptcies-surge-to-15-year-high-recession-alarms-flash-as-filings-outpace-2020-crisis/articleshow/125750463.cms 2 - https://www.financialexpress.com/world-news/us-news/why-us-bankruptcy-filings-increased-in-the-second-half-of-2025-here-is-all-you-need-to-know/4064840/": -0.8,
  "In Jan 2025 I invested in 11 stocks because of reddit. Here's how it went - 80% of my portfolio is in the s&p but I want to be more aggressive while I'm younger and knew I could afford to gamble some so I bought 11 of the most mentioned stocks on different investing subreddits in Jan of 2025. There's some I didn't invest in for personal reasons and I didn't invest all 20% into": 0.2,
  "Who will win the AI race- only one Hyperscaler or all of them? - I am looking for realistic scenarios for MAG 7 businesses in 5 years. A few months ago $GOOG dumped because of ChatGpt release, threatening Googles search monopoly. Today completely different picture, Google dominates AI with Gemini and their own hardware, and some believe they have the potential to crush the competition. Everytime a major announcement regarding an LLM is released stocks": 0.2,
  "Does Regeneron’s Choppy 2025 Share Price Reflect Its Long Term Growth Potential?": 0.1,
  "The Three Best Tech Stocks to Buy Before 2026": 0.5,
  "Why not overweight on Mag7? - What are the reasons not to be overweight the Mag 7 vis-a-vis the SP500? Aren’t Mag 7 gains holding up the entire SP500? What would actually change that? If Mag 7 goes down, it feels like everything is going down. If anything goes up, it feels like it’s going to be Mag 7. I don’t see that changing unless there’s a radical shift in policy.": 0.2,
  "Stock Ideas from Barron’s 12/8: WY, CASY, FISV, AAPL - This is the second installment of my effort to summarize some stock ideas from the week’s issue of Barron’s Magazine. Do your own due diligence and research. **WY** Weyerhaeuser is a play on lumber prices and the economic cycle. It is down 24% for the year and 33% from the high but this seems to be a trough for both lumber and for WY. If": 0.2,
  "Is Booking (BKNG) Using Gig-Tripping To Quietly Prove Its Connected Trip Strategy?": 0.2,
  "Should You Buy Lululemon Stock Before 2026?": 0.2,
  "Honeywell - I call it an interesting “boring stock” - Not investment advice to buy. I own shares. Seems like a classic value unlocking play. Why interesting and boring? Well first of all it’s a conglomerate, hence probably wont explode and isn’t for day trading. Interesting? I’ll explain below. They already spun off the materials business back in Oct 2025. Since then the spinoff went up 3% but Honeywell went down 6%. The big catalyst": 0.2,
  "Is New Neurology Data And Partnerships Altering The Investment Case For Biogen (BIIB)?": 0.2,
  "Pat Gelsinger wants to save Moore’s Law, with a little help from the Feds": 0.5,
  "Down 10%, Should You Buy the Dip on Vertex Pharmaceuticals?": 0.2,
  "Up 59%, Should You Buy ASML Right Now?": 0.5,
  "Is It Too Late To Consider PDD After Temu Expansion And Strong Multi Year Share Gains?": 0.2,
  "Analog Devices (ADI): Evaluating Valuation After Strong Earnings Beat and Upgraded Outlook": 0.8,
  "Prediction: 2 Hypergrowth Stocks That Will Run Circles Around Nvidia Through 2030": 0.5,
  "Looking at the Narrative for Digital Turbine After Shifting Ad Tech Valuations and Rising Risks": 0.1,
  "Why The Narrative Around Gilead Sciences Is Shifting After HIV And Oncology Updates": 0.5,
  "What is Netflix buying? A visual history of 100 years of Warner Bros.": 0.2,
  "Reassessing Paychex After 2025 Slump And New HR Partnerships": 0.2,
  "Assessing ADP (ADP) Valuation After Weak November Private Payrolls Deepen Fed Rate Cut Speculation": -0.5,
  "Recent SPY additions are all dud! - Everyone says to buy and hold S&P (SPY or VOO) but the recent additions are all dud \\- HOOD (insiders have sold most of their stock. Director baiju batt holds just 800 shares!) \\- APP (scam company shorted by multiple short sellers. SEC in a different administration would have enough man power and power to investigate) \\- COIN (pure scam company which just withholds crypto from people. They": -0.8,
  "David Ellison's hunt for WBD made David Zaslav richer and it may not be over - There’s some fresh movement around the Warner Bros. Discovery situation. According to CNBC, WBD has agreed to sell its studio and streaming business to Netflix, a move that reportedly leaves CEO David Zaslav financially better off but has raised plenty of questions about what WBD shareholders are actually getting out of it. Now, Paramount is said to be considering": 0.2,
  "Why You Should Care About Cadence Design Systems' (NASDAQ:CDNS) Strong Returns On Capital": 0.5,
  "Is Roper Technologies, Inc. (NASDAQ:ROP) Trading At A 38% Discount?": 0.2,
  "Amgen Inc.'s (NASDAQ:AMGN) Intrinsic Value Is Potentially 68% Above Its Share Price": 0.8,
  "The AMD Story: Breakthrough Chips, Hyperscale Deals, Valuation Risks": 0.2,
  "3 Growth Stocks That Could Skyrocket in 2026 and Beyond": 0.8,
  "Crucial Fed decision looms as stocks fly high near records: What to watch this week": 0.5,
  "Yescarta® Delivers Consistent Safety, Efficacy, and Quality of Life Benefits Across Broad Range of Relapsed/Refractory Large B-cell Lymphoma Patients in New Analysis at ASH 2025": 0.8,
  "Applied Materials (NASDAQ:AMAT) stock performs better than its underlying earnings growth over last five years": 0.5,
  "3 Nuclear Energy Stocks to Buy Before 2026": 0.5,
  "Street Calls of the Week": 0.0,
  "This Top Chip Stock Could Also Be the Best Way to Play a New Trump Robotics Rally": 0.6,
  "OpenAI goes from stock market savior to burden as AI risks mount": -0.6,
  "Companies prepare — as best they can — for possible tariff refunds": 0.2,
  "The Market Is Giving Investors an Unbeatable Opportunity to Buy This Long-Term Artificial Intelligence (AI) Winner (Hint: Not Palantir or Nvidia)": 0.8,
  "Is GlobalFoundries Fairly Priced After Recent Share Price Rebound?": 0.2,
  "Palantir Crushes 63% Growth While UiPath Celebrates Its First Profit": 0.5,
  "Thoughts on my grandfather’s 27 year performance? - My grandfather retired in 1998 at 48 years old(around when I was born to help out), he had about $75k in an IRA and a pension that covered most of his expenses. He currently has $170k in a Roth IRA. Since then he’s invested only in stocks (no bonds or ETFs), he mostly did short term trades until 5-7 years ago he started long term investing. The": 0.2,
  "Has Applied Materials Stock Run Too Far After Its 63.5% 2025 Surge?": -0.5,
  "Global week ahead: Fed’s December decision to inform world’s central banks - Looks like this week could set the tone for year-end policy moves globally. The U.S. Federal Reserve is widely expected to cut rates at its meeting, which is likely to influence how other central banks wrap up 2025. The Swiss National Bank is up on Thursday, followed by the Bank of England and the European Central Bank on December 18, and then the": 0.5,
  "How best to track trade learnings and plan strategy? - I’ve started and stopped writing/recording all my trades over time. I haven’t enjoyed the extra tracking outside of my trading app (TD Direct). I’ve been able to look back at trades and confirmations there when I need. But I want to record certain trade moments and develop and record my learnings and strategy. Does anyone have a good way of doing this? Maybe you use": 0.2,
  "'Lowest-probability outcome': Netflix's $72 billion deal for Warner Bros. Discovery stuns Wall Street": 0.5,
  "As Growth Accelerates, Is It Time to Buy CrowdStrike Stock?": 0.6,
  "Give me your thoughts on my investing direction - I am currently 27 years old and I have about 50k in a Robinhood account invested in realty income (30k), Voo (10k) and qqqi (17k). I also have about 50k in a 401k account that is invested in an allocated fund. I invest 15% of my paycheck into my 401k which comes to about $620 biweekly. I also invest $300 a week to my Robinhood account": 0.5,
  "Forget Medtronic, Buy This Healthcare Stock Instead": 0.2,
  "Coca-Cola quietly makes a massive change to its soda brands": 0.2,
  "'Every Game Company' is Doing it? 'Arc Raiders' AI Scandal Explodes, Big Name CEO Suggests Hidden Truth": -0.6,
  "What is the best personal finance software out there? - I am wondering what software you all would recommend for basically a 'one stop shop' that projects investments/retirement, taxes (im self employed as well) and one i can input monthly expences/income. Thank you!": 0.6,
  "PACCAR (PCAR): Assessing Valuation After Parts Division Records Boost Sentiment And Long-Term Growth Investments": 0.5,
  "Think Palantir Stock Is Expensive? This 1 Chart Might Change Your Mind.": 0.5,
  "Fed Rate Decision, Adobe, Oracle, Costco, Broadcom, and More Stocks to Watch This Week": 0.2,
  "This Artificial Intelligence (AI) Infrastructure Stock Could Be the Nvidia of 2026": 0.8,
  "Better Artificial Intelligence Stock: Palantir Technologies vs. Nvidia": 0.5,
  "Is Marvell Technology Fairly Priced After Recent AI Driven Share Price Surge?": 0.2,
  "Lynozyfic™ (linvoseltamab) Monotherapy in Newly Diagnosed Multiple Myeloma (NDMM) Shows Impressive Responses, Supporting Rationale as a Potential Foundation in Frontline Treatment": 0.8,
  "Meta is the best mag7 (value wise) - I think we all know that q3 earnings was okay althought the huge tax that been paid. But the real reason meta was down from that point is the spending and the weak fcf from the Ai and Metaverse spending. Now the Zuck is acting to reduce spending and this likely to add 2$ eps for 2026. The narrative right now is really good for META. so": 0.6,
  "Paychex (PAYX): Revisiting Valuation After a 19% Share Price Pullback Despite Steady Earnings Growth": 0.5,
  "Is ASML (NasdaqGS:ASML) Overvalued After Its Strong Recent Share Price Run?": -0.5,
  "1 Nvidia-Backed Artificial Intelligence Stock to Buy Hand Over Fist in 2026": 0.8,
  "GlobalFoundries (GFS) Is Up 8.7% After Defense, Sustainability Wins Strengthen Its Strategic Moat": 0.8,
  "(Item 8.01) Other Events. ATM Update On December 8, 2025, Strategy Inc (\"Strategy\") announced an update with respect to sales made under its at-the-market offering program (\"ATM\") of the following securities: During Period December 1, 2025 to December 7, 2025 As of December 7, 2025 Security Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) STRF Stock - $ - $ - $ 1,637.3 10.00% Series A": 0.1,
  "Prediction: This Artificial Intelligence (AI) Stock Could Be Michael Burry's Next Big Short": -0.5,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers On December 5, 2025, Microsoft Corporation (the “Company” or “Microsoft”) held its 2025 Annual Shareholders Meeting (the “Annual Meeting”). At the Annual Meeting, the Company’s shareholders approved the Company’s 2026 Stock Plan (the “2026 Stock Plan”). The 2026 Stock Plan replaces the Microsoft Corporation 2017 Stock Plan in its entirety. The material terms of the 2026\n\n(Item 5.07) . Submission of Matters to a Vote of Security Holders There were 7,433,087,554 shares of common stock entitled to be voted at the Annual Meeting, of which 6,321,402,487 were voted in person or by proxy. The results for each item submitted for a vote of shareholders are as follows. The shareholders: (1) Voted to elect each of the 12 nominees for director. (2) Approved, on an advisory basis, the compensation of the Company’s named executive": 0.1,
  "GME 5-Year DCF: The Transformation Climax - [I created a realistic DCF model using GME's last four quarters.](https://docs.google.com/spreadsheets/d/1BTLWPm3qS4pDl146-VRdeFbg6WVxqYM-/edit?usp=sharing&ouid=106284249597555720895&rtpof=true&sd=true) Now that GME is net profitable, and the transformation is taking place, it seems useful to project future cashflows based on the current operations from this past year. I created three different scenarios to highlight the different possibilities: * **Bear case $13.36/share**: declining sales, weak traffic, and continued capex cuts for cash preservation. This lower valuation shows": 0.5,
  "Should Newtyn’s Stake And T‑Mobile Lease Shift Array Digital Infrastructure’s (AD) Investment Narrative?": 0.1,
  "Trump Says Netflix-Warner Deal ‘Could Be a Problem’": -0.5,
  "Interested in Micron Technology (MU)? Mark Your Calendars for Dec. 17, 2025.": 0.2,
  "Carvana, Comfort Systems, CRH To Join S&P 500 Index. The Stocks Are Jumping.": 0.8,
  "What Every Constellation Energy Investor Should Know Before Buying": 0.2,
  "Agoda Unveils 2026 Travel Outlook Report: Key Trends for Industry Partners to Capitalize on the Year Ahead": 0.5,
  "Generative AI Upside: 2 Software Stocks Could Triple Revenue in 5 Years": 0.8,
  "Stock market news this week: Netflix, SpaceX, and Perplexity": 0.2,
  "Surgical Equipment & Consumables - Specialty Stocks Q3 Earnings: Intuitive Surgical (NASDAQ:ISRG) Best of the Bunch": 0.6,
  "Cadence Design Systems (CDNS) Benefits from Renewed Optimism in Semiconductor Design Software": 0.8,
  "A Look Back at Cybersecurity Stocks’ Q3 Earnings: Zscaler (NASDAQ:ZS) Vs The Rest Of The Pack": 0.2,
  "Dow Jones Futures: Tesla In Buy Area As AI Giants, Fed Loom": 0.2,
  "What Analysts Think Is Changing The Starbucks Turnaround Story Now": 0.2,
  "2 Cash-Producing Stocks to Target This Week and 1 We Avoid": 0.2,
  "2 Growth Stocks to Stash and 1 We Avoid": 0.2,
  "1 S&P 500 Stock to Keep an Eye On and 2 Facing Headwinds": 0.2,
  "3 S&P 500 Stocks Worth Investigating": 0.0,
  "1 S&P 500 Stock with Promising Prospects and 2 Facing Challenges": 0.5,
  "2 Nasdaq 100 Stocks to Own for Decades and 1 We Turn Down": 0.2,
  "3 Cash-Producing Stocks with Exciting Potential": 0.6,
  "2 S&P 500 Stocks Worth Your Attention and 1 That Underwhelm": 0.2,
  "2 Safe-and-Steady Stocks with Exciting Potential and 1 We Find Risky": 0.5,
  "2 Momentum  Stocks for Long-Term Investors and 1 We Brush Off": 0.2,
  "1 Cash-Producing Stock with Exciting Potential and 2 We Brush Off": 0.5,
  "2 Mega-Cap Stocks with Promising Prospects and 1 Facing Challenges": 0.5,
  "Riyadh Air and IBM Partner to Launch World's First AI-Native Airline": 0.8,
  "SED Initta and Intel Deepen Strategic Partnership to Accelerate AI-Driven Retail Transformation": 0.6,
  "Should Investors Give Intel Stock Another Look After Its AI Strategy Reset?": 0.5,
  "Autodesk (ADSK) Reports Better-Than-Expected Earnings and Guidance Increase According to Baird": 0.8,
  "Citi Lowers Adobe (ADBE) PT to $366 Ahead of Earnings, Maintains Neutral Rating on Anticipated Revenue Beat but Lowered Margin Forecasts": -0.2,
  "TD Cowen Raises Applied Materials (AMAT) PT to $315, Maintains Buy Rating Citing Intersection of Strong DRAM, Leading-Edge Foundry Market Uptrends": 0.8,
  "Morgan Stanley Hikes Lam Research (LRCX) PT to $158, Keeps Equal Weight on Increased 2027 Wafer Fab Equipment Forecast": 0.5,
  "BMO Believes Intuit (INTU) Had Strong Start to FY2026 Driven by Credit Karma, QBO Ecosystem Strength": 0.8,
  "Micron Exits Crucial Consumer Memory Business to Focus on High-Growth AI Data Center Chips Amid Supply Shortage": 0.5,
  "Nvidia Corp.’s (NVDA) Long-Term Revenue Opportunity Remains Intact, Per Morgan Stanley": 0.6,
  "AppLovin to Participate in the Nasdaq 53rd Investor Conference Held in Association with Morgan Stanley": 0.5,
  "Analyst Continues to Back Autodesk (ADSK) Amid Consistent Growth Momentum": 0.6,
  "The Ultimate Growth Stock to Buy With $1,000 Right Now": 0.5,
  "GlobalFoundries (GFS): Revisiting Valuation After Major CHIPS Act Backing and Trusted US Foundry Status": 0.5,
  "America Has a Investment Literacy Problem; $NFLX and $WBD Deal Showed This - When publicly traded companies announce agreements of purchase, it doesn't mean that the deal is mazal. There are still multple steps of legal, IBD, etc. steps companies go through before a something is mazal. Acquisitions are announced, but often times not fully finalized because of necessary steps that need to happen. And in this case, seems like the vast majority of America": -0.6,
  "Major Fund Bets $301 Million on MercadoLibre — Is the Stock a Buy as Shares Retreat From Record Highs?": 0.5,
  "Vertical Aerospace Partners with Syensqo to Support Industrialisation Plan for the VX4 Aircraft": 0.5,
  "Adobe (ADBE): Revisiting Valuation After Recent Share Price Rebound": 0.5,
  "Is Lululemon Quietly Becoming a Value Stock?": 0.5,
  "Qualcomm Highlights Edge AI Innovation at Qualcomm AI Program for Innovators (QAIPI) 2025 - APAC Demo Day and Sets the Stage for 2026": 0.5,
  "Is Biogen Stock Outperforming the Dow?": 0.2,
  "Fed Rate Decision, Broadcom and Costco Earnings: What to Watch This Week": 0.5,
  "With antitrust settlement, Constellation set to become largest US wholesale power provider": 0.6,
  "Here's Why Advance Auto Parts Stock Recovered in November": 0.5,
  "Should Analyst Upgrades After Strong Q3 and Higher Guidance Require Action From O'Reilly Automotive (ORLY) Investors?": 0.2,
  "Up 200% in 5 Years, Should You Buy This Unstoppable Artificial Intelligence (AI) Stock Heading Into 2026? The Answer Might Surprise You.": 0.5,
  "Global Markets Mixed at Start of Key Week": 0.0,
  "The Zacks Analyst Blog Highlights Dell Technologies, Hewlett-Packard, Cisco Systems and Super Micro Computers": 0.5,
  "What New Catalysts Are Gradually Shifting the Intel Narrative Now": 0.5,
  "Trump says Netflix £54bn takeover of Warner Bros ‘could be a problem’": -0.5,
  "The Zacks Analyst Blog Highlights Bank of America, Salesforce, PepsiCo, United Homes and AmeriServ Financial": 0.5,
  "The Zacks Analyst Blog Highlights Micron, Comfort Systems USA, Kinross Gold, On Holding and MongoDB": 0.5,
  "MetaOptics to Showcase Five Breakthrough Metalens-Powered Products at CES 2026": 0.6,
  "Crucial Fed decision looms as stocks fly high near records: What to watch this week - The Fed is back in session this week, with the decision due Wednesday along with Powell’s press conference. After last week’s data, markets seem almost convinced a 25 bps cut is coming. ADP and Challenger both showed unexpected job losses and higher layoffs, which really shifted expectations. Futures are now pricing a move from the current 3.75%–4.00% range down": 0.5,
  "WeRide Attracts Public Investments as Top Funds Back Its Autonomous Mobility Growth - Content: source: [https://finance.yahoo.com/news/weride-attracts-public-investments-top-101400013.html](https://finance.yahoo.com/news/weride-attracts-public-investments-top-101400013.html) WRD up +19.02% in one month, becoming one of the leader of global autonomous vehicle plays in the industry. Recently, ARK Invest just added 858,295 shares in three trading days. Now WeRide's major holders include NVIDIA, Temasek, Bosch, Grab, Uber, etc. Also, BofA just applied a BUY on them, $12 target, 46% upside, Citi and BOCI are more aggressive": 0.8,
  "Nvidia briefly crosses $5T market cap after Morgan Stanley raises price target - Nvidia’s stock caught another boost after Morgan Stanley raised its price target to $250, citing continued confidence in long-term revenue growth tied to AI demand. On the back of that optimism, the company briefly surpassed a $5 trillion market capitalization, highlighting just how dominant it has become in the current AI cycle. While the milestone grabbed headlines, the move mostly reflects ongoing": 0.8,
  "US Equity Investors to Focus on Fed Policy Guidance While Watching Out for Oracle's Quarterly Results": 0.5,
  "Robinhood Insiders Been Selling… - Chief Legal recently sold US$15m worth of stock On the 3rd of December, Daniel Gallagher sold around 110k shares on-market at roughly US$132 per share. This transaction amounted to 21% of their direct individual holding at the time of the trade. • This was the largest sale by an insider in the last 3 months. • Insiders have been net sellers, collectively disposing of US$124m more than they bought in": -0.8,
  "Oppenheimer & Co. Inc. Strengthens Equities and Biotech Research Teams with Addition of Kostas Biliouris, Ph.D.": 0.6,
  "Where Kroger feels the heat from regional competitors": -0.5,
  "Insiders At Honeywell International Sold US$1.5m In Stock, Alluding To Potential Weakness": -0.6,
  "2 companies well-positioned in AI-era cybersecurity": 0.5,
  "UniFirst (UNF) Valuation Check as Activist Campaign Escalates After Rejected Cintas Offer": 0.1,
  "Stocks Set to Open Higher as Investors Await Fed Meeting": 0.5,
  "Evaluating ORLY Stock's Actual Performance": 0.0,
  "3 Growth Companies With High Insider Ownership And Earnings Up To 105%": 0.5,
  "This Week In AI Chips - Synopsys Faces Legal Challenges Amid Revenue and Income Decline": -0.6,
  "Freshworks And Two More Stocks Estimated To Be Trading Below Fair Value": 0.5,
  "US High Growth Tech Stocks To Watch In December 2025": 0.5,
  "Magnum Ice Cream Hits $9 Billion Market Capitalization on Trading Debut": 0.8,
  "Took me way too long to realize a stock screener is just step one of stock analysis - I used to think finding the perfect stock screener would solve my investing problems. Spent months testing different setups. Nobody tells you screening is maybe 10% of the work. You can have the best filters and still buy garbage if you don't dig into what comes out. I'd run a screen, get 30 names, buy the cheapest": -0.6,
  "1 Reason to Buy Palantir Stock Before 2026 and 1 Reason to Sell": 0.2,
  "Berkshire Hathaway's Todd Combs, investment lieutenant to Buffett and Geico CEO, is leaving for JPMorgan - Berkshire Hathaway announced several structural changes ahead of Warren Buffett stepping down as CEO later this year, and one of the bigger ones is the departure of Todd Combs. Combs, who has been both an investment officer at Berkshire and CEO of Geico, will be moving to JPMorgan Chase. At JPMorgan, he’ll lead a newly created Security and Resiliency": -0.2,
  "Oscar Mayer Seeks New Class of Hotdoggers to Drive the Beloved Wienermobile into Its 90th Year": 0.6,
  "ISS Recommends UniFirst Shareholders Vote \"FOR\" Engine Capital’s New Director Candidates at 2026 Annual Meeting": 0.5,
  "Global Shift Toward Trust: 2025 Employer Branding Creativity Awards Highlight New Talent Trends": 0.5,
  "Option Volatility and Earnings Report for December 8 - 12": 0.0,
  "Possible Bearish Signals With Atlassian Insiders Disposing Stock": -0.5,
  "Great week for Old Dominion Freight Line, Inc. (NASDAQ:ODFL) institutional investors after losing 23% over the previous year": 0.2,
  "Global brands fight legality of Trump’s 'Liberation Day' tariffs": -0.5,
  "Why on Earth do people still invest in Meta? - No, seriously, I just don't get it. This company used to be known as Facebook, and at its core that's still what it is. The Metaverse has failed (quite spectacularly) and the company's revenues are essentially coming from Facebook and Instagram ads, while all the side ventures are neither significant profit bringers nor in a unique market position. So why on earth would you think": -0.8,
  "Adobe Q4 Earnings Preview -- What To Expect From Upcoming Report": 0.5,
  "Will Costco Announce a Special Dividend on Dec. 11?": 0.2,
  "Long Term Investment - Hi everyone, I’m planning to build a long-term investment strategy and I’d like to hear some opinions from people who have more experience. My goal is to invest consistently every month and slowly grow my portfolio over the years. Right now, I’m trying to decide which direction makes more sense in the long run. Should someone focus on interest-bearing savings accounts, precious metals like gold, or a portfolio of stocks and": 0.5,
  "Stocks Rise Pre-Bell as Traders Await Fed Policy Decision": 0.5,
  "Digital Payment Update - 4PAY Enhances Cloud Platform with Opti9 Partnership": 0.5,
  "Is Cognizant Technology Stock Underperforming the Nasdaq?": -0.5,
  "Charter Communications Stock: Is CHTR Underperforming the Communications Sector?": -0.5,
  "Micron vs. Lam Research: Which Stock Has Better Upside Potential?": 0.5,
  "ISRG Stock Forms Golden Crossover: Will the Uptrend Continue?": 0.5,
  "ASML reports transactions under its current share buyback program": 0.0,
  "If You Invested $10K In PayPal Stock 10 Years Ago, How Much Would You Have Now?": 0.5,
  "Lambda Appoints Heather Planishek as Chief Financial Officer": 0.5,
  "Israir Group Concludes the Best Quarter in Its History with a Net Profit of Approximately USD 35 Million, a 75% Increase, and EBITDAR of USD 46 Million": 0.8,
  "Inductive Bio Announces an Up To $21M Award to Develop AI Drug Toxicity Models that Improve Drug Safety Assessment with Leading Academic and Biopharmaceutical Organizations": 0.8,
  "Oura vs Big Tech: The ring taking on Apple, Google & OpenAI": 0.2,
  "Nine Of This Year's Top Stocks Will Win Again In 2026, Analysts Say": 0.5,
  "Best Growth Stocks to Buy for December 8th": 0.5,
  "Marvell stock falls on Microsoft-Broadcom talks and Amazon design loss fears": -0.6,
  "‘More Orange Dots’: Michael Saylor’s Strategy Buys 10,624 Bitcoin Amid Sell-Off Concerns": 0.5,
  "Assessing Mondelez (MDLZ) Valuation After Recent Share Price Weakness and Ongoing Earnings Growth": 0.5,
  "Strategy Bought Nearly $1B in Bitcoin Last Week as Saylor's Company Returns to Big Purchases": 0.8,
  "Is Kraft Heinz Stock Underperforming the S&P 500?": -0.5,
  "India's Tata signs up Intel as major customer for $14 billion chip foray": 0.8,
  "Billionaire Michael Saylor Adds 10,624 BTC in Latest Purchase – Is the Bull Market Back?": 0.5,
  "The Trade Desk Declines 44% in 6 Months: How to Approach the Stock?": -0.6,
  "Here's How Much a $1000 Investment in Take-Two Interactive Made 10 Years Ago Would Be Worth Today": 0.5,
  "Watch 5 Bigwigs in December After Double-Digit Returns Past Month": 0.2,
  "Netflix-Warner deal would drive streaming market further down the road of ‘Big 3’ domination": -0.6,
  "5 Stocks to Buy as AI Enthusiasm Continues to Drive Semiconductor Sales": 0.6,
  "What Makes Shopify (SHOP) a Strong Investment?": 0.8,
  "PayPal Holdings, Inc. (PYPL) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Palo Alto Networks, Inc. (PANW) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Investors Heavily Search CrowdStrike (CRWD): Here is What You Need to Know": 0.5,
  "Constellation Energy Corporation (CEG) Is a Trending Stock: Facts to Know Before Betting on It": 0.2,
  "MercadoLibre, Inc. (NASDAQ:MELI) is a favorite amongst institutional investors who own 81%": 0.5,
  "Nvidia Takes Top Spot in the List of Best-Managed Companies of 2025": 0.8,
  "Warner Bros fight heats up with $108 billion hostile bid from Paramount": 0.5,
  "Media Paramount Skydance launches hostile bid for WBD after Netflix wins bidding war - Paramount Skydance, led by David Ellison, is going straight to Warner Bros. Discovery shareholders with an all-cash offer of $30 per share in a hostile takeover move. This comes after Netflix won the bidding war for Warner Bros.’ film studio and HBO Max, while choosing not to acquire WBD’s TV networks. Paramount has maintained that keeping WBD’s assets together makes more": 0.2,
  "Don't Overlook Marvell (MRVL) International Revenue Trends While Assessing the Stock": 0.5,
  "Seeking Clues to Lululemon (LULU) Q3 Earnings? A Peek Into Wall Street Projections for Key Metrics": 0.2,
  "AI Stocks Face 'Show Me' Moment: Oracle, Broadcom Earnings Due": 0.2,
  "Is American Electric Power Stock Outperforming the Dow?": 0.2,
  "Stock Market News for Dec 8, 2025": 0.0,
  "Tether Moves $3.9B BTC for Jack Mallers’ ‘Twenty One’ NYSE Debut": 0.5,
  "Inspiring the Creators and Innovators of Tomorrow at Universal Epic Universe": 0.8,
  "Earnings Growth & Price Strength Make GE HealthCare Technologies (GEHC) a Stock to Watch": 0.8,
  "Is It Worth Investing in MercadoLibre (MELI) Based on Wall Street's Bullish Views?": 0.5,
  "GoodYear Tire & Rubber is ugly, ignored, but not completely dead in the waters. - *I am just trying to sharpen my analytical skills. My reports are designed for informational purposes only and do not constitute investment advice. Do your own due diligence and contact a professional before investing.* EV: 10.87B, trailing P/E: 5.12, P/S: 0.14, P/B: 0.84, profit Margin: -9.44%, Ret on Equity: -42.19%, Net loss: -1.73B. https://preview.redd.it/75loh8g1wv5g1.png?width=2391&format=png&auto=webp&s=e2b1103d208437ec7c8c2219debe12b1e3eb913b Goodyear Tire and Rubber, one of": -0.2,
  "Micron's latest move says more about AI than you think": 0.5,
  "Cooper Investors Global Equities Fund Sold Its Stake in GE Healthcare (GEHC). Here’s Why": 0.2,
  "IBM's $9.3B Confluent deal, WBD latest, Tesla downgrade": 0.0,
  "Has the cash ISA shakeup encouraged you to start investing? Have your say": 0.2,
  "Another Famous Tech Investor Sold Some Palantir Stock—Time To Do the Same?": -0.5,
  "Netflix, Tesla downgraded: Wall Street's top analyst calls": -0.5,
  "Is Xcel Energy Stock Underperforming the S&P 500?": -0.5,
  "r/Stocks Daily Discussion Monday - Dec 08, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.2,
  "Apartments.com Releases Multifamily Rent Growth Report for November 2025": 0.0,
  "MELI Dips 16% in 6 Months: Should Investors Hold or Fold the Stock?": -0.5,
  "Strategy acquires 10,624 bitcoin for $963 million through stock issuance": 0.8,
  "Best Momentum Stock to Buy for December 8th": 0.5,
  "Built for What's Next: Designing Human-Centered Workplaces in the Modern Age at Cisco": 0.5,
  "Pillar Biosciences and AstraZeneca Expand Liquid Biopsy Access Partnership to China": 0.5,
  "Is DoorDash Stock Outperforming the Dow?": 0.2,
  "3.86M ETH and Counting — BitMine’s Progress Toward 5% of Ethereum Supply": 0.5,
  "Apple Gains Higher Wedbush Price Target on Strengthening AI Strategy and iPhone 17 Demand": 0.8,
  "Nvidia Stock Has a Lot Riding on Broadcom Earnings": 0.2,
  "Dr Pepper Marks 18 Years of Impact with the Announcement of the 2025 Dr Pepper Tuition Giveaway Winners": 0.5,
  "Control Room Solutions Market Set for $86.3 Billion Valuation by 2030, Led by Honeywell , Siemens, Schneider Electric, Johnson Controls, and ABB": 0.8,
  "Paramount goes to war with Netflix for Warner Bros. Discovery with hostile $108.4B bid": 0.2,
  "Celsius Holdings Innovation Pipeline Expands Beyond Energy Core": 0.5,
  "Is CDW Stock Underperforming the Dow?": -0.5,
  "Synopsys stock rating upgraded by BofA as Nvidia investment boosts outlook - BofA Securities upgraded Synopsys (SNPS) from *Underperform* to *Neutral* today, but at the same time **l**owered its price target from $525 to $500. The stock is currently trading around $466.76. Even after the pullback, Synopsys is still priced pretty richly, with a P/E ratio of about 63, which keeps valuation concerns front and center. The upgrade feels more like BofA saying “it’s not": -0.5,
  "Form 8.3": 0.0,
  "Paramount Skydance makes hostile bif doe WBD, Berkshire's top stock picker to exit": -0.5,
  "Given that hostile bidding for WBD, why hasn't Amazon, Google, or even Apple enter the game? $30/shares max of higher if others join in? - Curious, with Google and Apple getting in on the Apple TV/Google TV game and yet have limited content and tons of cash each company holds, why hasn't Apple or Google enter into the bidding war for content? I get they probably don't want the legacy cable stuff like TNT, CNN,": 0.2,
  "Grid Tech Stocks Are Poised to Soar Even Further Amid AI Bubble Fears": 0.8,
  "Paramount sparks takeover battle for Warner Bros with £81.3 billion hostile bid": 0.5,
  "Nvidia Topples Apple As Best-Managed U.S. Company; Is Nvidia A Buy Now?": 0.5,
  "BC-Most Active Stocks": 0.0,
  "3 Dividend Stocks Retirees and Yield Lovers Should Own": 0.5,
  "Pre-markets Up for Nasdaq and Russell 2000, Flat for Dow": 0.5,
  "Palantir Climbs Above 21-day, 50-Day Lines. Is PLTR Stock A Buy Heading Into 2026?": 0.5,
  "Berkshire Hathaway stock picker Todd Combs departs to lead new strategic investment group at JPMorgan": 0.2,
  "Paramount makes $108.4 billion hostile bid for Warner Bros Discovery": 0.2,
  "Strategy Drops Nearly $1 Billion on Bitcoin, Marking Largest BTC Buy in Months": 0.8,
  "Major League Pickleball's Brooklyn Pickleball Team Adds Entrepreneurs and Media Personalities Tara and Hunter Fieri to Ownership Group": 0.8,
  "Marvell Downgraded by Benchmark After Reported Loss of Key Amazon Chip Designs": -0.8,
  "Burry May Be Short, But BoA Sees Nvidia and Palantir Moving Higher": 0.5,
  "Carvana to join S&P 500, Strategy buys more bitcoin": 0.5,
  "Can PepsiCo's Zero Sugar & Dew Flavors Sustain PBNA's Share Gains?": 0.2,
  "Market Loves Affirm at 54.6X Premium Valuation: But is Love Blind?": 0.6,
  "Netflix, Apple, Five Below: Top analyst calls today": 0.5,
  "Down 51.9% YTD, Is Lululemon Stock a Buy Ahead of December 11?": 0.1,
  "NVIDIA’s Strategic Partnership With Synopsys Aims to Accelerate AI-First R&D": 0.8,
  "TSMC Maintains Consensus Buy Rating With Over 20% Upside to $355 Price Target As of Early December": 0.8,
  "Nasdaq Turns Lower as AI Rally Loses Steam": -0.5,
  "Analysts Doubled Down on AMD in December Amid AI Wins and Growing Buy Ratings": 0.8,
  "How the Narrative Around Axon Enterprise Is Evolving Amid Mixed Orders and Long Term Growth Hopes": 0.2,
  "Can J&J Offset Stelara LOE, MedTech China and Legal Headwinds in 2026?": 0.0,
  "Comcast’s Warner Bros. Bid Was ‘Light’ on Cash, Co-CEO Says": 0.1,
  "Logicbroker Announces Partnership with PayPal to Make Agentic Commerce Accessible to Merchants at Scale": 0.8,
  "SoftBank, Nvidia looking to invest in Skild AI at $14 billion valuation, sources say - According to a Reuters report, SoftBank and Nvidia are in discussions to invest in Skild AI as part of a funding round that could exceed $1 billion and value the robotics-focused AI startup at around $14 billion. A term sheet seen by Reuters suggests this would be one of the largest private funding rounds in the robotics AI space so": 0.8,
  "Apple Chip Chief Tells Staff He’s Not Leaving ‘Anytime Soon’": 0.5,
  "MetaPlanet CEO Reveals Strategy-Style ‘MARS’ Plan to Supercharge Bitcoin Buying": 0.5,
  "Bitcoin Price Holding Above $85,000. Are We Out Of The Woods?": 0.5,
  "Strategy Buys Almost $1 Billion Worth of Bitcoin. It’s Just What the Stock Needs.": 0.8,
  "Synopsys Faces Balanced Risk-Reward Ahead of Fiscal 2026 Outlook, BofA Says": 0.5,
  "Apple to Enter AI Revolution in 2026, Wedbush Says": 0.5,
  "Tesla stock drops as new Morgan Stanley analyst downgrades shares, citing valuation": -0.7,
  "Why Micron Stock Popped Again on Monday": 0.5,
  "Why Lululemon (LULU) Shares Are Sliding Today": -0.5,
  "Why Broadcom (AVGO) Stock Is Trading Up Today": 0.5,
  "Why Lam Research (LRCX) Stock Is Up Today": 0.5,
  "Micron (MU) Stock Is Up, What You Need To Know": 0.5,
  "onsemi (ON) Stock Is Up, What You Need To Know": 0.5,
  "Costco Q1 Sales Trends Offer Insight Into Holiday Season Strength": 0.5,
  "Major Events in U.S. Stocks This Week - Monday (December 8) Volatility High volatility assets: BE, TTD Active areas in robotics: IRBT, SERV (catalyzed by the White House's robotics policy). IPO week's pricing/listing: CDNL, LMRI, WLTH Stocks released from lock-up: VOYG, AIRO ex-dividend ADI, ALB, UNH, GRMN Other highlights Golden Globe Award Nomination NFLX confirms acquisition of WBD for $72 billion. 11:00 Android XR Launch Event (GOOG / GOOGL) Investor meeting Barclays TMT Raymond TMT": 0.2,
  "Arm Holdings: The Engine Powering Behind Efficient AI Computing": 0.8,
  "Morgan Stanley Keeps Diamondback (FANG) Overweight as 2025 Guidance Comes Into Focus": 0.6,
  "SERHANT. and T-Mobile Join Forces to Turbocharge S.MPLE’s AI Engine and Transform Agent Mobile Productivity with SuperMobile": 0.5,
  "Marvell (MRVL) Upgraded to Strong Buy: Here's Why": 0.8,
  "Why Marvell Technology (MRVL) Stock Is Down Today": -0.5,
  "Michael Burry shares bold predictions for OpenAI, Palantir": 0.5,
  "Besides U.S. stock indices like VOO, QQQ, and VGT, another ETF I believe is suitable for long term holding in the AI era is MAGS. - MAGS ETF bundles the seven strongest tech giants into a single ETF. These seven companies are known as the Mag7. The philosophy behind investing in MAGS: Directly buy the seven most profitable companies. It represents an extremely concentrated version of tech exposure, more aggressive than holding QQQ/VGT. Its holdings": 0.6,
  "Regeneron’s (REGN) Recovery and Dupixent Strength Support BMO’s Outperform Rating": 0.6,
  "PayPal stablecoin nears $4bn as DeFi protocols drive adoption": 0.8,
  "Truist Stays Neutral on Analog Devices (ADI) Amid Strong Auto and AI Growth": 0.1,
  "Why Intel (INTC) Shares Are Plunging Today?": -0.7,
  "Time for (Selective) Caution in Tech. 3 Stocks With Bearish Charts.": -0.6,
  "Paramount Hijacks Netflix's Warner Bros Deal With $108B Power Play for the Whole Company": 0.2,
  "As Palantir Announces a TWG Partnership, Should You Buy, Sell, or Hold PLTR Stock?": 0.2,
  "Research Veteran Yardeni Ends 15-Year Tech Bet With Underweight Mag 7 Call": 0.2,
  "Is a Global Margin Call Coming? How a Bank of Japan Rate Hike Could Trigger the Next Market Shock": -0.6,
  "Tesla's $1 Trillion Dream Hits a Wall: Morgan Stanley Says the Stock May Have Run Too Far": -0.6,
  "Liberation Day Tariffs: Panic, Recovery, & What Comes Next": 0.2,
  "Don't bet against the Fed, Oracle's Larry Ellison: Fmr. Cisco CEO": 0.2,
  "3 Growth Companies With High Insider Ownership And 25% Return On Equity": 0.8,
  "Discover 3 Stocks Priced Below Estimated Value": 0.5,
  "Susquehanna Sees Stronger 2026 Performance From Broadcom’s (AVGO) Expanding ASIC Base": 0.8,
  "Can Coca-Cola's Innovation Pipeline Outrun Health-Conscious Shifts?": -0.5,
  "Apple won’t be the same in 2026. Meet the company’s next generation of leaders and rising stars after its biggest executive exodus in years": 0.2,
  "Jefferies Maintains Buy on Microsoft (MSFT) Amid Strong RPO Growth and Copilot Demand": 0.8,
  "SoftBank and Nvidia Explore Major Investment in Skild AI at $14 Billion Valuation": 0.8,
  "Apple Just Dropped a Global Fitness Bombshell--And It's Not What You Think": 0.5,
  "lululemon Pre-Q3 Earnings: Is it Wise to Buy Amid Evolving Headwinds?": -0.5,
  "CoreWeave Just Dropped a $2 Billion Bomb--And Investors Are Already Fleeing": -0.8,
  "Paychex Unveils Intelligent AI Solutions to Revolutionize Workforce Management": 0.8,
  "Ranking the Best \"Magnificent Seven\" Stocks to Buy for 2026. Here's My No. 1 Pick.": 0.6,
  "Analysts' 'AI Loser' List Points To Risks For Uber, Adobe, Intel And These Tech Players": -0.5,
  "AppLovin Stock In A Buy Zone With Profit Set To Rise": 0.8,
  "Apple exec. staying, Nvidia & SoftBank eye Skild AI: Reports": 0.2,
  "Carvana Stock Rallies—And May Have Further to Go Before Joining the S&P 500": 0.6,
  "Stock Market Today: Longtime Tech Bull Downgrades Mag7 Tech Giants In Surprising Pivot": -0.5,
  "The New Opportunities That Could Boost Coupang Stock in 2026": 0.6,
  "The Popular Wholesale Retailer That's Suing The Trump Administration": 0.1,
  "A Major Shift in Adobe’s (ADBE) Risk Geometry Points to Fresh Upside": 0.8,
  "Warner Bros. bidding war: Paramount & Netflix offers compared": 0.2,
  "MicroStrategy Buys More Bitcoin Despite Shareholder Concerns": 0.2,
  "Deepseek latest model, 3.2 Outperforms Alphabet's(GOOG)Gemini 3.0 Pro, despite Export Controls. - Deepseek just launched its latest model which outperform's GOOG's Gemini 3 pro and other models on benchmarks. For some reason, this hasn't been picked up by most financial media. The fact that China can produce the best LLM in the world despite export controls on American hardware companies suggests many things that are bearish for US tech: 1. **You don't need that large": 0.2,
  "Costco's new rule could be a costly mistake": -0.6,
  "Waymo crosses 450,000 weekly paid rides as Alphabet robotaxi unit widens lead on Tesla - Waymo, the robotaxi unit owned by Alphabet, has crossed 450,000 weekly paid rides, according to a letter from investor Tiger Global viewed by CNBC. That’s almost double the milestone it hit in April, when Waymo reported 250,000 paid robotaxi rides a week in the U.S. “Waymo is the clear leader in autonomous driving, recently surpassing 450k trips per week with": 0.8,
  "Sector Update: Tech Stocks Rise Monday Afternoon": 0.5,
  "Jared Kushner suddenly emerges in the Warner brawl between Paramount and Netflix, backed by Saudi billions and fresh off brokering another megadeal": 0.6,
  "Ex-Cisco CEO says 2026 will be a 'great year for AI'": 0.6,
  "A Key Moment for AI Stocks Comes This Week—and It Has Nothing to Do With Nvidia": 0.2,
  "AI Finance Revs Up With Convertible Bonds": 0.5,
  "Tesla Stock Just Got Downgraded by a Major Wall Street Firm. Here's Why.": -0.7,
  "Market Weakening: Fed Signals, Overvaluation, Nasdaq Double Top Formation - US stocks weakened overall today, primarily due to market uncertainty surrounding the Fed's future interest rate policy, rising bond yields, and some institutions reducing their holdings due to concerns about overvaluation in the technology sector, leading to cautious market sentiment. Major stock indices and the Nasdaq ETFs (SPY, QQQ) all declined slightly; Apple shares fell, Google shares fell more, while Microsoft remained relatively resilient, rising": -0.6,
  "The S&P 500 Falls. Tech Is the Only Sector Rising.": -0.5,
  "PepsiCo to review North American supply chain amid Elliott talks": 0.1,
  "Equity Markets Fall Intraday as Netflix, Tesla Weigh": -0.7,
  "Elon Musk Says He Warned Donald Trump To Drop Tariffs Over Fears of Job Losses: 'President Loves Tariffs, I've Tried To Dissuade Him'": 0.2,
  "Daktronics to Report Q2 Earnings: What's in Store for the Stock?": 0.2,
  "Is Tesla Really Slowing Down or Just Resetting? - After following Tesla closely for a while now, I keep wondering if what i'm seeing is just a pause or something more significant. Free cash flow jumped by over 540% in FY 2025 Q3, which is huge, but at the same time gross margin dropped to 17% and EPS growth fell by 64%. It makes me think how a company can produce that much cash while": 0.2,
  "Bet on These 5 Top-Ranked Stocks With Rising P/E": 0.5,
  "Why 2026 Could Be the Breakout Year for Dividend Growth Investors": 0.6,
  "Analysts Are Betting on Broadcom Stock for 2026. Should You Load Up on Shares Now?": 0.5,
  "Bitget sees record 4,468% surge in tokenized U.S. stock futures volume": 0.8,
  "Have Capital Gains in 2025? 3 Ways to Reduce the Tax Burden.": 0.5,
  "Celsius (CELH) Stock Trades Up, Here Is Why": 0.5,
  "Does VXUS concern you? - For those of you that are Perma bears on the USA. Aren’t you concerned by the returns of VXUS? I see everyone saying to switch from S&P 500 to VXUS but the all time returns are abysmal. This sub won’t let me post an image of it, but it’s 52% return since 2011 and a 27% return in the last 5 years. I’m all for “diversification” but damn": -0.6,
  "Why Tesla (TSLA) Shares Are Sliding Today": -0.5,
  "Apple’s Chips Chief Says He Isn’t Leaving": 0.5,
  "Why Broadcom Stock Popped on Monday": 0.5,
  "STEM Next Opportunity Fund and Qualcomm Partner on Pilot to Bring AI Learning to Afterschool": 0.5,
  "Why Marvell Technology Sank Today": -0.5,
  "NextEra Signs Big Google, Meta Deals. Why the Stock is Falling.": -0.5,
  "Tachyum Defends TPU® Trademark from Infringement by Google TPU": -0.5,
  "Meta Platforms Stock Jumps on Metaverse Spending Cuts. Here's Why the Growth Stock Is a Screaming Buy Before 2026": 0.8,
  "Alphabet's Google Unit Launches Updates for Galaxy XR": 0.5,
  "Quantum Computing Outlook Shines: 2 Stocks to Watch Heading into 2026": 0.8,
  "NVIDIA Vs. Palantir: Which is the Best AI Stock to Buy for 2026?": 0.5,
  "Does Nvidia Have Too Much Cash? Unpacking the Case for More NVDA Stock Buybacks, Larger Dividends, and Less Deals.": 0.2,
  "Maker of ICE-Tracking App Says Trump Officials Violated Free-Speech Rights": -0.5,
  "Market Chatter: Google Plans 2026 Launch of Next-Gen AI Glasses Featuring Gemini": 0.5,
  "How to Hedge AI-Heavy Portfolios Before the Bubble Pops (or Starts To Deflate)": -0.5,
  "Can Google Stock Hit $400 in 2026?": 0.2,
  "Trump approves Nvidia H200 chips for sale to China": 0.2,
  "10 Dividend Stocks That Look Better Than Bonds": 0.5,
  "Wave Life skyrockets on obesity drug trial, Strategy buys bitcoin": 0.6,
  "Netflix vs Paramount Skydance: The $108B Battle for HBO, Harry Potter, and DC - Who Wins? - Okay so this is getting spicy. We officially have a bidding war for Warner Bros Discovery and I genuinely don't know who wins here. Want to hear what you all think. ## Quick background **Friday (Dec 5):** [Netflix announced a deal to buy WBD's studio and streaming assets](https://www.npr.org/2025/12/05/g-s1-100873/netflix-buys-warner-bros-discovery-studio-streaming) for $72B ($27.75/share). This gets them HBO Max, Harry Potter,": 0.5,
  "Stock market today: Dow, S&P 500, Nasdaq fall as Netflix skids on deal drama, Nvidia rises": -0.2,
  "Sector Update: Consumer Stocks Slide Late Afternoon": -0.5,
  "The S&P 500's Record Bid Stalls Again Ahead of Fed Decision": -0.5,
  "NextEra Energy Transmission and Exelon Power Pennsylvania and West Virginia's Energy Future": 0.5,
  "What to know about Paramount's hostile bid for Warner Bros. Discovery": 0.1,
  "Tesla Stock Drops on a Downgrade. Why Its Price Target Was Raised.": -0.5,
  "Kymera Rockets, Pulling Nurix Higher. Does It Have The Next Dupixent?": 0.2,
  "Morgan Stanley Hands Tesla Stock A New Rating, Sees Musk Hitting This Many Pay Deal Milestones": 0.5,
  "Alphabet (GOOGL) Stock Trades Down, Here Is Why": -0.5,
  "These Stocks Moved the Most Today: Warner Bros., Paramount, Netflix, Tesla, CoreWeave, Confluent, Marvell, Carvana, and More": 0.1,
  "Microchip Technology to Present at the Barclays 23rd Annual Global Technology Conference": 0.5,
  "Paramount Goes Straight To Warner Bros. Shareholders, Sidesteps Netflix": 0.2,
  "Paramount Launches Hostile Bid for Warner Bros. Why It Says Its Offer Is Better Than Netflix’s.": -0.5,
  "Wall Street Sours On Netflix Stock Amid Warner Bros. Acquisition": -0.6,
  "An EV Winter Is Coming. Lucid Stock Falls on Downgrade.": -0.6,
  "Will the Netflix-Warner Bros. Merger Go Through? It Depends on How You Define Market Share.": 0.1,
  "Breakout Watch: Robinhood Stock Makes Bullish Move In Volatile Base": 0.6,
  "Netflix Faces a Bidding War for Warner—and the Stock Market Hates the Idea": -0.6,
  "Marvell Stock Down As Microsoft Mulls Switch To Broadcom For Custom Chips": -0.5,
  "Marvell Stock Is the Biggest Loser From Amazon’s New Chip. This Downgrade Proves It.": -0.8,
  "PepsiCo Announces Priorities to Enhance Shareholder Value and Provides Preliminary 2026 Financial Outlook": 0.5,
  "Whoever Replaces Tim Cook at Apple Will Have 'Big Shoes to Fill'": 0.5,
  "Why Netflix's New Growth Strategy Could Reshape the Entire Streaming Landscape": 0.8,
  "Paramount Makes $77.9 Billion Hostile Bid for Warner After Netflix Struck Deal": 0.6,
  "Stocks to Watch Monday Recap: IBM, Boeing, Broadcom, CoreWeave": 0.0,
  "This Energy Provider Is the Latest to Score Big AI Data Center Deals": 0.6,
  "Stock Market Today: Dow Falls As Trump Says This; Warren Buffett's Berkshire Tests Key Level (Live Coverage)": 0.1,
  "Dow Falls as Investors Count Down to Fed Meeting": -0.5,
  "S&P 500, Nasdaq Snap 4-Day Advance as Netflix Slides": -0.5,
  "Earnings live: Toll Brothers stock falls on margin softness; investors look to Oracle, Broadcom results ahead": -0.2,
  "US Equity Indexes Decline as Rising Treasury Yields Signal Divided Fed, Cautious Interest Rates Outlook": -0.5,
  "Investor letter reveals skyrocketing growth of Waymo’s robotaxi rides": 0.8,
  "A Low-Cost Model 3 Just Hit the Streets in Europe. Can That Help Turn Tesla Stock Around?": 0.2,
  "TempraMed Announces Strategic Agreement with Maccabi Healthcare Services, a Leading HMO with over 2.8 Million Patients": 0.8,
  "Trump greenlights Nvidia H200 AI chip sales to China, says Xi responded positively - President Donald Trump on Monday said the United States will allow tech giant Nvidia to ship its H200 artificial intelligence chips to “approved customers” in China and elsewhere, under a set of conditions. Chinese President Xi Jinping “responded positively” to the proposal, Trump wrote in a Truth Social post. Trump’s post appeared to state that 25% of the chips sales will": 0.6,
  "Nvidia Stock Rises After Trump Approves H200 Chip Sales to China": 0.5,
  "US to allow Nvidia to ship H200 chips to China, Trump says": 0.2,
  "Trump says he will allow Nvidia to sell some AI chips in China": 0.2,
  "Paramount’s hostile bid for WBD comes down to shareholder value": 0.1,
  "Top Stock Reports for Meta, SAP & Booking": 0.0,
  "PepsiCo Launching Measures to Boost Shareholder Value After Engagement With Elliott Investment": 0.5,
  "Former Trump ally praises Michael Saylor's new Bitcoin move": 0.5,
  "Elon Musk Calls Cybertruck Tesla's 'Best Ever' — But Sales Say Otherwise": -0.5,
  "Netflix shares drop after Paramount launches hostile takeover bid": -0.7,
  "Netflix CEO Untroubled By Paramount. Hostile Bid For Warner Bros. 'Entirely Expected.'": 0.5,
  "PepsiCo Announces Moves to Boost Sales, Cut Costs in 2026": 0.5,
  "Whoever wins Warner Bros. deal will 'transform the media industry'": 0.8,
  "PepsiCo to Cut Costs, Lower Food Prices in Deal With Activist": 0.2,
  "Intuitive Surgical, Inc. (ISRG) Declines More Than Market: Some Information for Investors": -0.2,
  "Comcast (CMCSA) Declines More Than Market: Some Information for Investors": -0.5,
  "Dow Jones Futures: Astera, Netflix, Nvidia, Tesla Are Big Movers; Toll Brothers Sells Off Late": 0.2,
  "Tether Invests in Italian Robotics Startup Generative Bionics Amid Humanoid Hype": 0.5,
  "Paramount Made a Hostile Bid for Warner After Netflix Deal. What Happens Next?": -0.5,
  "Netflix CEO brushes aside Paramount’s ‘entirely expected’ hostile bid, ‘super confident’ of closing deal with Warner Bros. Discovery": 0.6,
  "Better Artificial Intelligence (AI) Pick for 2026: Alphabet or Nvidia Stock?": 0.5,
  "Why Paramount Skydance Stock Crushed it Today": 0.8,
  "“LEQEMBI®” (lecanemab) for the Treatment of Early Alzheimer’s Disease Included in China’s Commercial Insurance Innovative Drug List": 0.5,
  "Stock market today: Dow, S&P 500, Nasdaq futures climb as Nvidia jumps ahead of Fed rate meeting kickoff": 0.6,
  "PepsiCo to cut prices, eliminate products as part of a deal with an activist investor": 0.2,
  "Carvana $CVNA is Highly Fraudulent - Credentials: 14 year automotive veteran. 15 year options trader Bullet Points: 1) Carvana’s profit margins are too good to be true. The best companies in the industry don’t come close to their 19% gross profit margins. 2) The CEO of Carvana (Ernest Garcia III) Also owns a privately owned auto business named Drivetime. Drivetime is a dumpster fire. 3) Ernest Garcia III has been funneling his unwanted Carvana inventory": -0.8,
  "Combs’ Departure from Berkshire Leaves a Gap in Managing Equity Portfolio": -0.5,
  "What to Know About the Battle for Warner Bros. Discovery": 0.0,
  "$GIPR a real estate stock you should have your eyes on - Real estate stocks should be on your radar as many are bottomed out and have lots or room on their charts to make big moves. Decembers FOMC rate cut decision is Wednesday and there is a 94% chance of a rate cut this week. the market is also pricing a 70% chance for a rate cut in January. Trump is pounding the table": 0.6,
  "Verizon CEO reveals mistakes that led to over 13,000 layoffs": -0.8,
  "Shaq Refused To Spend $80,000 On A Security System. Instead, He Invested In A Startup Jeff Bezos Eventually Bought For $1B": 0.8,
  "PepsiCo Plans Layoffs as It Looks to Wrap Up Elliott Talks": -0.5,
  "What is a hostile takeover bid?": 0.0,
  "How Recent Shifts In The Story Give Constellation Energy An Edge Against Competitors": 0.5,
  "Palantir (PLTR): Evaluating Valuation After New AI Partnerships and the Launch of Chain Reaction Platform": 0.5,
  "Why Netflix Stock Dropped Today": -0.5,
  "Why Warby Parker Stock Was a Winner Today": 0.5,
  "How Walmart, Target, Amazon pay holiday workers (and who's hiring)": 0.2,
  "Jeff Bezos Once Said The Universe Wants You To Be 'Typical,' But There Is A Price To Pay For Being Yourself As Well: 'Not Easy Or Free'": 0.1,
  "Lowe’s has a new Christmas product parents will love": 0.8,
  "Where Will Super Micro Computer Stock Be in 5 Years?": 0.0,
  "Paramount rips Warner’s sale ‘process’ as it reveals 2-year-long pursuit, escalating bids before going hostile": 0.2,
  "Nvidia Rises As Trump OKs H200 AI Chip Sales In China": 0.5,
  "O'Reilly Automotive (ORLY): Taking Stock of Valuation After a Recent Share Price Pullback": 0.2,
  "Trump says US will allow sale of Nvidia AI chips to China": 0.2,
  "Nvidia vs. Broadcom: Which Is the Better AI Chip Stock to Own in 2026?": 0.2,
  "Behind Paramount’s Relentless Campaign to Woo Warner Discovery and President Trump": 0.1,
  "Should You Buy Stock Splits?": 0.0,
  "US Detains Two Men Accused of Smuggling Nvidia AI Gear to China": -0.8,
  "Trump clears way for Nvidia to sell powerful AI chips to China": 0.2,
  "Microsoft sends harsh message to millions of Microsoft 365 customers": -0.8,
  "Has civil asset forfeiture ever hit stocks? - What forms of damages/theft can Civil Asset Forfeiture take that I should be worried about? We have a lot of stories about Civil asset forfeiture out there already. Most of them are about cash and metals in vehicles or safe deposit boxes. Stuff that's tangible. In some cases, document folders too, because they might have a method to get more money. However, I have only seen one": 0.1,
  "Trump Says U.S. Will Allow Nvidia H200 Chip Sales to China, Get 25% Cut": 0.2,
  "Nvidia Wins Approval to Sell H200 Chips in China": 0.5,
  "Amazon issues urgent alert on recalled portable batteries": -0.8,
  "Nvidia Stock Pops After President Trump OKs Sales of New H200 AI Chips to China": 0.6,
  "FXTRADING.com Appoints Amit Kaushik as Chief Marketing Officer to Accelerate Global Growth and Brand Expansion": 0.6,
  "Earnings To Watch: Adobe (ADBE) Reports Q4 Results Tomorrow": 0.2,
  "BMNR's biggest asset has a major new usage. - [https://www.cftc.gov/PressRoom/PressReleases/9146-25](https://www.cftc.gov/PressRoom/PressReleases/9146-25) Today marks the launch of the CFTC's new program. This represents a significant evolutionary step for BMNR's largest asset, ETH, in gaining acceptance. During the first three months of the pilot program, Ethereum will be permitted to serve as institutional-grade collateral in the derivatives market. It will permit Futures Commission Merchants (FCMs) to accept Ethereum as margin with enhanced reporting requirements. Tokenized Treasuries and Money-Market": 0.8,
  "Amazon's Next Chapter: A Look Back at 2025 and What Investors Should Expect in 2026": 0.5,
  "Michael Saylor Just Made His Biggest Bitcoin Bet of H2 2025": 0.5,
  "Tech ETF XLK on Its Way for Longest Rally Since 2020: Here's How": 0.5,
  "Morgan Stanley cuts Tesla's stock rating from 'buy' for the first time in 2 years on valuation concerns": -0.6,
  "$12B farm aid, Tesla downgrade, and NVIDIA chips: Stock Market News": 0.2,
  "Asian shares slip after Wall Street pulls back from its record heights": -0.5,
  "US to allow Nvidia H200 chip shipments to China, Trump says": 0.2,
  "Google, Warby Parker to launch Gemini AI-powered smart glasses in 2026 - Source: https://www.reuters.com/business/warby-parker-google-launch-ai-powered-smart-glasses-2026-2025-12-08/ Dec 8 (Reuters) - Warby Parker said on Monday it is collaborating with Alphabet's Google to develop lightweight AI-powered glasses, with the first product expected to launch in 2026. The announcement, made during The Android Show | XR Edition, marks the first time the companies have set a public timeline for the release since unveiling the partnership earlier this year. Google": 0.6,
  "Marvell Stock Faces Heavy Sell-Off After Benchmark Flags Amazon Design Loss": -0.8,
  "Broadcom Breaks Out to All-Time High as UBS Sees Explosive AI Demand": 0.8,
  "Trump greenlights exports of Nvidia H200 chips to China": -0.5,
  "How Investors May Respond To Advanced Micro Devices (AMD) Rack-Scale AI Push With Vultr And HPE": 0.2,
  "Bitcoin's 2025 rollercoaster may end on a low": -0.6,
  "2 Potential Stock Splits to Watch for in 2026": 0.5,
  "ASML customers include at least one with Chinese military links, Nieuwsuur reports": -0.5,
  "Is Jane Street Behind Bitcoin’s Daily Dumps? Chart Pattern Raises Big Questions": -0.5,
  "Strong Momentum expected for Data Center AI Chip Packaging in 2025-2030": 0.8,
  "Why Is The Crypto Market Up Today?": 0.2
}