{
  "5 Reasons Lululemon Stock Can Bounce Back": 0.5,
  "3 Artificial Intelligence ETFs to Buy With $100 and Hold Forever": 0.5,
  "Strength Seen in Travere (TVTX): Can Its 26.2% Jump Turn into More Strength?": 0.6,
  "Trending tickers: Klarna, Alibaba, Opendoor, Synopsys and Fevertree": 0.0,
  "Which UK Regions Splurged or Saved on Summer ’25 Travel?": 0.0,
  "Marriott opens first dual-branded hotel in Las Vegas": 0.5,
  "Marriott’s StudioRes expansion continues with tenth hotel": 0.5,
  "Is lululemon athletica Stock Underperforming the S&P 500?": -0.5,
  "Kraft Heinz split may come too late to fend off growing MAHA threat": -0.5,
  "7 No-Brainer Robotics Stocks to Buy Right Now": 0.5,
  "Social Buzz: Wallstreetbets Stocks Advance Premarket Thursday; Opendoor Technologies, Synopsys to Open Higher": 0.5,
  "GE HealthCare inks Icometrix buyout to acquire brain MRI software": 0.5,
  "Calculating The Intrinsic Value Of Marvell Technology, Inc. (NASDAQ:MRVL)": 0.1,
  "1 Thing I Can't Stop Thinking About Following O'Reilly Automotive's Recent Earnings Report": 0.5,
  "Multiple LTL carriers report August volume declines": -0.5,
  "Latest News In Energy Transition - Renewable Growth Opportunities in Middle East and Africa Regions": 0.5,
  "How Cadence's (CDNS) Expanded Digital Twin Platform With NVIDIA Could Shape AI Infrastructure Development": 0.5,
  "T-Mobile (TMUS): Taking a Closer Look at Valuation After Recent Share Price Pause": 0.2,
  "Kraft Heinz Post-Split Fate Uncertain as Analysts Recall Kellogg M&As": 0.1,
  "Exploring PACCAR (PCAR) Valuation: Is the Market Overlooking Opportunity?": 0.5,
  "AI-Fueled Cybersecurity Market Makes These 3 Stocks Worth Buying": 0.6,
  "Opendoor, Alibaba, Synopsys: Trending Stocks": 0.0,
  "Starbucks Teams With AI Startup NomadGo To Automate Counting In 11,000 Stores — CTO Says Goodbye To Manual Tallies Forever": 0.6,
  "Waterford Hotel Group Takes the Helm at Aloft & Element Arundel Mills BWI Airport": 0.5,
  "Are Options Traders Betting on a Big Move in Thomson Reuters Stock?": 0.2,
  "Take-Two Interactive to Host Webcast of 2025 Annual Meeting of Stockholders": 0.2,
  "The Trade Desk (TTD) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Starbucks Corporation (SBUX) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "lululemon athletica inc. (LULU) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Vertex Scientists Awarded the 2025 Lasker~DeBakey Clinical Medical Research Award for Pioneering Discoveries in Cystic Fibrosis": 0.8,
  "Starbucks Nears Sale of China Stake as Bidders Line Up": 0.5,
  "Sector Update: Energy Stocks Decline Pre-Bell Thursday": -0.5,
  "Company News for Sep 11, 2025": 0.0,
  "Is It Worth Investing in Take-Two (TTWO) Based on Wall Street's Bullish Views?": 0.5,
  "Wall Street Bulls Look Optimistic About Intuitive Surgical (ISRG): Should You Buy?": 0.8,
  "Diamondback Energy Stock: Is FANG Underperforming the Energy Sector?": 0.1,
  "Union Pacific, Norfolk Southern: Rival alliances bolster merger case": 0.5,
  "Is Exelon Stock Underperforming the S&P 500?": -0.5,
  "Is Climb Bio, Inc. (CLYM) Stock Outpacing Its Medical Peers This Year?": 0.2,
  "Are You a Value Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Guggenheim bullish on Atlassian and GitLab as AI adoption to fuel growth": 0.8,
  "Apple downgraded, Nvidia upgraded: Wall Street's top analyst calls": 0.2,
  "Here's Why Qualcomm (QCOM) is a Strong Momentum Stock": 0.8,
  "Baker Hughes Signs Equipment Contract with Geothermal Developer Fervo": 0.5,
  "When Should You Buy Honeywell International Inc. (NASDAQ:HON)?": 0.0,
  "Can MRVL Sustain EPS Momentum as AI Competition Heats Up?": 0.1,
  "Synopsys Stock Rises. Why This Analyst Sees a Buying Opportunity After Wednesday’s Pummeling.": 0.6,
  "Can AMAT Maintain Strong Margins Amid Rising R&D Expenses?": -0.5,
  "Micron Reports Earnings Soon. Watch for This Surprise.": 0.5,
  "Starbucks Corporation (SBUX): Jim Cramer Wonders Whether CEO Might Not Have Realized How Broken Things Were": -0.5,
  "AI Chip Stock Astera Labs Breaks Out Past Rare Buy Point With This Bullish Signal": 0.8,
  "Fabrinet vs. TE Connectivity: Which Electronics Stock is the Better Buy?": 0.2,
  "2 Growth Stocks Down 20% or More to Buy Right Now": 0.5,
  "Old Dominion Faces Analyst Split After Earnings Miss and August LTL Decline": -0.5,
  "EPAM vs. CSGP: Which Stock Is the Better Value Option?": 0.0,
  "ARM's 11% Rise in Three Months: Should You Buy, Hold, or Sell?": 0.2,
  "Honeywell Unveils Ionic Modular All-in-One BESS for Industrial Use": 0.5,
  "Update: Q2 Metals Up 3% as Clarifies Technical Disclosure on Cisco Lithium Project": 0.5,
  "Lam Research (LRCX) Shares Skyrocket, What You Need To Know": 0.8,
  "DAT thanks truck drivers with free BBQ and giveaways Sept. 15-16": 0.6,
  "Qualcomm and Harman forge alliance to elevate AI in car cockpits": 0.5,
  "The ELC Awards $2 Million in Scholarships to More Than 100 Emerging Business Leaders in 2025 Cohort": 0.8,
  "Starbucks Opens First Spain Flagship Store Inside Real Madrid’s Bernabéu Stadium": 0.5,
  "QUALCOMM (QCOM) Expands its Collaboration with Google Cloud": 0.5,
  "Wall Street is Bullish on PDD Holdings (PDD), Here’s Why?": 0.8,
  "Amgen Inc (AMGN) Releases Top-Line Results From ASCEND Study of Rocatinlimab": 0.5,
  "TD Cowen Remains Bullish on On Semiconductor Corporation (ON)": 0.6,
  "Phase III success for Regeneron signals pozelimab and cemdisiran’s entry into MG market": 0.6,
  "T-Mobile US Increases Synergy Expectations, Accelerates Integration of UScellular Acquisition": 0.8,
  "Fiserv Acquires CardFree to Enhance Clover Point-of-Sale System": 0.5,
  "1 Reason Every Investor Should Know About Intuitive Surgical (ISRG) Stock": 0.5,
  "Starbucks Faces Scrutiny as CEO's Pay Is 6,666 Times That of the Median Barista": -0.8,
  "3 Stocks Estimated To Be Trading Below Intrinsic Value By Up To 47.5%": 0.5,
  "KLA (KLAC) Sees 10% Share Price Rise Over Past Week": 0.6,
  "Oracle's blockbuster surge shows AI trade's growing influence on market": 0.8,
  "Why Lam Research Rallied Today": 0.5,
  "StandardAero Opens Expanded Augusta Facility to Increase Business Aviation MRO Capacity": 0.5,
  "Why Zscaler (ZS) Stock Is Trading Up Today": 0.5,
  "Gilead Sciences Commits To Veeva Systems (VEEV) For Vault CRM Suite": 0.5,
  "Equipment Check: Charts Show Energy Services Stocks Poised to Rally": 0.8,
  "Why Synopsys Stock Bounced Higher Today": 0.5,
  "Arm Holdings (ARM) Stock Surges 17% In One Week": 0.8,
  "Biotechs Could Benefit If RFK Jr. Leaves HHS": 0.2,
  "Datadog Appoints Ami Vora to Its Board of Directors": 0.5,
  "The Estée Lauder Cos. Taps PepsiCo’s René Lammers as Chief Research & Innovation Officer": 0.5,
  "How to Buy the Dip in Synopsys Stock with a 2:1 Reward/Risk Ratio": 0.6,
  "Booking Holdings Bets on Agentic AI to Challenge Big Tech": 0.5,
  "Fresh Video Game Data Is Positive For Roblox Stock": 0.8,
  "These Stocks Moved the Most Today: Warner Bros., Oracle, Micron, Opendoor, Synopsys, Centene, Delta, and More": 0.0,
  "Baker Hughes Secures Order for Rio Grande LNG Expansion": 0.5,
  "Hyatt Hotels, Marriott Vacations, Travel + Leisure, Xponential Fitness, and Polaris Shares Skyrocket, What You Need To Know": 0.8,
  "Cognizant Pledges to Expand AI Education and Upskill Workforce": 0.8,
  "US oil titan to cut up to 25% of its workforce — impacting thousands. So what happened to ‘drill baby drill’?": -0.6,
  "Why Zscaler Stock Topped the Market on Thursday": 0.5,
  "Take-Two Interactive (TTWO) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "PepsiCo (PEP) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "Qualcomm (QCOM) Laps the Stock Market: Here's Why": 0.5,
  "Gilead Sciences (GILD) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "OpenAI, ORCL, NVDA and the UK - The question has to be asked, who is funding OpenAI moving forward? $300 billion to Oracle. Projected cash burn through 2029 is $115 billion (as of a few days ago). And now this comes out: OPENAI, NVIDIA TO ANNOUNCE BILLIONS IN UK DATA CENTER PROJECTS So that lands them in the realm of needing maybe $500+ billion in the next 4 years? They don’t make money, they burn": -0.6,
  "Agoda Maps Asia's Appetite for Regional Food-Focused Tourism as Hoteliers Eat Up the Benefits": 0.6,
  "2 High-Flying Stocks to Target This Week and 1 We Ignore": 0.2,
  "1 High-Flying Stock to Own for Decades and 2 We Avoid": 0.5,
  "3 Growth Stocks Set to Flourish": 0.5,
  "2 Profitable Stocks for Long-Term Investors and 1 We Brush Off": 0.2,
  "Jim Cramer on AppLovin: “It’s a Buy”": 0.6,
  "Jim Cramer on Fortinet: “That’s Actually the Weakest of the Cybersecurities”": -0.6,
  "Jim Cramer on Marvell: “The Guidance Was Not What I Wanted”": -0.5,
  "Is CoStar Group Stock Underperforming the Nasdaq?": -0.5,
  "Cadence (CDNS) Stock Jumps 4.8%: Will It Continue to Soar?": 0.6,
  "Puts on Duolingo - Been watching this stock for a while. It had a surge yesterday and is now sitting at $310, still down from its ath of $545. This upward movement came from 2 analysts increasing their price target to $400. It had a similar spike back on August 18th when it increased to $370, which was then followed by a large sell off down to $270. Same reason, an analyst made an upgrade.": 0.2,
  "Meet the Impressive Growth Stock That's Up More Than 700% Since IPO and Is Poised to Join the S&P 500": 0.8,
  "Kraft Heinz opens a new tomato processing plant in Portugal": 0.5,
  "Starbucks shortlists five candidates for China stake sale": 0.1,
  "If Pepsi Wants to Win, It Has to Play Coke’s Game": 0.2,
  "r/Stocks Daily Discussion & Fundamentals Friday Sep 12, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is": 0.2,
  "Marriott’s Moxy brand makes debut in Northern Ireland": 0.5,
  "Starbucks unveils Spanish flagship outlet at Bernabéu Stadium, Madrid": 0.5,
  "Meet the Artificial Intelligence (AI) Stock That's Crushing Nvidia on the Market in 2025": 0.8,
  "Starbucks Whips Up Big Bids for Its Chinese Biz": 0.5,
  "Charter Communications (NASDAQ:CHTR) Has A Somewhat Strained Balance Sheet": -0.5,
  "Is DoorDash, Inc.'s (NASDAQ:DASH) Recent Stock Performance Influenced By Its Fundamentals In Any Way?": 0.1,
  "Values Cap Wall Street Pre-Bell, Asia Up, Europe Off": 0.2,
  "Mizuho downgrades Applied Materials on China competition risks": -0.6,
  "Applied Materials Announces Cash Dividend": 0.5,
  "How Is Verisk Analytics' Stock Performance Compared to Other Industrial Stocks?": 0.1,
  "AI Chips Update - Edge Video Streaming Revolution Powered By Advanced AI Hardware": 0.8,
  "Earnings growth outpaced the decent 9.8% CAGR delivered to Datadog (NASDAQ:DDOG) shareholders over the last five years": 0.6,
  "Earnings live: Adobe stock rises on upbeat sales outlook, RH slides as tariffs bite": 0.5,
  "Roper's Application Software Growth Picks Up: A Sign of More Upside?": 0.6,
  "Applied Materials Faces Growing Risks in China, Analyst Says. The Stock Falls.": -0.7,
  "Maia’s NSCLC immunotherapy secures Phase II efficacy win": 0.6,
  "Can CEG's Energy Efficiency Products Act as a Growth Catalyst?": 0.2,
  "Should You Add IDEXX Stock to Your Portfolio Right Now?": 0.2,
  "Break Free: Borderlands®4 Now Available Worldwide": 0.5,
  "Best Buy Appoints Meghan Frank to Board of Directors": 0.6,
  "ASML Is Betting Big on AI Giant Mistral. Does That Make ASML Stock a Buy, Sell, or Hold Here?": 0.2,
  "How to Boost Your Portfolio with Top Computer and Technology Stocks Set to Beat Earnings": 0.8,
  "Intuitive Surgical, Inc. (ISRG) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Vertex Pharmaceuticals Incorporated (VRTX) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Is Trending Stock Applied Materials, Inc. (AMAT) a Buy Now?": 0.2,
  "Cisco Systems, Inc. (CSCO) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "KDP strikes distribution deal for Cove Soda in Canada": 0.5,
  "How will the market react to secondary tariffs on china/India? - [https://www.bloomberg.com/news/articles/2025-09-12/us-proposes-broad-g-7-sanctions-on-russian-energy-to-end-war](https://www.bloomberg.com/news/articles/2025-09-12/us-proposes-broad-g-7-sanctions-on-russian-energy-to-end-war) Apparently Trump wants the EU to impose upto 50/100 percent tariffs on china and india to pressure Russia to end the war, and he will do the same. What are you guys thoughts?": -0.5,
  "Exchange-Traded Funds Higher, Equity Futures Mixed Ahead of September Consumer Sentiment Report": 0.2,
  "(09/12) Interesting Stocks Today- An AI for an AI makes the whole world blind? - Hi! I am an ex-prop shop equity trader. This is a daily watchlist for short-term trading: I might trade all/none of the stocks listed, and even stocks not listed! I am targeting potentially good candidates for short-term trading; I have no opinion on them as investments. The potential of the stock moving today is what makes it interesting, everything else": 0.2,
  "Lam Research vs. Micron: Which Semiconductor Stock Is the Better Bet?": 0.5,
  "Intuitive Introduces Real-Time Surgical Insights for da Vinci 5": 0.5,
  "Unlocking Zscaler (ZS) International Revenues: Trends, Surprises, and Prospects": 0.5,
  "Sector Update: Energy Stocks Advance Premarket Friday": 0.5,
  "Wall Street Set to Open Little Changed Friday Ahead of Consumer Sentiment Report": 0.0,
  "Paychex Recognized as One of America’s Greatest Companies and Most Admired Workplaces by Newsweek": 0.8,
  "Wall Street Analysts See Constellation Energy Corporation (CEG) as a Buy: Should You Invest?": 0.5,
  "How Is Electronic Arts' Stock Performance Compared to Other Video Gaming and eSports Stocks?": 0.2,
  "Is AppLovin (APP) Outperforming Other Business Services Stocks This Year?": 0.2,
  "Synopsys (SNPS) Soars 13% on 4 Analysts’ “Buy” Calls": 0.8,
  "Cisco - The Data Catalyst: Blended Finance Paving the Way for Climate AI Solutions": 0.5,
  "Here's Why Qualcomm (QCOM) is a Strong Growth Stock": 0.8,
  "CN and CSX tout railroad collaboration to power growth": 0.5,
  "Is ON Semiconductor Stock Underperforming the S&P 500?": -0.5,
  "Baker Hughes Wins Key Contract to Support Sakarya Gas Field Phase 3": 0.6,
  "Berkshire + ASML: The Investment That Never Happened, Why? - ASML fits many of Buffett’s usual criteria: near-monopoly, critical infrastructure, decades of R&D. Yet Berkshire has never owned it, at least to my knowledge. What’s your take? Was it too ‘tech’, too cyclical, or something else?": 0.2,
  "Is $ORCL secretly SoftBank in a mask? - Let me get this straight: * Oracle announces $455B in RPOs through 2030, driving stock up 40% in a single day * $300B of this (66%) depends on a single contract with OpenAI starting in 2027 * OpenAI's funding for this contract comes from SoftBank's $500B Stargate commitment * SoftBank's total assets are $300B - meaning they'd need to liquidate their entire company just for the Oracle": 0.2,
  "Baker Hughes Stock: Is BKR Outperforming the Energy Sector?": 0.5,
  "Form 8.3 - Qualcomm Incorporated": 0.0,
  "Stock Market Runs To Highs On Surging Oracle, Fed Rate Cut Hopes: Weekly Review": 0.6,
  "Gartner predicts Fortune 500 companies won’t eliminate human agents anytime soon": 0.2,
  "AppLovin price target raised as Wedbush sees ’vast, growth potential": 0.8,
  "Baker Hughes to supply liquefaction equipment for Rio Grande LNG’s Train 4": 0.5,
  "AppLovin Poised to Benefit 'Handsomely' From Gaming Momentum, Wedbush Says": 0.8,
  "Applied Materials, Inc. (AMAT) Reaffirms Its Forecast for High-End Chipmaking Tools; Cantor Fitzgerald Maintains Bullish Stance": 0.8,
  "QUALCOMM Incorporated (QCOM) and BMW Launches Snapdragon Ride Pilot, A Next-Generation Automated Driving System": 0.6,
  "Why Shares in Synopsys Tumbled This Week": -0.5,
  "Honeywell International Inc. (HON) Announces $600 Million Equity Capital Raise for Its Quantum Subsidiary Quantinuum": 0.5,
  "Okta Shares Rise 17% Year to Date: Buy, Sell or Hold the Stock?": 0.2,
  "RH, Lululemon, Alaska Air: Wall Street analyst calls": 0.1,
  "Tariff-Driven Price Increases Taking Hold, With More Hikes on the Cards, Oppenheimer Study Shows": -0.5,
  "The Kroger Co. (KR) “Had A Very Good Number,” Says Jim Cramer": 0.8,
  "AppLovin Stock Could Rise 25%, Analyst Says. Here’s Why.": 0.8,
  "Intuitive adds new real-time insights to da Vinci 5 robot": 0.5,
  "SpeedLine Solutions launches cloud-based POS system for restaurants": 0.5,
  "Prescription Drug Ads Face Big Changes. These Stocks Could Get Hurt the Most.": -0.7,
  "Is Cognizant Technology Solutions Stock Underperforming the S&P 500?": -0.5,
  "LULU is the next UA not NKE - Post earnings LULU has slid harder and continues to fall off a cliff. I understand its trading low and it gets people excited to buy cheap.. thing is its going to get much cheaper. Once a brand is deemed uncool or unpopular it can easily fall into a value trap that slow bleeds. Nike has been able to weather the storm as it has a iconic brand": -0.8,
  "EA SPORTS™ NHL® 26 Launches Worldwide Today, Bringing Fans an Early Start to the Hockey Season": 0.6,
  "US Equity Indexes Mixed, Treasury Yields Rise as Michigan Consumer Sentiment Drops to Four-Month Low": -0.5,
  "Rambus (RMBS) Surges 14.9%: Is This an Indication of Further Gains?": 0.8,
  "Returns On Capital Are Showing Encouraging Signs At Thomson Reuters (TSE:TRI)": 0.6,
  "US Drillers See Slight Uptick in Oil Activity": 0.2,
  "Intuitive Surgical (ISRG) Unveils New Software Upgrades for da Vinci 5 Platform": 0.5,
  "Starbucks (SBUX) Opens Immersive Experience at Madrid's Santiago Bernabeu Stadium": 0.6,
  "CNI & CSX Partner to Expand Intermodal Network to Nashville": 0.5,
  "Sellers on Amazon, MercadoLibre face competitive barriers, Mexico watchdog rules": -0.5,
  "Follow-up: Why flu vaccine economics shouldn’t apply to Cidara’s (CDTX) CD388 universal flu prophylaxis - In response to my earlier post asking if Cidara’s (CDTX) CD388 “universal flu prophylaxis” was the most undervalued clinical-stage blockbuster on the market ([CDTX – Is their CD388 “universal flu prophylaxis” the most undervalued clinical-stage blockbuster on the market, or I am missing something?](https://www.reddit.com/r/stocks/comments/1ndt2go/cdtx_is_their_cd388_universal_flu_prophylaxis_the/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)), I received a number of comments that begged the question: Why should CD388 be priced any": 0.1,
  "Is Biogen Stock Underperforming the Nasdaq?": -0.5,
  "After Trump Meeting, Union Pacific CEO Defends Norfolk Southern Deal as Catalyst for Fiercer Rail Competition": 0.5,
  "Datadog (DDOG) Expands Board With Appointment Of Former WhatsApp Product Leader": 0.5,
  "Why Lululemon (LULU) Stock Is Falling Today": -0.5,
  "Intuitive Surgical Reveals New FDA-Cleared Features Driving Innovation In da Vinci 5": 0.5,
  "Physical gold, silver & gold miners have outperformed S&P500, Nasdaq & NVidia YTD - Wanna hear something funny? YTD Performance * Gold ($PHYS) +39.45% * Silver ($PSLV) +48.60% * Gold miners ($GDS) +105.32% * Sibanye Stillwater ($SBSW) +164.70% In comparison (YTD) * Nasdaq +14.18 * SP500 +12.24% * NVidia ($NVDA) +32.24% Full disclosure, I'm invested and I've been invested in the PM tickers I mentioned for the past 3+ years": 0.8,
  "Nuclear renaissance has 'more momentum' than ever to power AI": 0.6,
  "Thoughts on $APLD? - I’m up 230% right now bought 6059 shares @$5.58, the stock doesn’t seem to slow down. It looks like a lot of AI datacenter companies are doing very well. Including $WULF $IREN $NBIS and of course $APLD. They seem to keep expanding while the demand is not slowing down at all. Are you guys confident in AI datacenter stocks especially $APLD?": 0.8,
  "The Coca-Cola Company (KO)’s CEO Is Putting “Consistent Numbers,” Says Jim Cramer": 0.5,
  "Conagra Brands, Inc. (CAG)’s Sector Needs A “Great Merger,” Says Jim Cramer": 0.5,
  "The Kraft Heinz Company (KHC) Might Be Better Off With A Big Deal, Says Jim Cramer": 0.5,
  "Jim Cramer Says Maybe A Merger Would Solve PepsiCo, Inc. (PEP)’s Problems": 0.2,
  "Oil Rig Count Rises by 2; Crude Headed for Weekly Gains Amid Growing Geopolitical Risks": 0.5,
  "Sector Update: Tech Stocks Mixed Late Afternoon": 0.0,
  "Top Funds Have This Nvidia Partner Etched In Their Brains": 0.6,
  "I’m 67. My wife, 48, is financially illiterate. How do I teach her to manage our money? After all, I won’t be around forever.": -0.7,
  "Why AppLovin Stock Zoomed Almost 19% Higher This Week": 0.8,
  "Corteva, a $50 Billion Seed-and-Pesticide Maker, Is Exploring a Breakup": 0.1,
  "Black Rock Coffee Bar Plots Post-IPO Growth": 0.2,
  "These Were the 3 Top-Performing Stocks in the Nasdaq-100 in August 2025": 0.5,
  "Nasdaq Composite Bucks Trend, Rises as Dovish Policy Expectations Lift Consumer Discretionary, Technology": 0.5,
  "AstraZeneca pauses £200m expansion in Cambridge": -0.5,
  "Sipping with Style: Capri Sun and Christian Siriano Introduce the Fan-Fueled Pouch Purse": 0.5,
  "ASML Partners With Mistral AI in Strategic €1.3 Billion Deal": 0.8,
  "AppLovin (APP) Gains As Market Dips: What You Should Know": 0.5,
  "Here's Why Datadog (DDOG) Fell More Than Broader Market": -0.5,
  "Constellation Energy Corporation (CEG) Gains As Market Dips: What You Should Know": 0.5,
  "Why Fortinet (FTNT) Dipped More Than Broader Market Today": -0.5,
  "Here's Why Comcast (CMCSA) Fell More Than Broader Market": -0.5,
  "Pfizer, Moderna shares fall on report that Trump officials will link child deaths to Covid shots - https://www.cnbc.com/2025/09/12/pfizer-moderna-shares-fall-on-trump-child-covid-shot-report.html > Shares of Pfizer and Moderna fell on Friday after a report that Trump administration health officials plan to link Covid vaccines to the deaths of 25 children. The report from the Washington Post said officials plan to include the claim in a presentation next week to a key vaccine panel that advises the Centers for Disease": -0.8,
  "Finally leaving Robinhood after a decade - I was part of the original batch of users when Robinhood was first teased online. Back then zero commission trading was unheard of. As a 21 year old trying to buy Tesla, logging into Scotttrade and paying commissions every single time felt like a huge barrier. Robinhood completely changed that and honestly changed the whole industry for the better. But the app today feels very different. It has": 0.5,
  "Rate Cuts: Priced In? - We know rate cuts will be happening next week. We could either be getting a 25bps or 50bps rate cut. But the main question is, what has the markets priced in already? Do you think we have already priced in a 50 point cut and see a massive sell off happening after rates are cut? Or do you think we will be seeing small profit taking but a continued rally?": 0.2,
  "My thoughts on PAR. - Hey Everyone, So i have been looking for undervalued securities, and often you find investement ideas in niche places, from value line, to barrons, to in my case a interview with a founder of a asset management firm. The founder brought up PAR, and naturally my curiosity spiked, i went to check out the company as of now. This is will be pretty unformal so please bare with. The company": 0.5,
  "Here's How You Can Earn $100 In Passive Income By Investing In Gilead Sciences Stock": 0.5,
  "1 Cash-Producing Stock with Exciting Potential and 2 We Avoid": 0.6,
  "2 Elite Growth Stocks to Buy and Hold Forever": 0.5,
  "Deep dive on the hotel opportunity for Airbnb": 0.5,
  "Investing.com’s stocks of the week": 0.0,
  "/r/Stocks Weekend Discussion Saturday - Sep 13, 2025 - This is the weekend edition of our stickied discussion thread. Discuss your trades / moves from last week and what you're planning on doing for the week ahead. Some helpful links: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips *": 0.2,
  "‘Fastest-Growing Market in Software’: Morgan Stanley Suggests 2 Cybersecurity Stocks to Buy": 0.8,
  "Those who invested in Analog Devices (NASDAQ:ADI) five years ago are up 133%": 0.5,
  "Best Stock to Buy Right Now: Costco vs. Amazon": 0.0,
  "3 Monster Stocks That Could Double Your Money by 2030": 0.8,
  "Homeowners insurance costs just hit a new high. It’s scaring off some buyers.": -0.6,
  "How Investors Are Reacting To Liberty Broadband (LBRD.K) Beating Q2 Revenue Forecasts With Tech-Driven Growth": 0.5,
  "Does Elliott’s $4B Stake Signal Value in PepsiCo After Double Digit Slide?": 0.5,
  "Is Now the Right Time to Reconsider Lam After the 13% Weekly Price Surge?": 0.2,
  "Jim Cramer on AppLovin: “I Think This is a Mini Google”": 0.6,
  "Jim Cramer on The TJX Companies: “They Have the Best Merchandise”": 0.8,
  "Jim Cramer on Ross Stores: “I’m Happy to Put Ross at Second”": 0.6,
  "Jim Cramer on Cintas: “This is a Great Long-Term Hold”": 0.8,
  "Datadog Inc. (DDOG)’s AI Initiatives Accelerating Growth": 0.8,
  "Jim Cramer Says “I’m Not Going to Pull the Trigger” on Intuitive Surgical": 0.1,
  "Palo Alto Networks Inc. (PANW) Targets $15B in Recurring Revenue": 0.5,
  "Jim Cramer on Pepsi: “You Let That Dividend Compound Over Time”": 0.5,
  "Truist Securities Buoyed by Zscaler (ZS)’s Emerging Business Growth, Affirms Buy Stance": 0.8,
  "Constellation Energy Corporation's (NASDAQ:CEG) Stock Been Rising: Are Strong Financials Guiding The Market?": 0.5,
  "Paramount-Skydance's reported bid for Warner Bros. Discovery could spark media bidding war": 0.6,
  "China Probes U.S. Chip Sector On Eve Of Trade Talks": -0.5,
  "r/Stocks Weekly Thread on Meme Stocks Saturday - Sep 13, 2025 - The meme stock scheduled posts will now run weekly and post Saturday afternoon and won't be a sticky; you're probably seeing this because automod sent you here! [Full list of meme stocks here.](https://www.reddit.com/r/stocks/wiki/meme-stocks) This will be updated every once in a while. ------ Welcome traders who just can't help them selves discuss the same exact stock that's been discussed 100s of times a": 0.1,
  "Jim Cramer Shares Important Metric For Salesforce, Inc. (CRM)’s Hypothesis": 0.2,
  "Jim Cramer Shares Key Insights For Adobe Inc. (ADBE)": 0.5,
  "Is O'Reilly Automotive Stock a Buy After Recent Earnings?": 0.2,
  "Electronic Arts (EA) Launches NHL 26 With Innovative Features And Enhanced Gameplay": 0.8,
  "Is Microsoft planning a 1GW datacenter in Permian Basin outside Odessa? - Context Labs runs its platforms exclusively on Microsoft Azure, the only hyperscaler in a confirmed partnership for the tech, providing real-time emissions tracking and sustainability tools that support Azure’s hyperscale data center goals. Context labs just got onboard for a 250-1000MW datacenter project in the Permian Basin. Then Globelink NETWORK got 1,600 miles of fiber planned running from Odessa through Microsoft Azure's locations": 0.5,
  "Netflix Is Just Getting Started: Here Are 3 Growth Drivers for the Next Few Years": 0.8,
  "Dovish fed 2021 around the corner - Bitcoin ripped in Q4 last year after the Fed cut and Trump’s win. Since then, hawkish policy has stalled things out. Now we’re about to get rate cuts next week, and potentially more into next year. This feels like 2021 all over again. The talks of a looming recession? That’s even more of an indicator, big money is sitting on the sidelines ready to chase. Don’t be late.": 0.8,
  "How is this possible? - So, draftkings and fanduel have BOTH found a way to not turn a profit on a sports book. I understand it's more complex than that, but cmon. They both are probably unable to offload action, but the players prepay. No risk on collecting either. That leaves 2 companies inept at keeping enough lines right to profit on the spread, and even worse with parlays. Books don't go broke on parlays.": -0.8,
  "I'm losing money... - Because of socio-economic-political uncertainty in the age of Trump. The financial markets have their bear and bull cycles, everybody knows that, but I'm farting onto my fence over here like an asshole, anxious about this overpriced market and afraid to go all in. Meanwhile... I'm missing out on gains trying to stay sane. Is there a tried and true strategy to combat the FUD?": -0.6,
  "China launches probes targeting US semiconductors ahead of Madrid trade talks": -0.6,
  "Netflix Chief Product Officer Eunice Kim to Depart; CTO Elizabeth Stone Appointed as Interim Successor": 0.2,
  "Silvaco Group Appoints Semiconductor Veteran Chris Zegarelli as Chief Financial Officer": 0.5,
  "Mizuho Reiterates Buy Rating on Intuit (INTU) with $875 PT Following Strong FQ4, Full-Year FY2025 Results": 0.8,
  "Evercore ISI Reiterates Buy Rating on Costco (COST) with $1,060 PT Ahead of Q4 Earnings": 0.8,
  "Arete Upgrades ASML to Buy with €879 PT, Cites Strong Bookings, Robust Backlog": 0.8,
  "Where is PDD Holdings (PDD) Headed According to Analyst?": 0.1,
  "BMO Capital Maintains a Buy on Regeneron Pharmaceuticals (REGN), Sets a $640 PT": 0.6,
  "Guggenheim Maintains a Hold on Amgen Inc. (AMGN)": 0.0,
  "2 Popular AI Stocks to Sell Before They Fall 46% and 73%, According to Wall Street Analysts": -0.8,
  "The Ultimate Growth Stock to Buy With $1,000 Right Now": 0.5,
  "Buying individual company Stocks vs ETFs? - Currently purchased individual stock for companies like apple, Microsoft, google, NVDA, Tesla, and META. Have some left over investing to split into ETFS (s&p 500) and Nasdaq. Should i just transfer the money from individual stocks into ETFS instead of splitting my investing into half for individual companies and then the other half for ETFs? and if so please reccomend me some low cost/passive ETFS. esp for Nasdaq.": 0.2,
  "Biotech stocks: Who wins and who loses if RFK, Jr. goes": 0.1,
  "Stock buybacks--Why are they happening and what do they imply for regular investors? - I just saw that companies are buying back their own stock at a record pace, and this activity represented 6 times the volume of households buying in the market in 2024. This is mind-blowing, and I can see a few ways to take it. Also, I might be missing the point or the info might be misleading. For example, how did": 0.2,
  "2 Healthcare Dividend Stocks to Buy and Hold": 0.5,
  "Duolingo valuation. - Seems like great company. Amazing growth. Has pulled back 50 percent and now retracing a bit. I circled back to this. How do you get comfortable with valuation even after the drop ? Analysts have like 8 $ in eps in 29. So 40x pe or 10x projected 2 billion revenue is nearly any upside. Maybe I’m missing something? Unless you think they can crush estimates and become the learning super app.": 0.6,
  "3 Top Cybersecurity Stocks to Buy in September": 0.5,
  "Why PepsiCo, Black Hills, And Tyson Foods Are Winners For Passive Income": 0.5,
  "Should You Buy Costco Stock Right Now?": 0.0,
  "How the Narrative for Lululemon Is Evolving Amid Analyst Downgrades and Execution Risks": 0.1,
  "Does Regeneron Offer Value After Recent Share Price Drop in 2025?": 0.1,
  "Roper Technologies, Inc. (NASDAQ:ROP) Stock's Been Sliding But Fundamentals Look Decent: Will The Market Correct The Share Price In The Future?": 0.2,
  "Should You Reconsider Costco’s Value After Strong March Sales Update?": 0.5,
  "Here's Why We Think Exelon (NASDAQ:EXC) Is Well Worth Watching": 0.6,
  "3 Millionaire-Maker Technology Stocks": 0.0,
  "Should You Investigate CoStar Group, Inc. (NASDAQ:CSGP) At US$86.80?": 0.2,
  "Do Fundamentals Have Any Role To Play In Driving Monster Beverage Corporation's (NASDAQ:MNST) Stock Up Recently?": 0.2,
  "Perspectives on OKLO, its potential and realistic expectations - I was wondering if I can hear more about people’s thoughts on OKLO. On paper and on the stock market evaluations and trends, it sounds like it has a lot of potential and also it keeps on rising. But realistically speaking, OKLO currently does not have any ACTUAL product right? And no actual income? I worry that it is more of a theoretical future income and": -0.5,
  "Mag 7: exposure to AI downside - Hi everyone, A quick question: out of the Mag 7, which do you think have the largest and lowest downside potential in case AI does not turn out to be the goldmine many think/thought it could be? There are increasing concerns around the current version of AI (LLMs) being limited and not able to reach AGI (see, for instance, Yann Lecun’s take on it), coupled with concerns around": -0.5,
  "SES S.A. $SESG Stock Thoughts? - Yo so I was digging around random tickers and ended up on SES S.A. (ticker SESG) – barely anyone here ever talks about it 🤷‍♂️. It’s basically a Luxembourg-based satellite outfit running the Astra satellites + O3b stuff. What’s kinda dope is they’re not just GEO like the old guys but also got a MEO constellation, so the latency’s lower and coverage’s wider than some of the newer LEO": 0.6,
  "Hennessy funds recommends these top 3 small caps to become GIANTS - Josh Wein, a VP & key 5 star portfolio manager of Hennessy Funds, who manages 10 of the funds worth collectively 3B in AUM, recently mentioned that these 3 top small caps are his favorite to become giants. **$ROOT insurance:** ROOT insurance is an insurance company with a 1.5B market-cap that underwrites risk utilizing AI targeting safe drivers, which allows them to have": 0.6,
  "Billionaire Phillipe Laffont Sold Coatue Management's Stake in Super Micro Computer and Snapped Up This Surgical Robotics Pioneer That's Up 19,390% Since Its IPO": 0.8,
  "O'Reilly Automotive: The '\"Boring\" Retailer Beating Wall Street's Hottest Stocks": 0.5,
  "U.S. Oil Majors Slash Jobs Despite Trump’s Fossil Fuel Push": -0.6,
  "BMNR - 50x? Tom Lee thoughts. - I get Tom Lee is talking his book, but if everything does go on-chain, ETH does appear to be the leading blockchain right now, which would add to the value... Tom said BMNR will focus on having low debt & increasing ETH/per share, which would make it a more leverage ETH play, so thoughts on it being a impactful trade/investment?": 0.6,
  "Prediction: This Stock Will Be Worth More Than Palantir 3 Years From Now": 0.6,
  "(Item 8.01) Other Events. ATM Updates On September 15, 2025, Strategy Inc (“Strategy” or the “Company”) announced updates with respect to its at-the-market offering programs: ATM Program Summary During Period September 8, 2025 to September 14, 2025 As of September 14, 2025 Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) STRF ATM 302,503 STRF Shares $30.3 $34.0 $1,749.6 $2.1 billion of 10.00% series A perpetual strife": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Yvonne McGill resigned from the Board of Directors of Applied Materials, Inc. (the “Company”), effective September 12, 2025. Ms. McGill’s resignation is not due to any disagreement with the Company related to the Company’s operations, policies or practices.": 0.5,
  "Agoda Unveils Ranking of Asia's Top Rural Destinations: Highland Tourism on the Rise": 0.6,
  "Thoughts on $LULU? - Lululemon has been having a rough time this year. Their stock went down more than 40%. Revenue growth has slowed for several quarters in a row, and their latest profit guidance didn’t meet expectations. Even though its forward P/E has dropped to around 13.8, which is way below Nike’s 39, there doesn’t seem to be much buying interest. Now they’ve got another issue. Tariffs are expected to cut around 240 million": -0.8,
  "Q2 Earnings Outperformers: Mondelez (NASDAQ:MDLZ) And The Rest Of The Shelf-Stable Food Stocks": 0.5,
  "IT Services & Other Tech Stocks Q2 Recap: Benchmarking Cisco (NASDAQ:CSCO)": 0.0,
  "3 Reasons MRVL Has Explosive Upside Potential": 0.8,
  "2 Unpopular Stocks That Deserve a Second Chance and 1 We Avoid": 0.0,
  "1 Services Stock Worth Your Attention and 2 We Brush Off": 0.0,
  "1 Momentum  Stock to Target This Week and 2 We Ignore": 0.2,
  "2 Unpopular Stocks That Deserve a Second Chance and 1 Facing Headwinds": 0.2,
  "2 Profitable Stocks to Target This Week and 1 We Brush Off": 0.2,
  "1 Cash-Producing Stock to Consider Right Now and 2 We Turn Down": 0.2,
  "JDE Peet’s transfers shares to participants under its employee incentive plans": 0.2,
  "Is CDW Stock Underperforming the Nasdaq?": -0.5,
  "Dexcom Spotlights Upcoming Feature Launches, Improved Health Outcomes and Cost-Effectiveness With Dexcom Glucose Biosensing at EASD 2025": 0.6,
  "would investing in rolls royce @ p1140 be stupid? - i ownded rolls royce stock from around 300 up to 700 and then i took out because i was satisfied with the winnings, hindsight is a wonderful thing lol. I've been looking at more stocks and currently into small modular reactors which rolls royce is very keen on making so i want to buy back into it but is it worth buying now or should": 0.2,
  "AstraZeneca Pauses Plans for $271 Million Expansion of U.K. Site": -0.5,
  "Intuitive da Vinci 5 updates offer feedback during surgery": 0.5,
  "Update: Market Chatter: AstraZeneca Pauses $271 Million Cambridge Project": -0.5,
  "Micron Technology and Wendy's have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "Trending tickers: Nvidia, Adobe, Opendoor, Pop Mart and Sainsbury's": 0.0,
  "Oracle, Adobe and Alphabet are part of Zacks Earnings Preview": 0.0,
  "TV Industry Bets AI Can Peel Ad Dollars Away From Big Tech": 0.5,
  "Is GE HealthCare Stock Underperforming the Dow?": -0.5,
  "Stocks Set to Open Higher as Investors Await Fed Meeting and U.S. Economic Data": 0.5,
  "China Ministry to Launch Anti-Dumping Probe of US-Made Microchips": -0.5,
  "Is MercadoLibre Stock a Warren Buffett-Worthy Investment?": 0.5,
  "Adobe: After Boosting Guidance, Is Its Beaten-Down Stock Ready to Break Out?": 0.5,
  "With 82% ownership, Marvell Technology, Inc. (NASDAQ:MRVL) boasts of strong institutional backing": 0.6,
  "Are Strong Financial Prospects The Force That Is Driving The Momentum In Palo Alto Networks, Inc.'s NASDAQ:PANW) Stock?": 0.5,
  "A Closer Look At Honeywell International Inc.'s (NASDAQ:HON) Impressive ROE": 0.8,
  "Is There Now an Opportunity in Baker Hughes After 39.9% Share Price Rise?": 0.5,
  "My 3 Favorite Stocks to Buy Right Now": 0.0,
  "Netflix’s ties to Paramount and Warner Bros.: How much do they matter?": 0.2,
  "How Investors May Respond To Take-Two Interactive (TTWO) Analyst Optimism Ahead of GTA VI Release": 0.5,
  "Trade Desk (TTD) Is Down 13.2% After Netflix Opens Ad Inventory to Amazon—Has the Competitive Edge Shifted?": -0.6,
  "OKLO's Tennessee Bet Lifts Hype - But Should Investors Buy?": 0.5,
  "1 Reason Wall Street Is Obsessed With Vertex Pharmaceuticals": 0.5,
  "Latest News In AI Chips - Alpha Modus Sues MNTN Over AI Patent Infringement": -0.5,
  "Cognizant and the North Carolina Turnpike Authority Collaborate to Modernize Toll Operations": 0.5,
  "Side Income From Airbnb, Turo, and Gig Platforms Could Spark IRS Action - Clear Start Tax Warns Short-Term Renters and Car Hosts": -0.5,
  "Is Keurig Dr Pepper Inc.'s (NASDAQ:KDP) Recent Performance Underpinned By Weak Financials?": -0.5,
  "Zscaler CEO warns that AI could spark new cyberattacks": -0.5,
  "Cadence Design Systems (NASDAQ:CDNS) Has A Rock Solid Balance Sheet": 0.8,
  "AstraZeneca halts £200m research investment in Cambridge": -0.8,
  "Samsung Biologics, Amgen and Biocon invest in US pharma sites": 0.5,
  "BMO Capital Maintains a Buy on Regeneron Pharmaceuticals (REGN)": 0.5,
  "Deep Blue to Acquire Environmental Disposal Systems from Diamondback Energy (FANG)": 0.2,
  "Investors in Cognizant Technology Solutions (NASDAQ:CTSH) have unfortunately lost 9.8% over the last year": -0.7,
  "Dear Costco Stock Fans, Mark Your Calendars for September 25": 0.5,
  "Texas Instruments, Analog Devices Stocks Fall. China Inquiry Targets U.S. Chip Makers.": -0.7,
  "Intuit and Clair Partner to Deliver On-Demand Pay, Helping Companies Attract and Retain Employees While Giving Employees Financial Peace of Mind": 0.8,
  "Autodesk Will Partner With the Kraft Group as the Official Design and Make Platform for the New England Patriots": 0.5,
  "Lululemon Stock May Be Down 57% This Year, But Is It Out?": 0.1,
  "September Calls: Oil and Platinum Outlook": 0.0,
  "Remedio Raises $65 Million in Its First-Ever Funding Round to Set a New Standard in Device Posture Management": 0.8,
  "Chatmeter Integrates With Uber Eats, DoorDash and GrubHub to Enhance Multi-Location Restaurant Customer Intelligence": 0.5,
  "Amgen Inc. (AMGN) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Investors Heavily Search Palo Alto Networks, Inc. (PANW): Here is What You Need to Know": 0.5,
  "Cintas Insiders Sold US$4.0m Of Shares Suggesting Hesitancy": -0.5,
  "Is Now An Opportune Moment To Examine Ross Stores, Inc. (NASDAQ:ROST)?": 0.2,
  "ISRG Stock Down More than 13% in 3 Months: How to Play the Stock?": -0.5,
  "Beat the Market the Zacks Way: CommScope, Micron, Oracle in Focus": 0.5,
  "CEG Rises 62.3% in a Year: Should You Buy, Sell, or Hold the Stock?": 0.2,
  "H.C. Wainwright Affirms Biogen Inc. (BIIB) Buy Rating on Lupus Franchise Prospects": 0.6,
  "AstraZeneca PLC (AZN) Receives Tagrisso Boost in Lung Cancer Trials": 0.8,
  "Keurig Dr Pepper Inc. (KDP) Strengthens Coffee Business with JDE Peet’s Acquisition": 0.8,
  "Traders Cautious Ahead of Fed Meeting, Driving Muted Premarket Action for US Equity Futures": 0.1,
  "Do You Believe in Datadog’s (DDOG) Growth Potential?": 0.5,
  "Zscaler CEO says companies need AI to fight AI threats": 0.5,
  "Is Fortinet Stock Underperforming the Nasdaq?": -0.5,
  "Musk buys Tesla, China vs. US chips, Hims: Trending Tickers": 0.0,
  "Stocks are going up today because world's richest person bought his own stock! - It is becoming a self full-filling setup. Mr. Musk buys $1B worth of TSLA stock, which he is employed with, earned that $1B from TSLA, and will get $1B performance pay from TSLA. So, the same money is circulated. Earlier ORCL and top few companies teamed up to buy/sell among each other to boost their own stock evaluations. It is circular": 0.2,
  "How Is Xcel Energy's Stock Performance Compared to Other Utilities Stocks?": 0.0,
  "Broadcom initiated, Beyond Meat downgraded: Wall Street's top analyst calls": 0.1,
  "Why Adobe Systems (ADBE) is a Top Growth Stock for the Long-Term": 0.6,
  "Why Booking Holdings (BKNG) is a Top Growth Stock for the Long-Term": 0.6,
  "Opendoor (OPEN) Grows 36% on Turnaround, Revival Optimism": 0.8,
  "r/Stocks Daily Discussion Monday - Sep 15, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.0,
  "Japan Building Automation System Forecast and Company Analysis Report 2025-2033 Featuring Cisco, Hitachi, Mitsubishi, Honeywell, Emerson Electric, United Technologies, Trane, Huawei, Hubbell": 0.5,
  "REGN Loses 21.1% Year to Date: Buy, Sell or Hold the Sock?": -0.2,
  "EA SPORTS FC™ Reveals Star-Studded FC 26 Soundtrack, Featuring First-Ever Professional Footballer on an FC Soundtrack": 0.8,
  "What Is Automatic Data Processing, Inc.'s (NASDAQ:ADP) Share Price Doing?": 0.0,
  "Stocks to Watch Monday: Nvidia, Tesla, Corteva, Onsemi": 0.5,
  "ASYS vs. AMAT: Which Semiconductor Equipment Stock is the Better Buy?": 0.5,
  "Is Costco's 5.7% Q4 Comparable Sales Growth a Bullish Signal?": 0.6,
  "Alphabet becomes fourth company to reach $3 trillion market cap - Alphabet has joined the $3 trillion club. Shares of the search giant jumped more than 4% on Monday, pushing the company into territory occupied only by Nvidia, Microsoft and Apple. The stock got a big lift in early September from an antitrust ruling by a judge, whose penalties came in lighter than shareholders feared. The U.S. Department of Justice wanted Google to be forced": 0.6,
  "Market Minute 9-15-25- \"Fed Week\" Hopes Propel Stocks Higher": 0.6,
  "Target (TGT) advice - I have owned Target stock for 4 years. Cost averaged lower as the stock has plummeted but now sitting on 24k in long term losses. Starting to lose hope for a turnaround especially with the internal promotion for CEO- kind of feels like nothing is going to change. Walmart has dominated the space and even my wife says she doesn’t shop at target any more because it’s boring and she never": -0.6,
  "Trump advocates end to quarterly earnings reports - President Donald Trump floated the idea Monday of companies no longer providing earnings report on a quarterly basis and switching to semiannual instead. In a Truth Social post, Trump said the idea is “subject to SEC approval” and would “save money, and allow managers to focus on properly running their companies.” “Did you ever hear the statement that, ‘China has a 50 to 100 year view on": 0.2,
  "Micron, The RealReal, Beyond Meat: Top Analyst Calls": 0.5,
  "How Much Growth is Too Much? - I'm invested mostly in tech stocks like Google, Nvidia and AMD, but also some banks. As of the last year I've been seeing an average rate of growth of 2.6%. That seems pretty unsustainable. Historically, my portfolio was only doing an average of 1.4% over 9 years. Is this a warning sign of a big correction?": -0.6,
  "Want To Earn What Your CEO Makes? 5 Shocking Truths About Your Paycheck Differences": -0.7,
  "Micron Hits New 52-Week High: Is the Stock Still Worth Buying?": 0.5,
  "Micron Technology 'Well Positioned' to Maintain HBM Market Share, Deutsche Bank Says": 0.8,
  "Honeywell And Redwire Join Forces To Build Quantum Secure Satellite For Europe": 0.6,
  "LENZ Therapeutics - A high risk, high reward biotech stock - Hello r/stocks I have a small cap company I want to share. Firstly I want you all to be aware of the risks associated with small caps. Mainly low volume and low liquidity leading to larger spreads on the bid/ask. Along with if the float is small then it is possibly easier for bigger players to manipulate price action. Okay great now that we": 0.1,
  "How might lower interest rates affect gold prices? - I bought a bunch of gold several months ago and want to better understand the economics behind how the interest rate changes will affect gold prices. I’m thinking of it in an opportunity cost scenario where lower interest rates will cause people to sell gold because they want to use that money to buy other things, but am I mistaken? What are the other possibilities?": 0.2,
  "How do I (27M) convince my dad (68M) to stop gambling on individual stocks? - My dad comfortably retired around 13 years ago from a good business he owned. He was able to build a strong nest egg to coast through retirement easily, even if he just kept it in lower-interest assets yielding 3-4% per annum. As for me, I've began my investing journey around 3 years ago and adopted a relatively conservative approach. By": -0.5,
  "Union Pacific, Norfolk Southern roll out new domestic intermodal": 0.2,
  "ReBound Returns Announces Premier Partnership With Shopify to Deliver Seamless Omnichannel Returns Solution": 0.8,
  "Palo Alto Networks added to Wedbush Best Idea List, sees golden buying opportunity": 0.8,
  "OpenAI board chair doubles down on CEO Sam Altman’s belief we’re in an AI bubble: ‘A lot of people will lose a lot of money’": -0.8,
  "Is DoorDash Stock Outperforming the Nasdaq?": 0.2,
  "DexCom (DXCM) Stock Is Up, What You Need To Know": 0.5,
  "Opendoor (OPEN) Stock Trades Up, Here Is Why": 0.5,
  "Why Texas Instruments (TXN) Stock Is Down Today": -0.5,
  "lululemon's Fresh Styles, Soft Sales: Is Innovation Falling Short?": -0.5,
  "Mexican Watchdog: Amazon, Mercado Libre Limit Competition Among Sellers": -0.6,
  "T vs TMUS: Which Telecom Stock is a Smart Investment Right Now?": 0.5,
  "Why California’s biopharma boom is critical for logistics": 0.5,
  "Netflix to Announce Third Quarter 2025 Financial Results": 0.0,
  "MEDIA ALERT: Cisco's WebexOne Event Spotlights Global AI Brands and Ryan Reynolds, Acclaimed Actor, Film Producer, and Entrepreneur": 0.5,
  "Baker Hughes Secures Subsea Contract for Sakarya Gas Field": 0.5,
  "Corteva shares fall as potential split report stirs worries over operational disruptions": -0.6,
  "ADBE's AI Push Gains Traction: Buy or Hold the Stock Post Q3 Earnings?": 0.5,
  "Can PepsiCo's Diverse Portfolio Outperform in a Soft Market?": 0.2,
  "U.S., China Close In On TikTok Deal But Punt on Tariffs, Export Controls, and Other Frictions": 0.2,
  "Will Weak Market Conditions Keep MercadoLibre's Costs Elevated?": -0.5,
  "AppLovin Sees Stronger Non-Gaming Momentum As Expansion Accelerates": 0.8,
  "Uber, Shopify, and 11 Other Stocks Growing Free Cash Flow Margins": 0.5,
  "Intuit (INTU) Unveils Clair On-Demand Pay To Empower QuickBooks Payroll Users": 0.5,
  "China Targets Nvidia Over 2020 Deal, Straining Trade Talks": -0.6,
  "Adobe Produces Strong FCF - ADBE Stock Could Be Over 20% Too Cheap": 0.8,
  "Are tech stocks the new consumer staples? - During the last few recessions, investors were always running to consumer staples like WMT, PG, MCD, KO, PEP, because tech stocks were too risky to hold and they always crashed hard. This is the first time tech stocks are actually going up during a recession while consumer staples are going down. People are addicted to technology and they would rather go to a food bank than cancel": 0.2,
  "Communication Services, Consumer Discretionary Help Push US Equity Indexes Higher": 0.5,
  "China’s tariff investigation could shift analog chip market dynamics: Bernstein": 0.1,
  "McDonald's plans $200 million investment to promote regenerative practices on US cattle ranches": 0.8,
  "Shopify (SHOP) Stock Is Up, What You Need To Know": 0.5,
  "Utilities, nuclear stocks to benefit from lower rates. Here's how.": 0.5,
  "PayPal Launches Shareable ‘PayPal links’ P2P Payment Service With Upcoming Crypto Support": 0.6,
  "China probes Texas Instruments, CoreWeave & Nvidia, Union Pacific": 0.0,
  "As Netflix Stock Falls Below $1,250, Should You Binge Watch Or Keep Chilling?": 0.2,
  "Mercado Libre's Incoming CEO Lays Out Vision": 0.5,
  "Netflix Joins Google On Two Elite Lists. Now The Trial Begins.": 0.2,
  "Wedbush Just Added These Two Tech Stocks to Its 'Best Ideas' List": 0.6,
  "These Stocks Moved the Most Today: Nvidia, Tesla, Texas Instruments, Oracle, CoreWeave, Gemini Space Station, and More": 0.2,
  "Nvidia Stock Falls As China Pressures U.S. Chipmakers": -0.6,
  "This Railroad Stock Is On Track for Gains After Merger Mania. The Case to Buy.": 0.8,
  "Alger Russell Innovation Index Updates for Third Quarter 2025": 0.0,
  "StubHub IPO Puts Direct Ticket Sales Plan in the Spotlight": 0.5,
  "Micron Stock Notches Record High Ahead Of Earnings Report": 0.8,
  "Why ASML Rallied on Monday": 0.5,
  "EchoStar (SATS) seems massively undervalued after the $17B SpaceX deal - I look at EchoStar (SATS), and I see something very interesting. A big thing happened and I think many people do not see the real story. I think maybe the price is too low now. So, this company had a very big problem. It had too much debt. Like a huge credit card bill that is hard to pay. But then, they sell something": 0.8,
  "Stocks Rally as Bond Yields Fall Before FOMC Meeting": 0.8,
  "US Equity Indexes Rise, Paced by Gains in Communication Services, Consumer Discretionary": 0.6,
  "Here’s how investors can play latest wave of corporate breakups": 0.5,
  "Netflix (NFLX) Rises Higher Than Market: Key Facts": 0.5,
  "Airbnb, Inc. (ABNB) Stock Slides as Market Rises: Facts to Know Before You Trade": -0.2,
  "Cadence Design Systems (CDNS) Beats Stock Market Upswing: What Investors Need to Know": 0.5,
  "Texas Instruments (TXN) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "Kraft Heinz (KHC) Stock Falls Amid Market Uptick: What Investors Need to Know": 0.1,
  "Why Booking Holdings (BKNG) Outpaced the Stock Market Today": 0.2,
  "Exploring Agentic AI: Innovation Meets Security": 0.5,
  "Seeking Outsized Gains? 3 Traits Outperfoming Stocks Possess": 0.5,
  "(Item 1.01) Entry into a Material Definitive Agreement. On September 12, 2025, MercadoLibre, Inc. (the “Company”), as borrower, entered into Amendment No. 1 to the Amended and Restated Revolving Credit Agreement (the “First Amendment”) with the lenders party thereto (the “Lenders”), Citibank, N.A. as administrative agent (the “Administrative Agent”) and MercadoLibre S.R.L., Ebazar.com.br Ltda., Mercado Pago Instituição de Pagamento Ltda, DeRemate.com de Mexico S. de R.L. de C.V., MPFS, S. de R.L. de C.V., MP Agregador, S.\n\n(Item 1.01) Entry into a Material Definitive Agreement” is incorporated herein by reference.": 0.1,
  "(Item 8.01) – Other Events On September 15, 2025, Workday, Inc. (“Workday”) entered into a definitive agreement (the “Agreement”) by and among Workday, Sana Labs AB (“Sana”), and certain other parties thereto. Pursuant to the Agreement, Workday will, subject to the satisfaction of certain customary conditions, acquire all of the outstanding capital stock of Sana. A copy of the press release announcing the entering into of the Agreement is attached hereto as Exhibit 99.1. Forward-Looking Statements This": 0.1,
  "Lam Research and JSR Corporation/Inpria Corporation Enter Cross-Licensing, Collaboration Agreement to Advance Semiconductor Manufacturing": 0.5,
  "(ITEM 5.02) . DEPARTURE OF DIRECTORS OR CERTAIN OFFICERS; ELECTION OF DIRECTORS; APPOINTMENT OF CERTAIN OFFICERS; COMPENSATORY ARRANGEMENTS OF CERTAIN OFFICERS. Effective September 14, 2025, Kevin R. Sayer, Chief Executive Officer (principal executive officer) and Chairman of the Board of DexCom, Inc. (“Dexcom” or the “Company”) is taking a temporary medical leave of absence. Accordingly, effective September 14, 2025, Dexcom’s Board of Directors (the “Board”) appointed Jacob S. Leach, President and Chief Operating Officer, to serve as": -0.2,
  "(Item 8.01) . Other Events. On September 16, 2025 , Keurig Dr Pepper Inc. (the “Company”) issued a press release announcing that its Board of Directors has declared a regular quarterly dividend of $0.23 per share, payable in U.S. dollars on the Company’s common stock. The regular quarterly dividend will be paid on October 10, 2025 to shareholders of record on September 26, 2025.": 0.5,
  "Appeals court declines to let Trump remove Fed Governor Cook - https://www.reuters.com/legal/government/appeals-court-declines-let-trump-remove-fed-governor-cook-2025-09-16/ > Sept 15 (Reuters) - A U.S. appeals court declined on Monday to allow Donald Trump to fire Federal Reserve Governor Lisa Cook - the first time a president has pursued such action since the central bank's founding in 1913 - in the latest step in a legal battle that threatens the Fed's longstanding independence. > > The decision by the U.S. Court": -0.5,
  "Market Wrap today: Alphabet and Tesla gain while Texas Instruments slips": 0.5,
  "Dow Jones Futures: Nvidia, Shopify, Uber In Buy Zones; Fed Meeting Next": 0.5,
  "If there really is a rate cut this time, just as Trump wants, I’ll continue betting on gold. - Someone who supports tariff policies can actually join the Fed how incompetent must this person really be? If the other Fed members are willing to cave to a rate cut, risking being seen as Trump’s puppets and not defending their independence, then the Fed’s credibility is finished everyone might as well just follow Trump’s orders from": -0.8,
  "3 Reasons GILD is Risky and 1 Stock to Buy Instead": -0.5,
  "2 Reasons to Watch DDOG and 1 to Stay Cautious": 0.5,
  "1 High-Flying Stock to Own for Decades and 2 We Turn Down": 0.2,
  "1 Nasdaq 100 Stock for Long-Term Investors and 2 We Turn Down": 0.0,
  "1 Consumer Stock with Promising Prospects and 2 We Find Risky": 0.5,
  "2 Nasdaq 100 Stocks with Impressive Fundamentals and 1 Facing Headwinds": 0.5,
  "OpenAI hires former xAI CFO Mike Liberatore as business finance officer": 0.5,
  "Senate confirms Trump Adviser Miran as Fed Governor right before this week's Fed Meeting. - Stephen Miran is the new nominee to the Federal Reserve Board in an incredibly tight 48-47 vote on Monday evening. He'll be just in time to cast a crucial vote in this week's central bank policy meeting. The Fed is widely expected to lower its benchmark interest rate for the first time this year. \"Miran's confirmation is part of a": 0.6,
  "Nazhar Adnan, Former CBO at Sonocharge and Director at Temasek, Joins TeraWatt Technology as Chief Commercial Officer": 0.5,
  "Former CinCor execs reunite to helm new biotech startup": 0.5,
  "Investing in Coca-Cola Europacific Partners (AMS:CCEP) five years ago would have delivered you a 163% gain": 0.8,
  "Senhwa Biosciences' CX-5461 Teams Up with Global PD-1 Leaders to Enter the Immunotherapy Arena, Targeting Multi-Billion Dollar Global Market": 0.8,
  "1 Reason Intuitive Surgical (ISRG) Is 1 of the Best Healthcare Stocks You Can Buy Today": 0.8,
  "Citi Group among US finance firms pledging investment into UK before Trump visit": 0.5,
  "MoonPay Acquires Meso to Boost Global Payments Expansion": 0.5,
  "GlobalFoundries Joins World Economic Forum’s Global Lighthouse Network for Manufacturing Excellence": 0.5,
  "Should You Buy Micron Technology Stock Before Sept. 23?": 0.2,
  "Trending tickers: Alphabet, Oklo, ASML, CoreWeave and Unilever": 0.0,
  "Ørsted Initiates EUR 8 Billion Rights Issue to Build Sunrise Wind, Cover Revolution Wind Halt Impact - Ørsted (Denmark) is launching the rights issue announced last month, offering new shares with pre-emptive rights to existing shareholders during the period from 19 September to 2 October 2025. The company is looking to raise DKK 60 billion (around EUR 8 billion) to fund the construction of the Sunrise Wind project in New York and enhance its financial": 0.5,
  "Indicium Receives Investment from Databricks Ventures": 0.5,
  "MoonPay buys crypto payments firm Meso": 0.2,
  "r/Stocks Daily Discussion & Technicals Tuesday - Sep 16, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on technical analysis (TA), but if TA is not your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly": 0.2,
  "Will Opendoor Stock Get Another Win From the Fed on Wednesday? It's Not That Simple": 0.1,
  "1 Million BTC Treasury Push, Michael Saylor to Attend Bitcoin Act Roundtable This Week": 0.5,
  "PandaDoc Takes Aim at Docusign with AI-Native MCP Release, Enterprise-Grade Trust, and Outcome-Based Pricing": 0.6,
  "Analysis-From Alphabet to Visa, US giants drive euro-denominated bond surge": 0.5,
  "Lagging the Market This Year, Is Costco Stock a Buy?": 0.2,
  "Advanced Micro Devices, Inc. (AMD)’s “Doing A Great Job,” Says Jim Cramer": 0.8,
  "Jim Cramer Wonders Whether “Intel Crushed” Synopsys, Inc. (SNPS)": 0.2,
  "CEO Jack Hightower Retires from HighPeak Energy": 0.0,
  "Jim Cramer Says Intel Corporation (INTC)’s “Got Real Problems”": -0.6,
  "Lam Research And JSR Resolve Legal Disputes As They Team Up On AI Era Chips": 0.5,
  "AllRock Bio Announces $50 Million Series A to Advance Lead Clinical Program for Pulmonary Hypertension": 0.8,
  "Verisk Launches Generative AI Commercial Underwriting Assistant to Revolutionize Risk Assessment and Underwriting Efficiency": 0.8,
  "Immuneering Appoints Dr. Thomas Schall as Chairman of the Board": 0.5,
  "Can MercadoLibre, Inc. (NASDAQ:MELI) Maintain Its Strong Returns?": 0.5,
  "What Does the Ryanair Settlement Mean for Booking Holdings Shares in 2025?": 0.1,
  "TD Cowen downgrades Warner Bros. Discovery after bid speculation drives rally": -0.5,
  "Drug developer Dualitas launches $65 million funding round": 0.5,
  "Does FDA Progress Reinforce C4 Therapeutics' (CCCC) Platform Validation Story in Autoimmune Disease?": 0.2,
  "Is Analog Devices Stock Still a Smart Choice After Its Strong 2025 Rally?": 0.5,
  "How the Departure of Netflix’s Chief Product Officer Has Changed Its Investment Story (NFLX)": 0.1,
  "Evaluating Opendoor (OPEN) Valuation Following Leadership Overhaul and Renewed Founder Influence": 0.5,
  "How Investors May Respond To Canadian National Railway (TSX:CNR) Expanding All-Rail Intermodal Service With CSX": 0.2,
  "UK pay-TV group Sky set to cut around 600 jobs": -0.7,
  "Here is one advantage PayPal has in the crypto space": 0.5,
  "Insulet names new CFO; Dexcom CEO on leave": 0.0,
  "Energy Transition Today - Statkraft Sells Indian Assets To Serentica For Strategic Focus": 0.5,
  "Cadence Design Systems to spend $3.2B on Hexagon’s simulations tech": 0.2,
  "Marriott partners with Kuzu Group to launch St Regis brand in Bodrum, Türkiye": 0.5,
  "Universal Ads Launches AI-Powered Video Generator to Bring Free TV Commercial Ad Creation to Every Advertiser": 0.8,
  "New DualPack 3 IGBT7 Modules Deliver High Power Density and Simplify System Integration": 0.6,
  "HONEYWELL ANNOUNCES LAUNCH OF SOLSTICE ADVANCED MATERIALS' OFFERING OF SENIOR NOTES IN CONNECTION WITH PLANNED SPIN-OFF": 0.2,
  "NextPlat Launches its Florida Sunshine Brand of Premium Vitamins in Europe and North America and Receives Initial Approval for Sale in China": 0.8,
  "CrowdStrike and Salesforce Partner to Secure the Future of AI-Powered Business": 0.6,
  "Is it a Prudent Move to Retain MYGN Stock in Your Portfolio Now?": 0.2,
  "TEM Strengthens Radiology Portfolio With Pixel's FDA Clearance": 0.6,
  "Archer Aviation (ACHR) Surges After FAA Backs U.S. Air Taxi Trials - Archer Aviation ripped higher Monday (+7% premarket to $9.40) after [announcing it will join the new eVTOL Integration Pilot Program (eIPP), basically a government backed runway to get flying taxis into U.S. cities faster.](https://www.benzinga.com/markets/tech/25/09/47666827/archer-aviation-joins-white-house-flying-taxi-program) The program came out of a June executive order and sets up controlled trial environments under DOT and FAA oversight. Archer will work with airlines (United is already backing": 0.8,
  "Cybersecurity firm Netskope lifts IPO price range, eyes $7.3 billion valuation": 0.8,
  "Top 20 Companies Recognized in Labrador Transparency’s 2025 U.S. Transparency Awards": 0.5,
  "Dave Ramsey Says It's 'Wonderful' That You Can Venmo The Government To Pay Down The $37 Trillion Debt. 'There's Always Some Idiot Out There'": -0.6,
  "'CEO's need to master AI': Interview with Cisco President Jeetu Patel": 0.5,
  "Implied Volatility Surging for Cognizant Technology Solutions Stock Options": 0.5,
  "Sky to slash hundreds of UK jobs": -0.8,
  "Transact IDX® Adds Mobile Credentials to Apple and Google Wallets, Alongside Additional Features": 0.5,
  "Norton Unveils Advanced Deepfake Protection Powered by Intel® Core™ Ultra Processors": 0.6,
  "AI Workforce Consortium Finds 78% of ICT Roles Now Include AI Technical Skills, While Human Skills Gain Priority for Responsible Tech Adoption": 0.6,
  "CDW & AMD Collaborate to Enable Mission to Maximize AWS Cloud Efficiency": 0.5,
  "ExtraHop® and CrowdStrike Signal Next Step in Partnership to Break Down Data Silos": 0.5,
  "Zip Becomes First Procurement Platform Named Finalist in Fast Company’s Innovation by Design Awards": 0.6,
  "Here is What to Know Beyond Why ON Semiconductor Corporation (ON) is a Trending Stock": 0.2,
  "Here is What to Know Beyond Why ASML Holding N.V. (ASML) is a Trending Stock": 0.2,
  "Investors Heavily Search AppLovin Corporation (APP): Here is What You Need to Know": 0.5,
  "Adobe Inc. (ADBE) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Is DoorDash, Inc. (NASDAQ:DASH) Trading At A 30% Discount?": 0.2,
  "Stocks making big moves yesterday: Estée Lauder, Intel, Comfort Systems, Chewy, and 3D Systems": 0.5,
  "VDURA and AMD Launch Scalable Reference Architecture for AI and HPC": 0.5,
  "Mark Anderson joins Verkada's Board of Directors": 0.5,
  "CSX CEO: Obsession with profit margins stunting railroads’ growth": -0.5,
  "Coca-Cola Europacific Partners JV eyes largest factory in Philippines": 0.5,
  "OpenTable Launches All-in-One Marketplace for Private and Group Dining": 0.5,
  "Is ASML a Buy?": 0.0,
  "Here’s Sands Capital Select Growth Strategy’s Views on Shopify (SHOP)": 0.2,
  "Company News for Sep 16, 2025": 0.0,
  "Honeywell, Redwire advance collaboration on quantum-secured communications": 0.5,
  "The 5 Largest Publicly Traded Solana Treasury Firms": 0.0,
  "New to Investing? This 1 Computer and Technology Stock Could Be the Perfect Starting Point": 0.6,
  "Reliable, High-Speed Internet from Xfinity Coming to Westport, CT": 0.8,
  "GEHC Eyes icometrix Buyout to Strengthen Neurology Imaging Portfolio": 0.5,
  "Nvidia Stock Falls. Reasons to Look Past China Fears.": 0.2,
  "Israeli cybersecurity startup Vega raises $65 million, valued at $400 million": 0.8,
  "Bitcoin, XRP Rise. There’s a New Red-Hot Crypto Treasury Stock.": 0.5,
  "Starbucks Named Official Coffee Partner of the LA28 Olympic and Paralympic Games and Team USA": 0.6,
  "ElevenLabs CEO Mati Staniszewski Reveals Why He Interviews Every Hire Even As Startup Passes $200 Million Revenue And $6.6 Billion Valuation": 0.5,
  "Micron Stock Rises Toward Record High. This Is Driving Its 10-Day Winning Run.": 0.8,
  "Why DoorDash, Inc. (DASH) is a Top Momentum Stock for the Long-Term": 0.6,
  "Salesforce Teams Up With CrowdStrike To Fortify AI Agents Against Growing Cyber Threats": 0.8,
  "Is Datadog Stock Outperforming the S&P 500?": 0.2,
  "CrowdStrike Bets on Identity Security: Is it the Next Growth Engine?": 0.5,
  "WTF is going on with the stock market? - Hi friends. I am fairly new to the stock market and have been trying to invest aggressively over the past 6 month. I just don’t understand how can the market continue to break record highs while inflation is high, unemployment is high, people are having a hard time affording basic needs/housing, and there are concerns for stagflation. I’ve held off on putting anymore money because this": -0.8,
  "Is Take-Two Interactive Software Stock Outperforming the Nasdaq?": 0.2,
  "PANW's Platform Strategy Builds Momentum: Can it Hit $15B ARR Target?": 0.6,
  "Fora Financial Appoints John Egerman as Chief Financial Officer": 0.5,
  "Netflix's Ad Business: Game Changer or Overhyped?": 0.2,
  "Eaton Accelerates Transformation of Building and Data Center Infrastructure With Autodesk To Deliver AI-Powered Digital Energy Twin and Software Tools": 0.5,
  "Amgen Insiders Sold US$12m Of Shares Suggesting Hesitancy": -0.5,
  "AppLovin Joins S&P 500 as Cramer Hails Stock’s Strong Growth Momentum": 0.8,
  "Opendoor Technologies Finds a New CEO. Is It a Game Changer?": 0.5,
  "Micron numbers raised at Mizuho as HBM4 seen as two-horse race": 0.5,
  "Cintas Gains Cramer Endorsement as Long-Term Buy Ahead of Q1 Results": 0.6,
  "Okta is providing extra security to AI agents, your data: CEO": 0.2,
  "MGX co-invests with Silver Lake in Altera acquisition": 0.5,
  "Form 8.3 - Aqua Acquisition Sub LLC (an indirect wholly-owned subsidiary of Qualcomm Incorporated)": 0.0,
  "ISRG Stock Dips Despite Introducing Real-Time Insights on da Vinci 5": -0.2,
  "Aurora And Copeia Launches English-language version of the Physician Experience Platform (PEP)": 0.5,
  "AppLovin's International Expansion Poised to Supercharge Growth": 0.8,
  "Chipotle vs. Starbucks: Which Restaurant Titan Can Rebound Stronger?": 0.5,
  "ASML Soars 16% in a Month: Should You Buy, Sell or Hold the Stock?": 0.5,
  "Warner Bros Discovery stock falls on merger concerns and downgrade": -0.7,
  "IntelliTrans Expands TMS with Integrated CO₂ Emissions Dashboard, Powered by EcoTransIT World": 0.5,
  "Bank Director's 2025 Technology Survey: Banks Grapple With Data, AI Maturity": 0.2,
  "SPECTRUM MARKS ONE YEAR OF INDUSTRY-FIRST CUSTOMER COMMITMENT ACCOMPLISHMENTS": 0.6,
  "PayPal to Allow Direct Transfer of BTC and ETH": 0.5,
  "INTC vs. AMD: Which AI-Driven Chip Stock Should You Bet on Now?": 0.5,
  "New Speakers Announced: 5th Palm Beach CorpGov Forum | Preview Panelists & Topics": 0.2,
  "5G in Aviation Market Booming: 2025-2034 Trends and Investment Opportunities Report": 0.6,
  "INTU vs. UPST: Which AI-Driven Fintech Stock Offers Better Upside Now?": 0.5,
  "PepsiCo vs. Monster Beverage: Which Is a Better Buy for Investors Now?": 0.2,
  "Comcast Opens New Xfinity Store in Grand Blanc, Expanding Access to Technology and In-Person Support": 0.6,
  "$QQQ vs S&P comparison - returns for Invesco QQQ Average Annual Return Last 5 years 17.1% per year Last 10 years 19.5% per year Last 15 years 17.5% per year Last 20 years 15.2% per year ======= returns for the S&P 500 over different trailing periods, based on recent data (including dividends, nominal, not inflation-adjusted): Average Annual Return Last 5 years 13.6% Last 10 years 11.3% Last 15 years 10.5% Last 20 years 8.4% ==========": 0.8,
  "BROS vs. KDP: Which Coffee Stock Offers More Growth Potential?": 0.2,
  "New Opendoor Chairman Keith Rabois says he doesn’t know why the company has 1,400 employees: ‘We don’t need more than 200’": -0.8,
  "Verizon vs. T-Mobile: Which Telecom Stock Should You Bet On?": 0.2,
  "Why Moderna (MRNA) Stock Is Trading Up Today": 0.5,
  "Why Warner Bros. Discovery (WBD) Stock Is Falling Today": -0.5,
  "TD Cowen Maintains a Buy on Strategy Inc (MSTR), Keeps the PT": 0.6,
  "Charter Communications (CHTR) Launches Internet, Mobile, TV, and Voice Services in Scott County, Kentucky.": 0.5,
  "lululemon athletica inc. (LULU): A Bull Case Theory": 0.5,
  "Morgan Stanley Lowers PT on Synopsys (SNPS), Maintains an Overweight Rating": 0.5,
  "Morgan Stanley Maintains Buy on Atlassian Corporation (TEAM)": 0.5,
  "Keurig Dr Pepper (KDP) to Acquire JDE Peet’s": 0.5,
  "Regeneron Pharmaceuticals (REGN) Releases Results From EMPOWER-Lung 3 trial": 0.5,
  "Wall Street is Bullish on DexCom (DXCM), Here’s Why": 0.8,
  "J.P. Morgan Maintains a Buy on Adobe Inc. (ADBE), Keeps PT": 0.6,
  "Bank of America Securities Maintains a Buy on Intuitive Surgical (ISRG), Keeps PT": 0.5,
  "GitLab Inc. (GTLB): A Bull Case Theory": 0.5,
  "CrowdStrike Holdings, Inc. (CRWD): A Bull Case Theory": 0.5,
  "Micron Stock Climbs as Mizuho Boosts Target Ahead of Earnings": 0.8,
  "Bernstein Lowers the PT on Charter Communications (CHTR), Keeps a Buy": 0.5,
  "Wall Street is Bullish on Roper Technologies (ROP), Here’s Why?": 0.8,
  "TD Cowen Reduces PT on Paychex, Inc (PAYX), Keeps a Hold": -0.2,
  "Wall Street Bullish on Keurig Dr Pepper (KDP), Here’s Why": 0.8,
  "Federated Wireless and Cisco Validate Standard Power Wi-Fi 6E and Wi-Fi 7 for Commercial Use in North America": 0.6,
  "Mitratech Unveils Premier Partner Awards, Honoring Industry Leaders Driving AI Innovation & Compliance Excellence": 0.8,
  "CoreWeave, Inc. (CRWV): A Bull Case Theory": 0.5,
  "Warner Bros. Discover Stock Downgraded. Why Paramount Deal Reports Add ‘Elevated Risk.’": -0.6,
  "Looking at Elon Musk's transactions for TSLA going back to 2017 - Elon's enthusiasm for this upcoming pay package ($1 trillion) vote on Nov 6th has him buying his own company's stock (link below), but I took a look at his past transactions of TSLA: [Tracking Elon's transactions here is very interesting](https://finviz.com/insidertrading.ashx?oc=1494730&tc=7) because the last time he bought TSLA shares was between 2017 to 2020 and since then he's just been selling billions worth of": -0.5,
  "Top Midday Stories: Judge Tosses Terrorism Charges Against Alleged Shooter of UnitedHealth Executive; Hims Shares Fall After FDA Warning Letter": -0.5,
  "Bloom Energy Corporation (BE): A Bull Case Theory": 0.5,
  "This Penny Stock Almost Doubled on Plans to Buy Bitcoin and Ethereum. Should You Buy Its Shares Now?": 0.5,
  "Okta CEO on the quarterly reports debate: Less obsession with numbers, more conversation with investors": 0.5,
  "CrowdStrike Unveils the Falcon Platform Fall Release to Lead Cybersecurity into the Agentic Era": 0.6,
  "UK ‘difficult’ operating environment says Merck boss after £1bn London site axed": -0.6,
  "CrowdStrike Unleashes the Agentic Security Workforce to Transform Security Operations": 0.6,
  "Bears Winning as 'Meaningful' Discount Emerges for 4 Bitcoin Treasury Firms: TD": 0.2,
  "Kymera initiated at Outperform on potential of lead skin drug": 0.8,
  "Leidos Holdings, Inc. (LDOS): A Bull Case Theory": 0.5,
  "CrowdStrike to Acquire Pangea to Secure Every Layer of Enterprise AI": 0.5,
  "CrowdStrike Teams with NVIDIA to Build, Power, and Secure the Agentic Ecosystem": 0.5,
  "PayPal Links Boosts P2P Payments With Crypto & Global Reach": 0.5,
  "Top Stock Movers Now: Warner Bros Discovery, Rocket Lab, Steel Dynamics, and More": 0.5,
  "Software Companies Are Fighting Back With AI. The Stocks Are Still Hurting.": -0.6,
  "AMGN vs. VKTX: Which Biotech Stock Is the Better Obesity Play?": 0.0,
  "Will FTNT's Heavy Infrastructure Build-Out Drive Next Phase of Growth?": 0.5,
  "Lam Research Corporation (LRCX): A Bull Case Theory": 0.5,
  "Celsius Holdings, Inc. (CELH): A Bull Case Theory": 0.5,
  "Starbucks to add ‘hundreds of thousands of seats’ back to its stores": 0.6,
  "EA and Full Circle Launch skate. in Early Access Today": 0.5,
  "Netflix Says Canelo vs. Crawford Set Streaming Record": 0.5,
  "Ondaro Appoints Jason Whitesides as Chief Revenue Officer to Drive Growth and Innovation": 0.6,
  "Cantor Fitzgerald Reiterates Neutral Rating on Shopify (SHOP) Amid 103% Rally and Strong Cross-Border Growth": 0.5,
  "Absci Corporation Taps Advanced Micro Devices Inc. (AMD) Chip for AI Drug Discovery Platform": 0.5,
  "Susquehanna Reiterates Broadcom (AVGO) Buy Rating, $400 Target on AI Solutions Growth": 0.8,
  "Netflix’s (NFLX) Seasonal Tailwinds and Pricing Power Justify Bernstein’s Buy Rating": 0.8,
  "Crowdstrike Holdings Inc. (CRWD) Partners with Amazon on Falcon Go": 0.5,
  "Andrew Yang took inspiration from Mark Cuban for his budget cell carrier Noble Mobile": 0.5,
  "Palo Alto Networks Stock is Up, But Analysts Have Raised Their Targets": 0.5,
  "Leverage Shares Launches First 3x Single-Stock ETPs on HOOD, HIMS, UNH and Others": 0.5,
  "Equities Mostly Fall Intraday as Fed Meeting Begins": -0.5,
  "Real estate mogul Grant Cardone warns Saylor’s Bitcoin treasury mania is over": -0.5,
  "Apple Could Be Best Positioned to Benefit From AI Hardware ‘Revolution,’ Analyst Says": 0.8,
  "As Opendoor Touts Sweeping Job Cuts, Turnaround Plans, How Should You Play OPEN Stock?": 0.2,
  "BABA is at a 4 year high - Ahh it’s that time of year to discuss Reddit’s favorite sector: Chinese equities. Yes, if you bought during or before 2021 you likely are still down. However, if you held your nose and bought when it was trading at dirt cheap prices during Feb 2024 you’re probably pretty happy right now. The best time to buy is when everyone says “this is Uninvestable.” For example, I think": 0.6,
  "Benchmark Maintains Buy Rating for MercadoLibre (MELI)": 0.6,
  "Mizuho Maintains Outperform Rating on Intuit (INTU), Sees a Buying Chance": 0.8,
  "DA Davidson Keeps Buy Rating for Adobe (ADBE) After Q3 FY 2025 Results": 0.6,
  "Truist Keeps Hold Rating on Costco (COST) After August Sales Report": 0.2,
  "Why Opendoor (OPEN) Stock Is Nosediving": -0.7,
  "Top Midday Decliners": -0.5,
  "Redburn Atlantic Maintains a Buy on Gilead Sciences (GILD), Sets a $143 PT": 0.6,
  "Canaccord Genuity Reiterates a Buy on Biogen (BIIB)": 0.5,
  "What Do Analysts Think About Amgen Inc. (AMGN)?": 0.0,
  "AI agents could multiply cyber risk, warns Zscaler CEO": -0.6,
  "Celsius Takes Control Of Energy Drink Aisle With PepsiCo Partnership": 0.6,
  "Cintas Corporation Hosts the Cincinnati 9/11 Memorial Stair Climb in Support of the National Fallen Firefighter Foundation": 0.5,
  "Microsoft announces $30 billion investment in AI infrastructure in UK - Microsoft said on Tuesday that it plans to invest $30 billion in artificial intelligence infrastructure in the U.K. by 2028. The investment includes $15 billion in capital expenditures and $15 billion in its U.K. operations, Microsoft said. The company said the investment would enable it to build the U.K.’s “largest supercomputer,” with more than 23,000 advanced graphics processing units, in partnership with Nscale, a": 0.8,
  "US Equity Indexes Lower Ahead of the Fed's Rate-Cut Decision": -0.5,
  "3 Top AI Energy Stocks to Buy and Hold Forever": 0.5,
  "Cybersecurity Stocks: Netskope Hikes IPO Price, Aims To Raise $900 Million": 0.5,
  "Keurig Dr Pepper Declares Quarterly Dividend": 0.5,
  "Paychex, Inc. Schedules First Quarter Fiscal 2026 Earnings Conference Call for September 30, 2025": 0.2,
  "Ubisoft stocks just keep freefalling - I'm not surprised they're falling. I'm just surprised how quickly it's happening. Since I made a post here 2 weeks ago regarding Ubi stock prices, they have dropped from 8.92 euro to 8.36 euro. They were already worth pennies on the dollar, now even less... I know they are not a well liked corporation but wtf is causing such a sharp price exodus RN? I don't know of any": -0.6,
  "Strategy CEO, Crypto Advocates Meet At Bitcoin Reserve Roundtable": 0.5,
  "ASML Stock Rises As Semiconductor Equipment Group Rallies": 0.8,
  "The AI Trade Has Stocks Near Highs Again. Some Tech Names Remain on the Sidelines": 0.5,
  "Is Netflix Stock Down For The Count After Boxing Match?": -0.5,
  "Chipmakers Post Longest Win Streak Since 2017 Amid AI Growth": 0.8,
  "US Equity Markets End Lower Amid Likely Interest Rate Cut Expectations, Increase in Industrial Production": 0.2,
  "Netskope IPO In Demand as AI Era Heightens Cyber Threats": 0.5,
  "US Equity Indexes Lower Ahead of Fed Policy Decision Despite Robust Retail Sales, Surprise Industrial Production Print": -0.5,
  "Miran is Trump's 'sock puppet': Sen. Warren on Fed independence": -0.5,
  "Corporate Tax Collections Decline as New Law Kicks In": -0.7,
  "HONEYWELL ANNOUNCES PRICING OF SOLSTICE ADVANCED MATERIALS' OFFERING OF SENIOR NOTES IN CONNECTION WITH PLANNED SPIN-OFF": 0.2,
  "Palantir: A Strong Investment or a Risky Bet?": 0.0,
  "CoStar Group Founder and CEO Andy Florance Named 2025 Tech Titan by Washingtonian Magazine": 0.8,
  "S&P 500, Nasdaq Fall From Record Highs as Fed Decision Looms": -0.5,
  "ASML (ASML) Ascends While Market Falls: Some Facts to Note": 0.5,
  "The Trade Desk (TTD) Suffers a Larger Drop Than the General Market: Key Insights": -0.5,
  "Airbnb, Inc. (ABNB) Advances While Market Declines: Some Information for Investors": 0.5,
  "Why the Market Dipped But Intel (INTC) Gained Today": 0.2,
  "Starbucks (SBUX) Gains As Market Dips: What You Should Know": 0.5,
  "Lam Research (LRCX) Rises As Market Takes a Dip: Key Facts": 0.5,
  "Warner Bros. Discovery (WBD) Falls More Steeply Than Broader Market: What Investors Need to Know": -0.5,
  "Axon Enterprise (AXON) Sees a More Significant Dip Than Broader Market: Some Facts to Know": -0.5,
  "MercadoLibre (MELI) Advances While Market Declines: Some Information for Investors": 0.5,
  "Diamondback Energy (FANG) Advances While Market Declines: Some Information for Investors": 0.5,
  "American Bitcoin, Backed by Eric and Donald Trump Jr., Joins Crowded Crypto Field": 0.2,
  "GSK Says It Will Spend $30B on U.S. Manufacturing and R&D": 0.8,
  "(Item 8.01) . Other Events. Olivier Lemire has been appointed as President, U.S. Coffee of Keurig Dr Pepper Inc. (the “Company”). Mr. Lemire has been with the Company since 2011 and previously served as President of the Company’s Canadian business. Patrick Minogue, the Company’s former President of U.S. Coffee, will remain with the Company to support the transition to his successor through September 30, 2025.": 0.5,
  "(Item 8.01) – Other Events On September 16, 2025, Workday announced that its Board of Directors authorized the repurchase of up to an additional $4.0 billion of Workday’s outstanding shares of Class A common stock (the “Share Repurchase Program”). The Share Repurchase Program has no expiration date, may be suspended or discontinued at any time, and does not obligate Workday to acquire any amount of Class A common stock. As of July 31, 2025, approximately $1.2 billion": 0.2,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers . On September 15, 2025, Heather M. Fernandez notified Atlassian Corporation (the “ Company ”) of her decision to retire as a director of the Company, effective as of September 30, 2025. Ms. Fernandez’s decision to resign was not the result of any disagreement with the Company on any matter relating to its operations, policies, or": -0.2,
  "(Item 5.07) below, at a special meeting of stockholders (the “Special Meeting”) of The Trade Desk, Inc. (the “Company”) held on September 16, 2025, the stockholders of the Company approved the amendment and restatement of the Company’s articles of incorporation (as amended, the “Amended Articles”). The information set forth in\n\n(Item 5.07) of this Current Report on Form 8-K is incorporated by reference into this\n\n(Item 5.07) Submission of Matters to a Vote of Security Holders. On September 16, 2025, the Company held the Special Meeting. As of the record date for the Special Meeting, which was established by the Board to be the close of business on July 21, 2025, there were 445,649,241 shares of the Company’s Class A common stock, par value $0.000001 per share (the “Class A Common Stock”), outstanding (each entitled to one vote per share) and 43,275,936": 0.1,
  "Review & Preview: The Fed’s Awkward Day": 0.1,
  "Elliott Issues Statement on Workday, Inc. - WEST PALM BEACH, Fla., Sept. 16, 2025 /PRNewswire/ -- Elliott Investment Management L.P. (\"Elliott\"), which manages funds that together hold a significant investment in Workday, Inc. (NASDAQ: WDAY) (\"Workday\"), today issued the following statement: Elliott is one of Workday's largest investors, with an investment of more than $2 billion. We believe CEO Carl Eschenbach, CFO Zane Rowe and the entire Workday team have made substantial progress in recent": 0.5,
  "The Smartest Artificial Intelligence (AI) Stocks to Buy With $1,000": 0.5,
  "Tom Lee Says Ethereum Is Entering A 'Macro Super Cycle' For The Next Decade": 0.8,
  "Osaka Rises as the Top Choice for Chinese Travelers Celebrating Golden Week, Agoda Reports": 0.6,
  "Arm Holdings (ARM) Stock: Analysts See Nvidia-Like Strategy Taking Shape": 0.5,
  "Applied Materials (AMAT) Stock: Downgraded to Neutral as Competition Rises in China": -0.6,
  "Stifel Maintains Hold on Datadog (DDOG) After Mid-Quarter Check": 0.1,
  "Citizens JMP Reiterates Market Perform on Adobe (ADBE) Following Q3 Beat": 0.5,
  "AMD (AMD) Downgraded to Hold by Erste Group on Margin Concerns": -0.5,
  "AppLovin (APP) Price Target Raised to $725 by Wedbush, Outperform Maintained": 0.8,
  "Firing on All Cylinders: Biogen (NASDAQ:BIIB) Q2 Earnings Lead the Way": 0.8,
  "A Look Back at Processors and Graphics Chips Stocks’ Q2 Earnings: Qualcomm (NASDAQ:QCOM) Vs The Rest Of The Pack": 0.1,
  "Processors and Graphics Chips Stocks Q2 Highlights: Broadcom (NASDAQ:AVGO)": 0.2,
  "Goldman Sachs Reiterates Buy on Adobe (ADBE) With $570 PT, Citing AI Momentum": 0.8,
  "Why Analysts See Micron (MU) Benefiting From the AI Data Center Boom": 0.6,
  "3 Reasons We Love Lam Research (LRCX)": 0.8,
  "1 Nasdaq 100 Stock Worth Investigating and 2 Facing Challenges": 0.2,
  "1 Healthcare Stock Worth Your Attention and 2 We Brush Off": 0.2,
  "3 Volatile Stocks with Open Questions": -0.5,
  "1 Oversold Stock Primed to Rebound and 2 That Underwhelm": 0.2,
  "3 Cash-Producing Stocks We Steer Clear Of": -0.5,
  "Ollin debuts with $100M and plans to challenge top-selling eye drugs": 0.5,
  "Lloyds Banking Group Extends Strategic Partnership with Broadcom to Accelerate Digital Transformation": 0.6,
  "r/Stocks Daily Discussion Wednesday - Sep 17, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.0,
  "Billionaire David Tepper of Appaloosa Is Buying 3 Trillion-Dollar Artificial Intelligence (AI) Stocks and Selling 3 Others": 0.5,
  "AstraZeneca says Fasenra misses main goal in COPD trial": -0.6,
  "I Was Making $20K A Month Off 2 Texas Properties In My 20s, But Now I'm Bleeding $1700 Each Month. Should I Sell Them or Raise the Rent?": 0.2,
  "3 Top Stocks to Buy and Hold Forever": 0.5,
  "Should You Buy Costco Before Sept. 25?": 0.1,
  "Is Lululemon Stock Finally a Buy Below $170?": 0.5,
  "1 Unstoppable Stock That Could Join Nvidia Microsoft and Apple in the $2 Trillion Club by 2028": 0.8,
  "Zacks Investment Ideas feature highlights: Talen, Amazon, Nvidia, Constellation Energy and MasTec": 0.5,
  "AI Buildouts Push Data Center Switch Sales in Front-end Networks to Record Levels, According to Dell'Oro Group": 0.5,
  "Seraphic Browser-Native Protection Now Available for Purchase on the CrowdStrike Marketplace": 0.5,
  "2 High-Yield Dividend Stocks You'll Wish You Had Bought 10 Years From Now": 0.8,
  "Lululemon Stock Hasn't Been This Cheap Since 2020. Is It a Bargain Buy, or Is It Heading Lower?": 0.2,
  "LTIMindtree Partners with Shopify to Launch an AI Commerce Center of Excellence": 0.6,
  "Best Artificial Intelligence (AI) Stock to Buy Now: Nvidia or Palantir?": 0.5,
  "Investors haven't been this bullish on stocks since February - Wall Street fund managers are piling back into equities, even as the economic backdrop turns shakier. Bank of America's latest Global Fund Manager Survey, released Tuesday, showed global equity allocations for September rose to a seven-month high. https://finance.yahoo.com/news/investors-havent-been-this-bullish-on-stocks-since-february-171424588.html": 0.8,
  "Oracle Sparks Bubble Talk With Stock Price in Dot-Com Territory": 0.2,
  "This Technology Stock Just Crashed 35% in 1 Day. Time to Buy?": -0.7,
  "Google preps for bot payments": 0.5,
  "Data Center Construction Strategic Industry Report 2025-2030 Featuring Over 200 Companies Including ABB, Aecom, Ascenty, Cisco Systems, and Clayco": 0.5,
  "Stock Index Futures Tread Water With All Eyes on Fed Rate Decision": 0.2,
  "MGX joins Silver Lake as co-investor in semiconductor company Altera": 0.5,
  "Is BigBear.ai Stock a Buy Now?": 0.2,
  "1 Top Cryptocurrency to Buy Before It Soars 18,254%, According to Strategy's Michael Saylor": 1.0,
  "Broadcom Expands Lloyds Banking Deal To Power Massive Digital Overhaul": 0.8,
  "PayPal taps data for ad revenue": 0.2,
  "Amazon announces above inflation pay rise for staff": 0.8,
  "China bans tech companies from buying Nvidia’s AI chips - China’s internet regulator has banned the country’s biggest technology companies from buying Nvidia’s artificial intelligence chips, as Beijing steps up efforts to boost its domestic industry and compete with the US. The Cyberspace Administration of China (CAC) told companies, including ByteDance and Alibaba, this week to end their testing and orders of the RTX Pro 6000D, Nvidia’s tailor-made product for the country, according to three": -0.6,
  "Parents can delay the smartphone with Bounce 2 kids smartwatch from Garmin": 0.5,
  "Palantir Technologies Achieves Cybersecurity Maturity Model Certification (CMMC) Level 2": 0.5,
  "Nurix Therapeutics Presents Preclinical Data from Novel IRAK4 Degrader, GS-6791, Demonstrating Potent Inhibition of IL-1 and IL-36 in Vitro and Efficacy in a Model of Dermatitis": 0.8,
  "Baker Hughes Secures Multi-Year Contract with Petrobras for Offshore Stimulation Vessels": 0.6,
  "Regeneron Announces Positive Phase 3 Trial in Adults with Ultra-Rare Genetic Disorder Fibrodysplasia Ossificans Progressiva (FOP), Demonstrating that Garetosmab Prevents Greater than 99% of Abnormal Bone Formation": 1.0,
  "ECARX Powers Global Launch of Geely Galaxy M9, Delivering a Next-Generation AI Cockpit Experience": 0.8,
  "Will Weakness in Adobe Inc.'s (NASDAQ:ADBE) Stock Prove Temporary Given Strong Fundamentals?": 0.5,
  "Texas Instruments Incorporated's (NASDAQ:TXN) Fundamentals Look Pretty Strong: Could The Market Be Wrong About The Stock?": 0.6,
  "SAPHNELO self-administration TULIP-SC Phase III trial meets primary endpoint in patients with systemic lupus erythematosus based on an interim analysis": 0.6,
  "As of 2025, the Average Social Security Retirement Benefit Check is $1,976. Could ASML Help Boost Your Retirement?": 0.2,
  "Lilly, Novo showcase new obesity drug data; Fasenra falls short in COPD": -0.2,
  "Best credit card deals of the week": 0.0,
  "Groq Raises $750 Million as Inference Demand Surges": 0.8,
  "Flowserve Announces the Appointment of Alice DeBiasio as President of Flow Control Division": 0.5,
  "Top Dividend Stocks To Consider In September 2025": 0.5,
  "Strong Results Lifted MercadoLibre (MELI) in Q2": 0.8,
  "Will Eaton’s (ETN) New Digital Partnerships Reshape Its Competitive Edge in Energy Management?": 0.5,
  "Groq more than doubles valuation to $6.9 billion as investors bet on AI chips": 0.8,
  "AI Chips Update - UK Boosts AI Power With Massive NVIDIA GPU Deployment": 0.8,
  "Exploring US High Growth Tech Stocks September 2025": 0.5,
  "Is Micron Technology (MU) Still Fairly Valued After Its Recent Share Price Surge?": 0.2,
  "How Recent FDA Approval Impacts the Valuation Story for Vertex Pharmaceuticals in 2025": 0.5,
  "A Look at AMD’s Valuation Following Strategic AI Partnerships and Growing Cloud Adoption": 0.5,
  "Lear taps Palantir software for manufacturing operations": 0.2,
  "Sands Capital Global Growth Fund Sold Airbnb (ABNB) as Top-line Growth Decelerated": -0.5,
  "Can Comcast’s (CMCSA) Community Expansion Efforts Reveal Clues About Its Long-Term Growth Strategy?": 0.2,
  "Does Palantir Still Have Room to Run After 126% Surge and New Army AI Partnership?": 0.5,
  "Texas Instruments (TXN): Valuation Reassessed After China Launches Chipmaker Investigations": -0.5,
  "Nokia, Datwyler IT Infra, Intel, and SIPBB launch private 5G and AI-powered edge innovation hub in Switzerland": 0.5,
  "SHARC Energy Named Cohort 2 Finalist in New York Climate Exchange’s Sustainable Solutions Challenge": 0.8,
  "Cerence AI Collaborates with DSP Concepts to Revolutionize In-Car Audio": 0.8,
  "Ka'Chava Expands Its Retail Presence with Exclusive Launch on Costco.com": 0.6,
  "Cognizant Named to Forbes' list of Canada's Best Employers for Company Culture 2025": 0.8,
  "Amazon Aims to Grow Ad Sales Further by Automating Creation": 0.5,
  "Apple iPhone Air and iPhone 17 review: Apple's strongest lineup in years": 0.8,
  "With 77% ownership of the shares, PepsiCo, Inc. (NASDAQ:PEP) is heavily dominated by institutional owners": 0.1,
  "iPhone Air, iPhone 17: Why this is Apple's strongest lineup in years": 0.8,
  "Should Zscaler's (ZS) Z-Flex Adoption and Stock Plan Filing Prompt Investor Attention?": 0.5,
  "Treasury Secretary Bessent, like Fed Governor Cook, made contradictory mortgage pledges: Bloomberg - https://www.bloomberg.com/news/articles/2025-09-17/bessent-like-fed-governor-made-contradictory-mortgage-pledges Methinks Federal Reserve Governor Lisa Cook is now safe from removal. Too many of the rich in the Administration have abused the “primary residence” mortgage loophole for them to punish her. Turns out the accusations painted the accusers. Broadly speaking, these multiple cases of mortgage fraud and “incongruity” show that the distinction about criminal fraud relies on intent. Governor Cook provided": -0.5,
  "Venbrook and Cognizant Partner to Modernize Claims Processing for Insurance Carriers": 0.5,
  "Assessing AstraZeneca Shares After Investment Pause in Britain and Recent Price Slide": 0.1,
  "Is Axon Enterprise (AXON) Poised for Continued Durable Growth?": 0.5,
  "Dow Jones Futures Await Fed Rate Cut, Powell; Nvidia Falls On China Ban Report": 0.2,
  "Billionaire Mario Gabelli Says He’s Thinking About Buying More Kraft Heinz (KHC) Shares": 0.5,
  "Here’s Why ClearBridge Growth Strategy Added Axon Enterprise (AXON) in Q2": 0.5,
  "Does Howmet Aerospace (HWM) Have Runway for Growth and Expansion?": 0.2,
  "Palo Alto Networks (PANW): Evaluating Valuation After AI Expansion and CyberArk Acquisition in Cybersecurity Push": 0.5,
  "5 Things to Know Before the Stock Market Opens": 0.0,
  "CrowdStrike (CRWD) Is Up 5.1% After New AI Partnerships and Falcon Platform Enhancements – Has the Bull Case Changed?": 0.5,
  "Does DexCom's Interim Leadership Shift Alter the Strategic Outlook for DXCM?": 0.1,
  "Could Analyst Optimism Around APP’s Self-Serve Ad Platform Signal a Shift in Its Core Growth Strategy?": 0.5,
  "PayPal (PYPL) Valuation: Is the Market Missing a Story Beneath Recent Lows?": 0.2,
  "Stock Chart Expert Explains Why Amazon.com (AMZN) Will Jump": 0.6,
  "Intel (INTC): Evaluating Valuation Following Government Stake, Fresh Funding, and Leadership Overhaul": 0.5,
  "Amazon invests over $1 billion to raise employee pay, lower healthcare costs": 0.8,
  "Here’s Why ClearBridge Investments Growth Strategy Closed Out Charles River Laboratories International (CRL)": 0.2,
  "Sui Crypto Joins Google’s AP2 Launch, Putting Crypto Payments Into the AI Era": 0.6,
  "Where Will Broadcom Stock Be in 5 Years?": 0.2,
  "Advancing Cancer Research Brings New Hope for Patients Worldwide": 0.8,
  "Gesture-Control Wearables Redefine Human-Technology Interaction": 0.8,
  "CRDO Guides 120% Growth in Fiscal 2026: Will the Momentum Sustain?": 0.6,
  "Warner Bros Discovery's HBO Max Rolls Out Asia Expansion Ahead of New IT Series": 0.5,
  "Is Johnson Controls International plc (JCI) Benefiting From Increased Focus on AI": 0.5,
  "GEHC Expands Women's Health Portfolio With AI-Enabled Voluson": 0.5,
  "Market Chatter: Pharmaceutical Firms Pledge $350 Billion US Investment Amid Tariff Threats": 0.5,
  "From Sidelines to Strategy: How Shannon Lima Built a Career on Change, Curiosity, and Opportunity": 0.8,
  "Here’s What Lifted Robinhood Markets (HOOD) in Q2": 0.5,
  "Intel’s Granite Rapids processor seeing \"meaningful ramp,\" KeyBanc analysts say": 0.5,
  "TD SYNNEX Wins 2025 CrowdStrike Global Distributor Partner of the Year Award": 0.8,
  "Where Will Costco Stock Be in 5 Years?": 0.0,
  "Icarus raises $6.1M to take on space’s “warehouse work” with embodied-AI robots": 0.6,
  "Synopsys, Inc. (SNPS) Is a Trending Stock: Facts to Know Before Betting on It": 0.5,
  "Dear Micron Stock Fans, Mark Your Calendars for September 23": 0.5,
  "Calculating The Intrinsic Value Of Constellation Energy Corporation (NASDAQ:CEG)": 0.0,
  "Sally Beauty and DoorDash Team Up to Deliver Fall Beauty Must-Haves on the Go": 0.5,
  "Israel's Glilot Capital raises $500 million for new AI and cybersecurity investments": 0.8,
  "Digital Twin Consortium Welcomes AMD to Accelerate AI-Powered Digital Twin Innovation at the Edge": 0.6,
  "Nvidia, Stubhub, Trump visits the UK: 3 Things": 0.1,
  "Fed decision, China's Nvidia ban, TikTok deal: 3 Things": 0.2,
  "General Mills, Workday, Nvidia, Baidu: Trending Stocks": 0.0,
  "Sector Update: Health Care Stocks Rise Premarket Wednesday": 0.5,
  "Varied Growth Drivers Led ClearBridge Investments Growth Strategy to Add The Sherwin-Williams Company (SHW)": 0.5,
  "Lyft stock soars 20% on Waymo Nashville robotaxi deal - Waymo has partnered with Uber to get its robotaxis into Atlanta and Austin, Texas. Now it’s teaming up with Lyft for the first time in a commercial deal to enter Nashville next year. Lyft stock rocketed 20% higher on the news. Riders in Nashville will be able to hail a Waymo robotaxi through the Waymo One app, and Lyft will add Waymo robotaxis to its": 0.8,
  "Dan Niles Says Nvidia (NVDA) Data Center Miss Should Not Be Ignored": 0.2,
  "Quantinuum CEO Says It’s at a ‘Turning Point.’ The Company Is Achieving New Feats in Quantum Computing.": 0.8,
  "CommScope Rides on Strength in ANS Segment: Will it Persist?": 0.5,
  "Vertex Plunges Around 24% in Six Months: How to Play the Stock": -0.6,
  "Results from Phase 2 COURAGE Trial Demonstrating Potential to Improve Quality of GLP-1 receptor agonist-induced Weight Loss by Preserving Lean Mass, Presented at EASD": 0.5,
  "Comcast to Host Third Quarter 2025 Earnings Conference Call": 0.0,
  "Why Palantir Technologies Inc. (PLTR) is a Top Stock for the Long-Term": 0.8,
  "Is Micron (MU) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Is PDD Holdings Inc. Sponsored ADR (PDD) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "Netflix upgraded, Five Below initiated: Wall Street's top analyst calls": 0.5,
  "Cisco: Leveraging Technology To Transform Homeless Services": 0.5,
  "Why Amgen (AMGN) is a Top Value Stock for the Long-Term": 0.6,
  "Apple initiated, Hershey upgraded: Wall Street’s top analyst calls": 0.5,
  "ASYS' Cost Reduction Initiatives: Can it Drive Margin Expansion?": 0.5,
  "Nvidia Stock Drops on Report China Has Banned Its Chips. What It Means for Investors.": -0.6,
  "2 Growth Stocks to Buy and Hold Forever": 0.5,
  "Comcast Opens First Xfinity Store in Lawrenceville, Georgia": 0.5,
  "Treasury bonds are gaining popularity as today is likely the start of the first interest rate cut this year. - ***TLT*** *is highly sensitive to the rate cat. It is for the adventurous but not extremely risky*. TLT has never been less than $80 for over 23 years. *On the opposite end, there is* ***SGOV*** *for the super conservative who wants to store money like in a bank account.* **Yields from Treasury bonds** and other": 0.5,
  "DoorDash: Momentum or Mirage After the Rally?": 0.2,
  "ADI's Industrial Segment Improves: What's Driving the Growth?": 0.5,
  "Solana Treasury Firm Holdings Could Double as Forward Industries Unveils $4 Billion Raise": 0.5,
  "A deep dive into the autonomous robobus market: the renault-weride partnership - I've been tracking the autonomous vehicle space like tesla to find a good point to sell it, and the news about weride caught my attention. their plan to launch a mass-produced robobus by 2030 for the european market seems like a big shift. This partnership raises some interesting questions for me. for a while, the market's been obsessed with robotaxis, but the b2b": 0.5,
  "GOOGL vs GOOG: how many outstanding shares - Is there any way to determine the number of outstanding shares for Google but broken down between the number of class A (GOOGL) vs. class C (GOOG) shares? All the financial sites I see show the combined figure (\\~12B) for both tickers.": -0.2,
  "Amazon launches AI agent to help sellers complete tasks and manage their businesses": 0.6,
  "Why Did Redwire Stock Crash Today?": -0.5,
  "This Tech Stock Just Hit Another All-Time High": 0.8,
  "Regeneron Says Antibody Combo May Preserve Muscle During Weight Loss": 0.5,
  "FedEx, Netflix, Walmart: Top Analyst Calls": 0.5,
  "Trump's UK visit: US Big Tech to invest billions in UK's AI": 0.6,
  "Workday gains, FedEx demand troubles, Ben & Jerry's founder quits": 0.1,
  "Honeywell's Unit Prices Senior Notes Offering at $1B in Aggregate": 0.5,
  "Costco construction could start this fall after retailer buys Oconomowoc site for $7 million": 0.5,
  "CrowdStrike Guidance On Key Metric Takes Center Stage At Investor Day": 0.5,
  "Bill Ackman Insurance acquisition TBA soon at 09/30 annual meeting? - Previously Bill Ackman for HHH mentioned that he was looking to acquire a 1-3B+ insurance co following the model of Warren Buffett. It is expected that an announcement can happen at the annual meeting in a couple of weeks on Sep 30 or even announced earlier. the reason why Warren outperforms the market & loves insurance, is because insurers reinvests their profits. For Warren": 0.5,
  "NetExperience Appoints Jack Raynor as President to Accelerate OpenWiFi Growth and Innovation": 0.6,
  "Can TTD's Strategies & Innovations Shield Stock in an Uncertain Market?": 0.2,
  "Bernstein sees Dollarama as Canada’s ’Costco,’ stays cautious on Five Below": 0.2,
  "If You Had Invested in These 3 Growth Stocks 15 Years Ago, You Would’ve Become a Millionaire": 0.8,
  "Uranium/Nuclear Equities irrationally sinking due to China 'ban' on NVIDIA's AI chips. The reality is uranium is in seriously short supply. - Obviously this ban (actually the Chinese government telling Chinese companies to avoid NVIDIA's AI chips) is bringing down NVIDIA stocks today. But it looks like it is also affecting Uranium and Nuclear. Sprott and VanEck Uranium/Nuclear ETFs are down up to a half percent as I type this, for example. However, this \"instruction\"": 0.2,
  "Analyst Says Broadcom (AVGO) is ‘Too Expensive’ – ‘Don’t Think They’re Going to Take Over Nvidia’": -0.6,
  "Amazon spends $1 billion to increase pay and lower health care costs for US workers": 0.8,
  "The UK companies partnering with US big tech": 0.5,
  "Why the Dow Is Crushing the S&P 500 and Nasdaq": 0.5,
  "GitLab (GTLB) Analysts Say Fears of AI Replacing Developers Are Overblown": 0.6,
  "Analysts Say AI Is Not the ‘Death Knell’ for Atlassian (TEAM) Stock": 0.5,
  "Why Is Palo Alto (PANW) Up 10.9% Since Last Earnings Report?": 0.5,
  "Meta (META) Stock Backed With $900 Price Target as Reels Ads Expand": 0.5,
  "Nvidia stock dips as China reportedly tells its companies to avoid buying chips": -0.6,
  "NCLH vs. ABNB: Which Stock Is the Better Value Option?": 0.0,
  "LYFT or SHOP: Which Is the Better Value Stock Right Now?": 0.2,
  "PDD vs. GLBE: Which Stock Should Value Investors Buy Now?": 0.2,
  "Apple (AAPL) Downgraded as Analysts See No Significant AI Innovation": -0.6,
  "Starbucks CEO says the coffee chain won’t lose its cash-strapped consumers because it’s on its way to being a ‘world-class customer service’ company": 0.6,
  "DexCom, Inc. (DXCM): A Bull Case Theory": 0.5,
  "Broadcom Inc. (AVGO): A Bull Case Theory": 0.5,
  "Warner Bros. Discovery, Inc. (WBD): A Bull Case Theory": 0.5,
  "Top Midday Stories: Markets Await Fed Rate Decision; China Regulator Reportedly Bans Nvidia Chip Sales to Alibaba, ByteDance": 0.2,
  "Teen Founders, Tap The Brakes: Paul Graham Says Curiosity Beats Companies In High School — Despite YC Wins With Airbnb, Reddit, And Sam Altman At 19": 0.2,
  "Gold has hit a new record high. Here's how much that Costco gold bar is worth.": 0.5,
  "Andy Jassy’s crusade against Amazon’s bureaucracy led to 1,500 tip line complaints and 450 process changes—and counting": 0.5,
  "Almost Everything Is Rallying Ahead of Fed Decision. What’s Not Matters More.": 0.5,
  "Senior Yale Professor on Tesla (TSLA): ‘This is the Biggest Meme Stock We’ve Ever Seen’": 0.2,
  "Aker-Nscale JV signs Multi-Billion Dollar AI infrastructure agreement with Microsoft": 0.8,
  "Cathie Wood Goes Bargain Hunting: 3 Stocks She Just Bought": 0.5,
  "Lucid + Uber robotaxi deal could mark the start of a new chapter - Lucid has been under pressure for a long time but the picture looks more interesting now. 1. Uber just invested 300 million dollars to partner with Lucid on a 20,000 unit robotaxi fleet built on the Gravity SUV platform. This is a huge validation of both Gravity and Lucid’s tech, with the first launch planned in the US next year 2.": 0.8,
  "Workday AI Push Signals Durable Growth And Sharper Margins Ahead": 0.8,
  "Bill and Melinda French Gates gave their Gen Z daughter this piece of business advice before she launched her own $8 million startup": 0.5,
  "GrowthLoop Launches Compound Marketing Engine for Commerce Media Networks, Enabling Enterprises to Unlock New Revenue Streams": 0.6,
  "GE HealthCare (GEHC) Upgraded to Strong Buy: What Does It Mean for the Stock?": 0.6,
  "Are You Looking for a Top Momentum Pick? Why AppLovin (APP) is a Great Choice": 0.8,
  "Are You Looking for a Top Momentum Pick? Why Micron (MU) is a Great Choice": 0.8,
  "Analysts Are Pounding the Table on This Red-Hot AI Stock": 0.8,
  "US Equity Indexes Mixed Ahead of Fed Rate Decision": 0.0,
  "Nvidia faces ban in China, Chinese tech gains, Uber stock falls": -0.5,
  "Should American Investors Be Concerned About China's Slowdown? - The most recent data from China showed that retail sales were up 3.4%, fixed-asset investment was just up 0.5%, and industrial production was up 5.2% YoY (the lowest in a year). This suggests a decline in local demand, which might have an impact on commodities, multinational corporations (AAPL, TSLA, NKE), and international commerce. On the other hand, slower growth in China reduces inflation pressure, perhaps allowing": -0.2,
  "Amazon Upgrades Seller Assistant By Adding Agentic Capabilities": 0.5,
  "Why CrowdStrike (CRWD) Might be Well Poised for a Surge": 0.6,
  "Job seekers feel awful about the labor market. Data is finally starting to explain why.": -0.8,
  "Autodesk CEO talks industry impact of new AI architecture tools": 0.5,
  "Winning The Game Within The Game – The Top 5 Highest Earning NIL Deals For College Athletes": 0.5,
  "Watch These Alphabet Stock Price Levels After Google Parent Joins the $3 Trillion Club": 0.5,
  "Why Lyft Stock Was Climbing Today": 0.5,
  "Airbuds is the music social network Apple and Spotify wish they had built": 0.6,
  "Workday Poised to Achieve Medium-Term Growth Targets, RBC Says": 0.6,
  "Falcon for IT Risk-based Patching Accelerates Cybersecurity and IT Consolidation on CrowdStrike": 0.5,
  "Market Chatter: Reddit in Talks for New Content Sharing Deal With Google": 0.5,
  "US Equity Indexes Mixed as Investors Await Fed Rate Decision": 0.0,
  "Families of Victims in Air India 171 Crash Sue Boeing, Honeywell": -0.5,
  "CrowdStrike Threat AI Leads Threat Intelligence into the Agentic Era": 0.5,
  "Walmart Stock Heads for a Record High. The Retailer Could Become a Leader in ‘Agentic’ AI.": 0.8,
  "Can FTNT Stock Recover From YTD Drop on AI Security Push? How to Play": 0.2,
  "Meta Platforms vs. Snap: Which Social Media Stock Has an Edge?": 0.5,
  "Starbucks Corporation (SBUX) “Goes Much Higher,” Says Jim Cramer": 0.6,
  "Jim Cramer Discusses Target Corporation (TGT) And Turnarounds": 0.5,
  "Netflix ‘Has Won The Streaming Wars,’ Analyst Says. The Stock Is a Buy.": 0.8,
  "Jim Cramer Says Apple Inc. (AAPL)’s Going To Have The Best AI": 0.8,
  "Jim Cramer Says NVIDIA Corporation (NVDA)’s China Troubles Are Poorly Times": -0.5,
  "Can Mark Zuckerberg ‘Connect’ to More Upside for META Stock After the Hypernova Glasses Release?": 0.5,
  "Coherent Corp. (COHR): A Bull Case Theory": 0.5,
  "The Kraft Heinz Company (KHC): A Bull Case Theory": 0.5,
  "Meta Connect Preview: How To Watch Mark Zuckerberg Speech, What's Next For AI, Smart Glasses & Metaverse": 0.5,
  "MicroStrategy could see cheaper debt if Fed cuts rates today": 0.5,
  "Heavy Out-of-the-Money Put Options Activity in Amazon - Setting a Lower AMZN Buy-In Point": -0.5,
  "Broadcom (AVGO) Stock Trades Down, Here Is Why": -0.5,
  "Paramount (PSKY) Stock Trades Up, Here Is Why": 0.5,
  "IBD Stock Of The Day, Up 330%, Set To Join S&P MidCap 400": 0.8,
  "Workday (WDAY) Shares Skyrocket, What You Need To Know": 0.8,
  "US High Growth Tech Stocks to Watch for Potential Expansion": 0.5,
  "Equity Markets Mixed Ahead of Fed Decision": 0.0,
  "FIGR - Worth Investing In? - Hi all - I’m looking at Figure Technologies which IPO’d last week. They are profitable and seem to have a lot of investor excitement around them. My question is, what exactly do they do? Something like a crypto bank? I don’t get it. And for someone who does understand this space, what do you think of this company? Is it worth to get in around $35 on a profitable": 0.2,
  "Sector Update: Tech Stocks Mixed Wednesday Afternoon": 0.0,
  "MELI vs. EBAY: Which Online Marketplace Stock Is the Better Pick?": 0.5,
  "SKYBOXE Secures Nationwide Network Certification from T-Mobile for its 5G Fixed Wireless Access Router": 0.6,
  "The Fed is cutting interest rates by 25 basis points - Per CNBC's live thread that just updated now: [https://www.cnbc.com/2025/09/17/fed-meeting-today-live-updates.html](https://www.cnbc.com/2025/09/17/fed-meeting-today-live-updates.html) [https://www.federalreserve.gov/newsevents/pressreleases/monetary20250917a.htm](https://www.federalreserve.gov/newsevents/pressreleases/monetary20250917a.htm) >Recent indicators suggest that growth of economic activity moderated in the first half of the year. Job gains have slowed, and the unemployment rate has edged up but remains low. Inflation has moved up and remains somewhat elevated. >The Committee seeks to achieve maximum employment and inflation at the rate of 2 percent over": 0.2,
  "Sector Update: Energy Stocks Higher in Afternoon Trading": 0.5,
  "Truist Financial Reiterates a Buy on Microsoft Corporation (MSFT)": 0.6,
  "Citizens JMP Reiterates Outperform Rating on Meta Platforms (META)": 0.5,
  "J.P. Morgan Maintains a Buy on Apple Inc (AAPL)": 0.6,
  "Wall Street Has a Mixed Opinion on Advanced Micro Devices (AMD), Here’s Why?": 0.1,
  "Car Stocks Race Higher After Fed Cuts Rates": 0.8,
  "Regeneron Pharmaceuticals (REGN) Advances Allergy Pipeline with Two Positive Phase 3 Trials Evaluating First-in-Class Antibody-Blockers of Cat and Birch Allergies": 0.8,
  "Anthony Scaramucci Explains Why Warren Buffett's Apple Bet Shows Diversification Can Be Overrated: 'Don't Trade Michael Jordan For...'": 0.2,
  "Stifel Analyst Maintains Buy Rating on Adobe (ADBE) After Earnings Beat": 0.8,
  "Fast and Cheap: The Two Shortcuts That Fuel Freight Fraud": -0.6,
  "Barclays Forecasts 465,000 Tesla (TSLA) Deliveries in Q3, Above Consensus": 0.8,
  "The iPhone Air’s real breakthrough is its battery": 0.6,
  "Top Midday Gainers": 0.0,
  "Honeywell, Caterpillar CTOs say AI can ease labor, skills gaps in manufacturing": 0.6,
  "Boeing, Honeywell sued by Air India crash victim families": -0.8,
  "Quantum Computing Stocks Rally. IonQ, Honeywell In Space Collaboration.": 0.8,
  "Strong Buy Alerts: AppLovin & 2 More Momentum Stocks for Big Gains": 0.8,
  "Use These Stock Chart Signals to Find Winning Options Trades": 0.5,
  "TikTok Deal Could End Ban Saga. What To Watch For Meta Stock, Social Media Rivals.": 0.2,
  "Google’s Gemini goes 'nano-banana' in AI wars": 0.5,
  "It’s Not Just Bad Apples: Wall Street Sentiment on AAPL Stock Falls to Multi-Year Lows, so Should You Sell Shares Here?": -0.6,
  "Lyft Stock Pops on Tie-Up With Google's Waymo for Nashville Robotaxi Service": 0.8,
  "Google and PayPal Forge   Multiyear Partnership to Revolutionize Commerce": 0.8,
  "Why Netflix (NFLX) Stock Is Gaining Today?": 0.5,
  "Reddit is Becoming a Key Consideration for Marketers": 0.6,
  "Harvard Dropouts Behind Mercor Target $10 Billion Valuation As Startup Supplying OpenAI, Tesla And Nvidia Hits $450 Million Run Rate": 0.8,
  "Palantir Is Falling Today -- Is the Stock a Buy Right Now?": 0.1,
  "Nvidia’s UK Partner Is a 16-Month-Old Crypto Mining Spinout": 0.1,
  "Robinhood Stock - Can someone convince me on Robinhood? Been on the sidelines for a long time on this one & with the recent S&P inclusion I think it’s time I finally made the jump. I would be looking at Jan 21 2028 LEAPS on it, as I believe in its longterm potential & growth prospects… but the valuation and hype scare me": 0.2,
  "CoinDesk Live at Stellar Meridian 2025": 0.5,
  "As Drone Stocks Skyrocket, Cathie Wood Can’t Get Enough of This 1 Name": 0.8,
  "US Equity Indexes Mixed Following Fed's Rate Cut": 0.1,
  "Sector Update: Tech Stocks Mixed in Late Afternoon Trading": 0.0,
  "Tesla Cybertruck Underperformed In The US: Will The International Launch Be Different?": -0.5,
  "Apple's China iPhone Sales Slide 6% Before iPhone 17 Debut": -0.5,
  "Microsoft, Nvidia, Google, CoreWeave Ignite $39 Billion UK-US AI Mega Deal": 0.8,
  "TSMC Extends Lead With 38% Foundry Market Share": 0.8,
  "Lam Research And JSR Strike Chipmaking Partnership": 0.5,
  "Tesla Faces New Probe As Model Y Doors Fail To Open": -0.8,
  "Tesla Is Redesigning Door Handles That Drew Scrutiny Over Safety": 0.1,
  "Kleiner Perkins-backed voice AI startup Keplar aims to replace traditional market research": 0.5,
  "Sector Update: Health Care Stocks Edge Higher Late Afternoon": 0.5,
  "‘Red Queen Syndrome’ Hits Global Oil Production": -0.6,
  "Sector Update: Energy Stocks Advance in Late Afternoon Trading": 0.5,
  "AppLovin Stock Hits an All-Time High: Buy, Hold, or Take Profits?": 0.5,
  "Tesla Settles Two More Autopilot Lawsuits. Investors Shrug.": 0.2,
  "Lyft stock surges 13% on Waymo robotaxi deal in Nashville": 0.8,
  "IonQ Signs Memorandum of Understanding with U.S. Department of Energy to Advance Quantum Technologies in Space": 0.8,
  "US Equity Markets End Mixed as Investors Parse Fed's Interest Rate Cut Decision": 0.2,
  "As Nvidia Retreats, These AI Chip Stocks Show Strength": 0.5,
  "Google, PayPal partner to roll out AI-powered solutions across platforms": 0.6,
  "Netflix Stock Upgraded To Buy, Retakes Key Level": 0.8,
  "The ‘Neocloud’ Is Tech’s Next Big Thing. It Comes With a Risk.": 0.2,
  "Tesla is redesigning its door handles following safety probe, Bloomberg investigation": 0.1,
  "Anybody understand what's been going on with DEC lately? - I know they did something with creating new shares to fund a new acquisition recently, and now some big institution dumped shares (I think) but the info I'm finding is pretty limited and I'm not totally understanding what's going on. Would love somebody else's take on it.": -0.2,
  "US Equity Indexes Mixed After Fed's Rate Cut": 0.1,
  "Biogen Receives European Commission Approval for ZURZUVAE® (zuranolone), the First and Only Treatment Approved for Women with Postpartum Depression in Europe": 0.8,
  "Atlassian Appoints Jason Warner, poolside Co-Founder to Board of Directors": 0.2,
  "Kash Patel Called Krispy Kreme Stock a Buy and Fueled Wild Rally": 0.6,
  "Stock Market Today: Dow Jumps, Nasdaq Lags As Powell Sees 'Challenging Situation' (Live Coverage)": 0.2,
  "Tesla Stock Clinched a 7-Day Winning Streak. Here’s How.": 0.5,
  "Albertsons® Companies, Inc. Announces Board Changes": 0.0,
  "Google, PayPal Ink Multiyear Partnership on Digital Commerce": 0.6,
  "These Stocks Moved the Most Today: Nvidia, StubHub, Workday, Lyft, IonQ, Netflix, and More": 0.2,
  "Tesla's full self-driving isn't prime-time ready: CFRA analyst": -0.5,
  "Top Stock Reports for Exxon Mobil, AMD & Caterpillar": 0.0,
  "Tech, Media & Telecom Roundup: Market Talk": 0.0,
  "Jim Cramer Says Some People Are “Afraid” To Take Up NVIDIA Corporation (NVDA)": 0.2,
  "S&P 500 Gains & Losses Today: Uber Stock Skids, Homebuilding Sector Slips; Workday Jumps": 0.2,
  "Equities Mixed as Traders Parse Powell's Remarks After Fed Rate Cut": 0.0,
  "Tech Tracker: DoorDash, Uber Eats, more, expand restaurant operator tools": 0.5,
  "Health Care Roundup: Market Talk": 0.0,
  "Fed Signals More Cuts, But Powell Says Don't Be Too Sure (Live Coverage)": 0.1,
  "CoStar Group Founder and CEO Andy Florance Featured on Sixth Annual Virginia 500 Power List": 0.5,
  "xStocks Issuer Chose Switzerland to Avoid Whitelisting Tokenized Tesla Shares: CEO": 0.1,
  "S&P 500 crypto stocks tank after Fed’s surprising rate cut": -0.7,
  "Mondelēz 2024 Snacking Made Right Report: Health & Safety": 0.0,
  "Stocks to Watch Recap: StubHub, Cracker Barrel, Nvidia, General Mills": 0.2,
  "Lyft CEO discusses goals of Waymo robotaxi deal, consumer health": 0.5,
  "Starmer hails £150bn US tie-up amid ‘vassal state’ criticism": 0.2,
  "Apple and Citi CEOs Join Trump and King Charles at State Dinner": 0.2,
  "Costco (COST) Gains As Market Dips: What You Should Know": 0.5,
  "Why the Market Dipped But Paypal (PYPL) Gained Today": 0.2,
  "Palantir Technologies Inc. (PLTR) Suffers a Larger Drop Than the General Market: Key Insights": -0.5,
  "Why the Market Dipped But Take-Two Interactive (TTWO) Gained Today": 0.2,
  "Vertex Pharmaceuticals (VRTX) Declines More Than Market: Some Information for Investors": -0.5,
  "Gilead Sciences (GILD) Ascends While Market Falls: Some Facts to Note": 0.5,
  "Why Paccar (PCAR) Dipped More Than Broader Market Today": -0.5,
  "Nvidia has largest short position by dollar value as risk exposure declines - S3": 0.1,
  "5 Passive Income Streams for Retirees To Build Wealth": 0.5,
  "Q3 Earnings Outlook Remains Positive: A Closer Look": 0.8,
  "Sangoma Technologies Corporation (SANG) Q4 Earnings and Revenues Top Estimates": 0.8,
  "Stock market today: Dow, S&P 500, Nasdaq futures rise after Fed lowers rates, signals more cuts ahead": 0.8,
  "Dan O'Dowd Slams Tesla For Redacting Robotaxi Crash Information In NHTSA Reports: 'Robotaxi Had Three Crashes And Injured Somebody'": -0.8,
  "Meta launches smart glasses with built-in display, reaching for 'superintelligence'": 0.5,
  "Asia Morning Briefing: Bittensor’s dTAO Shows a Retail Path to AI Exposure Beyond Robinhood’s SPVs": 0.2,
  "Nvidia AI chip challenger Groq raises even more than expected, hits $6.9B valuation": 0.8,
  "Reddit stock may be in trouble - Recent news about political left leaning media constructs such as Colbert and now Kimmel are getting cancelled. Between the left leaning ideology most of reddit has and the fact theres porn all over.. its about time that regulation happens. Personally think the ai future can only drive the stock so far. When you see the stock has ran nicely from ipo of 30 bucks to over 250 in": -0.6,
  "Purpose Investments Inc. Announces September 2025 Distributions": 0.0,
  "Meta unveils its new Oakley Meta Vanguard smart glasses for athletes": 0.6,
  "Cohesity and Semperis Announce Groundbreaking Offering that Unifies Data and Identity Resilience": 0.8,
  "Market movers: Lyft stock accelerates, Workday active and Nvidia slips": 0.2,
  "Fangzhou Wins Gilead ‘Award of Excellence’ for AI-Driven Chronic Disease Management": 0.8,
  "Mark Zuckerberg unveils $799 Meta Ray-Ban Display glasses - Mark Zuckerberg on Wednesday unveiled the $799 Meta Ray-Ban Display glasses, the social media company’s first consumer-ready smart glasses with a built-in display. The glasses, which costs $799, contain a small digital display that can be controlled via hand gestures through a wristband powered by neural technology, confirming a CNBC report in August. A promotional video of the new smart glasses appeared on Meta’s YouTube page": 0.5,
  "EssilorLuxottica: EssilorLuxottica and Meta build on their successful partnership with new AI glasses that offer a glimpse into the future": 0.8,
  "Garmin powers live data for Oakley Meta Vanguard AI glasses": 0.5,
  "Meta Unveils New Smartglasses With Display and AI Abilities": 0.8,
  "Agoda's World Tourism Day Sale Presents Opportunities for Travel Partners": 0.5,
  "Looking For Yields: Avista, Cogent Communications, And Mondelez Are Consistent Moneymakers": 0.6,
  "Dow Jones Futures Rise After Fed Rate Cut, Nvidia Skids; Meta's Zuckerberg Connects": 0.5,
  "Zillow Will Benefit Strongly From A Housing Rebound - **Zillow (Z) $90.75, Planning to add tomorrow morning** **Industry/Sector/Type - - - Housing Marketplace/Platform/Steady growth tied to housing cyclicality.** **Biggest catalyst for the stock** \\- If interest/mortgage rates keep reducing and housing bottoms out, this could be a better way to play the housing rebound. It’s asset light, a market leader with a lot of scale and has emerged much stronger in the housing sector decline.": 0.8,
  "India leads the way on Google’s Nano Banana with a local creative twist": 0.6,
  "Panasonic aims to develop groundbreaking EV battery in about two years": 0.6,
  "China drops Google antitrust probe during US trade talks": 0.5,
  "Beijing drops Google probe, shifting focus to Nvidia in US trade talks, FT reports": 0.1,
  "When do you guys take Profits for long term stocks? - As the title says, how do you guys determine when to take profits? I've held some stocks (BAC, AMZN, GOOG, SOFI, and a few others), that I have had for years (so I won't be taxed at short gain tax at least). By now they've gotten at/over, or very close to, 100% returns. Now some of them give dividends even if it's very little": 0.2,
  "Huawei Unveils New AI Chip Tech to Challenge Nvidia’s Lead": 0.5,
  "The AI Boom Is Far From Over. Dell and 11 Other Industrial Stocks That Benefit.": 0.6,
  "The worst airlines for flight delays": -0.8,
  "Baker Hughes Strikes Iraq Deal To Cut Gas Flarin": 0.5,
  "$PTRN thoughts? - Did some cursory research on the company and it looks quite positive. upcoming IPO on friday! basically they use AI , analytics and consulting to help ecommerce brands optimize marketing channels and relevant data. to be aligned with their partners , they actually purchase inventory from their brand partners and help them sell through on the global marketplace direct to consumer some key financials pulled from their s-1 revenue climbed 29% from": 0.6,
  "Google's Managing Director for Africa on Digital Transformation": 0.5,
  "Workday Pops as Elliott Discloses $2 Billion Investment": 0.8,
  "Circus SE Delivers First CA-1 AI Robot to Meta": 0.5
}