{
  "2 Artificial Intelligence (AI) Stocks to Buy Before They Soar 100%, According to Select Wall Street Analysts": 0.8,
  "Next-Gen Cybersecurity Market Forecast to 2030 with Historical Analysis Since 2020 - Palo Alto Networks, CrowdStrike, and Fortinet Lead the $21+ Billion Industry": 0.5,
  "Roche Raises Full-Year Earnings Outlook as U.S. Drug-Pricing Talks Continue": 0.5,
  "United States Chronic Obstructive Pulmonary Disease Market Report 2025-2033, Profiles of AstraZeneca, Pfizer, GSK, Novartis, Astellas Pharma, Abbott Laboratories, Boehringer Ingelheim, Almirall": 0.1,
  "United States Oatmeal Market Forecast and Company Analysis Report 2025-2033 Featuring PepsiCo, Nestle, Kellogg's, Hain Celestial, Marico, Unilever, Post, and General Mills": 0.0,
  "United States Cookies Market Report Forecast and Company Analysis 2025-2033 Featuring Mondelez, Ferrero, Campbell Soup, Mckee Foods, Grupo Bimbo, General Mills, PepsiCo, Meiji, Hostess Brands": 0.5,
  "S&P 500 Futures Rise as Rate Cut Bets Grow": 0.8,
  "Tradr Debuts Leveraged ETFs on BLSH, DASH, FLY, IREN, NEM, OPEN, QS, SRPT & WULF": 0.0,
  "Synopsys, Inc. (SNPS) Stock Could Jump to $600, Says Mizuho": 0.8,
  "Crowded DSP Market Pressures The Trade Desk, Inc. (TTD), Says Guggenheim": -0.5,
  "Roper Technologies announces third quarter financial results and new share repurchase program": 0.5,
  "Old Dominion Freight Line Announces $0.28 Per Share Quarterly Cash Dividend": 0.5,
  "Creator Television® Launches On-Demand Offerings on Plex and Xumo Play": 0.5,
  "Roper Technologies: Q3 Earnings Snapshot": 0.0,
  "A Closer Look at Lululemon (LULU) Valuation After Analyst Upgrade and Growth Reset Plans": 0.5,
  "What GE HealthCare Technologies (GEHC)'s New AI Partnerships and Product Launches Mean for Shareholders": 0.5,
  "What to Expect From Monster Beverage's Q3 2025 Earnings Report": 0.1,
  "High Growth Tech Stocks in the US to Watch for October 2025": 0.5,
  "Bio-Techne Q1 Earnings Preview: What's in Store for the Stock?": 0.2,
  "Gilead to Showcase Interim Long-Term Efficacy Data for Livdelzi® (Seladelpar) in Primary Biliary Cholangitis (PBC) and Investigational Bulevirtide in Chronic Hepatitis Delta": 0.5,
  "Roper Technologies (ROP) Surpasses Q3 Earnings Estimates": 0.8,
  "Is ASML's 1.3B Euro AI Bet the Catalyst for Its Next Growth Cycle?": 0.5,
  "Texas Instruments signals ‘slower’ semiconductor market recovery": -0.5,
  "Blackstone (NYSE:BX) Reports Sales Below Analyst Estimates In Q3 Earnings": -0.5,
  "Roper cuts annual profit forecast as acquisition costs bite": -0.5,
  "Marvell Technology, Inc. (MRVL): A Bull Case Theory": 0.5,
  "Zacks.com featured highlights include The Honest Company, Dutch, AIM ImmunoTech, Masimo and Cognizant Technology Solutions": 0.1,
  "Atlassian Corporation (TEAM): A Bull Case Theory": 0.5,
  "Vertex Presents New Data Across Portfolio of Cystic Fibrosis Medicines Including ALYFTREK® at the North American Cystic Fibrosis Conference": 0.5,
  "These 2 Oils-Energy Stocks Could Beat Earnings: Why They Should Be on Your Radar": 0.5,
  "The Trade Desk (TTD) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "These 2 Consumer Staples Stocks Could Beat Earnings: Why They Should Be on Your Radar": 0.5,
  "Electronic Arts (EA) Q2 Earnings Preview: What You Should Know Beyond the Headline Estimates": 0.5,
  "Stock Market News for Oct 23, 2025": 0.0,
  "Company News for Oct 23, 2025": 0.0,
  "Roper Technologies (ROP) Reports Q3 Earnings: What Key Metrics Have to Say": 0.2,
  "Tech Tactics: Lululemon Taps VeChain to Crack Down on Counterfeits": 0.5,
  "The Zacks Analyst Blog Highlights lululemon athletica, NIKE and Under Armour": 0.5,
  "Is DoorDash (DASH) Stock Outpacing Its Computer and Technology Peers This Year?": 0.2,
  "Here's Why Constellation Energy Corporation (CEG) is a Strong Growth Stock": 0.8,
  "SPECTRUM REACH AND WAYMARK PARTNERSHIP POWERS OVER 15,000 CAMPAIGNS AND COUNTING, DRIVING SUCCESS FOR LOCAL BUSINESSES": 0.8,
  "Kentik Expands Executive Team to Support Demand for Network Intelligence": 0.5,
  "Gilead Sciences (GILD) Earnings Expected to Grow: Should You Buy?": 0.5,
  "Monolithic Power (MPWR) Earnings Expected to Grow: Should You Buy?": 0.5,
  "Atlassian (TEAM) Earnings Expected to Grow: Should You Buy?": 0.5,
  "Saia (SAIA) Expected to Beat Earnings Estimates: Can the Stock Move Higher?": 0.5,
  "Xcel Energy (XEL) Earnings Expected to Grow: Should You Buy?": 0.5,
  "Biogen Inc. (BIIB) Expected to Beat Earnings Estimates: Can the Stock Move Higher?": 0.5,
  "DexCom (DXCM) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "Is MRVL's Connectivity Portfolio the Next Growth Catalyst?": 0.5,
  "Barclays’ Vote of Confidence Could Be a Game Changer for KLA (KLAC)": 0.6,
  "Gilead Sciences Rallies 32% in 2025 Are Shares Trading Below Their True Value": 0.5,
  "KeyBanc bullish on Booking as AI and scale to drive growth": 0.8,
  "Quebec layoffs at U.S. truck plant days before tariff spur calls for urgent action": -0.6,
  "CDW (CDW) Fell as Market Yet to Accept it as an “AI Winner”": 0.1,
  "Copart (CPRT) Slipped Due to Investors’ Concerns": -0.5,
  "Shopify (SHOP) Compounded 29% Annually. Here’s How": 0.5,
  "Roper Q3 Earnings Top Estimates, Application Software Sales Up Y/Y": 0.8,
  "Radiopharmaceuticals Market to Reach US$ 13.4 Billion by 2033 | Astute Analytica": 0.5,
  "Here are Rowan Street Capital’s Updates on The Trade Desk (TTD)": 0.2,
  "Will Fortinet's Firewall Upgrade Cycle Continue to Power Top-Line Growth?": 0.5,
  "DOX vs. CSGP: Which Stock Should Value Investors Buy Now?": 0.2,
  "Monster Beverage (MNST): Exploring the Stock’s Current Valuation After a Strong Three-Month Performance": 0.5,
  "Will Verisk (VRSK) Beat Estimates Again in Its Next Earnings Report?": 0.2,
  "How Investors Are Reacting To Fortinet (FTNT) Class Action Lawsuits Over Upgrade Cycle Transparency": -0.5,
  "How To Make Marvell Stock Float Like A Butterfly With This Trade": 0.6,
  "Roche in ongoing discussions with US government over drug pricing, CEO says": 0.2,
  "Leopard Imaging Expands Portfolio with Comprehensive onsemi Hyperlux™ Sensor Families": 0.5,
  "Norfolk Southern revenue falters in Q3": -0.5,
  "Did FDA Progress on Povetacicept and New Data for ALYFTREK Just Shift Vertex’s (VRTX) Investment Narrative?": 0.2,
  "Marjorie Taylor Greene Buys 6 Stocks And Bitcoin ETF: Here's Her Latest Shopping List": 0.2,
  "Barclays Downgrades Marvell (MRVL) as AI Chip Market Leans Toward Broadcom": -0.5,
  "Why Applied Materials (AMAT) Stock Is Trading Up Today": 0.5,
  "Atlassian (TEAM): Assessing Valuation Potential After Recent Share Price Rebound": 0.5,
  "Sector Update: Consumer Stocks Mixed Late Afternoon": 0.0,
  "Why Beyond Meat (BYND) Shares Are Falling Today": -0.5,
  "Analog Devices, Inc. to Report Fourth Quarter Fiscal Year 2025 Financial Results on Tuesday, November 25, 2025": 0.0,
  "Buy the Post-Earnings Surge in Intuitive Surgical (ISRG) Stock?": 0.2,
  "Top Research Reports for Amazon.com, Wells Fargo & Amgen": 0.5,
  "Intel Swings to Quarterly Earnings as Rising Demand Lifts Revenue": 0.8,
  "O'Reilly Automotive Inc (ORLY) Q3 2025 Earnings Call Highlights: Strong Growth in Professional ...": 0.8,
  "Applied Materials to lay off 4% of workforce to simplify operations": -0.5,
  "Applied Materials to Cut 4% of Global Workforce": -0.7,
  "Marten Transport, Ltd. (MRTN) Lags Q3 Earnings and Revenue Estimates": -0.7,
  "Intuit (INTU) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "Marvell Technology (MRVL) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "Palo Alto Networks (PANW) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Amgen (AMGN) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Axon Enterprise (AXON) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "Why Analog Devices (ADI) Outpaced the Stock Market Today": 0.5,
  "Constellation Energy (CEG) Secures AI Data Center Deals as Carbon-Free Power Demand Reshapes Utilities": 0.6,
  "NXP Semiconductors (NXPI) Surpasses Market Returns: Some Facts Worth Knowing": 0.5,
  "NBC changes beloved NBA broadcast format, confuses fans": -0.6,
  "Is Marvell (MRVL) Keeping Pace With AI Data Center Demands or Losing Its Edge?": -0.5,
  "Roper Technologies (ROP): Evaluating Valuation After Earnings Beat, $3B Buyback, and Upbeat Growth Guidance": 0.6,
  "Trump: ALL TRADE NEGOTIATIONS WITH CANADA ARE HEREBY TERMINATED. Thank you for your attention to this matter! - >The Ronald Reagan Foundation has just announced that Canada has fraudulently used an advertisement, which is FAKE, featuring Ronald Reagan speaking negatively about Tariffs. The ad was for $75,000. They only did this to interfere with the decision of the U.S. Supreme Court, and other courts. TARIFFS ARE VERY IMPORTANT TO THE NATIONAL SECURITY, AND ECONOMY, OF": -0.8,
  "3 Reasons We’re Fans of DoorDash (DASH)": 0.5,
  "Does Analog Devices' (ADI) New Power Studio Suite Signal a Digital Edge in Competitive Sectors?": 0.5,
  "O'Reilly (ORLY) Margin Dip Reinforces Market Caution Despite Ongoing Earnings Growth": -0.5,
  "1 of Wall Street’s Favorite Stock for Long-Term Investors and 2 We Avoid": 0.5,
  "1 Momentum  Stock for Long-Term Investors and 2 We Brush Off": 0.5,
  "2 Large-Cap Stocks to Keep an Eye On and 1 We Avoid": 0.2,
  "3 Profitable Stocks We Steer Clear Of": -0.5,
  "UK Stocks That Could Be Trading Below Estimated Value In October 2025": 0.2,
  "How the Narrative for Xcel Energy Is Shifting After Litigation Settlement and Growth Updates": 0.5,
  "2 Consumer Goods Stocks to Buy Now": 0.0,
  "LNG Demand Fuels Strong Third Quarter for Baker Hughes": 0.8,
  "Why Analysts See PACCAR’s Story Shifting as Tariffs and Valuation Drive New Optimism": 0.6,
  "This Robotics Stock Is a Far Better Investment Than Palantir": 0.6,
  "2 Soaring Stocks I'd Buy Now With No Hesitation": 0.8,
  "Has Lululemon Stock Bottomed Out?": 0.1,
  "Sanofi Earnings Get Boost From Dupixent, New Drugs as U.S. Talks Continue": 0.5,
  "What You Need to Know Ahead of Axon Enterprise’s Earnings Release": 0.0,
  "CEO of IT firm with 350K workers says AI will create more entry level jobs—and he’s recruiting liberal arts graduates": 0.5,
  "13 Press Releases You Need to See This Week": 0.0,
  "JW MARRIOTT PHU QUOC - ASIA'S TOP 5 RESORT WELCOMES THE FESTIVE SEASON WITH 'A SYMPHONY BENEATH THE STARS'": 0.8,
  "United States Precision Medicine Market Analysis Report 2025-2033: Developments in Biomarker Identification and Genomic Sequencing, & Combining Big Data Analytics and AI Fuel Growth": 0.6,
  "United States Oats Forecast and Company Analysis Report 2025: A $2.92 Billion Market by 2033 Featuring General Mills, B&G Foods, Kellanova, Marico, PepsiCo, Nestle, Blue Lake Milling, Avena Foods": 0.5,
  "From Stocks and Gold to Crypto: Why Crypto is Becoming the New Gold for Modern Investors": 0.5,
  "Bull of the Day: Advanced Energy Industries (AEIS)": 0.5,
  "Biogen Licenses Oral C5aR1 Antagonist from Vanqua Bio to Expand Immunology Portfolio": 0.5,
  "3 Stocks Estimated To Be Undervalued By Up To 29.8%": 0.5,
  "Exploring 3 High Growth Tech Stocks in US Market": 0.5,
  "HealthLynked Launches New MedOfficeDirect Shopify Platform at DiscountOnlineMedicalSupplies.com with Improved Performance and Lower Prices": 0.6,
  "Baker Hughes, Aramco to Expand Integrated Coiled Tubing Drilling Operations Across Saudi Arabia": 0.5,
  "Is Palo Alto Networks Still a Smart Bet After 19% YTD Surge and New Partnerships?": 0.5,
  "Dow Jones Futures: Intel, AI Play Jump After Bullish Tesla Move; Trade Talks, CPI In Focus": 0.5,
  "Exchange-Traded Funds, Equity Futures Higher Pre-Bell Friday Ahead of Potential CPI Report": 0.5,
  "Cognizant CEO Ravi Kumar S on the ‘Hollywood model’ and going with your gut": 0.2,
  "These 2 Consumer Discretionary Stocks Could Beat Earnings: Why They Should Be on Your Radar": 0.5,
  "Should Old Dominion Freight Line's (ODFL) Rate and Dividend Hikes Signal a Shift in Margin Strategy?": 0.2,
  "Wall Street's Insights Into Key Metrics Ahead of MercadoLibre (MELI) Q3 Earnings": 0.5,
  "AEP (AEP) Q3 Earnings on the Horizon: Analysts' Insights on Key Performance Measures": 0.2,
  "Baker Hughes Q3 Earnings & Revenues Surpass Estimates, Increase Y/Y": 0.8,
  "Wall Street Bulls Look Optimistic About Zscaler (ZS): Should You Buy?": 0.8,
  "Wall Street Analysts Think Axon (AXON) Is a Good Investment: Is It?": 0.5,
  "Coinbase, eBay upgraded: Wall Street's top analyst calls": 0.5,
  "Why Marvell Technology (MRVL) is a Top Growth Stock for the Long-Term": 0.8,
  "O'Reilly Automotive (ORLY) is a Top-Ranked Growth Stock: Should You Buy?": 0.6,
  "ASYS vs. LRCX: Which Semiconductor Equipment Stock is the Better Buy?": 0.5,
  "How Much Upside is Left in Cognizant (CTSH)? Wall Street Analysts Think 25.68%": 0.2,
  "ORLY Q3 Deep Dive: Professional Segment Drives Growth Amid Tariff-Driven Inflation and Cautious Outlook": 0.5,
  "1 Top Dividend Growth Stock to Buy Right Now": 0.8,
  "Charter Communications (CHTR) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "O'Reilly Q3 Earnings Beat Expectations, 2025 FCF Guidance Trimmed": 0.5,
  "VZ vs. CHTR: Which Connectivity Stock is the Better Buy Now?": 0.5,
  "American Electric Power to Post Q3 Earnings: What's in Store?": 0.2,
  "SNPS vs. MRVL: Which Stock Has an Edge in the Interconnect Market?": 0.2,
  "Will Biogen Beat on Q3 Earnings? Leqembi, Skyclarys Could Hold the Key": 0.2,
  "Verisk Set to Report Q3 Earnings: Here's What You Should Know": 0.0,
  "Zacks Investment Ideas feature highlights: Intuitive Surgical's": 0.2,
  "Biogen licenses a possible immune drug from OrbiMed-backed biotech": 0.5,
  "Applied Materials to Cut 4% of Staff as Automation Changes Workforce": -0.6,
  "Can Biogen’s (BIIB) Immunology Pipeline Moves Reshape Its Competitive Edge in Autoimmune Disease?": 0.2,
  "PepsiCo (PEP) vs. Coca-Cola (KO): What's the Stronger Near-Term Buy?": 0.5,
  "FormFactor (FORM): A Fresh Look at Valuation Following Sector-Wide Semiconductor Weakness Triggered by Texas Instruments’ Outlook": 0.2,
  "Electronic Arts to Report Q2 Earnings: What's in the Cards?": 0.2,
  "Cintas (CTAS) Down 4.8% Since Last Earnings Report: Can It Rebound?": 0.2,
  "The Zacks Analyst Blog Highlights Amazon.com, Wells Fargo, Amgen, IDT and Village Super Market": 0.2,
  "EXPE or MELI: Which Is the Better Value Stock Right Now?": 0.5,
  "Trump Administration Moves to Accelerate AI Power Hookups": 0.5,
  "A GSK Cancer Drug Is Making a Comeback. It’s So-So News for the Stock.": 0.1,
  "TSX up 182 Points at Midday With Info Tech The Best Performer": 0.8,
  "Will Marriott (MAR) Beat Estimates Again in Its Next Earnings Report?": 0.5,
  "/C O R R E C T I O N -- Coupa Software/": 0.0,
  "Why Intuitive Surgical Stock Zoomed 23% Higher This Week": 0.8,
  "Spectrum makes a harsh decision after major customer losses": -0.7,
  "RBC Capital Markets Says Q3 Earrings for Its Canadian Technology Coverage \"Likely To Remain Bifurcated\"": 0.1,
  "Oil Rig Count Inches Higher Amid Oil Price Rally": 0.5,
  "Strong Portfolio Aids Cisco's Security Revenues: More Upside Ahead?": 0.6,
  "Can Axon (AXON) Maintain Its Public Safety Tech Lead as Integration Ambitions Expand?": 0.2,
  "Correction: RBC Capital Markets Says Q3 Earnings for Its Canadian Technology Coverage \"Likely To Remain Bifurcated\"": 0.1,
  "CoStar Group to Post Q3 Earnings: What's in Store for the Stock?": 0.2,
  "Exploring 3 High Growth Tech Stocks In The US Market": 0.5,
  "Datadog Earnings Preview: What to Expect": 0.0,
  "Evaluating DoorDash (DASH) Valuation After Mixed Share Price Movements": 0.1,
  "Anthropic and Google Strike a Deal. How Broadcom and Amazon Fit In.": 0.0,
  "Axon by AppLovin: AI and the Future of Performance Marketing": 0.5,
  "Investing.com’s stocks of the week": 0.0,
  "Oil Rig Count Rises by 2; Crude Set for Sharp Weekly Gain Following US Sanctions on Russia": 0.8,
  "MercadoLibre (NasdaqGS:MELI): Revisiting Valuation After Casas Bahia Partnership Boosts Growth Prospects": 0.6,
  "6 Stocks to Sell in a Hot Market": -0.5,
  "Two Data Center Plays Race To New Highs, Near Buy Points": 0.5,
  "Texas Instruments (TXN) Makes You “Feel Like A Chump,” Says Jim Cramer": -0.6,
  "“I Like That,” Says Jim Cramer About Intuitive Surgical (ISRG)": 0.6,
  "Jim Cramer Discusses Warner Bros. Discovery, Inc. (WBD) In Detail": 0.2,
  "A comprehensive list of 2025 tech layoffs": -0.5,
  "Breakout Watch: Why Nvidia, Apple, Meta And Others Use This AI Brain": 0.5,
  "Zscaler (ZS): Evaluating Valuation After Analyst Upgrades and Major AI Security Partnership with HCLTech": 0.5,
  "Sanofi Jumps As Dupixent Nears $5 Billion In Sales; Trump Drug Talks Continue": 0.5,
  "The Trade Desk stock falls after Amazon offers free DSP testing": -0.5,
  "IGEL Teams with Palo Alto Networks to Elevate Enterprise Cybersecurity": 0.5,
  "Baker Hughes Q3 2025 Earnings Transcript": 0.2,
  "Unity, Health Catalyst, Shopify, Flywire, and RingCentral Shares Skyrocket, What You Need To Know": 0.5,
  "US Equity Indexes Advance This Week Amid Cooling China Trade Tensions, Inflation While Earnings Lift Sentiment": 0.8,
  "Baker Hughes Co (BKR) Q3 2025 Earnings Call Highlights: Record Backlog and Strategic Growth ...": 0.8,
  "The Score: Netflix, Amazon.com, Six Flags and More Stocks That Defined the Week": 0.5,
  "Tamboran Raises US$56.1 Million via Public Offering, Enters Into PIPE With Proceeds of up to US$29.3 Million, and Intends to Launch CDI Share Purchase Plan With Target Proceeds of up to US$30 Million": 0.5,
  "Synopsys (SNPS) Outperforms Broader Market: What You Need to Know": 0.5,
  "ON Semiconductor Corp. (ON) Stock Sinks As Market Gains: Here's Why": -0.5,
  "KLA (KLAC) Rises Higher Than Market: Key Facts": 0.5,
  "Top Technology and Security Executives Recognized at the 2025 SoCal ORBIE Awards": 0.5,
  "Big Tech earnings, Fed meeting, Trump & Xi meet: What to Watch": 0.2,
  "Basin rig count down one as prices jump": 0.5,
  "Applied Materials (AMAT): Examining Valuation After Recent Share Price Surge": 0.5,
  "How Analyst Sentiment Is Shaping the Evolving Trade Desk Story": 0.5,
  "Should You Reconsider Old Dominion After a 22% Drop in 2025?": -0.5,
  "Jim Cramer on Automatic Data Processing: “It is an Excellent Company”": 0.8,
  "Jim Cramer on Warner Bros: “I Think You Gotta Hold Onto It”": 0.5,
  "Jim Cramer Says Constellation Energy is a Good Company but “It’s Up Too Much”": 0.2,
  "Jim Cramer Highlights Intuitive Surgical Rally on Unexpected Procedure Growth": 0.6,
  "Jim Cramer on Texas Instruments: “I Don’t Expect Buyers to Take That Stock Up Anytime Soon”": -0.6,
  "Exelon Corporation (EXC) Price Target Raised by $4 at Morgan Stanley": 0.5,
  "Take-Two Interactive (TTWO): Examining Valuation Following Recent Share Price Momentum": 0.5,
  "Cintas (CTAS): Exploring Valuation After Recent Momentum Shift in Industrial Stocks": 0.2,
  "What Catalysts Could Shift the Story for Copart Amid Analyst Caution and Optimism?": 0.2,
  "Baker Hughes (BKR) Margin Gains Reinforce Bullish Narratives Despite Slower Earnings Growth": 0.6,
  "Is Synopsys Still a Good Value After Recent Strategic Acquisitions and Mixed Price Moves?": 0.2,
  "Is Applied Materials Stock a Buy as AI Chip Manufacturing Surges?": 0.5,
  "Top execs share their best career advice for Gen Z": 0.5,
  "AT&T COO compares its coverage reliability to T-Mobile's claims": 0.2,
  "Paychex (PAYX): Assessing Valuation After Recent Share Price Dip": 0.2,
  "Insiders Are Scooping Up Shares of a Miner, a Driller, and a Biotech": 0.5,
  "Apple Shines, Leads Parade Of Megacap Hyperscaler Earnings Reports": 0.8,
  "Lam Research (LRCX): Examining Valuation After a Strong Year-to-Date Rally": 0.5,
  "Fast-Money Quants Stumble as Momentum Bust Roils Strategies - https://www.bloomberg.com/news/articles/2025-10-24/fast-money-quants-stumble-as-momentum-bust-roils-strategies > Quantitative funds are suffering this month amid reversals in crowded and previously money-minting positions, with quant long-short funds down 1.7% in October. > The momentum unwind has tripped up investors who have been riding on the profitable coattails of steady winners like AI and European banking shares, as well as assets like gold. > Strategies tuned to the “quality” factor and the “low volatility”": -0.6,
  "T-Mobile restricts a beloved discount, angering customers": -0.8,
  "How Investors May Respond To Arm Holdings (ARM) Expanding AI Chiplet Partnerships in Data Center Infrastructure": 0.5,
  "AstraZeneca (LSE:AZN): Is the Pharma Giant Undervalued After Recent Momentum?": 0.5,
  "Novavax (NVAX) Jettisons Maryland Facility to AstraZeneca as Investor Pressure Mounts—Is an Acquisition Inevitable?": 0.2,
  "Trump says he's increasing tariffs on Canada by 10% 'over and above what they are paying now' - https://www.cbc.ca/news/politics/trump-says-he-s-increasing-tariffs-on-canada-by-10-over-and-above-what-they-are-paying-now-9.6953786 > U.S. President Donald Trump has announced on social media he will be increasing tariffs on Canada by \"10 per cent over and above what they are paying now\" because of an advertisement by the Ontario government. > It’s the latest escalation by Trump over an advertisement by the Ontario government that uses the late U.S.": -0.8,
  "How the Narrative for Charter Communications Is Evolving Amid Sector Pressures and Strategic Shifts": 0.1,
  "Skyworks Solutions (SWKS): A Fresh Look at Valuation After Sector Jitters Triggered by Texas Instruments Forecast": 0.2,
  "How Analyst Upgrades and Growth Optimism at Exelon (EXC) Have Changed Its Investment Story": 0.5,
  "Will Arrow Electronics’ (ARW) Automotive Partnership With NXP Shift Its Software Services Trajectory?": 0.2,
  "NXP Semiconductors (NXPI) Q3 Earnings Report Preview: What To Look For": 0.5,
  "How Investors Are Reacting To NXP Semiconductors (NXPI) Expanding Software Focus Through eInfochips Alliance": 0.5,
  "Is Amgen Riding the Momentum After a 6.9% Price Jump?": 0.5,
  "How Recent Developments Are Rewriting the Story for Lululemon": 0.5,
  "Best buy and hold stocks over the past 20 years in S&P500 - Over the past 20 years, the best buy and hold stocks in the S&P 500 have been dominated by a few exceptional longterm compounders, which shows that a handful of stocks drive most market gains, underscoring why broad diversification still matters. An investment in these five stocks would have turned $10,000 in 2005 into between $1.6 million and $6 million today. 1.": 0.8,
  "2 Brilliant Medical Device Stocks to Buy Now and Hold for the Long Term": 0.8,
  "Does ON Stock Present Opportunity After a 3.5% Weekly Dip?": 0.2,
  "Diamondback Energy (FANG): Evaluating Valuation After Recent Share Price Swings": 0.2,
  "5 big analyst AI moves: Apple lifted to Buy, AI chip bets reassessed": 0.5,
  "CDW (CDW) Valuation in Focus as Investors Spotlight AI Infrastructure Potential and Revenue Growth": 0.5,
  "3 Millionaire-Maker Technology Stocks": 0.0,
  "How the Aprio Partnership Could Shape Intuit’s (INTU) Mid-Market Growth Prospects": 0.5,
  "Morgan Stanley Maintains a Buy on Diamondback Energy (FANG), Keeps the PT": 0.6,
  "Big Tech earnings, a crucial Fed meeting, and a Trump-Xi sit-down: What to watch this week": 0.5,
  "NATURAL LEARNING CURVE OR AM I JUST STUPID? - Hey everyone, I’ve been trading for about 2 years now. Still pretty new overall.Earlier this year, during the Circle IPO, I got greedy. Bought in at $240, and when it shot up to $298, I literally took a screenshot feeling like a genius. Then it tanked. Lost around $1100. I told myself, “Lesson learned. Never again.” Fast forward to last week. I thought I had matured": -0.6,
  "CoStar Group (CSGP): Evaluating Valuation as Legal Dispute Over MLS Data Raises New Questions for Homes.com": 0.1,
  "Earnings season off to an impressive start": 0.8,
  "RDDT earnings forecast prediction - Hi, its me again. I took a look at details about DAUq and ARPU today. ## ARPU in the last 4 quarters, the worst growths were: Int ARPU: -20% US ARPU: -11% The best cases were: Int ARPU: 29% US ARPU: 26% That would bring us to a range of: Int ARPU: 1,39$ - 2,23$ US ARPU: 7$-9,88$ I dont think ARPU will go down, as ADs got very much": 0.2,
  "Chinese and U.S. Officials Reach Framework of a Trade Deal - “Chinese and American trade negotiators said on Sunday that they had agreed to a framework of a deal on tariffs and other issues ahead of an expected meeting of the countries’ top leaders this week. We are moving forward to the final details of the type of agreement that the leaders can review and decide if they want to conclude together,” Jamieson Greer, the": 0.8,
  "Baker Hughes Logs Higher Adjusted Profit": 0.5,
  "AI will 'amplify, not replace' human performance: Workday CEO": 0.5,
  "Adobe (ADBE): Exploring Valuation After Recent Share Price Rebound and Shifting Market Sentiment": 0.5,
  "Is the investing world just waiting for Tesla to crash? - Ex-Stellantis CEO Carlos Tavares said this week he doesn't think Tesla will still produce cars in 10 years. I've compared new models Teslas and BYDs side-by-side and I don't get how Tesla can continue to complete with an inferior, overpriced product. On the other hand, Tesla has done extremely well in the US market (where Chinese cars are largely excluded and there is minimal": -0.6,
  "Is Now the Right Moment to Reconsider Netflix After This 9.6% Drop?": 0.2,
  "Beyond Chips: AI Infrastructure Spending Is Projected to Hit $490 Billion -- Who Benefits Most?": 0.5,
  "2 Incredible Growth Stocks I Can't Stop Buying": 0.8,
  "Is American Electric Power’s Strong 2025 Rally Supported by Its Dividend and Earnings Outlook?": 0.5,
  "\"Ask IBKR\" just launched...is this the future? - [https://www.interactivebrokers.com/en/trading/ask-ibkr.php](https://www.interactivebrokers.com/en/trading/ask-ibkr.php) Interactive Brokers just rolled out \"Ask IBKR\", an AI chat that lets you ask things like “What’s my P&L this month?” or “Show my largest positions.” Presumably they'll be rolling out additional analytics on top that let you do heavier insights eventually (sector attribution, risk catalysts, maybe even trade recommendations). Probably in its infancy right now. But feels like every platform these days is moving toward": 0.2,
  "Health Canada Grants Authorization for “LEQEMBI®” (lecanemab) for the Treatment of Early Alzheimer’s Disease": 0.8,
  "Netflix Investors Didn't Get a Stock Split in the Latest Quarterly Report. They Got Something Better.": 0.6,
  "(ITEM 5.02) . DEPARTURE OF DIRECTORS OR CERTAIN OFFICERS; ELECTION OF DIRECTORS; APPOINTMENT OF CERTAIN OFFICERS; COMPENSATORY ARRANGEMENTS OF CERTAIN OFFICERS. On October 24, 2025, the Board of Directors (the “Board”) of DexCom, Inc. (“Dexcom” or the “Company”), pursuant to the Amended and Restated Bylaws of the Company, increased the size of the Board to ten directors and appointed Dr. Euan Ashley as a director, effective immediately. Dr. Ashley will hold office for a term expiring at": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. The information contained in this\n\n(Item 2.02) , including Exhibit 99.1, shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), or incorporated by reference in any filing under the Securities Act of 1933, as amended (the \"Securities Act\"), or the Exchange Act, except as expressly set forth by specific reference in such a filing. On October 27, 2025 , Keurig Dr Pepper Inc. (the \"Company\" or \"KDP\") issued a": 0.1,
  "(Item 8.01) Other Events. ATM Updates On October 27, 2025, Strategy Inc (“Strategy” or the “Company”) announced updates with respect to its at-the-market offering programs: ATM Program Summary During Period October 20, 2025 to October 26, 2025 As of October 26, 2025 Shares Sold Notional Value (in millions) (1) Net Proceeds (in millions) (2) Available for Issuance and Sale (in millions) STRF ATM 175,634 STRF Shares $17.6 $19.4 $1,668.4 $2.1 billion of 10.00% series A perpetual strife": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On October 27, 2025 Cadence Design Systems, Inc. (“Cadence”) issued a press release announcing its financial results for the quarter ended September 30, 2025. A copy of the press release is attached hereto as Exhibit 99.01 and a copy of the commentary by the Chief Financial Officer of Cadence regarding Cadence's financial results for the quarter ended September 30, 2025 is attached hereto as Exhibit 99.02, and the": 0.1,
  "Augmentus Secures Strategic Investment from Applied Ventures to Accelerate AI-Robotics for High-Mix Manufacturing": 0.6,
  "1 Growth Stock Down 17% to Buy Right Now": 0.5,
  "Electronic Arts Earnings: What To Look For From EA": 0.2,
  "CoStar (CSGP) To Report Earnings Tomorrow: Here Is What To Expect": 0.2,
  "Is Union Pacific Trump ballroom donation Vena’s  merger knockout punch?": 0.1,
  "Wireless, Cable and Satellite Stocks Q2 Highlights: Charter (NASDAQ:CHTR)": 0.0,
  "A Fresh Look at Marriott International (MAR) Valuation as Shares Hold Steady": 0.5,
  "Ross Stores Earnings Preview: What to Expect": 0.0,
  "3 Consumer Stocks with Solid Fundamentals": 0.5,
  "1 Volatile Stock on Our Watchlist and 2 That Underwhelm": -0.5,
  "🎧 Markets Last Week: Earnings Movers, Warner Plans, AWS Outage": 0.2,
  "How Recent Developments Are Shaping the T-Mobile US Investment Story": 0.5,
  "AppLovin (APP) Valuation in Focus After Strong Share Price Momentum": 0.6,
  "Should Investors Buy the Netflix Dip?": 0.2,
  "The Smartest Growth Stock to Buy With $2,000 Right Now": 0.5,
  "Why nobody is bidding for AMCX? - AMC Networks does not only sound like that famous meme-stock, but it is a great business on paper - it created or distributed some of the best TV series of all time: Breaking Bad, Mad Men, The Walking Dead and countless spinoffs, Hell on Wheels, Halt and Catch Fire, Better Call Saul, Interview with the Vampire, Silo (for Apple TV) and Pantheon among others. It owns five television": 0.6,
  "Earnings Preview: What to Expect From Applied Materials' Report": 0.5,
  "Prediction: Vertex Pharmaceuticals Will Be Worth More Than Pfizer by 2030": 0.8,
  "3 Artificial Intelligence Stocks to Buy and Hold Through 2035": 0.5,
  "Japanese automakers warned of chip supply disruption": -0.6,
  "The Zacks Analyst Blog Highlights Mastercard, Netflix, Citigroup, Oil-Dri and Perma-Pipe": 0.0,
  "Bull of the Day: Lam Research (LRCX)": 0.5,
  "KPop Netflix Hunters: Can It Bounce Back This Week?": 0.2,
  "Baker Hughes expands UBCTD operations in Saudi Arabia": 0.5,
  "DAT execs in two forums discuss how it seeks to reshape the freight sector": 0.5,
  "Netflix's Move From Screen to Shelf Could Be a Genius Diversification Play": 0.8,
  "Can Cadence’s 36.5% Rally Continue After Recent AI Partnership Push?": 0.5,
  "Can Regulatory Scrutiny Change the Growth Narrative for AppLovin (APP)?": 0.2,
  "Warner Bros. (WBD) Jumps 16.3%, Hits New High on More Acquisition Bids": 0.8,
  "Comcast loops in linear TV for cross-channel programmatic ad buys": 0.2,
  "Stocks Gain Pre-Bell as US-China Trade Deal Hopes Rise; Investors Await Fed Policy Decision, Big Tech Earnings": 0.6,
  "How Investing Has Changed in the Last 5 Years": 0.0,
  "3 Elite Growth Companies With Strong Insider Ownership": 0.5,
  "What motivation reveals about CEO readiness": 0.0,
  "Cognizant and Rubrik Announce Strategic Partnership to Deliver Business Resilience-as-a-Service": 0.5,
  "Toast Appoints Anu Bharadwaj to Board of Directors": 0.5,
  "High-Accuracy Time Transfer Solution Provides Sub-Nanosecond Time Transfer Up To 800 km Using Long-Haul Optical Networks": 0.5,
  "5 Things to Know Before the Stock Market Opens": 0.0,
  "PepsiCo, Alliance of Bioversity International, and CIAT Launch Major Update to Open-access Climate Resilience Platform to Accelerate Climate Adaptation": 0.6,
  "Here's How Much You'd Have If You Invested $1000 in KLA a Decade Ago": 0.5,
  "3 Value Stocks We Approach with Caution": -0.5,
  "2 Value Stocks on Our Watchlist and 1 Facing Headwinds": 0.2,
  "Lam Research and Helen of Troy have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "1 Cash-Heavy Stock on Our Buy List and 2 Facing Challenges": 0.2,
  "3 Profitable Stocks That Fall Short": -0.5,
  "Intuitive Surgical vs. Medtronic: Which Stock Is the Better Buy?": 0.5,
  "‘Doorstep taxes’ are now showing up on delivery orders in some states — how this new fee may be impacting you": -0.5,
  "Sprouts Farmers vs. Costco: Which Retail Stock Is the Stronger Play?": 0.5,
  "Beat the Market the Zacks Way: PDD, Shopify, 3M in Focus": 0.2,
  "ASML reports transactions under its current share buyback program": 0.0,
  "DoorDash CFO to Participate in Fireside Chat at Upcoming Investor Conference": 0.5,
  "Investors Heavily Search PDD Holdings Inc. Sponsored ADR (PDD): Here is What You Need to Know": 0.5,
  "Here is What to Know Beyond Why Intuitive Surgical, Inc. (ISRG) is a Trending Stock": 0.2,
  "Here is What to Know Beyond Why Netflix, Inc. (NFLX) is a Trending Stock": 0.2,
  "Want Better Returns? Don't Ignore These 2 Computer and Technology Stocks Set to Beat Earnings": 0.5,
  "How to Find Strong Medical Stocks Slated for Positive Earnings Surprises": 0.8,
  "Why Investors Need to Take Advantage of These 2 Medical Stocks Now": 0.5,
  "Warner Bros. Discovery, Inc. (WBD) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Assessing ASML (ENXTAM:ASML) Valuation After Strong Three-Month Share Price Momentum": 0.5,
  "This week could set the tone for the rest of the quarter - **Macro events:** * Fed interest rate decision and Powell press conference on Wednesday * Trump meets Xi on Thursday, potential global trade headlines **Earnings:** * Big tech reports on Wednesday: Microsoft, Alphabet, Meta * Thursday brings Apple and Amazon * Around 20% of the S&P 500 reports results this week Markets are already jittery, and any surprise could move prices fast. Traders": 0.5,
  "Unlocking Netflix (NFLX) International Revenues: Trends, Surprises, and Prospects": 0.5,
  "Investing in Texas Instruments (TXN)? Don't Miss Assessing Its International Revenue Trends": 0.2,
  "Curious about Gilead (GILD) Q3 Performance? Explore Wall Street Estimates for Key Metrics": 0.2,
  "Unlocking Lam Research (LRCX) International Revenues: Trends, Surprises, and Prospects": 0.5,
  "Exploring Analyst Estimates for Comcast (CMCSA) Q3 Earnings, Beyond Revenue and EPS": 0.5,
  "Do Options Traders Know Something About CSX Stock We Don't?": 0.2,
  "Does GEHC Stock Deserve a Spot in Your Portfolio Ahead of Q3 Earnings?": 0.2,
  "Tempus AI Enhances AI-Driven Diagnostics With Multiple FDA Approvals": 0.8,
  "Costco's Renewal Rate Slips to 89.8%: Temporary Dip or New Normal?": 0.1,
  "Lululemon Athletica, NFL Launch Team-Branded Apparel Collection": 0.5,
  "Brokers Suggest Investing in Intuit (INTU): Read This Before Placing a Bet": 0.2,
  "Baker Hughes (BKR) Q3 Earnings: Taking a Look at Key Metrics Versus Estimates": 0.2,
  "Is Intuitive Surgical (ISRG) a Buy as Wall Street Analysts Look Optimistic?": 0.5,
  "David Ellison may still raise Paramount bid for Warner Bros. Discovery": 0.2,
  "Linde Declares Dividend in Fourth Quarter 2025": 0.0,
  "I Cut losses on SPOT and invested in TME - TME is a Chinese streaming company that just reached $2B in revenue this year. They are stable and just launched a streaming service called WeTV in Thailand this year. It’s also a low bar of entry. Spotify isn’t great for artists and is overvalued, it’s only a matter of time until the price continues to fall.": 0.5,
  "Microsoft upgraded, Harley-Davidson downgraded: Wall Street's top analyst calls": 0.2,
  "Are You a Momentum Investor? This 1 Stock Could Be the Perfect Pick": 0.5,
  "Why This 1 Momentum Stock Could Be a Great Addition to Your Portfolio": 0.8,
  "r/Stocks Daily Discussion Monday - Oct 27, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.2,
  "Yoga Pants, Oil and Pickup Trucks—These Companies Count on Canada": 0.2,
  "Comcast Expands NOW TV Latino: More Channels, More Fútbol, More Value": 0.6,
  "Smart Learning Market Surges to $155.2 billion by 2029 - Dominated by IBM (US), Samsung (South Korea), Adobe (US)": 0.6,
  "Analysts Estimate Castle Biosciences, Inc. (CSTL) to Report a Decline in Earnings: What to Look Out for": -0.5,
  "Diamondback Energy (FANG) Expected to Beat Earnings Estimates: Should You Buy?": 0.5,
  "Idexx Laboratories (IDXX) Earnings Expected to Grow: What to Know Ahead of Next Week's Release": 0.5,
  "Vertex Pharmaceuticals (VRTX) Earnings Expected to Grow: Should You Buy?": 0.5,
  "IBM quietly joins the crypto wave (didn’t see that one coming) - IBM just announced a new digital asset platform called Digital Asset Haven, built with a company called Dfns. Apparently, it’s meant for banks, governments, and big corporations to manage blockchain-based assets tokenization, custody, compliance, the whole deal. In other words, they’re setting up shop for the “grown-up” side of crypto. Now, when I think of IBM, I think of mainframes, not meme coins.": 0.4,
  "Qualcomm announces AI chips to compete with AMD and Nvidia - Qualcomm announced Monday that it will release new artificial intelligence accelerator chips, marking new competition for Nvidia, which has so far dominated the market for AI semiconductors. The AI chips are a shift from Qualcomm, which has thus far focused on semiconductors for wireless connectivity and mobile devices, not massive data centers. Qualcomm said that both the AI200, which will go on sale in": 0.5,
  "Dave Ramsey: 7 Brutally Honest Money Tips To Follow": 0.5,
  "Tesla risks losing CEO Musk if $1 trillion pay package isn’t approved, board chair says - Tesla Board Chair Robyn Denholm, in a letter Monday, asked shareholders to vote for CEO Elon Musk’s nearly $1 trillion pay package ahead of the company’s annual meeting. Denholm said Musk was key to the future of the EV maker as it moves beyond being “just another car company,” with a bigger focus on Full Self Driving and Optimus.": 0.2,
  "How Warner Bros. Discovery’s Story Is Shifting Amid New Deal Talk and Analyst Upgrades": 0.5,
  "Mercado Libre Launches New Episode of Inside MercadoLibre, featuring Roberta Donato – Brazil Marketplace VP – on Seller Tools": 0.5,
  "A Paramount-Warner Deal Will Sour. I Won’t Be Surprised.": -0.6,
  "NVTS vs. ON: Which Power Chip Stock Has an Edge Right Now?": 0.2,
  "3 Healthcare Stocks to Buy Hand Over Fist in October": 0.8,
  "1,800 Reasons to Sell Target Stock Now": -0.8,
  "Atlassian to Report Q1 Earnings: What's in Store for the Stock?": 0.0,
  "Honeywell's Q3 Marks Start of Catalyst-Rich Phase Ahead of Breakup, RBC Says": 0.6,
  "This Chip Stock Is Cutting 4% of Its Staff Despite 40% YTD Pop. Should You Stay Far Away or Buy Shares Now?": 0.2,
  "Can Higher Revenues Benefit Monolithic Power's Q3 Earnings?": 0.2,
  "Roper Technologies Shows Limited Upside Amid AI Uncertainty, RBC Says": -0.5,
  "Lululemon Pushes Further Into Pro Sports With NFL Deal. The Stock Is Up.": 0.8,
  "MARUY or HON: Which Is the Better Value Stock Right Now?": 0.2,
  "AMD Lands $1 Billion AI Deal Has It Finally Caught Up to Nvidia? - The U.S. Department of Energy has just announced a $1 billion partnership with AMD to build two new supercomputers. One, named Lux, is expected to be operational within six months. These systems will feature AMD's new MI355X AI chips alongside AMD CPUs and networking equipment. They will be deployed across diverse fields from nuclear research to cancer treatment and national security,": 0.8,
  "Airspace and Procedure Design Industry Research Report 2025-2033 Featuring Adacel, Leonardo, Frequentis, Advanced Navigation and Positioning, Honeywell, L3Harris, Indra Sistemas, RTX, Saab, THALES": 0.1,
  "Wall Street is Pounding the Table Over HON, GOOG, AAPL, MSFT, BKNG, and TSLA": 0.8,
  "Stock Market Today: Nasdaq, S&P, and Dow Post New Records On China Trade Optimism, Strong U.S. Earnings": 0.8,
  "Netflix Plunges 12% Post Q3 Earnings: Buy, Sell or Hold the Stock?": -0.5,
  "MercadoLibre's Pre-Q3 Earnings Analysis: Hold or Fold the Stock?": 0.2,
  "$5.46 Bn Tracking-as-a-Service Markets, 2025-2033 by Component, Type, Asset Type, Enterprise Size, End Use, Countries and Company Analysis": 0.0,
  "Barclays Raises Honeywell (HON) PT After Q3 Earnings": 0.5,
  "Jim Cramer Notes “Meta’s Mark Zuckerberg Keeps Finding Ways to Deliver Great Quarter After Great Quarter”": 0.8,
  "Deutsche Bank Confirms Buy Rating and Target of US$185 on Shopify Ahead of Q3 Results": 0.8,
  "Intellia Therapeutics Stock Drops as Safety Fears Emerge in Drug Trial": -0.8,
  "North America Frozen Food Market Forecast Report 2025: A $145.34 Billion Market by 2033 Featuring Unilever, Nestle, General Mills, Nomad, Tyson, Conagra, Wawona Foods, Bellisio, McCain, Kraft Heinz": 0.5,
  "CrowdStrike Named the Overall Frost Radar™ Leader for SaaS Security Posture Management (SSPM) for the Second Consecutive Time": 0.8,
  "KLAC Set to Report Q1 Earnings: What's in Store for the Stock?": 0.2,
  "Top Stock Movers Now: Qualcomm, Keurig Dr Pepper, Newmont, Novartis, and More": 0.5,
  "NEE vs. AEP: Which Giant Utility Stock Shines Brighter for Investors?": 0.5,
  "Comcast Announces Roster of Team USA Xfinity Athletes for the Olympic and Paralympic Winter Games Milano Cortina 2026": 0.5,
  "JPMorgan picks Perpetua Resources for $1.5 trillion security fund first investment - Oct 27 (Reuters) - Antimony and gold miner Perpetua Resources (PPTA.O), opens new tab is the first investment from JPMorgan Chase's (JPM.N), opens new tab $1.5 trillion investment fund for U.S. national security, a move underscoring the company's key role in producing a metal whose exports China has blocked and which is used to make bullets and other weaponry. Under the agreement, details": 0.6,
  "Ross Stores (ROST) Stock Is Up, What You Need To Know": 0.5,
  "DoorDash (DASH) Stock Trades Up, Here Is Why": 0.5,
  "Why onsemi (ON) Stock Is Up Today": 0.2,
  "Why Lululemon (LULU) Stock Is Trading Up Today": 0.5,
  "MercadoLibre (MELI) Shares Skyrocket, What You Need To Know": 0.8,
  "AXIL Upgraded to Outperform on Retail-Driven Operating Leverage": 0.8,
  "Cybersecurity Stocks: With Earnings On The Way, Focus Shifts To 2026 Outlooks": 0.2,
  "Lam Research Corp's Strong FCF Margins From AI-Related Chip Equipment Sales Shows LRCX Stock is Cheap": 0.8,
  "Keurig Dr Pepper Stock Climbs After Earnings. It Woke Up and Smelled the Coffee.": 0.6,
  "Big-Tech Helps US Equity Indexes Break Records as China Trade Deal Expectations Slash Tail Risk": 0.8,
  "High Insider Ownership Fuels Growth In These 3 Companies": 0.5,
  "Coca-Cola Vs. PepsiCo: Which Beverage Giant is Poised for the Top Spot?": 0.5,
  "High Growth Tech Stocks In US Market": 0.5,
  "This or That: Jim Cramer shares Wall Street picks": 0.2,
  "Lululemon partners with NFL to release apparel collection": 0.5,
  "Poor Earnings In Netflix Stock Set Up Option Trade For Weakness": -0.5,
  "Bank of America finds surprise twist in AI, job market": 0.2,
  "Why Keurig Dr Pepper Stock Jumped Today": 0.5,
  "IDCC Set to Report Q3 Results: Will Revenue Growth Boost Earnings?": 0.5,
  "Cognizant to Report Q3 Earnings: What's in Store for the Stock?": 0.2,
  "Equity Markets Rise Intraday Amid Easing US-China Trade Tensions": 0.8,
  "Is Google quietly positioning itself to control future infrastructure? Energy + Payments + Big Data moves this week - I’ve been tracking several recent headlines from Google (GOOG), and the timing feels more intentional than random. Within just a short period, Google has announced: • Partnering with NextEra to build a nuclear-powered data center in the U.S. • Working with PayPal to launch a cloud-based agency payment solution for merchants • Upgrading its Bigtable storage": 0.6,
  "Old Dominion's Q3 Earnings Coming Up: What's in Store for the Stock?": 0.5,
  "1 Outstanding Growth Stock to Buy and Hold Over the Next Decade": 0.8,
  "Keurig settles K-Cup class action, offers customers up to $50": 0.5,
  "Amazon is cutting 30k corporate jobs… and Wall Street is cheering lol - So Amazon just decided to yeet **30,000 corporate workers** into the sun Not warehouse folks Not seasonal hires The people who actually run the machine And the market’s reaction “Yessss daddy Bezos cut more costs please” Stock goes up because apparently job losses = line go up Here’s what’s wild Everyone keeps saying AI is overhyped Meanwhile Amazon is basically saying “We": -0.8,
  "Argentine Peso, MercadoLibre Stock Surge After Milei’s Election Win": 0.6,
  "Sector Update: Consumer Stocks Advance Late Afternoon": 0.5,
  "US Equity Indexes Jump as Potential China Trade Deal, Earnings Expectations Lift Big-Tech": 0.8,
  "Vertex to Participate in the UBS Global Healthcare Conference on November 11": 0.2,
  "Cadence Reports Third Quarter 2025 Financial Results": 0.0,
  "NXP Semiconductors Reports Third Quarter 2025 Results": 0.0,
  "Why Shares of Arm Holdings Are Rising Today": 0.5,
  "Dexcom Appoints Euan Ashley to Board of Directors": 0.5,
  "Agilent Names Adam S. Elinoff as Chief Financial Officer": 0.5,
  "onsemi Completes Acquisition of  Vcore Power Technology from Aura Semiconductor": 0.5,
  "Cadence: Q3 Earnings Snapshot": 0.0,
  "Analyst Recommends Applied Materials (AMAT) as Top AI and Data Center Stock": 0.8,
  "NXP: Q3 Earnings Snapshot": 0.0,
  "Cadence Design Systems’s (NASDAQ:CDNS) Q3 Sales Top Estimates": 0.8,
  "Cadence Design Systems tops Q3 estimates, raises full-year outlook but shares slip": 0.2,
  "US Equity Indexes Touch Record Highs as Potential China Trade Deal Boosts Big-Tech Ahead of Earnings": 0.8,
  "Stocks to Watch Monday: Amazon, Nvidia, Novartis, Keurig Dr Pepper": 0.5,
  "Stock Market Today: Nasdaq Jumps As Palantir Tests Entry; Tesla Up Despite This Elon Musk Warning": 0.5,
  "Cadence Design Systems Falls Despite Q3 Earnings Beat": -0.5,
  "GlobalFoundries Announces Chief Financial Officer Transition": 0.0,
  "Tech, Media & Telecom Roundup: Market Talk": 0.0,
  "Is Warner Bros. Discovery Still a Good Bet After 98.4% Year-to-Date Rally?": 0.5,
  "Cadence Design Systems (CDNS) Beats Q3 Earnings and Revenue Estimates": 0.8,
  "NXP Semiconductors (NASDAQ:NXPI) Reports Q3 In Line With Expectations": 0.5,
  "A Dormant Nuclear Plant in Iowa Is Poised to Power Google’s Energy Needs": 0.5,
  "Keurig Dr Pepper Turns to Private Capital to Back $18 Billion Deal": 0.5,
  "Cadence (CDNS) Reports Q3 Earnings: What Key Metrics Have to Say": 0.2,
  "NXP Semiconductors (NXPI) Q3 Earnings Meet Estimates": 0.0,
  "Adobe Systems (ADBE) Rises But Trails Market: What Investors Should Know": 0.2,
  "Applied Materials (AMAT) Ascends But Remains Behind Market: Some Facts to Note": 0.1,
  "PDD Holdings Inc. Sponsored ADR (PDD) Exceeds Market Returns: Some Facts to Consider": 0.5,
  "Shopify (SHOP) Rises Yet Lags Behind Market: Some Facts Worth Knowing": 0.1,
  "Zscaler (ZS) Advances But Underperforms Market: Key Facts": 0.1,
  "Keurig Dr Pepper (KDP) Stock Trades Up, Here Is Why": 0.5,
  "Exxon and 9 More Dividend Stocks to Buy for a Rocky Market": 0.5,
  "Here's What Key Metrics Tell Us About NXP (NXPI) Q3 Earnings": 0.5,
  "Ross Stores (ROST) Laps the Stock Market: Here's Why": 0.5,
  "Cadence Reports Solid Earnings. The Stock Is Falling.": -0.5,
  "CarMax to leave the S&P 500 to give way to this famous industrial company’s spinoff": 0.2,
  "Solstice Advance Materials and Qnity Electronics Set to Join S&P 500; Others to Join S&P SmallCap 600": 0.5,
  "Diamondback Energy (FANG) Stock Sinks As Market Gains: What You Should Know": -0.5,
  "Copart, Inc. (CPRT) Stock Declines While Market Improves: Some Information for Investors": -0.5,
  "GlobalFoundries finance chief John Hollister departs, Sam Franklin named interim CFO": 0.1,
  "Earnings Preview: What to Expect From Intuit's Report": 0.5,
  "S&P gives low rating to Michael Saylor's Strategy": -0.6,
  "Agilent Technologies Names Adam S. Elinoff as CFO": 0.5,
  "Earnings Preview: What to Expect From Copart's Report": 0.5,
  "Sam's Club makes bold move to win over Costco members": 0.6,
  "Coca-Cola drops popular soda flavor from key venues, restaurants": -0.5,
  "(Item 2.02) . Results of Operations and Financial Condition. On October 28, 2025 , we issued a press release announcing earnings for the third quarter ended September 30, 2025. A copy of the press release is furnished as Exhibit 99.1 to this current report. This information, including Exhibit 99.1, will not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition. On October 28, 2025, Regeneron Pharmaceuticals, Inc. issued a press release announcing its financial and operating results for the quarter ended September 30, 2025. A copy of the press release is being furnished to the Securities and Exchange Commission as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated by reference to this\n\n(Item 2.02) . The information included or incorporated in this\n\n(Item 2.02) , including Exhibit 99.1, shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, nor shall such information and exhibit be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended, except as shall be expressly set forth by specific reference in such a filing.": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On October 28, 2025 , CoStar Group, Inc. (“CoStar Group” or the “Company”) announced its financial and operating results for the quarter ended September 30, 2025. The full text of the press release (the “Press Release”) issued in connection with the announcement is furnished as Exhibit 99.1 to this Current Report on Form 8-K. The information contained in this\n\n(Item 2.02) and the Press Release shall be considered “furnished” and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of that Section or Sections 11 and 12(a)(2) of the Securities Act of 1933, as amended, nor shall it be deemed incorporated by reference into any reports or filings with the Securities and Exchange Commission (the \"SEC\"), whether made before or": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition The information in\n\n(Item 2.02) of this Current Report, including the accompanying Exhibit 99.1, is being furnished and shall not be deemed “filed” for the purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities of Section 18. The information in\n\n(Item 2.02) of this Current Report shall not be incorporated by reference into any registration statement or other document filed pursuant to the Securities Act of 1933, as amended (the “Securities Act”), or the Exchange Act, regardless of any general incorporation language contained in such filing. Financial Results for the Quarter Ended September 30, 2025 On October 28, 2025, PayPal Holdings, Inc. (“PayPal,” the “Company,” “we,” “us,” or “our”) issued a press release announcing its financial results": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On October 27, 2025, NXP Semiconductors N.V. (\"NXP\") issued a press release regarding NXP’s financial results for its third quarter 2025. A copy of the press release is attached as Exhibit 99.1. The information contained in this\n\n(Item 2.02) , including the attached exhibit, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), nor shall it be deemed to be incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such a filing.\n\n(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Following the previous announcement on April 28, 2025, Kurt Sievers has voluntarily retired as CEO and executive director of NXP Semiconductors N.V. (the “Company”), effective October 28, 2025. The Company’s Board of Directors (the “Board”) has unanimously appointed Rafael Sotomayor to succeed Mr. Sievers as President and CEO and temporary executive director of the Company effective as": 0.1,
  "(Item 2.02) Result of Operations and Financial Condition. On October 28, 2025, Electronic Arts Inc. (\"Electronic Arts\" or “EA”) issued a press release announcing its financial results for the second fiscal quarter ended September 30, 2025. A copy of the press release is attached hereto as Exhibit 99.1. Neither the information in this Form 8-K nor the information in the press release attached hereto as Exhibit 99.1 shall be deemed “filed” for purposes of Section 18 of\n\n(Item 8.01) Other Events. On October 24, 2025, the Audit Committee of EA, on behalf of EA’s full Board of Directors declared a cash dividend of $0.19 per share of EA's common stock. The dividend is payable on December 23, 2025 to stockholders of record as of the close of business on December 3, 2025.": 0.2,
  "(Item 2.02) . Results of Operations and Financial Condition. On October 28, 2025, Booking Holdings Inc. announced its financial results for the third quarter ended September 30, 2025. The press release is attached as Exhibit 99.1 to this Current Report on Form 8-K and is incorporated herein by reference. Copies of Booking Holdings' consolidated balance sheet at September 30, 2025, consolidated statement of operations for the three and nine months ended September 30, 2025, and consolidated statement\n\n(Item 2.02) , including Exhibit 99.1, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such a filing.": 0.1,
  "(Item 5.02) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On October 28, 2025, CDW Corporation (the “Company”) announced that Sona Chawla will retire as Chief Growth and Innovation Officer and Executive Vice President of the Company effective December 31, 2025. Ms. Chawla will be available on a consulting basis until April 9, 2026 to assist with the transition of her responsibilities.": -0.2,
  "Universal Orlando makes major ticketing change at its new theme park": 0.5,
  "What to Expect From Palo Alto Networks' Next Quarterly Earnings Report": 0.2,
  "Adobe doubles down on AI after Q3 revenue gains": 0.5,
  "Why ‘Yellowstone’ Mastermind Taylor Sheridan Decided to Ditch Paramount": 0.1,
  "Cadence Design Systems Inc (CDNS) Q3 2025 Earnings Call Highlights: Strong Revenue Growth and ...": 0.8,
  "Verisk (VRSK) Q3 Earnings: What To Expect": 0.0,
  "why are you all staying in knowing that a huge bubble is coming? - Inevitably in the next year or two there’s going to be a huge crash on the level of 2000 / 2008. statistically speaking you are much better off to get out now wait for that crash and then jump in afterwards. is everybody here doing the smart thing and cashing out and then waiting for the crash ? This market is": -0.8,
  "Earnings To Watch: ADP (ADP) Reports Q3 Results Tomorrow": 0.2,
  "MercadoLibre (MELI) Reports Earnings Tomorrow: What To Expect": 0.5,
  "Old Dominion Freight Line (ODFL) Reports Earnings Tomorrow: What To Expect": 0.2,
  "Kraft Heinz Earnings: What To Look For From KHC": 0.0,
  "KLA Corporation (KLAC) To Report Earnings Tomorrow: Here Is What To Expect": 0.2,
  "What To Expect From GE HealthCare’s (GEHC) Q3 Earnings": 0.2,
  "3 Big Reasons to Love Cintas (CTAS)": 0.6,
  "Is ASML’s Rapid 51% Rally Supported by Semiconductor Demand and Recent Market Buzz?": 0.2,
  "Performance of major global indices (rebased to USD) - From FACTSET and all on USD basis. [https://imgur.com/a/lFKuMIo](https://imgur.com/a/lFKuMIo) It's very interesting to see how the major world indices have performed in the long term and the shorter term. Some notes I found interesting; * KOSPI is on fire. Combination of strong governance reform and the top 2 stocks in the index being heavy memory chip plays is a potent combination. * A lot of European indices": 0.2,
  "1 Cash-Producing Stock to Target This Week and 2 We Ignore": 0.2,
  "3 Unpopular Stocks That Deserve a Second Chance": 0.5,
  "S&P Slaps Michael Saylor’s Strategy With Junk Rating Over Bitcoin-Heavy Balance Sheet": -0.6,
  "Daily market wrap: top stocks - Qualcomm, Keurig Dr Pepper, and Albemarle": 0.0,
  "KDP Q3 Deep Dive: Market Applauds Strategic Transformation and Segment Growth": 0.8,
  "CDNS Q3 Deep Dive: AI Demand and Hardware Momentum Offset Cautious Market Reaction": 0.5,
  "The 5 Most Interesting Analyst Questions From Netflix’s Q3 Earnings Call": 0.6,
  "Intuitive Surgical’s Q3 Earnings Call: Our Top 5 Analyst Questions": 0.2,
  "5 Must-Read Analyst Questions From PACCAR’s Q3 Earnings Call": 0.0,
  "5 Insightful Analyst Questions From Texas Instruments’s Q3 Earnings Call": 0.5,
  "Will this be classified as Long Term gains? - If I bought 100 Shares of SPY in all. 95 on 05/01/24 Then I bought the other 5 on 12/01/24 - If I put in an offer to sell 95 of my shares tomorrow does that mean they will sell the 95 that will put me in the Long Term Gains bracket? Any risk that they accidentally sell the other 5 that will cause me the": -0.2,
  "UK Market: NIOX Group And 2 Other Stocks That May Be Trading Below Estimated Value": 0.5,
  "Lumentum (LITE) develops lasers and optical components for data centers. - I really like this one! I’ve bought in and I’m holding long. As demand for AI and cloud computing surges, data centers need faster and more energy-efficient connections - and that’s exactly what Lumentum builds. This puts them right at the center of a massive global infrastructure upgrade. The company recently reported strong revenue growth and expanding margins, driven by booming AI and data-center": 0.8,
  "Why The Story Around Ross Stores Is Changing After Fresh Analyst and Company Updates": 0.5,
  "Warner Bros. Discovery Executives Are Considering a Sale. Even So, the Stock Is Up 101%": 0.5,
  "ASML and Papa John's have been highlighted as Zacks Bull and Bear of the Day": 0.2,
  "ViCentra Strengthens Leadership Team to Accelerate Growth": 0.8,
  "Bull of the Day: ASML Holding (ASML)": 0.5,
  "Zacks.com featured highlights include Vertiv, Taiwan Semiconductor, Oracle, Lam Research and Elbit Systems": 0.2,
  "Is Honeywell Fairly Priced After Recent Sustainability Initiatives and 4.4% Weekly Gain?": 0.5,
  "FTSE and Wall Street hit record highs amid hopes over US-China trade deal and jobs recovery": 0.8,
  "Lumen Technologies (LUMN) Extends Gains by 15.7% as On-Demand Service Expands by 10 Million": 0.8,
  "r/Stocks Daily Discussion & Technicals Tuesday - Oct 28, 2025 - This is the daily discussion, so anything stocks related is fine, but the theme for today is on technical analysis (TA), but if TA is not your thing then just ignore the theme. Some helpful day to day links, including news: * [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks * [Bloomberg market news](https://www.bloomberg.com/markets) * StreetInsider news: * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly": 0.2,
  "Why I Think $GRRR’s Q3 Could Be a Knockout Quarter. - Gorilla ($GRRR) just released one of its most confident press statements to date, and reading between the lines, it looks like they’re setting up for a very strong Q3. **1) Board Expands Buyback to $20M** The Board of Directors has increased the share repurchase program to $20 million, roughly 5% of the company’s current market cap. That’s a major show of confidence for a": 0.8,
  "onsemi’s Treo Platform Selected by Teledyne    for Advanced Infrared Imaging Design": 0.5,
  "Company News for Oct 28, 2025": 0.0,
  "Cadence Raises Full-Year Outlook Following Third-Quarter Beat": 0.8,
  "Keurig Dr Pepper’s Shares Fizz Amid Private Equity Cash Infusion": 0.5,
  "Jones Soda, Bethesda Softworks Launch Vault-Tec Supply Pack, Sunset Sarsaparilla 4-Pack to Help Fans Celebrate Fallout™ Day": 0.5,
  "American Electric Power Company (NASDAQ:AEP) Has Announced That It Will Be Increasing Its Dividend To $0.95": 0.8,
  "CrowdStrike’s Q3 2026 Earnings: What to Expect": 0.0,
  "$LI - Play on sodium-ion batteries for EVs - So sodium-ion batteries are now a thing and can be used on EVs. CATL's batteries achieve energy density of 175 Wh/kg, similar to lithium iron phosphate (LFP) batteries at 180-200 Wh/kg. These batteries perform well at low-temperature, retaining 90% of usable power at -40°C and operating efficiently on the -40°C to 70°C range. Lithium batteries on the other hand at -20°C drop to just 23% of": 0.6,
  "Amazon Is Cutting Jobs. Why That’s a Strong Sign for the AI Boom.": 0.6,
  "United States Adult Vaccine Market Research and Company Analysis Report 2025-2033 Featuring GlaxoSmithKline, AstraZeneca, Sanofi Pasteur, Pfizer, and CSL Limited": 0.2,
  "1 Top Cryptocurrency to Buy Before It Soars 18,200%, According to Strategy Chief and Billionaire Michael Saylor": 0.8,
  "Is Marvell Technology (NASDAQ:MRVL) Using Too Much Debt?": -0.5,
  "Palo Alto Networks' (NASDAQ:PANW) Returns On Capital Are Heading Higher": 0.8,
  "Estimating The Intrinsic Value Of Analog Devices, Inc. (NASDAQ:ADI)": 0.1,
  "Amazon laying off about 14,000 corporate workers as it invests more in AI - Amazon said Tuesday that it will lay off about 14,000 corporate employees, marking the latest cuts in the company’s multi-year effort to rein in costs. In a blog post, the company wrote that the layoffs are being carried out to help make the company leaner and less bureaucratic, while it looks to invest in “our biggest bets” including generative artificial intelligence.": -0.6,
  "Regeneron earnings beat estimates amid strong anti-inflammatory drug demand": 0.8,
  "Check Point Software (CHKP) Q3 Earnings and Revenues Top Estimates": 0.8,
  "XRP Treasury Companies Have Entered the Chat. Should Investors Hop on Board?": 0.5,
  "2 Top Dividend Growth Stocks to Buy Now": 0.5,
  "CDW Announces Leadership Changes to Amplify Its Go-To-Market as Sona Chawla Retires": 0.2,
  "Synopsys Earnings Preview: What to Expect": 0.0,
  "SoFi Reports Third Quarter 2025 with Record Net Revenue of $962 Million, Record Member and Product Growth, Net Income of $139 Million - Adjusted Net Revenue up 38% to a record $950 million Adjusted EBITDA up 49% to a record $277 million Fee-based Revenue up 50% to a record $409 million Member growth up 35% to a record 12.6 million members Product growth up 36% to a record 18.6 million products Management Raises 2025 Guidance": 1.0,
  "Fireworks AI Raises $250M Series C to Lead the AI Inference Market": 0.8,
  "HONEYWELL INTRODUCES NEW, INNOVATIVE TECHNOLOGY THAT PRODUCES LOW-COST, HIGH QUALITY RENEWABLE FUELS FROM BIOMASS": 0.8,
  "Canada’s Seventh Costco Business Centre is now open in Mississauga": 0.5,
  "Stocks Mostly Up Pre-Bell as Traders Parse US-Japan Deal on Critical Minerals, Await Latest Earnings": 0.5,
  "Top 3 Growth Stocks With Significant Insider Ownership": 0.5,
  "Latest News In Energy Transition - Nimbus Wind Farm Powers Sustainable Energy Future": 0.5,
  "US High Growth Tech Stocks To Watch Now": 0.5,
  "Regeneron (REGN) Q3 Earnings and Revenues Surpass Estimates": 0.8,
  "NXP Completes Acquisitions of Aviva Links and Kinara to Advance Automotive Connectivity and AI at the Intelligent Edge": 0.5,
  "Best Buy (BBY)’s “Been Sneaking Up,” Says Jim Cramer": 0.6,
  "Uber (UBER)’s An “Up Stock,” Says Jim Cramer": 0.6,
  "Costco (COST)’s “Doing Quite Well,” Says Jim Cramer": 0.6,
  "Walmart (WMT) Continues To Take Market Share, Says Jim Cramer": 0.6,
  "Regeneron (NASDAQ:REGN) Surprises With Strong Q3": 0.8,
  "Posthaste: Why economists are cutting their forecasts for the Canadian dollar": -0.6,
  "VPNs from Cisco and Citrix Riskiest Products for Ransomware: At-Bay Rankings Report": -0.6,
  "Adobe Expands Creative Possibility with AI for Every Creator at Adobe MAX 2025": 0.6,
  "Gabelli Funds to Host 49th Annual Automotive Symposium at The Encore at Wynn, Las Vegas, Nevada": 0.2,
  "Fal.Con Europe 2025 Showcases the Power of Ecosystem in Cybersecurity’s Agentic Era": 0.6,
  "HONEYWELL ANNOUNCES PARTICIPATION AT UPCOMING INVESTOR CONFERENCES": 0.2,
  "Step Pharma announces the appointment of Dr Karen Smith as Chief Medical Officer": 0.5,
  "Adobe Firefly Delivers Groundbreaking AI Audio, Video and Imaging Innovations and New Models in All-In-One Creative AI Studio": 0.8,
  "Will Lower Revenues Adversely Impact Qorvo's Q2 Earnings?": -0.5,
  "Texas Instruments Incorporated's (NASDAQ:TXN) latest 5.7% decline adds to one-year losses, institutional investors may consider drastic measures": -0.6,
  "Grand Bay Hotel San Francisco Announces Affiliation with Marriott": 0.5,
  "Adobe Introduces New AI Assistant in Adobe Express that Unlocks Creativity for All with Conversational Creation and Editing": 0.8,
  "Atlassian (TEAM) Gains Analyst Confidence on Cloud Migration and AI Monetization Plans": 0.8,
  "Adobe and YouTube Partner to Empower Creators to Produce Amazing Content and Grow Their Audiences": 0.8,
  "AppLovin (APP) Rallied Following the Robust Operating Results": 0.8,
  "Adobe Delivers New AI Innovations, Assistants and Models Across Creative Cloud to Empower Creative Professionals": 0.8,
  "ADP Announces National Employment Report Preliminary Estimate Publicly Available on a Weekly Cadence": 0.2,
  "Adobe AI Already Providing Value to Users, CEO Narayen Says": 0.6,
  "AppLovin (APP) Rated Buy at Deutsche Bank on Strength of AI-Driven Advertising Platform": 0.8,
  "Renaissance Large Cap Growth Strategy Sold Cintas (CTAS) Due to Decline in Fundamentals": -0.5,
  "Analyst Says ASML Holding (ASML) an ‘Exciting’ AI Investment – Here’s Why": 0.8,
  "Bitcoin Price, Ethereum Slip. What to Watch for Crypto’s Next Move.": 0.1,
  "Apple, Qorvo, Celestica: Trending Stocks": 0.0,
  "Intuit Launches Intuit Accountant Suite: an AI-native Platform that Drives Efficiency and Growth for Accounting Firms": 0.8,
  "Microchip announces release of TimeProvider 4500 v3 grandmaster clock": 0.5,
  "Michael Dell’s son aims to transform the home power business by selling electricity and backup battery power like a Costco membership": 0.5,
  "Xactly Appoints Chief Marketing Officer and Chief Human Resources Officer To Fuel Next Phase of Growth": 0.6,
  "American Tower beats quarterly revenue estimates on strong leasing demand": 0.8,
  "Intuit Unveils Revolutionary System of Intelligence to Help Businesses Grow in the AI Era": 0.8,
  "SpotOn Enters Q4 with Sustained Growth Driven by Deeper Integrations, Multi-Unit Client Wins, and Strategic Partnerships": 0.8,
  "Balancing Innovation and Income: A2 Fund Shares 2026 Market Outlook Following 75% YTD Fund Growth": 0.6,
  "Should Lam Research Stock Be in Your Portfolio Post Solid Q1 Earnings?": 0.6,
  "MercadoLibre Q3 Preview: Credit Growth and Argentina Headwinds in Focus": 0.2,
  "US-Malaysia rare earth pact 2025: How it redefines global mineral supply chains - The US and Malaysia have sealed a landmark rare earth deal worth $150 billion, reshaping global mineral supply chains, reducing China’s grip on critical resources, and strengthening Washington’s strategic foothold in Southeast Asia’s resource-rich corridor. [https://www.indiaweekly.biz/us-malaysia-rare-earth-pact/](https://www.indiaweekly.biz/us-malaysia-rare-earth-pact/)": 0.8,
  "United States Carpet Forecast Report 2025: A $32.97 Billion Market by 2033, Driven by Residential Renovations, Commercial Infrastructure Development, and Demand for Eco, Stain-Resistant Materials": 0.6,
  "Xcel Energy to Post Q3 Earnings: What's in the Cards for the Stock?": 0.1,
  "Go Addressable, Blockgraph, Epsilon, Experian and TransUnion to Automate Audience Counts Across All Major Addressable TV Providers": 0.2,
  "ConductorOne Raises $79 Million Series B To Scale the World’s First AI-Native Identity Security Platform": 0.5,
  "360 Privacy Strengthens Board of Directors with Industry Veterans Wendy Bahr and Brian Murphy, Promotes Trinity Davis to Chief Security Officer": 0.5,
  "Is Trending Stock Datadog, Inc. (DDOG) a Buy Now?": 0.2,
  "Investors Heavily Search Texas Instruments Incorporated (TXN): Here is What You Need to Know": 0.5,
  "Why Investors Need to Take Advantage of These 2 Computer and Technology Stocks Now": 0.5,
  "Investors Heavily Search CrowdStrike (CRWD): Here is What You Need to Know": 0.5,
  "Silicon Valley chip start-up raises $100mn to take on TSMC and ASML": 0.5,
  "Estimating The Fair Value Of DoorDash, Inc. (NASDAQ:DASH)": 0.5,
  "Stocks making big moves yesterday: MACOM, Coinbase, Ross Stores, Lululemon, and Wayfair": 0.0,
  "Tufin Strengthens AI Data Center Security Capabilities with Addition of HPE Aruba Networking Support": 0.6,
  "Did Strategy’s (MSTR) Use of Preferred Stock for Bitcoin Signal a New Treasury Risk Approach?": 0.1,
  "What to Expect From Workday's Next Quarterly Earnings Report": 0.2,
  "Lam Research Corporation (LRCX) Hits Fresh High: Is There Still Room to Run?": 0.5,
  "Unlocking Q3 Potential of Xcel (XEL): Exploring Wall Street Estimates for Key Metrics": 0.5,
  "Unlocking Q3 Potential of Kraft Heinz (KHC): Exploring Wall Street Estimates for Key Metrics": 0.5,
  "Autodesk Earnings Preview: What to Expect": 0.0,
  "US job market shows signs of 'tepid recovery' in October, ADP says": 0.5,
  "Analog Devices' Q4 2025 Earnings: What to Expect": 0.2,
  "Is It Worth Investing in Take-Two (TTWO) Based on Wall Street's Bullish Views?": 0.5,
  "Brokers Suggest Investing in Adobe (ADBE): Read This Before Placing a Bet": 0.5,
  "Is It Worth Investing in CrowdStrike (CRWD) Based on Wall Street's Bullish Views?": 0.5,
  "Is It Worth Investing in PDD Holdings Inc. Sponsored ADR (PDD) Based on Wall Street's Bullish Views?": 0.5,
  "Compared to Estimates, Regeneron (REGN) Q3 Earnings: A Look at Key Metrics": 0.2,
  "Why This 1 Value Stock Could Be a Great Addition to Your Portfolio": 0.8,
  "Why Cognizant (CTSH) is a Top Value Stock for the Long-Term": 0.8,
  "Warner Bros. Discovery upgraded, F5 downgraded: Wall Street's top analyst calls": 0.2,
  "Tuesday’s Top 10 Wall Street Analyst Upgrades and Downgrades: Crowdstrike, Starbucks, Constellation Energy, McDonalds and More": 0.5,
  "Keurig Dr Pepper secures $7bn investment to fund business split": 0.5,
  "Will Diamondback's Permian Scale Drive Q3 Earnings Beat?": 0.2,
  "Here's Why Workday (WDAY) is a Strong Growth Stock": 0.8,
  "Apple, Microsoft cross $4 trillion market cap for the first time - Apple and Microsoft shares rose on Tuesday, pushing the companies over a market cap of $4 trillion for the first time. Both companies are still behind Nvidia, which is the world’s most valuable company with a market cap of over $4.6 trillion. Microsoft stock climbed about 3% on news that the company finalized a 27% in OpenAI’s for-profit business. The company has backed": 0.8,
  "If I Could Only Buy 2 Stocks in the Last Quarter of 2025, I'd Pick These": 0.5,
  "US startup Substrate announces chipmaking tool that it says will rival ASML": 0.5,
  "OpenAI completes restructure, solidifying Microsoft as a major shareholder - OpenAI on Tuesday announced it has completed its recapitalization, cementing its structure as a nonprofit with a controlling stake in its for-profit business. The artificial intelligence startup said its nonprofit is now called the OpenAI Foundation, and it holds an equity stake worth about $130 billion in its for-profit arm. OpenAI said its for-profit arm is now a public benefit corporation called OpenAI Group PBC.": 0.8,
  "Cadence Q3 Earnings & Revenues Surpass Estimates, Both Rise Y/Y": 0.8,
  "Treasury Yields Little Changed Ahead of Fed Decision": 0.0,
  "Palo Alto Networks Unveils Cortex AgentiX to Build, Deploy and Govern the Agentic Workforce of the Future": 0.5,
  "ISRG Rides on da Vinci 5 Momentum: Can This Growth Sustain?": 0.5,
  "Palo Alto Networks Secures the AI Agent Revolution with the Launch of Prisma AIRS 2.0": 0.6,
  "Palo Alto Networks Ushers In Autonomous AI Workforce for Cloud Security with Cortex Cloud 2.0": 0.6,
  "Earnings Preview: AC Immune (ACIU) Q3 Earnings Expected to Decline": -0.7,
  "Earnings Preview: Amgen (AMGN) Q3 Earnings Expected to Decline": -0.7,
  "Will Ultragenyx (RARE) Report Negative Q3 Earnings? What You Should Know": -0.5,
  "PepsiCo Insiders Sold US$19m Of Shares Suggesting Hesitancy": -0.5,
  "Earnings Preview: PROCEPT BioRobotics Corporation (PRCT) Q3 Earnings Expected to Decline": -0.7,
  "Exelon (EXC) Earnings Expected to Grow: Should You Buy?": 0.5,
  "Marriott International (MAR) Earnings Expected to Grow: Should You Buy?": 0.5,
  "Serve Robotics Inc. (SERV) Gains Analyst Confidence and Expands Reach with DoorDash Partnership": 0.8,
  "As Dow Hits Record, High-Yield Dogs of the Dow Still a Bargain": 0.5,
  "Riot Blockchain to Post Q3 Earnings: What's in Store for the Stock?": 0.2,
  "one of the recent IPOs I've been keeping my eyes on - WeRide on HKEX - WeRide on HKEX, one of those overlooked AI/selfdrivingcar tickers deserves more attention. Citi started coverage on WRD in late Sept with a BUY, $15.50 PT. The robotaxi sector’s hitting an inflection point, going from 0.1% penetration in 2025 to 9% by 2030 and 30% by 2035. The company has already tested in 30+ cities across 10 countries. Good partnership": 0.8,
  "Texas Sues Kenvue(KVUE), Alleging Omission of Autism Link From Tylenol Marketing - Texas sued Tylenol maker Kenvue, alleging it deceived pregnant women about risks associated with autism https://www.wsj.com/health/healthcare/texas-sues-kenvue-alleging-omission-of-autism-link-from-tylenol-marketing-d5ab7d50?st=thU5Sk&reflink=article_copyURL_share So since there’s no scientific evidence of this claim beyond RFK’s broken brain, and KVUE is down nearly 2% on this news, doesn’t this seem like it HAS to be hitting rock bottom?": -0.6,
  "This Analyst Was Right About Broadcom (AVGO)": 0.5,
  "Texas is facing a 'broken' shale industry. AI's power needs could be a lifeline.": 0.2,
  "Cuttable Launches in the U.S. — Giving Away 3.1 Billion AI-Made Ads": 0.5,
  "NXP Semiconductors Q3 Earnings Match Estimates, Revenues Fall Y/Y": -0.2,
  "Tesla, Qualcomm, Warner Bros. Discovery: Top Analyst Calls": 0.5,
  "Can Dexcom Deliver Strong Q3 Earnings on Stelo Gains and G7 Adoption?": 0.6,
  "Goldman Sachs Raises PT on AppLovin (APP) Stock": 0.5,
  "How a $5 Rotisserie Chicken and a $65 Membership Are Powering an Unstoppable Retail Juggernaut": 0.8,
  "A New Era Begins as Battlefield REDSEC Launches Alongside Battlefield 6's First Season - Bringing Free-to-Play Battle Royale and More to the Franchise": 0.8,
  "EA Music and Battlefield Studios Launch Official Battlefield Playlist Featuring All-star Talent, Available Now In-game and on Spotify": 0.8,
  "If You Invested in These Penny Stocks That Went Gangbusters in 1993, You’d Be Rich Today": 0.8,
  "GlobalFoundries CFO departs after less than two years": -0.5,
  "Consumer confidence continues to weaken as Americans see higher inflation, fewer jobs ahead": -0.8,
  "Kraft Heinz (KHC): Assessing Valuation After Board Changes Ahead of Business Split": 0.2,
  "Apollo's Kleinman on KDP Investment, PE Market and AI": 0.2,
  "Authorized Distributor Mouser Electronics Offers Wide Portfolio of Semiconductors and Electronic Components from onsemi": 0.5,
  "Big Tech has to 'walk the line' with AI spending this earnings season": 0.1,
  "Tesla CEO Musk's partisan politics cost automaker over 1 million EV sales, report shows - https://www.reuters.com/business/autos-transportation/tesla-ceo-musks-partisan-politics-cost-automaker-over-1-million-ev-sales-report-2025-10-28/ > Oct 28 (Reuters) - Tesla CEO Elon Musk's polarizing political actions since acquiring Twitter, later rebranded X, in 2022 dramatically hurt the automaker's U.S. sales, underscoring how deeply its fortunes are intertwined with the billionaire's persona. > The findings quantify for the first time how the political actions of the world's wealthiest person - including his role in": -0.6,
  "Apple Stock Ripe For Picking As This Fund Adds 8 Million Shares. Broadcom Is Also A Favorite.": 0.6,
  "Morningstar (MORN) Collaborates With NPPG Plan Professionals": 0.5,
  "16 Northern Illinois Communities Take Steps to Become EV Ready with ComEd": 0.5,
  "Cognizant's AI Lab Announces Breakthrough Research for Fine-Tuning LLMs and Records its 61st U.S. Patent Issuance": 0.8,
  "Quantum Computing Stocks: Cisco Targets Quantum Networking": 0.5,
  "FUTU vs. APP: Which Stock Is the Better Value Option?": 0.0,
  "DexCom Shares Fall After Hunterbrook Report on Incidents Related to G7 Glucose Monitor": -0.5,
  "Vertex Gears Up to Report Q3 Earnings: Is a Beat in the Cards?": 0.5,
  "PATH and APP: Two AI Stocks Worth Buying, But One Stands Stronger": 0.5,
  "Market Chatter: GlobalFoundries Expanding German Plant's Capacity to Meet Client Demand for Non-China, Non-Taiwan Chips": 0.6,
  "Nvidia takes $1 billion stake in Nokia - Nokia announced on Tuesday that Nvidia will purchase $1 billion in new Nokia shares, the latest equity stake in a strategic partner for the AI chip giant. Nokia shares soared 20% higher following the news. Nokia will issue over 166 million new shares. Nokia said that it would use the proceeds to fund its plans for AI and other general corporate purposes. The two companies also struck": 0.8,
  "Earnings Preview: What To Expect From lululemon athletica's Report": 0.5,
  "Adobe and Google Cloud Expand Strategic Partnership to Advance the Future of Creative AI": 0.8,
  "GlobalFoundries Plans Billion-Euro Investment to Expand Chip Manufacturing in Germany": 0.8,
  "Comcast Gears Up to Report Q3 Earnings: What's in the Cards?": 0.2,
  "Jim Cramer Says “AppLovin is a Winner”": 0.6,
  "Jim Cramer Suggests “Let’s Keep Palantir”": 0.5,
  "Jim Cramer Says Boeing is Supply-Constrained": 0.2,
  "Vertex Pharmaceuticals Stock Rises 8.9% as Pipeline Progress Renews Valuation Debate": 0.6,
  "Fortinet (FTNT): Examining Whether Recent Gains Signal an Undervalued Opportunity": 0.5,
  "Nvidia investing $1B in Nokia, Trump admin. inks nuclear deal": 0.2,
  "Why Are Regeneron (REGN) Shares Soaring Today": 0.5,
  "H.C. Wainwright Reiterates a Buy Rating on Vertex Pharmaceuticals (VRTX)": 0.6,
  "NVIDIA and Nokia to Pioneer the AI Platform for 6G — Powering America’s Return to Telecommunications Leadership": 0.8,
  "NXPI Q3 Deep Dive: Signs of Automotive and Industrial Recovery Amid Inventory Normalization": 0.6,
  "AVGO vs. CSCO: Which AI Infrastructure Stock is a Buy Right Now?": 0.5,
  "These Two Companies Are Set to Join the S&P 500 Soon": 0.5,
  "Palo Alto Networks launches AI-driven security offerings to tackle cyberattacks": 0.6,
  "Nvidia's DC Power Play: Can Jensen Huang Revive the AI Stock King?": 0.5,
  "Nvidia to sell thousands of GPUs to US labs as part of sovereign AI push": 0.5,
  "Mem0 Raises $24M Series A to Build Memory Layer for AI Agents": 0.6,
  "PayPal Becomes OpenAI’s Latest Partner on Powering AI-Based Commerce": 0.5,
  "Costco offers its weirdest membership promotion ever": -0.5,
  "October 2025's Leading Growth Companies With Strong Insider Ownership": 0.5,
  "High Growth Tech Stocks In The US Market With Promising Potential": 0.8,
  "Warner Bros. Discovery Upgraded on Bidding War Buzz": 0.6,
  "Sector Update: Health Care Stocks Retreat Tuesday Afternoon": -0.5,
  "Top analyst issues surprise verdict on 40-year-old tech giant's AI pivot": 0.5,
  "KDP Q3 Earnings Meet Estimates, 2025 Sales Outlook Raised, Stock Up 8%": 0.8,
  "NVIDIA and US Telecom Leaders Unveil the All-American AI-RAN Stack to Accelerate the Path to 6G": 0.5,
  "Buy, Sell, or Hold Strategy Stock? Key Tips Ahead of Q3 Earnings": 0.5,
  "US Equity Indexes Scale New Highs Amid Strong Earnings, Corporate Actions": 0.8,
  "Why Stocks Are Set to Melt Up Despite Investor Fear": 0.5,
  "NVIDIA partners with Uber to scale autonomous vehicle fleets by 2027 - https://www.streetinsider.com/Corporate+News/NVIDIA+partners+with+Uber+to+scale+autonomous+vehicle+fleets+by+2027/25512177.html > NVIDIA Corp. (NASDAQ: NVDA) announced a partnership with Uber Technologies Inc. to develop autonomous vehicle technology for global deployment, according to a company press release. The collaboration centers on NVIDIA's new DRIVE AGX Hyperion 10 platform, which the company describes as a reference compute and sensor architecture for level 4 autonomous vehicles. Uber plans to begin scaling its autonomous fleet starting": 0.5,
  "Cintas Corporation Announces Quarterly Cash Dividend and New $1.0 Billion Stock Buyback Authorization": 0.5,
  "NVIDIA just speed-ran like 5 partnerships today ，Who’s gonna stop this company？ - Every time you think NVIDIA is done announcing big news They drop another collab that adds billions in future value Today alone they touched • Automotive deals expanding AI fleets • Cloud partnerships pushing enterprise adoption • More AI chip supply commitments locked in • Software ecosystem hooks sinking deeper • New industries saying “yeah we want in too” It’s not just": 0.8,
  "Nvidia's Huang showcases AI latest, CrowdStrike stock upgraded": 0.5,
  "UPS stock rallies after company discloses 48,000 layoffs in multibillion-dollar savings push": 0.2,
  "Cisco, G42 Step Up Partnership to Power UAE AI Push": 0.5,
  "Does CrowdStrike’s 10% Surge Signal More Room to Run in 2025?": 0.2,
  "Keurig Dr Pepper (KDP) Margin Miss Reinforces Value Narrative After $787M One-Off Loss": 0.2,
  "Texas Instruments (TXN) Was A “Rain On My Parade,” Says Jim Cramer": -0.6,
  "Chipmaker GlobalFoundries to expand German facility with 1.1 billion euro investment": 0.8,
  "Jim Cramer Discusses Micron (MU) After Intel’s Earnings": 0.5,
  "Jim Cramer’s Positive On Seagate Technology (STX)": 0.8,
  "We Need To Talk About Advanced Micro Devices (AMD) Millionaires, Says Jim Cramer": 0.2,
  "Supermicro Just Announced New Record Computing Results. Does That Make SMCI Stock a Buy Here?": 0.5,
  "Corporate Earnings Help Lift Equities Intraday as Fed Meeting Begins": 0.5,
  "Jim Cramer Shares Key Insights For Western Digital (WDC)": 0.5,
  "As Netflix Stock Loses Steam, Should You Buy the NFLX Dip?": 0.2,
  "Qualcomm Joins the AI Race: Is QCOM a Must-Buy Stock?": 0.5,
  "Pure Storage and Cisco Deliver AI Factories for the Enterprise with NVIDIA": 0.5,
  "Synopsys Spotlights Agentic AI, Accelerated Computing, and AI Physics at NVIDIA GTC Washington, D.C.": 0.5,
  "MITRE Announces AI-Native Spectrum Agility Prototype to Strengthen Telecom in America": 0.6,
  "Nvidia says Eli Lilly will purchase more than 1,000 GPUs to power drug discovery efforts": 0.8,
  "Super Micro (SMCI) Stock Is Up, What You Need To Know": 0.5,
  "Signals Suggest $MSTR Could Be Setting Up for a Strong Move Post-Earnings - $MSTR (Strategy, formerly MicroStrategy) reports Q3 2025 earnings on October 30, and expectations are rising. Analysts project a smaller loss of about $0.10 per share, compared to $1.72 a year ago, with revenue near $116.6M. The company’s large Bitcoin position roughly 640,808 BTC continues to tie its performance closely to crypto market sentiment, which has added another layer of volatility. Citi recently": 0.6,
  "CrowdStrike and NVIDIA Redefine Cybersecurity with Always-On AI Agents Protecting the Nation’s Digital Infrastructure": 0.8,
  "Nokia an easy 10x - Just saw the bombshell - Nvidia is plunking $1 billion into Nokia for a ~2.9% stake. ￼ So here’s the tea: • Nokia, once the mobile-phone king, has been pivoting into network infrastructure and data centre switching/optical gear. ￼ • Nvidia doesn’t just want chips in data centres anymore - they want the whole telecom stack. They’ll use Nokia’s hardware/infrastructure + Nokia will run its 5G/6G RAN software on Nvidia’s": 0.8,
  "Cocoa Prices Fall on Favorable West Africa Growing Conditions": -0.7,
  "REGN Stock Up on Q3 Earnings Beat, Eylea HD Sales Increase": 0.8,
  "Dear Honeywell Stock Fans, Mark Your Calendars for October 30": 0.5,
  "Cisco Delivers AI Innovations across Neocloud, Enterprise and Telecom with NVIDIA": 0.5,
  "Adobe GenStudio Introduces New Scaled Content Production Capabilities, Enhanced Model Customization with Adobe Firefly Foundry and a Growing Ecosystem of Ad Delivery Partners": 0.5,
  "TeraWulf inks $9.5B extension to Fluidstack deal as CEO teases additional 168 MW rollout - Following the announcement, TeraWulf CEO Paul Prager tweeted that Fluidstack and Google have also tapped TeraWulf for another 168 MW of AI load an undisclosed location. Under the Abernathy agreement, TeraWulf will hold a 51% majority stake in the joint venture, which is expected to deliver the facility in the H2 2026. Echoing Prager’s comments, the joint venture secures TeraWulf": 0.6,
  "CrowdStrike (CRWD) Stock Is Up, What You Need To Know": 0.5,
  "Embattled ​Tylenol Maker Kenvue Hires New Marketing Chief": 0.2,
  "The Real Winner of Nvidia’s $1B Nokia Deal? T-Mobile Just Jumped to the Front of the 6G Race.": 0.8,
  "Thiel-Backed Startup Targets US Chip Comeback": 0.5,
  "Investment returns good? - Hello, I started investing in stock market and this is my return graph on Schwab and I was wondering if this is considered good. I invested mainly in AMD, Googles and UNH when they were down. I plan to sell these in future and put it back into index fund and I was wondering if this performance is good or should I just stick to index fund. https://imgur.com/a/KAduCvx Thank you": 0.5,
  "The next chapter of the Microsoft–OpenAI partnership - https://blogs.microsoft.com/blog/2025/10/28/the-next-chapter-of-the-microsoft-openai-partnership/ \"First, Microsoft supports the OpenAI board moving forward with formation of a public benefit corporation (PBC) and recapitalization. Following the recapitalization, Microsoft holds an investment in OpenAI Group PBC valued at approximately $135 billion, representing roughly 27 percent on an as-converted diluted basis, inclusive of all owners – employees, investors, and the OpenAI Foundation.\" \"OpenAI has contracted to purchase an incremental $250B of Azure services, and": 0.5,
  "Nokia Shares Soar After Nvidia Agrees to Invest $1 Billion in Finnish Telecom Giant": 0.8,
  "CoStar Group Q3 Revenue Increases 20% Year-over-Year, Net New Bookings up 92% Year-over-Year to $84 Million": 0.8,
  "Stock market today: Dow, S&P 500, Nasdaq notch fresh records as Nvidia soars ahead of Fed rate decision": 0.8,
  "Nvidia stock nears $5 trillion market cap after slew of updates at GTC event": 0.8,
  "Electronic Arts Reports Q2 FY26 Results": 0.0,
  "Mondelēz International Reports Q3 2025 Results": 0.0,
  "Electronic Arts’ Earnings Meet Expectations Ahead of $55 Billion Take-Private Deal": 0.5,
  "US Equity Markets End Higher Amid Expectations of Another Fed Rate Cut": 0.8,
  "Cameco's Westinghouse Becomes Big Winner From Trump's Nuclear Energy Push": 0.8,
  "CoStar: Q3 Earnings Snapshot": 0.0,
  "Booking Holdings: Q3 Earnings Snapshot": 0.0,
  "Electronic Arts’s (NASDAQ:EA) Q3 Sales Top Estimates": 0.8,
  "Mondelez: Q3 Earnings Snapshot": 0.0,
  "EA’s Sales, Profit Drop After Lapping College-Football Launch": -0.5,
  "These Are The 5 Best Stocks To Buy Now Or Watch": 0.5,
  "Roth IRA is 90% aapl - So I've had apple for years and it literally is 90% of my Roth, it's the lions share and truly has grew. For so long never wanted to sell and nowadays it has definitely paid off but lately wondering if i should take profits and maybe take a couple thousands when it on positive days and maybe moving it to etfs that won't compete with it. I guess since": 0.2,
  "Nvidia partners with Palantir, Uber, & more, easing AI bubble fear": 0.6,
  "Electronic Arts: Fiscal Q2 Earnings Snapshot": 0.0,
  "Why Check Point Software Stock Popped Today": 0.2,
  "The S&P 500 Just Added 2 Stocks—and Booted 2 Others": 0.1,
  "4 Pleasant Surprises from Coca-Cola's Earnings Report Last Week": 0.8,
  "Nvidia Stock Hits Record, Just Misses $5 Trillion as GTC Kicks Into High Gear": 0.8,
  "What are your predictions for specific industries with the most growth media/long term ? - Before I decide which stocks to invest, I'm trying to get the wisdom of the crowds for specific industries growth in the medium and long term. I'm trying predict out the industries with the most growth before I get into the very specific details. 1)Technology: AI. It seems AI both software and hardware will keep growing. Although I'm thinking, the": 0.2,
  "Booking Holdings shares rise 2% on profit beat fueled by resilient travel demand": 0.8,
  "US Equity Indexes Break Records as Fed Set to Cut While Gains Accrue From Earnings, Corporate Actions": 0.8,
  "Adobe Ramps Up Generative AI Offerings For Creators": 0.6,
  "Mondelez (NASDAQ:MDLZ) Reports Q3 In Line With Expectations": 0.5,
  "Booking Holdings Stock Jumps After Earnings Beat For Online Travel Leader": 0.8,
  "US Equities Extend Record Run on Upbeat Earnings Ahead of Fed Decision": 0.8,
  "Mondelez Tempers Outlook as Costs Rise": -0.5,
  "Booking Holdings beats results estimates on steady travel demand, shares up": 0.8,
  "Christie's International Real Estate Sereno Earns #19 Ranking on Silicon Valley Business Journal's Corporate Philanthropy List of Corporate Givers": 0.5,
  "CoStar (NASDAQ:CSGP) Posts Better-Than-Expected Sales In Q3": 0.8,
  "Viamedia Welcomes the Court’s Decision that Its Longstanding Antitrust Case Against Comcast Should Proceed to Trial on October 5, 2026": 0.5,
  "Electronic Arts misses second quarter estimates on lower booking and high cost": -0.6,
  "Visa Earnings Top Estimates as Consumers Keep Spending on Cards - >Visa Inc. reported fiscal fourth-quarter earnings that topped estimates as consumers continued to swipe, tap and insert their credit cards to transact globally. >Adjusted net income totaled $5.8 billion, or $2.98 a share, up 7% from a year earlier. That slightly exceeded analysts’ estimates of $2.97 a share. Visa said in July that it expected earnings per share to increase by a percentage in": 0.8,
  "The world’s most valuable public company just laid out its vision for the future": 0.5,
  "Mondelez warns of bigger hit to annual profit as rising cocoa prices weigh": -0.6,
  "Did Comcast's (CMCSA) Expansion of NOW TV Latino Just Shift Its Streaming Investment Narrative?": 0.1,
  "Intellia Therapeutics (NTLA) Is Down 45.2% After Pausing Key Nex-z Trials Over Safety Issue – Has The Bull Case Changed?": -0.6,
  "Booking Holdings (BKNG) Beats Q3 Earnings and Revenue Estimates": 0.8,
  "CoStar Group (CSGP) Q3 Earnings and Revenues Top Estimates": 0.8,
  "Mondelez (MDLZ) Surpasses Q3 Earnings and Revenue Estimates": 0.8,
  "Is Datadog (DDOG) The Best AI SaaS Stock to Buy?": 0.5,
  "4 Reasons Booking Holding Soars Even Higher After Earnings": 0.8,
  "Regeneron's Earnings Took A Big Tax Hit, And Still Pounded Forecasts": 0.8,
  "Electronic Arts (EA) Q2 Earnings and Revenues Miss Estimates": -0.8,
  "The Estée Lauder Companies Partners with Shopify to Reimagine Digital Beauty Commerce and Elevate Consumer Experiences": 0.6,
  "Booking Holdings (BKNG) Reports Q3 Earnings: What Key Metrics Have to Say": 0.2,
  "Varonis Systems (VRNS) Meets Q3 Earnings Estimates": 0.5,
  "Constellation Energy Corporation (CEG) Stock Sinks As Market Gains: Here's Why": -0.5,
  "AppLovin (APP) Stock Dips While Market Gains: Key Facts": 0.1,
  "Qualcomm (QCOM) Stock Sinks As Market Gains: Here's Why": -0.5,
  "The Trade Desk (TTD) Stock Drops Despite Market Gains: Important Facts to Note": -0.5,
  "Take-Two Interactive (TTWO) Stock Dips While Market Gains: Key Facts": -0.2,
  "Woojer Partners with Texas Logistic & Fulfillment Services to Power QC, Software Updates, and Nationwide Distribution to Best Buy, Costco, and Sam’s Club": 0.6,
  "Nvidia CEO Downplays AI Bubble Fears as He Enlists New Partners": 0.5,
  "Booking (NASDAQ:BKNG) Surprises With Q3 Sales": 0.5,
  "Electronic Arts (EA) Q2 Earnings: How Key Metrics Compare to Wall Street Estimates": 0.5,
  "Mondelez (MDLZ) Reports Q3 Earnings: What Key Metrics Have to Say": 0.2,
  "Broadcom, IBD Stock Of The Day, Breaks Out Past Buy Point On AI Activity": 0.6,
  "Visa, Caesars, Mondelez: Afterhours Earnings Roundup": 0.0,
  "Astrazeneca (AZN) Stock Declines While Market Improves: Some Information for Investors": -0.5,
  "'Google Guys' Larry Page and Sergey Brin have grown $55 billion richer in 3 months — and only trail Larry Ellison in wealth gain this year": 0.8,
  "New Record Closing Highs Ahead of Fed Cut, Mag 7 Earnings": 0.5,
  "CoStar (CSGP) Q3 2025 Earnings Call Transcript": 0.2,
  "Mondelez Says Downbeat Americans Are Skipping Snacks": -0.6,
  "Comcast Breaks Ground in the Rural Area of Kings County to Connect Homes and Businesses to High-Speed Internet": 0.8,
  "A Look at ON Semiconductor’s Valuation After Teledyne Partnership for Advanced Infrared Imaging Systems": 0.5,
  "Booking Third-Quarter Sales Rise as U.S. Travel Demand Stabilizes": 0.6,
  "Is Shopify’s 122% Rally Justified After Recent Product Investments and Partnerships?": 0.5,
  "Adobe's Quarterly Earnings Preview: What You Need to Know": 0.2,
  "We are in truly unprecedented times in the current market - Just absolutely insane. On one hand, I’m not complaining cause frankly, I’m making crazy money right now. On the other hand, there’s no way *everything* ai and tech related rn is not overvalued as fuck. You’re telling me, Nvidia is genuinely a 5 trillion dollar market cap company, and that’s a valid valuation? I mean I’ve seen such explosive growth in some of these": 0.6,
  "(Item 2.02) Results of Operations and Financial Condition. On October 29, 2025, KLA Corporation (the “Company”) issued a press release announcing selected financial and operating results for its first quarter of fiscal year 2026 . A copy of the press release is furnished as Exhibit 99.1 to this Current Report on Form 8-K. The information in\n\n(Item 2.02) of this Current Report on Form 8-K and the exhibit attached hereto shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities under that section, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended, or the Exchange Act, regardless of any general incorporation language in such filing.": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On October 29, 2025, the Registrant issued a press release announcing that the Registrant's financial results for the first quarter ended September 30, 2025 were available through an earnings release available on the Registrant's website. A copy of the Registrant's earnings release is attached hereto as Exhibit 99 and is hereby incorporated by reference.": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. On October 29, 2025 , Cognizant Technology Solutions Corporation (the “Company”), issued a press release to report the Company’s financial results for the quarter ended September 30, 2025. The full text of the press release and the infographic embedded in and part of such press release are attached to this current report on Form 8-K as Exhibits 99.1 and 99.2, respectively.*\n\n(Item 2.02) ,": 0.2,
  "(Item 2.02) Results of Operations and Financial Condition. On October 29, 2025, Meta Platforms, Inc. (\"Meta\") issued a press release and will hold a conference call regarding its financial results for the quarter ended September 30, 2025. A copy of the press release is furnished as Exhibit 99.1 to this report. The information furnished with this\n\n(Item 2.02) , including Exhibit 99.1, shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), or otherwise subject to the liabilities of that section, nor shall it be deemed incorporated by reference into any other filing under the Securities Act of 1933, as amended, or the Exchange Act, except as expressly set forth by specific reference in such a filing. Meta is making reference": 0.1,
  "(Item 2.02) . Results of Operations and Financial Condition. On October 29, 2025, the Registrant issued a press release, a copy of which is attached hereto as Exhibit 99.1 and is incorporated herein by reference.": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition. On October 29, 2025, Starbucks Corporation issued a press release announcing its financial results for the quarter ended September 28, 2025. A copy of the press release is attached as Exhibit 99.1.": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. On October 29, 2025, The Kraft Heinz Company issued a press release announcing results for the third quarter ended September 27, 2025. A copy of the press release is furnished as Exhibit 99.1 to this Current Report on Form 8-K. The information furnished pursuant to this\n\n(Item 2.02) , including Exhibit 99.1, shall not be deemed to be “filed” for purposes of Section 18 of, or otherwise regarded as filed under, the Securities Exchange Act of 1934, as amended (the “Exchange Act”), nor shall it be deemed incorporated by reference into any filing under the Securities Act of 1933, as amended, or in the Exchange Act, except as shall be expressly set forth by specific reference in such filing.": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition On October 29, 2025, Old Dominion Freight Line, Inc. issued a press release regarding its financial results for its third quarter of 2025, ended September 30, 2025. A copy of this press release is furnished as Exhibit 99.1.": 0.1,
  "(Item 2.02) Results of Operations and Financial Condition. On October 29, 2025, Verisk Analytics, Inc. (the “Registrant”) issued a press release announcing its financial results for the quarter ended September 30, 2025. A copy of the press release is annexed as Exhibit 99.1 and incorporated by reference herein. All information in the press release is furnished but not filed.": 0.0,
  "(Item 2.02) Results of Operations and Financial Condition. On October 29, 2025 , GE HealthCare Technologies Inc. (“GE HealthCare”) issued a press release announcing its third quarter 2025 financial results. A copy of this press release is furnished as Exhibit 99 to this Current Report on Form 8-K. The information furnished pursuant to\n\n(Item 2.02) , including Exhibit 99, shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or otherwise subject to the liabilities under that Section and shall not be deemed to be incorporated by reference into any filing of GE HealthCare under the Securities Act of 1933, as amended, or the Exchange Act, except as expressly set forth by specific reference in such filing.": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition. On October 29, 2025, Alphabet Inc. (“ Alphabet ” or the “ Company ”) is issuing a press release and holding a conference call regarding its financial results for the quarter ended September 30, 2025. A copy of the press release is furnished as Exhibit 99.1 to this Current Report on Form 8-K. This information shall not be deemed “filed” for purposes of Section 18 of the Securities": 0.0,
  "(Item 2.02) . Results of Operations and Financial Condition On October 29, 2025, Microsoft Corporation issued a press release announcing its financial results for the fiscal quarter ended September 30, 2025. A copy of the press release is furnished as Exhibit 99.1 to this report.": 0.0,
  "(Item 5.02) . Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers On October 29, 2025, CSX Corporation (the “Company”) announced the appointment of Kevin S. Boone to the position of Executive Vice President and Chief Financial Officer of the Company, effective immediately. Mr. Boone, who has most recently served as the Company’s Executive Vice President and Chief Commercial Officer since June 2021, succeeds Sean R. Pelkey, who\n\n(Item 8.01) . Other Events. Also on October 29, 2025, the Company announced the promotion of Maryclare T. Kenney, age 48, as the Company’s new Senior Vice President and Chief Commercial Officer, effective immediately. Ms. Kenney previously served as the Company’s Vice President of Sales and Marketing. Since joining the Company in 2011, she has advanced through roles of increasing responsibility. Most recently, Ms. Kenney was responsible for Merchandise Sales and Marketing, TRANSFLO, Automotive and Total Distribution": 0.5,
  "(Item 2.02) . Results of Operations and Financial Condition The information, including the exhibit attached hereto, in this Current Report is being furnished and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of that section. The information in this Current Report shall not be incorporated by reference into any registration statement or other document pursuant to the Securities Act of": -0.2,
  "Supermicro Smashes AI Trading Records With Intel And Micron — What's Powering The Surge?": 0.6,
  "Is Cisco’s New AI Partnerships and N9100 Launch Shaping the Investment Case for CSCO?": 0.2,
  "RBC Downgrades Roper Technologies (ROP) on Limited Upside and AI Uncertainty": -0.6,
  "NXP Semiconductors (NXPI): Margin Decline Challenges Bullish Narrative Despite Strong Valuation": -0.5,
  "Cadence Design Systems (CDNS): Slowing Margins Challenge Bullish Growth Narratives Despite Elevated Valuation": -0.5,
  "Wells Fargo Maintains Underweight on Qualcomm (QCOM) Amid AI Expansion Plans": -0.5,
  "RBC Upgrades Honeywell (HON) to Outperform, Sees Catalyst-Rich Phase Ahead": 0.8,
  "Agoda Data Reveals Top Honeymoon Destinations for Indian Travelers in 2025": 0.5,
  "Did Strong Results and New Acquisitions Just Shift Cadence Design Systems' (CDNS) Investment Narrative?": 0.5,
  "Is Keurig Dr Pepper Worth a Closer Look After Recent Product Expansion News?": 0.5,
  "Analog Devices (ADI) Balances R&D Leadership with Reliable Dividends": 0.5,
  "DexCom (DXCM) Reports Earnings Tomorrow: What To Expect": 0.5,
  "Earnings To Watch: Comcast (CMCSA) Reports Q3 Results Tomorrow": 0.5,
  "Biogen (BIIB) Reports Earnings Tomorrow: What To Expect": 0.5,
  "Mondelez Sinks 6% After Earnings: Here’s What You Need to Know": -0.6,
  "Gilead Sciences (GILD) Reports Q3: Everything You Need To Know Ahead Of Earnings": 0.5,
  "Strategy Earnings: What To Look For From MSTR": 0.2,
  "Atlassian (TEAM) Q3 Earnings: What To Expect": 0.0,
  "Returns vs Moral Compass - (25 y/o) I’ve been investing for 5+ years. These past couple of years I have had some excellent returns. However here’s the thing, my picks that are doing the best are companies that I do not align with ethically (mainly environmental concerns). I have been struggling between knowing what’s “right” and just going with what I think will provide a return. For example, I’ve been researching TMC and thinking about": -0.5,
  "Cisco (CSCO): Buy, Sell, or Hold Post Q2 Earnings?": 0.2,
  "Market Wrap: Top Stock Movers- PayPal, Nokia, and Wayfair": 0.0,
  "3 Reasons We’re Fans of Netflix (NFLX)": 0.5,
  "1 S&P 500 Stock to Target This Week and 2 We Brush Off": 0.2,
  "3 Cash-Producing Stocks We Steer Clear Of": -0.5,
  "2 Profitable Stocks with Exciting Potential and 1 Facing Headwinds": 0.5,
  "These Are The Best Robinhood Stocks To Buy Or Watch Now": 0.6,
  "How the Narrative Around ADP Is Shifting Amid New Analyst Outlooks and Market Headwinds": 0.2,
  "PYPL Q3 Deep Dive: Product Diversification and New Initiatives Drive Positive Market Reaction": 0.8,
  "5 Must-Read Analyst Questions From O'Reilly’s Q3 Earnings Call": 0.2,
  "REGN Q3 Deep Dive: Pipeline, Regulatory Progress, and Label Expansion Take Center Stage": 0.5,
  "5 Must-Read Analyst Questions From Lam Research’s Q3 Earnings Call": 0.5,
  "UK Value Stocks Trading At Up To 49.1% Estimated Discount": 0.6,
  "r/Stocks Daily Discussion Wednesday - Oct 29, 2025 - These daily discussions run from Monday to Friday including during our themed posts. Some helpful links: \\* \\[Finviz\\](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks \\* \\[Bloomberg market news\\](https://www.bloomberg.com/markets) \\* StreetInsider news: \\* \\[Market Check\\](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips \\* \\[Reuters aggregated\\](https://www.streetinsider.com/Reuters) - Global news If you have a basic question, for example \"what is": 0.0,
  "My 2 Favorite Stocks to Buy Right Now": 0.5,
  "Comcast (CMCSA): Exploring Valuation After the NOW TV Latino Expansion and Streaming Push": 0.2,
  "Does Billionaire Philippe Laffont Know Something Wall Street Doesn't? His Hedge Fund Is Backing a Stock That Jumped 211% in Just 5 Days.": 0.8,
  "NXP Improves Battery Health Monitoring with EIS Capable Battery Management Chipset": 0.6,
  "Stock-Split Watch: Is ASML Holding Next?": 0.2,
  "Heard on the Street Tuesday Recap: Another Record": 0.8,
  "Does Arm’s 24% Rally Signal More Growth Ahead Amid AI Optimism?": 0.6,
  "Intuitive Surgical and Oklo have been highlighted as Zacks Bull and Bear of the Day": 0.5,
  "A Once-in-a-Decade Investment Opportunity: 1 Artificial Intelligence (AI) Semiconductor Stock to Buy Hand Over Fist and Hold for Years (Hint: It's Not Nvidia)": 0.8,
  "Domaine Worldwide and Shopify Launch Enterprise Platform Migration Initiative Across Europe": 0.5,
  "Is This the Best Artificial Intelligence (AI) Stock to Buy Right Now?": 0.5,
  "Suze Orman says retirees need this much cash saved — and it’s more than you might expect": 0.5,
  "Billionaire Philippe Laffont Just Bought This ETF That Could Soar 19,000%, According to Strategy's Michael Saylor": 0.6,
  "Nvidia shares pop 3% in premarket as tech giant nears historic $5 trillion valuation - Shares of Nvidia rose more than 3% in premarket trade on Wednesday, putting the tech giant on track to become the first company to cross the $5 trillion market value threshold. The latest move higher comes shortly after CEO Jensen Huang said Nvidia expects $500 billion in artificial intelligence chip orders and announced plans to build seven new supercomputers for": 0.8,
  "Nokia stock retreats, follows “excessive” rally tied to Nvidia partnership": -0.5,
  "Trump-Xi Meeting, Microsoft Earnings, Fed Rate Decision: Still to Come This Week": 0.2,
  "Autodesk launches first-ever Team USA campaign honoring athletes who embody design and make spirit": 0.6,
  "The next chapter in OpenAI's dealmaking frees it to make even more": 0.6,
  "S&P 500 Futures Rise as Fed Rate Cut Decision Looms": 0.5,
  "GE HealthCare reports third quarter 2025 financial results": 0.0,
  "Infosys Extends Strategic Collaboration with Metro Bank to Transform Finance Operations with Workday": 0.6,
  "GE HealthCare: Q3 Earnings Snapshot": 0.0,
  "Trending tickers: Nvidia, UBS, Santander, Aston Martin and Next": 0.0,
  "Cognizant Reports Third Quarter 2025 Results": 0.0,
  "Chart Industries Reports Third Quarter 2025 Financial Results": 0.0,
  "Bull of the Day: Intuitive Surgical (ISRG)": 0.5,
  "Verizon tops estimates for subscriber additions, profit on strong phone upgrades": 0.8,
  "Cognizant: Q3 Earnings Snapshot": 0.0,
  "Boyu Capital is frontrunner for controlling stake in Starbucks China": 0.5,
  "Chart (NYSE:GTLS) Misses Q3 Revenue Estimates": -0.5,
  "GE HealthCare (NASDAQ:GEHC) Surprises With Q3 Sales": 0.5,
  "Best Growth Stocks to Buy for Oct. 29th": 0.5,
  "Latin America Buy Now Pay Later Business Report 2025-2029 Featuring Wibond, Wipei, PagoMisCuentas, Uala, Cleo, Sweetpay, Addi, PayPal, OpenPay, DiniePay": 0.0,
  "Social Buzz: Wallstreetbets Stocks Mixed Pre-Bell Wednesday; Beyond Meat to Advance, Nokia to Decline": 0.0,
  "PepsiCo overhauls corporate branding to broaden focus beyond Pepsi": 0.5,
  "Nvidia, OpenAI Advances Power Next Leg of AI Rally. How to Play It.": 0.5,
  "PayPal spots ‘softer’ consumer spending": -0.5,
  "GlobalFoundries pledges €1.1bn to expand chip production": 0.8,
  "AEP Reports Third-Quarter 2025 Operating Earnings, Updated Capital Plan Drives New Long-Term Growth Rate": 0.5,
  "ADP Reports First Quarter Fiscal 2026 Results": 0.0,
  "Domaine Worldwide Joins the B2B eCommerce Association, Reinforcing Commitment to B2B Commerce Innovation": 0.6,
  "Old Dominion Freight Line Reports Third Quarter 2025 Earnings Per Diluted Share of $1.28": 0.5,
  "Kraft Heinz Reports Third Quarter 2025 Results; Updates Full Year 2025 Outlook": 0.0,
  "Investors in Charter Communications (NASDAQ:CHTR) have unfortunately lost 58% over the last five years": -0.8,
  "A Look At The Fair Value Of Broadcom Inc. (NASDAQ:AVGO)": 0.2,
  "Investors in Baker Hughes (NASDAQ:BKR) have seen strong returns of 245% over the past five years": 0.8,
  "Why MercadoLibre, Inc. (NASDAQ:MELI) Looks Like A Quality Company": 0.8,
  "The Kraft Heinz Company Declares Regular Quarterly Dividend of $0.40 Per Share": 0.5,
  "GE HealthCare reports in line Q3 results, lifts profit outlook; shares down": 0.1,
  "AEP: Q3 Earnings Snapshot": 0.0,
  "With $500B in Bookings, Is Nvidia Stock Too Cheap to Miss?": 0.6,
  "ADP: Fiscal Q1 Earnings Snapshot": 0.0,
  "Old Dominion: Q3 Earnings Snapshot": 0.0,
  "Is This the AI Stock That Could Turn $100,000 Into $1 Million?": 0.5,
  "Norway’s gigantic sovereign wealth fund advanced 5.8% during the third quarter, notching a near $103 billion profit. - U.S. stocks account for almost 40% of NBIM’s equity investments. Among NBIM’s U.S. equity holdings are stakes in tech giants Meta, Alphabet, Amazon, Nvidia and Microsoft. The fund is also a major shareholder in companies including JP Morgan Chase, Walmart, Eli Lilly and Coca Cola.": 0.8,
  "Kraft Heinz: Q3 Earnings Snapshot": 0.0,
  "Verisk Reports Third-Quarter 2025 Financial Results": 0.0,
  "Over the Last 4 Quarters, Google Parent Alphabet Dumped Its Stake in CrowdStrike and Piled Into This Supercharged Space Stock Instead": 0.5,
  "Honeywell International (NASDAQ:HON) Is Paying Out A Larger Dividend Than Last Year": 0.6,
  "Intuit launches AI-native Accountant Suite to transform operations": 0.6,
  "How Synopsys' AI Partnership With NVIDIA (SNPS) Has Changed Its Investment Story": 0.5,
  "Stocks Rise Pre-Bell Ahead of Fed Policy Decision, Big Tech Earnings": 0.5,
  "ADP (NASDAQ:ADP) Posts Better-Than-Expected Sales In Q3": 0.8,
  "1 Important Tailwind That Could Send Bitcoin (BTC) Skyrocketing": 0.8,
  "Creating my Investing Rules this Weekend - Making my Investing Rules this Weekend I’ve done a lot of independent stock research and reading over the years, and its finally time that I begin formally following a set of personalized rules, especially since im now investing a large amount of money. I would appreciate any thoughts on this outline! 1. An excel sheet that outlines the current state of my finance and life goals + situation.": 0.5,
  "Verisk: Q3 Earnings Snapshot": 0.0,
  "Do Wall Street Analysts Like Warner Bros. Discovery Stock?": 0.2,
  "2 Monster Stocks to Hold for the Next 10 Years": 0.5,
  "Arm Flexes Muscles; Sees Stock Relative Strength Rating Rise To 82; Setting Up For Fresh Run": 0.8,
  "Is the 'gold rush' into AI spending sustainable for markets?": -0.2,
  "GE HealthCare Technologies (GEHC) Surpasses Q3 Earnings and Revenue Estimates": 0.8,
  "GE HealthCare Tech Profit Slides as Tariffs Drag": -0.6,
  "Kraft Heinz net sales slightly miss estimates as package goods group eyes split": -0.2,
  "Insider-Favored Growth Stocks To Consider In October 2025": 0.5,
  "AI Chips Update - Dataiku and NVIDIA Partner to Accelerate AI Deployment": 0.5,
  "High Growth Tech Stocks in the US Market": 0.0,
  "Cognizant (CTSH) Surpasses Q3 Earnings and Revenue Estimates": 0.8,
  "BitMine Adds $113 Million in Ethereum to Corporate Treasury, Onchain Data Shows": 0.5,
  "Germany Buy Now Pay Later Business Report 2025: A $103.44 Billion Market by 2030 with Ratepay, Klarna, and PayPal Leading by Leveraging Partnerships with Leading Retailers and Service Providers": 0.5,
  "Old Dominion Freight Line’s (NASDAQ:ODFL) Q3 Earnings Results: Revenue In Line With Expectations": 0.5,
  "2 Things Investors Need to Know About Netflix Stock's Recent Dive": 0.1,
  "Which Starbucks branches are closing down? Full list revealed including five in London": -0.5,
  "OPAQUE Introduces OPAQUE Studio for Building Confidential AI Agents with Verifiable Guarantees": 0.5,
  "TurinTech Appoints Former Intel CTO Greg Lavender as Strategic Advisor to Guide Enterprise AI Growth": 0.8,
  "Zscaler Announces New Innovations for Advanced End-to-End Monitoring, Diagnostics, and Remediation": 0.6,
  "ADP Acquires Pequity": 0.0,
  "Commerce Unlocks Agentic Checkout Within AI-Powered Discovery Platforms": 0.5,
  "OPKO Health’s ModeX Therapeutics Enters into Research Collaboration with Regeneron to Develop Multispecific Antibodies for Select Therapeutic Indications": 0.6,
  "Constellation and Xpansiv to Launch Clean Energy-Based Certificate Trading": 0.5,
  "Verisk (NASDAQ:VRSK) Misses Q3 Revenue Estimates": -0.5,
  "Trump’s ‘SALT torpedo’ could deal a massive tax blow worth thousands to America’s high earners. Here’s how to avoid it": -0.6,
  "Automatic Data Processing (ADP) Q1 Earnings and Revenues Top Estimates": 0.8,
  "American Electric Power (AEP) Lags Q3 Earnings Estimates": -0.5,
  "OneSpaWorld (OSW) Q3 Earnings Match Estimates": 0.5,
  "Micron Stock Jumps on Upbeat Memory Chip Forecast From SK Hynix": 0.8,
  "Buy 5 AI Laggards of 2025 to Tap Astonishing Growth Potential": 0.5,
  "Old Dominion Freight Line (ODFL) Q3 Earnings and Revenues Surpass Estimates": 0.8,
  "Dow Jones Futures: Trump Upbeat On China, Lifts Nvidia; Why Microsoft, Google, Meta Earnings Are So Important": 0.5,
  "UNIVERSAL THEME PARKS: THE EXHIBITION TICKETS ON SALE NOW FOR THE WORLD PREMIERE AT THE FRANKLIN INSTITUTE": 0.5,
  "Extreme Networks (EXTR) Meets Q1 Earnings Estimates": 0.5,
  "Kraft Heinz (KHC) Tops Q3 Earnings Estimates": 0.8,
  "The Fed just cut interest rates despite data blackout": -0.5,
  "Are Bitcoin Treasury Companies Like Strategy a Better Investment Than the Coin Itself?": 0.2,
  "SK Hynix, Nvidia, Mercedes, MAG 7 earnings: Trending Stocks": 0.0,
  "Verizon Profit, Revenue Rise but Postpaid Phone Losses Continue": -0.5,
  "First look: Old Dominion Q3 earnings": 0.2,
  "CSX Announces New Leadership Appointments": 0.0,
  "Verisk Analytics (VRSK) Beats Q3 Earnings Estimates": 0.8,
  "MDLZ Q3 Deep Dive: Volume Pressures and Pricing Actions Shape Near-Term Outlook": 0.2,
  "CSGP Q3 Deep Dive: Solid Revenue Growth, Margin Pressure, and AI-Driven Product Expansion": 0.6,
  "What You Need To Know Ahead of Broadcom’s Earnings Release": 0.1,
  "Kraft Heinz’s (NASDAQ:KHC) Q3 Earnings Results: Revenue In Line With Expectations": 0.5,
  "New CSX CEO switches up executive leadership": 0.2,
  "PayPal reports 7% increase in net revenues in Q3 2025": 0.6,
  "FDA rejects Regeneron’s pre-filled Eylea HD syringes amid filling facility woes": -0.6,
  "Can Lam Research Sustain $5B-Plus Revenue Streak on Foundry Strength?": 0.5,
  "ThisWay Global and Mirantis Agreement to Supercharge AI, HPC and Data Center Performance Worldwide": 0.5,
  "TTD's Global Growth Surges: Can it Outpace the U.S. Expansion?": 0.5,
  "ISRG vs BSX: Comparing Q3 Earnings, Growth Strategies and Prospects": 0.0,
  "Should You Buy, Hold, or Sell GILD Stock Ahead of Q3 Earnings?": 0.0,
  "Fruitist Closes $150 Million in Funding Led by J.P. Morgan Asset Management to Power Global Expansion and Meet Surging Demand for Healthy Snacking": 0.8,
  "Is Trending Stock Intuit Inc. (INTU) a Buy Now?": 0.2,
  "Shopify Inc. (SHOP) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Here is What to Know Beyond Why Synopsys, Inc. (SNPS) is a Trending Stock": 0.2,
  "Here is What to Know Beyond Why Axon Enterprise, Inc (AXON) is a Trending Stock": 0.2,
  "Here is What to Know Beyond Why Cisco Systems, Inc. (CSCO) is a Trending Stock": 0.2,
  "Applied Materials, Inc. (AMAT) is Attracting Investor Attention: Here is What You Should Know": 0.5,
  "Stocks making big moves yesterday: VF Corp, Super Micro, MSCI, Chegg, and CTS": 0.0,
  "BKNG Q3 Deep Dive: Loyalty, AI Features, and Direct Bookings Drive Growth Amid Margin Pressures": 0.5,
  "T-Mobile’s SuperMobile Keeps Siemens Energy Field Teams Connected": 0.5,
  "Exchange-Traded Funds, Equity Futures Higher Pre-Bell Wednesday Amid Interest Rate Cut Hopes": 0.6,
  "Stock market: Yahoo Finance Invest features exclusive conversations on AI, crypto, and the economy": 0.5,
  "Celestica CEO explains the company’s role in the AI boom: \"If AI is a speeding freight train, we’re laying the tracks ahead\" - \"Celestica CEO Rob Mionis explained how his company designs and manufactures infrastructure that enables artificial intelligence in a Tuesday interview with CNBC’s Jim Cramer. “If AI is a speeding freight train, we’re laying the tracks ahead of the freight train,” Mionis said. He pushed back against the notion that the AI boom": 0.6,
  "CoStar Upgrades U.S. Office Projections Through 2026": 0.5,
  "What Rubrik (RBRK)'s New Global BRaaS Partnership with Cognizant Means For Shareholders": 0.5,
  "Should Wendy’s Hire Kevin Hochman as CEO? - Hey everyone, curious what people think about this. Wendy’s currently has interim CEO Ken Cook running things, but I was wondering if Kevin Hochman would be a strong long-term choice. Hochman has been delivering standout results as CEO of Brinker International, the parent company of Chili’s and Maggiano’s. Chili’s has posted impressive traffic growth, improved margins, and gained share from quick service competitors by focusing on value,": 0.8,
  "A Fresh Look at Estée Lauder’s Valuation as Shopify Partnership Sets Stage for Digital Transformation": 0.6,
  "Countdown to ON Semiconductor Corp. (ON) Q3 Earnings: A Look at Estimates Beyond Revenue and EPS": 0.2,
  "Unveiling Atlassian (TEAM) Q1 Outlook: Wall Street Estimates for Key Metrics": 0.1,
  "Insights Into DexCom (DXCM) Q3: Wall Street Projections for Key Metrics": 0.2,
  "Countdown to Idexx (IDXX) Q3 Earnings: A Look at Estimates Beyond Revenue and EPS": 0.2,
  "Exploring Analyst Estimates for Vertex (VRTX) Q3 Earnings, Beyond Revenue and EPS": 0.2,
  "AI Meets Finance: ETFs in Spotlight as PayPal-OpenAI Seal Deal": 0.5,
  "AppLovin Stock: Analyst Estimates & Ratings": 0.0,
  "Company News for Oct 29, 2025": 0.0,
  "What Are Wall Street Analysts' Target Price for Advanced Micro Devices Stock?": 0.1,
  "Kraft Heinz (KHC) Reports Q3 Earnings: What Key Metrics Have to Say": 0.2,
  "GE HealthCare (GEHC) Q3 Earnings: Taking a Look at Key Metrics Versus Estimates": 0.5,
  "Compared to Estimates, Old Dominion (ODFL) Q3 Earnings: A Look at Key Metrics": 0.2,
  "AEP (AEP) Q3 Earnings: Taking a Look at Key Metrics Versus Estimates": 0.2,
  "ADP (ADP) Reports Q1 Earnings: What Key Metrics Have to Say": 0.2,
  "MSTR’s Earnings and the Role of Emerging Financial Products - I’ve been following the discussion around MSTR’s upcoming earnings and the broader debate about its hybrid exposure to Bitcoin. The analyst price targets and Citi’s $485 call are intriguing, but I’m curious how much of this hinges on crypto’s performance. With 640k BTC on the balance sheet, it’s clear MSTR’s fate is tied to Bitcoin’s swings, but is that a feature or a liability? What": 0.2,
  "Nvidia becomes first company to close above $5 trillion market cap": 0.8,
  "Cognizant raises annual adjusted profit forecast on strong client spending": 0.8,
  "Nvidia breaches $5 trillion in market cap": 0.8,
  "Nvidia Is Now the World’s First $5 Trillion Company": 0.6,
  "Booking (BKNG) Q3 2025 Earnings Call Transcript": 0.0,
  "Why Lam Research (LRCX) is a Top Growth Stock for the Long-Term": 0.6,
  "Stocks to Watch Wednesday: Boeing, Paramount, Nvidia, Visa": 0.5,
  "Nvidia (NVDA) Stands Out as Wall Street Reaffirms AI Leadership Ahead of Mega Cap Earnings": 0.8,
  "Nvidia becomes first company to reach $5 trillion valuation, fueled by AI boom - Shares of Nvidia rose more than 4% Wednesday, making the tech giant the first company to cross the $5 trillion market value threshold. The extraordinary milestone reflects a remarkable rise for the company, which has evolved from a niche video game processor to an integral player in the artificial intelligence boom. Nvidia’s stock, which closed up 5% Tuesday, has climbed more": 0.8,
  "Should You Buy the 3 Highest-Paying Dividend Stocks in the Nasdaq?": 0.0,
  "Analysts Estimate Acadia Pharmaceuticals (ACAD) to Report a Decline in Earnings: What to Look Out for": -0.5,
  "DoorDash, Inc. (DASH) Earnings Expected to Grow: Should You Buy?": 0.5,
  "Qualcomm (QCOM) Earnings Expected to Grow: Should You Buy?": 0.5,
  "Fastenal's (NASDAQ:FAST) five-year total shareholder returns outpace the underlying earnings growth": 0.5,
  "AppLovin (APP) Earnings Expected to Grow: Should You Buy?": 0.5,
  "Verizon Stock Rises After Earnings. The New CEO’s Aggressive Plans for Growth.": 0.8,
  "Billionaire Warren Buffett Says '$1 Million Isn't Going To Make You Happy' Because Once You See Someone With $2 Million, 'Your Happiness Will Disappear'": -0.7,
  "Wall Street Analysts Love Palantir, Datadog and Amazon Stocks Today": 0.8,
  "H.R.H. Prince Abdulaziz bin Salman Attends Cisco's and King Abdullah University of Science and Technology's (KAUST) Launch of Landmark AI Institute to Accelerate AI Research, Development and Talent in Saudi Arabia": 0.8,
  "GE HealthCare (GEHC) Q3 2025 Earnings Transcript": 0.0,
  "Earnings Preview: What To Expect From Micron Technology’s Report": 0.5,
  "Arm Holdings (NasdaqGS:ARM): Evaluating Valuation as Tariff Relief and AI Partnerships Boost Growth Outlook": 0.6,
  "How The Latest Shifts Are Reshaping Intuitive Surgical's Long-Term Value Story": 0.5,
  "Ahead of Earnings, Everybody Loves AMD Stock": 0.8,
  "Wix Partners with PayPal Becoming Strategic Partner for PayPal’s New Agentic Commerce Solution": 0.6,
  "Nvidia becomes first company ever to reach $5 trillion market cap": 0.8,
  "American Electric's Q3 Earnings Miss Estimates, Revenues Increase Y/Y": 0.2,
  "BC-Most Active Stocks": 0.0,
  "Verizon Earnings Beat, Revenue Misses. New CEO Promises Big Changes.": 0.2,
  "Fastenal: An Overlooked Industrial Gem to Unlock Decades of Steady Income": 0.8,
  "20 Years on Wall Street Taught Me: Dividend Blue-Chips You Never Sell": 0.5,
  "Nvidia becomes the world's first $5 trillion company, buoyed by AI boom": 0.8,
  "Is the Options Market Predicting a Spike in Copart Stock?": 0.2,
  "Etsy's CEO shakeup, Kraft Heinz warns about US sales environment": -0.5,
  "Verizon’s New CEO Promises Big Changes After Another Drop in Phone Subscribers": -0.7,
  "Centene (CNC) raises annual outlook after surprise quarterly profit, shares rise - \"Centene on Wednesday raised its annual earnings forecast after reporting a third-quarter surprise profit, helped by a low tax rate, sending its shares more than 10% higher in premarket trading. The company also recorded a non-cash goodwill impairment of $6.7 billion after a quantitative analysis that resulted in a net loss of $13.50 per share in the third quarter. President Donald Trump's tax": 0.6,
  "Adobe MAX conference highlights AI partnerships and platform expansion": 0.5,
  "T-Mobile has a huge plan to keep angry customers from fleeing": 0.2,
  "Workday Recognized as a Leader in Inaugural Gartner® Magic Quadrant™ for Cloud ERP Finance": 0.8,
  "Mondelez projects steeper EPS decline as third-quarter volumes deteriorate": -0.7,
  "Suze Orman Says 'Everybody's In AI'—So When Friends Ask What To Invest In, She Tells Them 'Put 50% Of Your Money In VOO, Then Buy Nvidia, AMD, Palantir, IONQ'": 0.5,
  "Here’s What the Wall Street Thinks About Netflix (NFLX), After its Q3 Earnings": 0.2,
  "Form 8.3 - Aqua Acquisition Sub LLC (an indirect wholly-owned subsidiary of Qualcomm Incorporated)": 0.0,
  "Barclays Lowers Price Target on MercadoLibre (MELI) to $2,800, Cites Competitive Intensity, Investment Mode": -0.5,
  "Truist Lowers PayPal (PYPL) PT to $65, Maintains Sell Rating Ahead of Q3 Earnings": -0.5,
  "Palantir, Lumen Partner in Multi-Year Deal Worth ~$200M to Accelerate Enterprise AI Deployment": 0.8,
  "AMD’s 118% YTD Rally Is ‘Ludicrous’ According to This Analyst. Should You Still Buy AMD Stock?": -0.5,
  "Amgen's Q3 Earnings in the Cards: Here's What to Expect": 0.2,
  "PEP's Margins Under Pressure: Will Productivity Play Deliver Relief?": -0.5,
  "CEG vs. TLN: Which Power-Producer Stock Has the Stronger Outlook?": 0.5,
  "AI chip giant Nvidia becomes world's first $5 trillion company": 0.8,
  "ADP Slips 4% After Reporting Q1 Earnings": -0.5,
  "Kraft Heinz Q3 Earnings Beat, '25 View Narrowed on Soft Volumes": 0.1,
  "Why PayPal Stock Deserves a Second Look Before 2025 Ends": 0.5,
  "PayPal's Branded Checkout Growth to Improve Slowly, Morgan Stanley Says": 0.5,
  "MU vs. AMD: Which Stock Is the Better Value Option?": 0.5,
  "Jim Cramer on Arista: “That’s a Beast That’s Going Higher”": 0.8,
  "Jim Cramer on Walmart: “The Stock, It’s Just Not Cheap”": 0.2,
  "Jim Cramer Recommends CrowdStrike and Palo Alto Over Netskope as Cyber Security Picks": 0.5,
  "Jim Cramer Says the “Year of Magical Investing” is “Led by Palantir”": 0.6,
  "Jim Cramer Calls QUALCOMM a “Boastful Company”": -0.5,
  "Top Funds Keep Loving This AI Stock Alongside Palantir, Nvidia": 0.5,
  "Michael Saylor's Strategy Could Be Snubbed Out of S&P 500 Again": -0.6,
  "Michael Saylor's Strategy Drops $18B in Value, but a Rebound May Be Near: 10X Research": 0.2,
  "Palantir Technologies (NASDAQ: PLTR) Stock Price Prediction for 2025: Where Will It Be in 1 Year": 0.2,
  "Verizon Third-Quarter Profit Rises Despite Phone Subscriber Growth Slowdown": 0.5,
  "Micron Technology (MU) Samples 192GB SOCAMM2 to Customers, Advancing Low-Power Memory for AI Data Centers": 0.6,
  "Amazon to report Q3 earnings as Wall Street looks for improved AI growth": 0.5,
  "Intel (INTC) is a Great Momentum Stock: Should You Buy?": 0.8,
  "Apple to report Q4 earnings after market cap touches $4 trillion": 0.5,
  "Apple Stock at Record Highs: Buy, Sell, or Hold Ahead of Q4 Earnings?": 0.2,
  "Booking Holdings' Fundamentals Strong, AI Debate Still Unclear, Morgan Stanley Says": 0.5,
  "Explainer-Why Nexperia is at the centre of an autos chip crisis": 0.0,
  "A Fresh Look at Rubrik (RBRK) Valuation Following Strategic Partnership With Cognizant": 0.6,
  "Regeneron Adds Fuel to Hot Healthcare Trade. Which Stocks Could Follow it Higher?": 0.5,
  "Electronic Arts' Battlefield, Live Services to Boost Bookings, EPS in Coming Years, Wedbush Says": 0.5,
  "Cocoa Prices Rebound as ICE Inventories Continue to Shrink": 0.6,
  "Starbucks investor group raises alarm over company’s ongoing financial woes, labor law violations": -0.7,
  "A Fresh Look at Honeywell (HON) Valuation as Shares Trend Higher": 0.6,
  "Nvidia is proof hyperscalers won't back off AI capex: Analyst": 0.5,
  "Surging Earnings Estimates Signal Upside for Intel (INTC) Stock": 0.8,
  "Kraft Heinz Lowers Full-Year Outlook on Weak Consumption Trends": -0.7,
  "AEP (AEP) Q3 2025 Earnings Call Transcript": 0.0,
  "Major MSNBC change may surprise loyal viewers": 0.5,
  "Should You Buy Palantir Stock Ahead of Q3 Earnings Report?": 0.2,
  "Baird Raises Apple (AAPL) PT Ahead of Earnings; Analysts Cite Upgrade Tailwinds": 0.6,
  "Old Dominion reports market softness, tonnage declines": -0.6,
  "This or That: Stocks vs. ETFs": 0.0,
  "BitMine Now Owns 2.8% of All Ethereum. Buy Now or Too Risky?": 0.2,
  "Datadog Named a Leader in the 2025 Gartner(R) Magic Quadrant(TM) for Digital Experience Monitoring": 0.8,
  "Mondelez Stock Falls 6% Despite Reporting Q3 Earnings & Sales Beat": -0.5,
  "Michael Saylor and Robert Kiyosaki Give End-of-2025 Bitcoin Price Prediction": 0.5,
  "Which brokerage should I get based on these parameters? - I have experience using robinhood, but believe I need a more serious, long term account. Between fidelity, vanguard, and schwab, which should I choose? 1. I want a to invest long term like (s&p500) and be able to buy individual stocks like i have done with robinhood. I heard schwab doesnt allow buying of fractional stocks. 2. I dont care too much about interface, just": 0.2,
  "Paramount Skydance layoffs begin, Etsy CEO to step down": -0.5,
  "Qorvo (QRVO) Stock Is Up, What You Need To Know": 0.5,
  "Can Upcoming Global Content Drive NFLX's Engagement in the Near Term?": 0.2,
  "Charter Communications to Report Q3 Earnings: What's in the Cards?": 0.2,
  "Absolutely everything you need to know about MSFT earnings - Okay, so it's finally time. With earning season ramping up, we have a bunch of techies going off today. MSFT, GOOG, and META are literally *all today*. So I wanted to put in my 2 cents for MSFT for those who are thinking of gambling. Right now the consensus is * Earnings per share: $3.67 * Revenue: $75.33 billion Analysts are expecting Microsoft’s Intelligent Cloud": 0.2,
  "Where Will Lululemon Stock Be in the Next 3 Years?": 0.0,
  "It’s Time to Go on the Defensive in This Market": 0.2,
  "Rail volumes down 3%: what it means for 2025": -0.5,
  "US Equity Indexes Touch All-Time Highs as Fed Set to Cut Rates, Nvidia Surpasses $5 Trillion Market Cap": 0.8,
  "Kraft Heinz bearish on outlook amid volume decreases ahead of split": -0.6,
  "Nvidia Is Accelerating Its Investing Spree in AI Startups": 0.5,
  "3 Growth Companies With Insider Ownership Up To 31%": 0.5,
  "Automatic Data Processing Q1 Earnings & Revenues Beat Estimates": 0.8,
  "Dear Qualcomm Stock Fans, Mark Your Calendars for November 5": 0.5,
  "Will Strong AWS Performance Improve Amazon's Q3 Results?": 0.5,
  "Verisk Earnings Surpass Estimates in Q3, Revenues Increase Y/Y": 0.8,
  "Anyone else into Arista Networks (ANET) - Stock has been doing well with upcoming earnings. I have been in it for over a year and what a frickin roller coaster. Bought the dips all the way down to the 60's and now it is $160. What are your thoughts on the company?": 0.6,
  "Old Dominion leaning on cost controls, yield management amid tonnage declines": 0.1,
  "Apple Gets Big Price Target Boost Ahead of Key Quarterly Earnings": 0.8,
  "Palantir Stock Hits New Record High. Wedbush Analyst Says Split 'Highly Likely'": 0.8,
  "Equity Markets Rise Ahead of Fed Decision, Mega-Cap Earnings": 0.5,
  "CoStar Q3 Earnings Beat Estimates, Revenues Up Y/Y, Shares Fall": 0.2,
  "Why American Electric Power Stock Just Popped": 0.5,
  "Why do passive ETF investors act like active investors don’t know what they’re doing? - I see the movement from mutual funds into indexation as a result of fund managers who didn't earn their fees. It's not that indexation is better - it's just cheaper. Sometimes it performs better, sure, but the main appeal is cost. Now for the irony... Why do stocks in the index have the weightings they do? Where did those weightings": 0.2,
  "Dear Palantir Stock Fans, Mark Your Calendars for November 3": 0.5,
  "COIN vs. MSTR: Which Bitcoin-Focused Stock Has More Upside?": 0.5,
  "The Rise of Integrated Financial Platforms": 0.5,
  "Why ADP (ADP) Stock Is Falling Today": -0.5,
  "Old Dominion Q3 Earnings & Revenues Surpass Estimates, Down Y/Y": 0.2,
  "Fed cut interest rates by 25 basis point in a split decision. - It's benchmark interest rate cut to a range of 3.75% to 4.00%. Fed Governor Stephen Miran disagreed with the decision, preferring to cut rates by half a percentage point. Meanwhile, Kansas City Fed President Jeff Schmid also dissented, advocating for holding rates steady. Miran is concerned that renewed trade tensions with China, which have since settled, posed risks to the economic outlook.": -0.2,
  "Apple Q4 Preview: Can iPhone 17 and AI Keep the $4 Trillion Story Alive?": 0.5,
  "Datadog (DDOG): Evaluating Valuation After Recent 13% Share Price Gain": 0.2,
  "AMD CEO flips the script on AI dominance": 0.5,
  "Is DexCom Trading Below Fair Value After a 41.8% Three Year Drop?": 0.2,
  "GE HealthCare raises FY25 guidance amid cross-segment growth": 0.6,
  "A Fresh Look at Constellation Energy (CEG) Valuation After Meta Deal, Calpine Acquisition, and Analyst Support": 0.6,
  "TSLA: Tesla Board Eyes Internal CEOs as Musk Raises Exit Pressure": -0.5,
  "Update: American Electric Power Shares Rise After Q3 Revenue Beat, Expanded Capital Plan": 0.8,
  "Cocoa Prices Rebound as ICE Inventories Dwindle": 0.5,
  "Nvidia CEO Jensen Huang Delivers Stark Message In Washington — US Can't Win AI Battle By Shutting Out China's Developers: 'It Hurts Us More'": 0.2,
  "Dear AMD Stock Fans, Mark Your Calendars for November 4": 0.5,
  "Kraft Heinz Shares Fall After Mixed Q3 Earnings": -0.5,
  "Amazon makes cold move that raises nationwide workplace fears": -0.6,
  "Insider Spends US$2.0m Buying More Shares In CSX": 0.5,
  "Cognizant Technology Solutions’ Shares Jump on Strong Q3 Earnings": 0.8,
  "Tesla Adds Steering Wheel to Cybercab, Stock Ticks Higher": 0.5,
  "Powell Says Labor Market Stalled, Not ‘Declining’": 0.5,
  "Are Nvidia's new partnerships adding value to AI trade?": 0.5,
  "WSFS Financial Corporation Appoints Michelle Hong to Board of Directors": 0.5,
  "Trump Administration Eases Approval Process for Biosimilar Drugs": 0.5,
  "What Palo Alto Networks (PANW)'s New AI-Powered Security Platforms Mean For Shareholders": 0.5,
  "Tesla Faces Political Split Ahead of $1 Trillion Elon Musk Pay Vote": -0.5,
  "Amazon Opens $11 Billion Rainier Data Center to Advance Anthropic Partnership": 0.5,
  "Nvidia Stock Is Still a Buy. Why $5 Trillion Isn’t the Top.": 0.5,
  "Comcast Grants $30,000 to Support Youth Digital Skills Training at the YMCA of Whitehaven": 0.8,
  "Adobe and 12 Other Stocks That Could Bounce Back In November": 0.5,
  "Booking's Fundamentals Solid, LLM Risks Seen Overstated, RBC Says": 0.5,
  "3 Technology Buys That Wall Street Loves": 0.5,
  "Why Verisk (VRSK) Shares Are Falling Today": -0.5,
  "Why CoStar (CSGP) Shares Are Getting Obliterated Today": -0.8,
  "Amazon Earnings Preview: On the Verge of a Breakout?": 0.5,
  "Sector Update: Energy": 0.0,
  "No Tech Wreck From a More Hawkish Fed": 0.5,
  "Constellation Energy Corporation Declares Dividend": 0.5,
  "Nvidia's Huang joins tech titans funding Trump's ballroom": 0.2,
  "MercadoLibre, Inc. Reports Third Quarter 2025 Financial Results": 0.0,
  "Sector Update: Energy Stocks Rise Late Afternoon": 0.5,
  "AMGEN ANNOUNCES WEBCAST OF 2025 THIRD QUARTER FINANCIAL RESULTS": 0.0,
  "Stock market today: Nasdaq clinches record, Dow, S&P 500 dip as Fed cuts rates, Powell downplays December cut": 0.5,
  "Sun Country Airlines Reports Third Quarter 2025 Results": 0.0,
  "OPKO Health Reports Third Quarter 2025 Business Highlights and Financial Results": 0.0,
  "Exelon Corporation Declares Dividend": 0.0,
  "Starbucks Reports Q4 and Full Fiscal Year 2025 Results": 0.0,
  "KLA Corporation Reports Fiscal 2026 First Quarter Results": 0.0,
  "Uber Outlines Robotaxi Rollout With This EV Maker": 0.5,
  "Starbucks reports same-store sales growth for the first time in nearly two years - Starbucks on Wednesday reported that its quarterly same-store sales returned to growth for the first time in nearly two years, showing that its turnaround strategy is winning over lapsed customers. The coffee chain’s global same-store sales rose 1%, lifted by international markets. Its U.S. same-store sales were flat for the quarter but turned positive in September. Wall Street was projecting global": 0.8,
  "Starbucks halts 2-year sales slide, but costly improvements hurt its profits": -0.5,
  "Meta stock sinks after tax hit weighs on earnings, company touts 'notably larger' AI investments in year ahead": -0.5,
  "Victory! AHF, 100 Organizations Kill Gilead’s Greedy Drug Price Hikes": 0.8,
  "Tesla Stock Is Close to a Record High. What Will Get It There.": 0.5,
  "Jim Cramer Says “We Need a Real Positive Outlook From the Company”": 0.8,
  "Alphabet tops $100 billion quarterly revenue for first time, cloud grows 34% - Alphabet reported third-quarter earnings on Wednesday after the bell. Here’s how the company did, compared with estimates from analysts polled by LSEG: * **Revenue:** $102.35 billion vs. $99.89 billion adj. estimated * **Earnings per share:** $2.87 not immediately comparable Wall Street is also watching several other numbers in the report: * **YouTube advertising revenue**: $10.26 billion vs. $10.01 billion, according to StreetAccount": 0.8,
  "Jim Cramer Says “Microsoft’s in a Tough Spot”": -0.5,
  "Microsoft reports earnings beat as Azure revenue climbs 40% - Microsoft reported better-than-expected results for its fiscal first quarter as revenue in the company’s Azure cloud business jumped 40%. The stock slipped in extended trading. **Earnings per share:** $4.13 adjusted per share vs. $3.67 per share expected **Revenue:** $77.67 billion vs. $75.33 billion expected Revenue increased 18% in the fiscal first quarter from $65.6 billion a year ago, according to a release. Net income increased": 0.8,
  "Nvidia Becomes First $5 Trillion Company": 0.8,
  "It’s Official: Nvidia Becomes the First $5T Company in History": 0.8,
  "Chipotle cuts same-store sales forecast for third straight quarter as diner visits drop again - Chipotle Mexican Grill on Wednesday reported quarterly revenue that fell short of expectations and cut its same-store sales forecast for the third straight quarter. Chipotle is expecting its full-year same-store sales to shrink by a low-single digit percentage in fiscal 2025. That’s a big change from February, when the burrito chain was projecting same-store sales would grow by a low-": -0.6,
  "Starbucks: Fiscal Q4 Earnings Snapshot": 0.0,
  "ServiceNow tops estimates, approves 5-for-1 stock split - ServiceNow reported third-quarter results on Wednesday that blew past Wall Street’s estimates, with the company also approving a five-for-one stock split. Shares rose 5%. Here’s how the company did versus LSEG estimates. * **Earnings per share**: $4.82 adjusted vs. $4.27 expected * **Revenue**: $3.41 billion vs. $3.35 billion expected Third-quarter subscription revenues, which account for the bulk of the enterprise software company’s sales, totalled $3.3 billion and": 0.8,
  "GE HealthCare Beat Earnings Estimates. The Stock Dropped.": -0.5,
  "Meta reports earnings, sees profits hit by one time tax charge, shares fall - Investing.com - Meta Platforms (NASDAQ: META) reported third quarter EPS of $1.05, $5.63 worse than the analyst estimate of $6.68. Revenue for the quarter came in at $51.24B versus the consensus estimate of $49.36B. Guidance Meta Platforms sees Q4 2025 revenue of $56.00B-$59.00B versus the analyst consensus of $57.26B. Meta Platforms’s stock price closed at $751.67. It is up 0.22% in": -0.5,
  "KLA: Fiscal Q1 Earnings Snapshot": 0.0,
  "Bill Gates Told Satya Nadella 'You're Going To Burn This Billion Dollars' By Investing In OpenAI — But Microsoft's Bet Became A 100-Bagger": 0.8,
  "Earnings live: Meta stock tumbles, Microsoft slides, and Alphabet rises as Big Tech earnings pour in": 0.1,
  "MercadoLibre: Q3 Earnings Snapshot": 0.1,
  "These Stocks Moved the Most Today: Nvidia, Fiserv, Stride, Caterpillar, Verizon, Micron, Microsoft, Alphabet, Meta, Centene, and More": 0.0,
  "Nvidia worth as much as German economy as value tops $5tn": 0.8,
  "Eli Lilly Reports Earnings Thursday as Investors Await Trump Drug Pricing Deal": 0.2,
  "Starbucks beats Q4 revenue estimates as global sales rise": 0.8,
  "Starbucks (NASDAQ:SBUX) Surprises With Q3 Sales": 0.5,
  "Stock Market Today: Dow Ends Lower As Traders Slash Rate-Cut Bets; Nvidia Holds To $5 Trillion Mark": 0.2,
  "Starbucks Misses Earnings, but Stock Rises on Revenue Improvements": 0.5,
  "Microsoft Beats First-Quarter Views as Users Navigate Azure Outage": 0.5,
  "Kayak CEO on $457 Million Writedown: Google Squeezed the Travel Industry Again": -0.5,
  "Top Stock Reports for IBM, Micron & Abbott": 0.0,
  "Intento Releases 9th Annual \"State of Translation Automation 2025\" Industry Report": 0.5,
  "Starbucks reports global sales rebound, offsetting earnings miss; shares tick up": 0.5,
  "Microsoft Hit With Global Outage to Azure and 365": -0.8,
  "MercadoLibre stock dips after Q3 earnings miss despite 39% revenue surge": -0.5,
  "Alphabet stock pops as it's seen as a 'clear AI winner'": 0.8,
  "Why CoStar Group Stock Wilted on Wednesday": -0.5,
  "Why the AI bull market is raising diversification red flags": -0.5,
  "Microsoft (MSFT) Surpasses Q1 Earnings and Revenue Estimates": 0.8,
  "Dow Falls From Record Level as Powell Dampens December Rate Cut Bets": -0.5,
  "Starbucks (SBUX) Q4 Earnings Lag Estimates": -0.5,
  "KLA (KLAC) Q1 Earnings and Revenues Beat Estimates": 0.8,
  "Trump To Discuss Nvidia's 'Super Duper' AI Chips With Xi, Hints At Meeting Jensen Huang": 0.2,
  "Mercado Libre's Strategic Investments Drive Net Revenue to $7.4 Billion in Q3 2025, Marking the 27th Consecutive Quarter of Growth Above 30% YoY": 0.8,
  "Nvidia makes a major push for quantum computing": 0.5,
  "MercadoLibre (MELI) Misses Q3 Earnings Estimates": -0.5,
  "Why Verisk Analytics Stock Plummeted by Over 10% Today": -0.8,
  "Starbucks Cafe Sales Stabilize After Year-and-a-Half-Long Slide": 0.5,
  "Advanced Micro Devices (AMD) Stock Moves 2.45%: What You Should Know": 0.5,
  "Intuit (INTU) Stock Moves -3.37%: What You Should Know": -0.5,
  "Micron (MU) Stock Moves 2.13%: What You Should Know": 0.2,
  "Palo Alto Networks (PANW) Stock Moves -1.91%: What You Should Know": -0.5,
  "Lululemon (LULU) Stock Moves -5.38%: What You Should Know": -0.5,
  "Marvell Technology (MRVL) Stock Moves 1.91%: What You Should Know": 0.5,
  "Vertex Pharmaceuticals (VRTX) Stock Moves -1.23%: What You Should Know": -0.5,
  "Workday (WDAY) Stock Moves -2.35%: What You Should Know": -0.5,
  "Warner Bros. Discovery (WBD) Stock Moves 1.67%: What You Should Know": 0.2,
  "Airbnb, Inc. (ABNB) Stock Moves -1.20%: What You Should Know": -0.2,
  "Fortinet (FTNT) Stock Moves -1.92%: What You Should Know": -0.5,
  "Analog Devices (ADI) Stock Moves -1.80%: What You Should Know": -0.5,
  "Udemy, Inc. (UDMY) Beats Q3 Earnings and Revenue Estimates": 0.8,
  "KLA Corporation’s (NASDAQ:KLAC) Q3 Sales Top Estimates": 0.8,
  "Why Broadcom Stock Jumped Today": 0.5,
  "Starbucks saw positive same-store sales for the first time in almost two years": 0.8,
  "Stock market advice - Hi, I follow this channel and wanted to ask what advice you would give someone who wants to learn how to day trade or just use the stock market? A little background, I’m 39 M and have mainly focused on real estate. I enjoy real estate but I have 11 rentals now and I’m tired of dealing with tenants. I don’t want to sell them but I’d like to focus on": 0.2,
  "Autodesk (ADSK) Stock Moves -4.50%: What You Should Know": -0.5,
  "Mixed share reaction to megacap earnings burst, Meta droops": -0.2,
  "Liver Drug Approval and Pipeline Data Could Be a Game Changer for Gilead Sciences (GILD)": 0.6,
  "Why Elon Musk could leave Tesla, and why it might actually happen": -0.5,
  "Skyworks CEO sees chance to save power in AI-driven phones with Qorvo deal": 0.5,
  "Impinj (PI) Q3 Earnings and Revenues Surpass Estimates": 0.8,
  "Gannett (GCI) beneficiary of DOJ case vs Google - Gannett is the largest news publisher in the US, and owns various local and national newspapers such as USA Today. Google has been in ongoing litigation with the DOJ over monopolistic practices that suppress ad revenue for publishers. Google was found guilty about a year ago and is in the remedies phase of their case with the DOJ. Separately, Gannett is suing Google for civil damages": 0.2,
  "Starbucks (SBUX) Q4 Earnings: Taking a Look at Key Metrics Versus Estimates": 0.2,
  "MercadoLibre (NASDAQ:MELI) Posts Better-Than-Expected Sales In Q3, Increases Its Unique Active Buyers": 0.8,
  "'Rich Dad, Poor Dad' Robert Kiyosaki Says He's $1 Billion—Maybe $2 Billion—In Debt And He's Not Worried At All Because It's The Bank's 'Problem'": -0.8,
  "Microsoft's massive AI spending draws investor concerns as cloud business booms": -0.5,
  "Microsoft (MSFT) Q1 2026 Earnings Call Transcript": 0.5,
  "Stock market today: Dow, S&P 500, Nasdaq futures fall following Trump-Xi meeting, mixed Big Tech earning": -0.5,
  "Google Revenue Soars to Record as AI Boom Lifts Cloud Business": 0.8,
  "Apple & Amazon earnings, Fed, mortgage rates: What to Watch": 0.0,
  "Why $71 Billion Bitcoin Behemoth Strategy Is Still Betting on BTC Hitting $150K This Year": 0.5,
  "The CEOs of Apple, Airbnb, and PepsiCo agree on one thing: life as a business leader is incredibly lonely": -0.5,
  "How Blue Owl’s $7 Billion Meta Partnership Has Redefined Its Investment Story (OWL)": 0.5,
  "Google parent Alphabet posts first $100 bn quarter as AI fuels growth": 0.8,
  "Alphabet Stock Jumps on Big Earnings Beat": 0.8,
  "Microsoft Is Dramatically Boosting AI Investments as It Races to Keep Up With Demand": 0.8,
  "YouTube announces ‘voluntary exit program’ for US staff": 0.1,
  "Microsoft, Alphabet and Meta results overshadowed by growing fears of AI bubble": -0.6,
  "Starbucks closes more stores in a key market": -0.6,
  "Meta Platforms (META) Q3 2025 Earnings Call Transcript": 0.1,
  "Meta Shares Fall on Accelerating AI Spending Despite Record Revenue": -0.6,
  "Dear Apple Stock Fans, Mark Your Calendars for October 30": 0.5,
  "Apple to split in 2026?? - With a past split price of 385.00 providing a 4-1. With the new phone being a major step forward and good earnings. I see EOY price for AAPL around 280.00 -300.00. With an avg of 20% + over the past couple years and recent success with AI thur their standard device offerings: 2026 EOY possibilities 360.00 plus or 385.00 reach past split history pricing: note their dancing with other": 0.6,
  "Starbucks (SBUX) Q4 2025 Earnings Call Transcript": 0.2,
  "Microsoft reports strong earnings as Azure hit by major outage": 0.2,
  "Why Analysts Are Rethinking CoStar’s Growth Story Amid Shifting Market and Revenue Outlook": -0.5,
  "OpenAI prepares for IPO at $1 trillion valuation - OpenAI is laying the groundwork for an initial public offering that could value the company at up to $1 trillion, three people familiar with the matter said, in what could be one of the biggest IPOs of all time. OpenAI is considering filing with securities regulators as soon as the second half of 2026, some of the people said. In preliminary discussions, the company has looked": 0.8,
  "3 Reasons Why I Just Bought Figma Stock": 0.5,
  "Michael Saylor Targets $150,000 For Bitcoin As Strategy Breaks New Ground With S&P Rating": 0.5,
  "Intel Gets a Much-Needed Win": 0.8,
  "ASTL stock potential? - Wondering what everyone’s thoughts are on Algoma Steel? They just reported their Q3 revenue earlier today of $523.9m which is a loss compared to $600.3m at the same time in 2024, and the stock has recently hit its all time low. While the steel market now is struggling heavily with slowed demand (domestically/internationally) and even more pressure from the American tariffs on steel (operational expenses and further affecting demand), I’m wondering": -0.6,
  "Supply chain drama, more jobs/housing growth and silence on Intel's New Albany operation": 0.1,
  "'Stay Nimble': Standard Chartered Says Bitcoin Is Set For 'Inevitable Dip' Below $100K": 0.2,
  "Assessing Datadog’s Valuation After New Cloud Integrations and a 22% Share Price Jump": 0.5,
  "CoStar Group (CSGP) Margin Drop Challenges Bullish Growth Narrative Despite Strong Forecasts": -0.5,
  "Memory-Chip Makers Are Enjoying a Boom to Remember, Thanks to AI": 0.8,
  "'Worst Crypto Bull Market Ever': Why Bitcoin, Ethereum, XRP Traders Are Fed Up": -0.8,
  "Western Digital earnings coming up. Is there even room for them to go higher when the whole Industry is up? - Seems like Data Storage is on a wild run. SanDisk, Seagate and Western Digital all have been going up non stop for the past couple of months, north of 100%. Today alone Seagate went up 15%, Western Digital 13%. Western Digital earnings are tomorrow. Do you guys think there is even room left for": 0.2,
  "Reddit getting more visits than Pornhub, X, Wikipedia? $RDDT - $RDDT Earnings tomorrow Thursday 10/30 After hours. Source: [https://www.semrush.com/website/top/](https://www.semrush.com/website/top/) I've been on reddit for 6 years and I remember seeing random ads for companies/things I haven't heard of. Scrolling now, I am getting ads every 7 posts from big names: Toyota, Adobe, Amex, Discover Card, Fender, Novo Nordisk, Ebay, Frito Lay. In comparison scrolling X dot com the first ad I got was \"Thursday Boot": 0.2,
  "How Chevron, Robert Half, And Horace Mann Educators Can Put Cash In Your Pocket": 0.2,
  "TeraWulf (WULF) Is Up 14.9% After $9.5B AI Data Center Deal With Google-Backed Fluidstack": 0.8,
  "ADP Acquires Pequity to Enhance Compensation Management Capabilities": 0.5,
  "NVIDIA (NVDA) Shares Surge 3% Today: Why One Picture Drove $400 Billion In Stock Gains": 0.5,
  "Analog Devices (ADI) and ASE Form Strategic Partnership in Penang, Malaysia": 0.5,
  "Citi Maintains Buy Rating on Baker Hughes (BKR), Cites Lack of Strategy Update": 0.1,
  "Are Wall Street Analysts Bullish on Microsoft Stock?": 0.5,
  "As Trump Says 'Buy A Toyota,' Japanese Automaker Denies Promising New $10 Billion Investment In US": -0.5,
  "Costco Executive members notice major early shopping problem": -0.6,
  "Big Tech tests investors’ patience with $80bn AI investment spree": 0.2,
  "Talking about stocks on the radio - sign of a market top? - I'm old, and I listen to this old-timey radio show called Howard Stern. This isn't a business show, but more of a variety show. Well today, they were talking about stocks and how well they were doing in the stock market. One of the co-hosts was talking about how good she was at picking stocks and how she teaches other people how": 0.2,
  "Charter (CHTR) Reports Q3: Everything You Need To Know Ahead Of Earnings": 0.5,
  "How Investors Are Reacting To Datadog (DDOG) Exploring a GitLab Takeover and Securing Gartner Leadership": 0.5,
  "Asia stocks muted with all eyes on Trump-Xi meeting": 0.0,
  "Meet The New Chip Maker Aiming To Outrun TSMC And ASML": 0.5,
  "Omdia: Global smartphone market grows 3% in Q3 2025, led by emerging economies": 0.5,
  "Lululemon just found a new arena, and it’s not the gym": 0.2,
  "Weekly Picks: 🤝 Alphabet's Anthropic Deal And 2 More Picks": 0.5,
  "AP Top Financial News at 2:08 a.m. EDT": 0.0,
  "AP Top Extended Financial Headlines at 2:08 a.m. EDT": 0.0,
  "Target's next CEO finds a bold solution to alarming sales declines": 0.8,
  "Samsung Net Profit Surges as Chip Business Rebounds": 0.8,
  "Asia Market Open: Bitcoin Slips Below $110K as Fed Cut Leaves Traders Guessing Next Move": -0.5,
  "Tracking the Evolving Narrative for Booking Holdings Amid Analyst Shifts and New Partnerships": 0.2,
  "What is this Meta tax issue? Why only Meta and not Microsoft or Alphabet? Why is all tax pulled into Q3? - What is Meta saying about the one big beautiful bill that made them owe (non-cash) $15B but reduced taxes in the future? The bill should have allowed a break on their capex and reduced tax burden but actually increased it. But how can tax be non-cash? Depreciation can be non-tax but actual tax?": -0.5,
  "Daily market wrap: Fiserv, CoreWeave, and Palantir lead": 0.5,
  "Zillow, Rocket, and CoStar Are Upending Homebuying. How the Stocks Stack Up.": 0.2,
  "Trump says US to cut fentanyl tariff to 10% after talks with China's Xi": 0.6,
  "Dow Jones Futures: Trump Touts Deals From 'Outstanding' Xi Meeting; Microsoft, Meta, Google Step Up Capital Spending": 0.5,
  "Gold Rises as Traders Weigh Trump Comments on China Trade Deal": 0.5,
  "What a cut to the cash ISA tax-free savings limit could mean for your finances": 0.1,
  "How Investors May Respond To Engie (ENXTPA:ENGI) Expanding Meta Partnership With 600 MW Texas Solar Deal": 0.5,
  "Did Diamondback Energy's (FANG) Move Toward AI Power Shift Its Investment Narrative?": 0.2,
  "Panasonic cuts full-year profit forecast on weaker outlook for automotive battery business": -0.7,
  "Despite high expectations, Trump didn't discuss Nvidia's Blackwell chip with Xi": -0.5,
  "Big Tech: AI, cloud demand lifts Microsoft, Alphabet, Meta": 0.5,
  "Vodafone to acquire Skaylink": 0.0,
  "How should we prepare for a war between the US and Venezuela? - If you keep up with the news, it shouldn't be very controversial for me to suggest that a large scale military engagement between the US and Venezuela is on the horizon. In the event that tensions escalate into a full blown war, what is the best way to prepare financially? Some predict that broad conflict could breakout as soon as November or": -0.6
}